{
  "schema_version": "raw_scrape_v1",
  "report_id": "2026-01-31",
  "scraped_at": "2026-01-31T11:34:09.931098",
  "subreddits": [
    "singapore",
    "askSingapore",
    "SingaporeRaw",
    "singaporefi"
  ],
  "total_posts": 40,
  "total_comments": 822,
  "posts": [
    {
      "id": "t3_1qr3kyg",
      "subreddit": "singapore",
      "title": "Hao Mart, Ang Mo Supermarket no longer required to charge for plastic bag after deregistering from scheme",
      "url": "https://old.reddit.com/r/singapore/comments/1qr3kyg/hao_mart_ang_mo_supermarket_no_longer_required_to/",
      "score": 368,
      "num_comments": 39,
      "created_at": "2026-01-30T20:03:01",
      "selftext": "",
      "comments": [
        {
          "text": "“According to Hao Mart's latest report, published on Dec 12, 2025, it collected S$21,143.50 in 2024 for 422,870 plastic bags. None of the proceeds was donated that year. After paying 9 per cent Goods and Services Tax (GST) to the government – S$1,745.79 – the remaining amount was retained by Hao Mart for its general operating expenses, including costs associated with providing disposable carrier bags and the administration of the scheme.” What was previously expense becomes a source of revenue",
          "score": 280
        },
        {
          "text": "When asked whether Hao Mart would continue to charge for plastic bags, the retailer's senior vice president of operations Jupri Suep said that the provision of plastic bags remains an expense for the operator. Good profit Sheng Siong and ntuc  donated all of it. Cold Storage donated most of it.",
          "score": 204
        },
        {
          "text": "I always suspect all those convenience stores that charges plastic bags are a form of revenue for them although they said the cash collected will be given back to NEA for national recycling policy. Oh well, this article prove that it is true......😎",
          "score": 112
        },
        {
          "text": "making money selling plastic bags😆😆😆🖨️💵🖨️💵🖨️💵🖨️💵🖨️💵",
          "score": 102
        },
        {
          "text": "What kind of shitty non-reply from Hao Mart is that?",
          "score": 69
        },
        {
          "text": "If they donated it, I’m going to assume that they also took the accompanying tax deduction. So this means that they didn’t get to keep the money, but let’s crunch the numbers real quick on the money that they presumably kept as a result. Charity donations are 250% tax deductible, so every dollar that is donated reduces taxable income by $2.50. The corporate tax rate is 17%. So for every dollar donated, they’d have saved $0.425 in taxes if they applied the tax deduction. It’s still a way of gouging money at the end of the day, whether they do it directly (by keeping the money earned) or indirectly (by saving on taxes).",
          "score": 60
        },
        {
          "text": "Btw Ang Mo supermarket is Absolute Garbage these days. Not sure there going under or what, but their shelves are either always near empty or filled with trash brand products that no one wants to buy.",
          "score": 40
        },
        {
          "text": "Just read theNEA websitefor information about plastic bag. Excerpt from point 7: The study found that over a year, an average family that buys groceries weekly would save about 1,248 single-use plastic bags by switching to reusable bags for their groceries. 1,248 plastic bags per year for groceries is 24 bags per weekly visit - what?! How can that be for \"average family\"? So I went to the linkedLCA studyto get more information: Annex A, Paragraph 1: For this study, the functional unit was the volume of items a family of four would approximately buy over the course of one year. The functional unit is needed to determine how many of each type of bag are needed to carry the items. The study found that the functional use of 10 reusable bags (non-woven polypropylene or nylon bags) over a year is equivalent to the use of 1,248 plastic or degradable bags, or 520 paper bags. [...] (Under the photos)The study assumed that a family buys 50 items per week. The 50 items were placed in the different types of bags studied to determine how many of each type of bag were needed to carry the 50 items. The study doesn't say that 1,248 plastic bags are used in a year, just that 1 reusable bag provides 125 plastic bag worth of use. Because If they did use 1,248 plastic bags a year, or 24 bags per week, for the assumed 50 items bought per week, then this family is putting 2-3 items in each plastic bag? What? Additionally, the study \"assumed\" a family - that's not the \"average family\", neither is that \"on average\". That's just a hypothetical family. NEA's read on the study is completely bonkers. And even if they were right, if the average family does indeed use 24 bags per weekly visit, it means they'll now have to bring 24 disposable bags for that one visit - who the heck brings 24 disposable bag. If I weren't 3 years late, I'd have written in to NEA. Hello news outlets, here's a story for you.",
          "score": 34
        },
        {
          "text": "Still better than just the business getting all of it. At least charity now gets a cut.",
          "score": 30
        },
        {
          "text": "But jn the first place they are not even required to charge for plastic bags.",
          "score": 25
        },
        {
          "text": "Auntie gossip network says is cause the owner's son got gambling debts so they couldn't pay suppliers so no stock or old stock that aren't moved",
          "score": 18
        },
        {
          "text": "yeah they're definitely closing. same thing is happening at the angmo at my side",
          "score": 16
        },
        {
          "text": "laughs in 250% of opportunity costs",
          "score": 10
        },
        {
          "text": "I might have gotten my figures wrong cos I just googled it (source is Gemini summary of Business Times website) For financial year ending in 2024, Hao Mart revenue is $55.7 million. The $21k also collected for 2024, therefore the percentage of revenue due to plastic bag sales is 0.0378%. Uhhh idk man sounds like a shitty way to make money lol",
          "score": 8
        },
        {
          "text": "Expense -> Need to charge to cover expense Still a shitty response indeed.",
          "score": 5
        },
        {
          "text": "The business can choose not to donate, and the govt gets less in tax money if they donate. Consumers like us have to pay for the plastic bags. Overall lose lose situation for us and govt and the winners are the supermarkets...",
          "score": 3
        },
        {
          "text": "Retail stores like uniqlo, etc also charge for paper bags even though they don't have to",
          "score": 3
        },
        {
          "text": "I dunno how many stores they have Last I saw its fairly deserted(?) im surprised they were even in the scheme to begin with",
          "score": 3
        },
        {
          "text": "It would be a much bigger percentage of profits. The profit margin of supermarkets is probably not big compared to revenue. AI is telling me only 1-3% profit margin, so multiply your 0.03+% by 33-100.",
          "score": 1
        },
        {
          "text": "As if they don't factor the price of purchasing plastic bags into the costs of the products. It is double dipping and green washing at its finest.",
          "score": 0
        },
        {
          "text": "They forgot to factor in the manpower needed to rub each plastic bag repeatedly until it opens up. Very time consuming endeavour!",
          "score": 0
        },
        {
          "text": "And the saliva!",
          "score": 0
        },
        {
          "text": "Sheng Siong profit margin is 30+%, ntuc around 20+%.",
          "score": 0
        },
        {
          "text": "I think that’s price mark-up, not profit margin after deducting rent, salaries etc.",
          "score": 0
        },
        {
          "text": "Read further down at page 14. Not sure if you go those hypermart before and see one family pushing one full trolley of groceries.",
          "score": -5
        }
      ]
    },
    {
      "id": "t3_1qqvl2i",
      "subreddit": "singapore",
      "title": "Why does it mean for s'poreans and M'sians if no longer SGD1:MYR3?",
      "url": "https://old.reddit.com/r/singapore/comments/1qqvl2i/why_does_it_mean_for_sporeans_and_msians_if_no/",
      "score": 255,
      "num_comments": 136,
      "created_at": "2026-01-30T12:31:28",
      "selftext": "the business in JB will suffer since it's no longer cost effective for S'poreans to shop there over the weekend?\n\nWe going to see more M'sians heading home to seek employment?\n\nNo more long traffic jam over the weekend at both Tuas and Woodlands?",
      "comments": [
        {
          "text": "My young padawan, people have been going to JB since SGD1:MYR2",
          "score": 1418
        },
        {
          "text": "This. The narrative past 3 months or so is overblown. Msian have been working in SG since late 90s when the exchange rate is 1:2. SG have been traveling to Msia for the weekend for the longest time between our country history. Sure there will slight dip of visits but the only one will crumble are those that overpriced their service/food in JB.",
          "score": 384
        },
        {
          "text": "But even if 1:1 or 1:2 last time, the prices were not like it is now where often you're paying upwards of RM10 to get a decent meal Just saying that 1:2 maybe still alright, but I'm staying tf home if it's 1:1 with the current JB prices because you'll probably find a meal under SGD10 more easily",
          "score": 75
        },
        {
          "text": "Eh since 1:1 also go.",
          "score": 66
        },
        {
          "text": "did dinosaurs roam the earth?",
          "score": 62
        },
        {
          "text": "My parents told me about the land before time where MYR is stronger than SGD….",
          "score": 58
        },
        {
          "text": "I think they meant in recent times, pricing in jb has been pegged closer to sg purchasing power more than to the locals purchasing power. Wasnt as bad last time (have family there, can confirm). Still cheaper than prices in sg, but quite painful for the locals not working in sg",
          "score": 55
        },
        {
          "text": "But pricing in jb has changed to be closer to 1:3 exchange rate. So it’s under the prices have to drop in jb to attract people or people just won’t go.",
          "score": 46
        },
        {
          "text": "Things that cost 10sgd here can cost 30rm there. So not really much savings unless you are doing bulk groceries or many things during that trip. Need to travel further north to find things/services that are not as inflated as in JB. So if currency drops below 1:3, you are no longer saving money in JB trip.",
          "score": 44
        },
        {
          "text": "Littlefoot walked through Oxley Road to get to the Great Valley.",
          "score": 41
        },
        {
          "text": "If it’s 1:1 sg is cheaper",
          "score": 37
        },
        {
          "text": "its the media milking and farming the attention which then brings $$$. Especially the one complaining JB business owner sad business decline due to the exchange rate last december.",
          "score": 34
        },
        {
          "text": "It's cute to see people thinking that the causeway jams will ease lol. Causeway jams are as sure as rain in December.",
          "score": 27
        },
        {
          "text": "The days before the 1988 constitutional crisis caused by Mahathir. https://en.wikipedia.org/wiki/1988_Malaysian_constitutional_crisis In one swift stroke, Mahathir caused the collapse of the ringgit in the short period after the chaos.",
          "score": 23
        },
        {
          "text": "I remember those times and when Malaysians would make the trip over to Woodlands Centre to shop because we were so cheap.  Woodlands Centre is gone now, but if you want to know what happens to Singapore when we're no longer economically competitive, just look at what happened to the hawker centre and market there.",
          "score": 21
        },
        {
          "text": "Immediately knowing who littlefoot is made me feel old 🥺",
          "score": 16
        },
        {
          "text": "Yes, the dinosaur was called Dr. M, apparently still roaming around.",
          "score": 13
        },
        {
          "text": "People have been going to JB to buy things for decades.",
          "score": 10
        },
        {
          "text": "Thanks guys, as if the white hairs weren't enough.",
          "score": 8
        },
        {
          "text": "If we hold on together ~~~",
          "score": 6
        },
        {
          "text": "bruh if 1:1 its like eating out in ang mo countries we are cooked",
          "score": 5
        },
        {
          "text": "Let's everyone watch the movie and cry again 🥹",
          "score": 4
        },
        {
          "text": "Omg the soundtrack exists",
          "score": 3
        },
        {
          "text": "If we hold on together…",
          "score": 3
        },
        {
          "text": "My ah ma used to bring me to the video tape rental shop where she scroll her hokkien da xi video while i scroll thru the colourful cartoon files",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1qqylp5",
      "subreddit": "singapore",
      "title": "Public can use ez-link card to get 10-cent refund when recycling drink bottles, cans from April",
      "url": "https://old.reddit.com/r/singapore/comments/1qqylp5/public_can_use_ezlink_card_to_get_10cent_refund/",
      "score": 235,
      "num_comments": 138,
      "created_at": "2026-01-30T15:11:55",
      "selftext": "Hope this doesn’t lead to conflicts, with people fighting over recyclable cans and bottles, getting injured, and eventually having to seek police assistance. Then this kind of news all over the newspapers and site. This is real money, I really don't dare to imagine.",
      "comments": [
        {
          "text": "today, auntie waits at the counter to get QR Code, tomorrow, auntie will wait for me to finish my coke zero.",
          "score": 330
        },
        {
          "text": "Just look at China, elderly picking cans, bottles and cardboard from trash bin and fighting each other for territory",
          "score": 118
        },
        {
          "text": "i am going to foresee it already,\nlong queues at the recycling machine because of one auntie that has 3 huge bags filled to the brim with recycling drink bottles one by one slotting them in for the cash $$$\nand afterwards the recycling machine would be full and everyone that queued will be dissapointed and that same auntie will always be there daily to do the same process over and over again and dont forget the new higher pricing of all those \"recyclable drink bottles\" as well and we as consumers will bear the cost just because of 10cent returns.",
          "score": 103
        },
        {
          "text": "Yeah, that's for sure.",
          "score": 42
        },
        {
          "text": "小弟，喝完可以给 auntie 吗?",
          "score": 35
        },
        {
          "text": "Confirmed got some unemployed people that are going to be struggling hard to collect more, hustling and fighting for every dollar to cover basic expenses.",
          "score": 35
        },
        {
          "text": "Then it is a supply and demand issue. If the gov really cared, they'll add more machines and manpower dedicated to recycling, like how the Germans do with the Pfand equivalent. A failure to do so either implies incompetence or their values didn't align with their mouths in the first place.",
          "score": 34
        },
        {
          "text": "This will signal the return of the rude can collecting uncle and aunties at hawker centers and kopitiam. Where they \"asks\" you if you have finished you drink or not,  if not they will next \"ask\" you to quickly empty the bottle so they can move on.",
          "score": 33
        },
        {
          "text": "I see a lot of aunties and uncles walking around the station platform to scan the wink QR code at each train door.",
          "score": 25
        },
        {
          "text": "可以，两瓶一毛",
          "score": 19
        },
        {
          "text": "BTW probably the last few months everyone can drink their can or bottle in peace at a public place, treasure it guys!",
          "score": 17
        },
        {
          "text": "Garang guni: auntie why u so long never come find me",
          "score": 16
        },
        {
          "text": "Sad that there are people that have to collect recyclables just to cover basic expenses. While PAP ministers eat with money launderes at expensive restaurants.",
          "score": 14
        },
        {
          "text": "I did that a lot in secondary school... Because it was free bingsu every few weeks",
          "score": 11
        },
        {
          "text": "There's one of these can recycling machines installed at the Yuhua village hawker center. Every Tuesday when I walk past it, it's either already full or jammed.",
          "score": 10
        },
        {
          "text": "Already happened long ago when an auntie swiped an unfinished can from one of the guys at the table.. he was too shocked to react",
          "score": 9
        },
        {
          "text": "I'm not even going to order canned or bottle drinks when I'm dining out. After my meal, am I suppose to bring my empty can and wash in the toilet, bring back to office keep in my bag the whole day, then make another trip to where ever that machine is to get back 10cents? Not to mention the increase price of 20-70 cents quoted by the vendors plus all these extra work... It's easier to just skip the drink and reduce consumption of unhealthy drinks at the same time.",
          "score": 7
        },
        {
          "text": "Labour n transport vehicles high coe. Will add to cost",
          "score": 6
        },
        {
          "text": "And worse, you can't even crush the can to save space because then, the machine can't scan the QR code to process the refund. My guess is to just accept that this is a barely-disguised price hike, and the empty cans are going back to the hawker centre who then processes them and keeps the refunds for themselves.",
          "score": 3
        },
        {
          "text": "Hahaha",
          "score": 3
        },
        {
          "text": "Ah boy / ah girl. I want that can",
          "score": 3
        },
        {
          "text": "Why blame the auntie. It’s being recycled right? But is this even being green considering that the machine uses energy and resources to be built.",
          "score": 3
        },
        {
          "text": "one auntie that has 3 huge bags filled to the brim with recycling drink bottles one by one slotting them in for the cash $$$ and afterwards the recycling machine would be full and everyone that queued will be dissapointed I mean thats good right? The point is to get more bottles recycled, not distribute money equally. if auntie is out there collecting discarded bottles to recycle she is basically providing a public service.",
          "score": 3
        },
        {
          "text": "Encountered at Toa Payoh before",
          "score": 3
        },
        {
          "text": "I'm okay with bearing the cost. Something has to be done.",
          "score": -8
        }
      ]
    },
    {
      "id": "t3_1qqz8p2",
      "subreddit": "singapore",
      "title": "GDP growth may no longer translate to jobs; deliberate strategy needed to create diverse opportunities: DPM Gan",
      "url": "https://old.reddit.com/r/singapore/comments/1qqz8p2/gdp_growth_may_no_longer_translate_to_jobs/",
      "score": 227,
      "num_comments": 168,
      "created_at": "2026-01-30T15:50:05",
      "selftext": "",
      "comments": [
        {
          "text": "Gdp means nothing when the income inequality rises, all the money gets funnelled to the rich ppl and stays there bc they love to accumulate money.",
          "score": 283
        },
        {
          "text": "Look. Look at my comment history. I’m very critical of our so called “leaders”. First thing first, it’s very refreshing that they are now implying that GDP at all cost and over every other priority is not the way forward. Thank you, thank you PAP for finally starting to see this. People on the streets and on the online sphere have been screaming at this for literal decades. Decades. Thank you for finally listening. Our GDP grew almost exponentially versus that of the late 1990s, but how many people actually feel better off as compared to then? We cannot solve the problem if the conversation is that the problem don’t exist.  We need to give credit when credit is due, now that they are FINALLY acknowledging this. The question is now what? Hubs wont cut it. We have so many failed and half-past-six “hubs” or “cities”. We need the level of leadership and visionary foresight that solved our water issue, to come up with a new game plan.",
          "score": 243
        },
        {
          "text": "Our GDP growth is basically from artificially inflating population and property prices and washing dirty money and not actually creating things of value. Of course it's not going to work at some point.",
          "score": 130
        },
        {
          "text": "not optimistic. they are still pushing the narrative that it's AI driven. you just know it's going to be more skillsfuture for everyone",
          "score": 83
        },
        {
          "text": "I think it's rly increasingly difficult to get a good living nowadays, really need to put in effort and work smart to secure good opportunities for ourselves. It's foolish to rely on anyone else, gone are the days where any lj job also can support a family comfortably. This is global, not just sg. Companies are too efficient.",
          "score": 77
        },
        {
          "text": "Hence 4.8% GDP growth, who actually believes it means anything real? Even best-case, GDP was never a sufficient measure of economic health alone.",
          "score": 43
        },
        {
          "text": "I won’t say they are falsifying number but they have been creating “artificial” growth all these while. Jacking up property prices and allowing them to runaway increases GDP, increasing population size increases GDP, keep relaying rebuilding and “upgrading” the same road over and over again increases GDP, all of which increases GDP at no real organic growth. Granted, I know that the actual economics is much more complex than this, so I’m just generally speaking. But regardless, I’m very heartened to have them hint at GDP-at-all-cost is not the way forward.",
          "score": 32
        },
        {
          "text": "There are people that put in little effort and are stupid but are cronies and nepo babies who get good opportunities. In a situation like this, it's necessary and smart to rely on others and work with them to overturn it.",
          "score": 31
        },
        {
          "text": "Only 1 minister said it. And nothing is changing. Still the same old PAP bashing opposition, NGOs and academics that disagree with them and making it easy for money launders from China, India, Indonesia, Malaysia, Thailand, Myanmar, etc. MAS (print cash notes for the launderers), the banks (facilitate accounts and churning) and shops (selling branded items to launderers that then sell in their countries for legitimate money) rely on the money launderers to keep them going.",
          "score": 29
        },
        {
          "text": "Feels like you’re somewhat thinking of and responding to a more critical take on this, which I weirdly feel obliged to provide despite also mostly agreeing with you. Perhaps, they are growing tired of all the shenanigans required to pad GDP figures to mask the lack of organic growth, and now want to dispense with the pretense altogether. Or our problems have grown too big for any manipulation to move the needle short of falsifying numbers.",
          "score": 18
        },
        {
          "text": "Say only and he’s really good at talking cock lol. Walk the talk and stop pegging ministerial bonuses to GDP then we’ll know he is sincere",
          "score": 13
        },
        {
          "text": "Opening more malls or casinos, and importing more workers will grow GDP. Thats just how the formula work, but pretty sick if someone’s salary is pegged to such nebulous data.",
          "score": 13
        },
        {
          "text": "scams are booming world wide",
          "score": 10
        },
        {
          "text": "4.8 percent is nominal GDP, real GDP is lower. Also, the amount that goes to workers is low compared to other developed countries. Stagnant wages are what we have.",
          "score": 8
        },
        {
          "text": "The shift is from “our government is completely clueless, out of touch, a lost cause” into now “maybe there’s hope. Finally there’s a sliver of very cautious hope.” Had they been saying this near election, I would not have believed them one bid. But coming from their so called “task force man” who is close to our reining PM, I hope things changes. I really do. Unpopular opinion. I think many of the honorable son’s policy did us in. Not all are bad, but clearly a large portion of it can be attributed to him.",
          "score": 6
        },
        {
          "text": "That's the work smart technique I guess......... Until u get caught",
          "score": 5
        },
        {
          "text": "So far LW has not been very different from LHL in his actions and his cabinet says the same type of motherhood statements with no actual changes. 1 taxi driver called him a smiling tiger. I fear no change is possible as the rot is too deep and wide.",
          "score": 5
        },
        {
          "text": "I somehow feel he is still bogged down by legacies.",
          "score": 3
        },
        {
          "text": "So right. Why tied ministers bonus to GDP growth. Conditions should include citizen’s jobs, cost of living etc and not just GDP.",
          "score": 2
        },
        {
          "text": "Low taxes, wealth preservation",
          "score": 2
        },
        {
          "text": "Gdp means Gan deputy prime?",
          "score": 1
        },
        {
          "text": "🎯",
          "score": 1
        },
        {
          "text": "LW has been a very different PM from LHL. Not as witty but I hear many people liked him.",
          "score": 1
        },
        {
          "text": "Like him for? What successes did he have? Actually what successes did his predecessor have?",
          "score": 1
        },
        {
          "text": "Those are like such a minority that you focus all your life to target. It is sad being you to be honest. Move on and improve your own life instead of dissing on others.",
          "score": -15
        }
      ]
    },
    {
      "id": "t3_1qr9bxt",
      "subreddit": "singapore",
      "title": "Man, 43, an Indian national & ex-technician at Home Team range, steals over 164kg of spent bullet heads, gets 10 months' jail",
      "url": "https://old.reddit.com/r/singapore/comments/1qr9bxt/man_43_an_indian_national_extechnician_at_home/",
      "score": 213,
      "num_comments": 43,
      "created_at": "2026-01-30T23:57:28",
      "selftext": "",
      "comments": [
        {
          "text": "Bruh you know who’s building all the new security systems in SAF camps? All the foreign workers. Hell if you’re in SAF camps you know they walk amongst everyone in camp. Just that they don’t have passes for offices. But yea I would think it’s a major security risk, if I’m an adversary I can just pay them to note all the camp layouts and details no?",
          "score": 169
        },
        {
          "text": "Looks like the recycler need to explain why they allow the bullet casing to be taken in without any certifications",
          "score": 121
        },
        {
          "text": "Govindarajan panicked and attempted to replace the spent bullets at the shooting range. A security supervisor at the industrial complex, which housed the recycling company, noticed an unattended bag of spent bullet heads and filed a police report on Jul. 26. So after he got rejected by the recycling company he just left the spent bullets there and dipped? How was he planning to replace the bullet heads at the shooting range without those?",
          "score": 86
        },
        {
          "text": "Why are foreign nationals allowed to work at the range?",
          "score": 69
        },
        {
          "text": "Blue collar jobs in Singapore has always been low. Due to easy importing of workers from other countries to depress wages. They should check how much plumbers and sparkies charge in Australia, US and UK. Even binmen. It is not a job problem, it is a salary mismatch.",
          "score": 42
        },
        {
          "text": "I an aware of this. Imo there’s a big difference in terms of security risk in having foreign workers constructing unfinished buildings as compared to doing operational roles within active buildings.",
          "score": 41
        },
        {
          "text": "Every time someone calls for maintenance or something that needs fixing, street lamps, tree pruning, drainage clearing, you name it they will be there. In more sensitive areas there will be a soldier to escort them. Expanded brass casings are processed by third party contactors, mainly foreign workers doing the ground work. That was my experience 20 years ago.",
          "score": 40
        },
        {
          "text": "went to babina before, saw those villages running around the shooting ranges to collect scrapes .....",
          "score": 38
        },
        {
          "text": "Yeah, and who builds all our military camps and installations? bangalas etc. Ohhhh nooooo they sign NDA..... now they surely can't talk about it right...??? It's like that family guy joke about Batman. SOMEONE built and moved all that equipment into the batcave. It wasn't just bruce and alfred. A shit ton of mexican workers did that. Excavating the place, fixing the electric cables, installation of platforms etc.",
          "score": 31
        },
        {
          "text": "Bruh you know who’s building all the new security systems in SAF camps? All the foreign workers. I mean who else to build them? they build everything. if u wanted SG construction workers then it will never be built",
          "score": 28
        },
        {
          "text": "Its an industry problem, not a worker problem No Singaporean would take the construction work of manual labor for a pitiful salary",
          "score": 17
        },
        {
          "text": "Don’t they have to take pics of their job done to send to supervisor?",
          "score": 15
        },
        {
          "text": "hah. reminds me of that one time during nsf days where a foreign civilian managed to walk past the main gate with a huge camera around his neck (he was a tourist) and stroll around inside the camp for over half an hour before being stopped by an encik.",
          "score": 15
        },
        {
          "text": "What happened to the ammunition declaration???",
          "score": 14
        },
        {
          "text": "Ans is same for all these type of questions: not enough Singaporean want to work there",
          "score": 10
        },
        {
          "text": "Still relevant 10 years ago",
          "score": 7
        },
        {
          "text": "no sinkie wan to do jobbbbbbbbbbb",
          "score": 6
        },
        {
          "text": "164kg??",
          "score": 3
        },
        {
          "text": "Another day another foreign talent…this time 🇮🇳",
          "score": 3
        },
        {
          "text": "If you want camp layout, you can see aerial shots of most restricted areas in Singapore straight from Google maps when you swap to satellite view. You would think that it would be censored on map apps but they aren't lol",
          "score": 1
        },
        {
          "text": "These are not the expended casing. Those would be accounted for after shooting and returned to a different secured storage. These are the copper jacketed bullets, most probably found in the backstop /sand at the end of the range. Once in a while which is cleared to remove all the lead.",
          "score": 0
        },
        {
          "text": "Still relevant now (camp ops)",
          "score": 0
        },
        {
          "text": "Plumbers actually earn decently here. Actually, more like make a killing. Other blue collar jobs, yeah, not this one.",
          "score": 0
        },
        {
          "text": "But there are tens of thousands of nsf with pitiful salary annually? Maybe construction work of manual labour can be a form of national service. At least it gives some of them an actual skillset (construction) and also help to reduce our reliance on foreigners in this area.",
          "score": -6
        },
        {
          "text": "Were the worker’s Bangladeshi or Indians? Mindef allows Muslim to build the installations? When I was in service, all the contractors were Indians, even our local Muslim brothers were allowed. Have the rules changed?",
          "score": -15
        }
      ]
    },
    {
      "id": "t3_1qqwufj",
      "subreddit": "singapore",
      "title": "Man gets jail for asking nurse to 'help' him in the toilet, exposing himself",
      "url": "https://old.reddit.com/r/singapore/comments/1qqwufj/man_gets_jail_for_asking_nurse_to_help_him_in_the/",
      "score": 136,
      "num_comments": 36,
      "created_at": "2026-01-30T13:34:15",
      "selftext": "",
      "comments": [
        {
          "text": "Despite her fear, the victim felt unable to leave Teng behind because of her duty as a nurse. Nurse is brave but I think next time just leave the bastard there and call police lol",
          "score": 159
        },
        {
          "text": "he watch too much jav already",
          "score": 147
        },
        {
          "text": "Once he was in the toilet with the nurse, the patient said in a low voice: \"As a man, I have my own personal needs, and I need you to help me.\"",
          "score": 72
        },
        {
          "text": "His prison mate can fulfill that",
          "score": 63
        },
        {
          "text": "People need to stop mistreating healthcare workers. I had no issues being assisted by female doctors, technicians and nurses while partially nude for medical tests and procedures.",
          "score": 58
        },
        {
          "text": "she damn poor thing pls can u imagine how terrifying is this for a girl and she was still trying to do her job, what a piece of rubbish this charles",
          "score": 46
        },
        {
          "text": "The nurse shd have replied....可以的，我立刻帮你把kkj剪掉。  。",
          "score": 43
        },
        {
          "text": "If he fall prism leh, tho I wouldn't know how this will proceed considering he harrassed her",
          "score": 29
        },
        {
          "text": "If his bird strong enough to stand means he also can stand",
          "score": 22
        },
        {
          "text": "Japanese awesome videos",
          "score": 20
        },
        {
          "text": "it was explained in the article why the victim was in the bathroom with the door closed and how she felt duty-bound to assist the idiot with his shower. she stayed very professional and was taken advantage of.",
          "score": 16
        },
        {
          "text": "Charles ah Charles..sick and still want to behave like a sick pervert",
          "score": 14
        },
        {
          "text": "No victim shame",
          "score": 14
        },
        {
          "text": "The nurse is very faithful to her duty but sometime it is okay to ignore that duty if it is being abused by others",
          "score": 11
        },
        {
          "text": "一劳永逸 Translation: Do things proper one time,so that there will be no future problems.",
          "score": 10
        },
        {
          "text": "He'll sure get a lot of \"help\" when he becomes the prison bitch.",
          "score": 9
        },
        {
          "text": "Watch too much jav",
          "score": 8
        },
        {
          "text": "The nurse still felt duty bound and tended to his needs despite the situation she was in... much respect to her but if it were me I would have just reported the incident immediately.",
          "score": 6
        },
        {
          "text": "I agree. It was actually embarrassing having to be watched by a female nurse when moving about when I was a fall risk. Only nice thing was that I was still able to hop short distances on one foot, and I could convince the trainee nurse to do it myself because I didn't want to expose my bits",
          "score": 5
        },
        {
          "text": "Jollibee applepie vanilla",
          "score": 4
        },
        {
          "text": "You have Google",
          "score": 4
        },
        {
          "text": "Joyful action video",
          "score": 3
        },
        {
          "text": "Yeah, his cardiac strong enough to sustain both his big and small head.",
          "score": 2
        },
        {
          "text": "Help him book appt for this.",
          "score": 1
        },
        {
          "text": "[ Removed by Reddit ]",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qrmygg",
      "subreddit": "singapore",
      "title": "Singapore begins ban on ‘undesirable’ visitors, airlines to comply or face fine",
      "url": "https://old.reddit.com/r/singapore/comments/1qrmygg/singapore_begins_ban_on_undesirable_visitors/",
      "score": 117,
      "num_comments": 15,
      "created_at": "2026-01-31T08:17:56",
      "selftext": "",
      "comments": [
        {
          "text": "This type of advance passenger processing is performed by many countries including Australia, Canada, USA, UAE and some European countries. It's basically the airline submitting passenger information in advance of departure, and the destination country telling them whether they can issue a boarding pass or not. It is particularly effective for island countries like Australia and New Zealand where the overwhelming majority of arrivals are by air. Great to see Singapore implementing it. It's not just about banning undesirables, given Singapore is a major transit hub there are implications for international law enforcement also. The webpage for Australia'sAdvance Passenger Processingsystem actually goes into quite a lot of detail on how it works in practice, for those interested.",
          "score": 73
        },
        {
          "text": "How was this managed previously? They are denied entry at immigration then sent back?",
          "score": 39
        },
        {
          "text": "Yes. Passengers arriving deny entry into Singapore and will need to be sent back. They call it NTL (Not to land). Passengers will need to pay for the return flight. Which often results in huge dispute… cos no one wants to pay. So I guess airlines will very much welcome this but if the airlines staff at the departing country makes a mistake lol then it’s the airlines that need to bear the cost of repatriation.",
          "score": 32
        },
        {
          "text": "Good. Undesirables stay out",
          "score": 22
        },
        {
          "text": "Nice. Especially the \"visa\" free travel made it much easier for unwanted elements to make this peaceful place their playground.",
          "score": 16
        },
        {
          "text": "Thanks for this. I'm surprised SG didn't already have this. I'm very curious as to how this list will be managed as it has been controversial in the US and Canada - mostly because in some cases you can't know if you're on the list and there's no way to challenge it.",
          "score": 15
        },
        {
          "text": "This is not about implementing new lists -- I am sure they already exist. This is about moving the enforcement point back to the start of the journey rather than the end. If someone is incorrectly on a list better they find out before they board rather than when they arrive into Singapore. Then they can engage with their local Singaporean embassy to have it resolved.",
          "score": 13
        },
        {
          "text": "Whether it exists or not does not detract from the sovereign right of all countries to deny entry to visitors. There is no way to challenge denial of entry.",
          "score": 8
        },
        {
          "text": "There is and should be. Sometimes the wrong people are denied simply due to having the same name. Mistakes happen that can be worth clarifying.",
          "score": 5
        },
        {
          "text": "This is more likely airline conservatism / policy to help reduce the chance of being fined for boarding a passenger they shouldn't have. I get asked for my EP about 50% of the time when departing Australia, I was also asked for it when departing Japan on a KIX-MNL-SIN itinerary.",
          "score": 5
        },
        {
          "text": "Maybe this explains why they always ask to see my travelling partners’ EPs, DPs etc when we exit Australia to fly back to SG. This isn’t something they ever check when we are travelling from ASEAN or European countries.",
          "score": 3
        },
        {
          "text": "Came here to ask this. There's a reply below byu/exidythat summarizes it well.",
          "score": 3
        },
        {
          "text": "?",
          "score": 0
        },
        {
          "text": "I think it’s the “influencer” who goes around trying to grab celebrities and jumping barricades at concerts and events (got jailed for grabbing Ariana Grande in sg)",
          "score": 0
        },
        {
          "text": "So the blue hair weirdo gonna be banned from transiting?",
          "score": -6
        }
      ]
    },
    {
      "id": "t3_1qqxn6x",
      "subreddit": "singapore",
      "title": "13 ex-Certis officers charged with offences including pocketing items, possessing vapes and contraband cigarettes",
      "url": "https://old.reddit.com/r/singapore/comments/1qqxn6x/13_excertis_officers_charged_with_offences/",
      "score": 89,
      "num_comments": 18,
      "created_at": "2026-01-30T14:17:18",
      "selftext": "",
      "comments": [
        {
          "text": "Nothing new la, back in my time ah when foreign warships came for portcall, we were supposed to confiscate all duty unpaid alcohol and cigarettes and “dispose” them. Nobody said how to dispose them so we used our livers and lungs.",
          "score": 39
        },
        {
          "text": "Likely many many many more lol",
          "score": 38
        },
        {
          "text": "They are: Muhammad Fitri Jaffar, 38 Muhammad Syafiq Tahar, 39 Mohamad Aidil Abu Bakar, 47 Muhamad Hazim Mohamed Jalil, 33 Sufian Mohamed, 45 Muhammad Faddley Abdul Wahid, 38 Chan Wei Ying, Olivia, 39 Mohamed Fiaros Mohamed Zakaria, 43 Muhammad Haziq Khamzah, 31 Muhammad Khairul Izzul Shah Abdul Karim, 38 Nurazmy Yusoff, 33 Reggie Choo Beng Kwang, 32 Tan Wee Keong, 38",
          "score": 23
        },
        {
          "text": "Ocean’s 13 ",
          "score": 11
        },
        {
          "text": "Please read the article first?",
          "score": 11
        },
        {
          "text": "Do SPF next",
          "score": 9
        },
        {
          "text": "Olivia Ocean",
          "score": 5
        },
        {
          "text": "Ocean's Certis",
          "score": 3
        },
        {
          "text": "Olivia OCHAN",
          "score": 2
        },
        {
          "text": "Literally the first sentence after the headline HAHA",
          "score": 2
        },
        {
          "text": "Droplet in the ocean.",
          "score": 1
        },
        {
          "text": "Shocked but not really that singaporeans have to do this shit job.",
          "score": 1
        },
        {
          "text": "Aiseh",
          "score": 0
        },
        {
          "text": "Can't smoke out of this one, gents!",
          "score": 0
        },
        {
          "text": "家贼难防",
          "score": -1
        },
        {
          "text": "MHA allows hiring of auxiliary cops from China, India; prisons trial sensors to track inmate health https://www.straitstimes.com/singapore/politics/mha-allows-hiring-auxiliary-cops-from-china-india-prison-trying-sensors-to-monitor-inmates-health",
          "score": -11
        },
        {
          "text": "Mostly Malaysian",
          "score": -12
        }
      ]
    },
    {
      "id": "t3_1qrp49y",
      "subreddit": "singapore",
      "title": "Young couple spotted acting inappropriately at Choa Chu Kang block void deck",
      "url": "https://old.reddit.com/r/singapore/comments/1qrp49y/young_couple_spotted_acting_inappropriately_at/",
      "score": 75,
      "num_comments": 54,
      "created_at": "2026-01-31T09:52:19",
      "selftext": "",
      "comments": [
        {
          "text": "She said she had been resting at home when her mother suddenly called her out to the corridor, where she then noticed the couple. Auntie can recon from afar, no need to leopard crawl to catch action lol",
          "score": 130
        },
        {
          "text": "Beside a rubbish chute is wild",
          "score": 119
        },
        {
          "text": "Good on them for working hard to make babies",
          "score": 83
        },
        {
          "text": "Isn't this what Jo Teo wanted",
          "score": 70
        },
        {
          "text": "“when Shin Ming reporters visited the area…” 😂 can’t help to chuckle, does this worth a trip down",
          "score": 42
        },
        {
          "text": "Based on the photo that place is bright AF, horniness really don’t stop people",
          "score": 31
        },
        {
          "text": "She’s wiping those potential babies away",
          "score": 30
        },
        {
          "text": "no space mah",
          "score": 28
        },
        {
          "text": "Gan Kim Yong say people not working hard enough. Give this couple an award!",
          "score": 23
        },
        {
          "text": "Small space mah",
          "score": 19
        },
        {
          "text": "For once it’s not a stairwell",
          "score": 16
        },
        {
          "text": "Should go to staircase instead. Rubbish chute area is too exposed with high traffic.",
          "score": 15
        },
        {
          "text": "Want babies... Don't keep reporting such things?",
          "score": 15
        },
        {
          "text": "Reuse, Recycle and Reproduce",
          "score": 9
        },
        {
          "text": "Auntie is that Encik's grandmother.",
          "score": 0
        },
        {
          "text": "Got space mah",
          "score": 0
        },
        {
          "text": "Mall staircase mah",
          "score": 0
        },
        {
          "text": "They took joteo’s words seriously",
          "score": 0
        },
        {
          "text": "The only time a parent would be able to legitimately respond to the question \"where did I come from\" with \"from the rubbish chute\"",
          "score": 0
        },
        {
          "text": "Where do babies come from?",
          "score": 0
        },
        {
          "text": "Dirty business can be quite a turn on actually..trash",
          "score": 0
        },
        {
          "text": "Train down: WhatsApp people = investigative journalism. Companies with big issues: email people = reach out for comments. People inappropriate at rubbish chute: grabs gear and lets go investigative journalism.",
          "score": 0
        },
        {
          "text": "Imagine the convo the boss had with the poor soul who had to do the site visit eh, can you visit the place What for? erm, just so we can say we did?",
          "score": 0
        },
        {
          "text": "Camping for crimewatch renenactment",
          "score": 0
        },
        {
          "text": "Public sex stories very popular now mah, strike while iron is hot",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qquhyw",
      "subreddit": "singapore",
      "title": "Beverage container return points to be set up within 5-minute walk of most HDB residents",
      "url": "https://old.reddit.com/r/singapore/comments/1qquhyw/beverage_container_return_points_to_be_set_up/",
      "score": 72,
      "num_comments": 153,
      "created_at": "2026-01-30T11:39:33",
      "selftext": "While this new scheme may \"result in some inconvenience\", he expressed confidence that people in Singapore would adapt.\n\n\"We did it for reusable bags and the tray return scheme, and I am confident that, with time and understanding, this scheme will become part of our daily routine,\" he said.",
      "comments": [
        {
          "text": "This is going to be pfand.",
          "score": 65
        },
        {
          "text": "We don't have much of a littering problem to begin with. And more importantly, we don't have a good plastic bottle recycling plant. So we collect for what? There was this pilot Plastic Recovery Facility announced in 2021. Can't find info about what was the result of the study or if the thing was even built. And in this 2023 NEA call for proposals related to plastic recycling: While there is currently no local facility that recovers contaminated plastics from domestic waste, NEA is studying the feasibility of a Plastic Recovery Facility which will take in domestic waste collected from households and trade premises, and recover various plastic polymer types (e.g. polyethylene and polypropylene). https://www.nea.gov.sg/docs/default-source/default-document-library/request-for-proposal-plastic-waste-recycling-and-packaging-solutions-_-finalcc66964db7d8411e833f33640c6b8887.pdf So again, we collect already, then the stuff goes where because no one wants it?  Back to our incinerator or overseas incinerator orillegal facilities in neighbouring countries?",
          "score": 41
        },
        {
          "text": "Yup I hope it will be as successful here as in Germany. They were able to cut down on so much littering by making recycling a profit incentive.",
          "score": 22
        },
        {
          "text": "We don't have much of a littering problem to begin with. We do, you're just not aware of it. Have you talked to people from JTC/NEA about the complains they receive about litter in industrial estates, or anyone who lives near foreign dorms?",
          "score": 21
        },
        {
          "text": "The whole process is managed by a consortium of major beverage producers, including Coca-Cola, F&N Foods and Pokka, and supervised by the National Environment Agency (NEA). Translation:Cost will come out of beverage producers.Gov just eye power. Consumers will foot the bill in the end.",
          "score": 19
        },
        {
          "text": "People littering means they literally couldn't find a single fuck to use the bins provided. What makes you think they will be bothered to use these machines?",
          "score": 15
        },
        {
          "text": "I commented because your statement on littering not being a problem is incorrect. I know my colleague's estate has serious issues with littering, complains were persistent enough to induce the MP to personally visit the problem areas with NEA, and was forced to admit it was a serious recurring problem. One that could not be resolved simply by increasing the cleaning frequency. Additionally JTC has been forced to send cleanup crews to clean up several industrial estates because several companies complained about the littering situation. Maybe this problem does not impact you. But it is a big concern for other Singaporeans.",
          "score": 9
        },
        {
          "text": "I disagree. There are plenty of plastic bottles in recycling bins from the significant portion of residents who have been recycling all along, not knowing if they were even doing any good or it just goes back to the incinerator. Show us that the recycling is actually meaningfully turned into new products and more people will recycle. They have had plenty of raw material to show proof of concept. If they had done that and want to scale up with this bottle return scheme, I wouldn’t be upset. But don’t abuse my desire to do good by making recycling far less convenient than it is now, with nothing productive to show for it.",
          "score": 9
        },
        {
          "text": "Collect to remove the rubbish from the streets lor. Like many here have said, Singapore is acleanedcity. There are many people who don’t follow the rules and leave trash everywhere. If you go watch you can see people leave drink containers / bottles everywhere (on tables, on benches, etc) and it’s the foreign workers who put these into the bins. Now we have a chance to actually make people dispose their trash in a proper location, or at the very least penalise them for not being civic minded. It will be a benefit to society.",
          "score": 6
        },
        {
          "text": "So all of us have to be inconvenienced because of some poor-behaved work permit holders? Go fine the crap out of them on Sunday night instead.",
          "score": 5
        },
        {
          "text": "10 cents plastic bags already giam siap to no end even if they don't pick up confirm someone will",
          "score": 4
        },
        {
          "text": "Fair, but I don't think it would make a lot of difference. I think the amount they get back is way too little. But we shall see.",
          "score": 3
        },
        {
          "text": "Walk around in Darryl David ward you will see the amount of trash everywhere.  I'm sure others are similar too",
          "score": 3
        },
        {
          "text": "No, people don’t usually leave bottles and cans lying around.....the only demographic that I see littering drink containers pretty often are the same migrant workers.. Ah, yes, the typical \"every sgporean is a good sgporean\" narrative. If there's some littered rubbish, then it must be the migrant workers and foreigners bcos there's no way we'll litter containers outside.",
          "score": 3
        },
        {
          "text": "Not just the foreigners mate. I see alcoholic uncles leaving their beer cans, kids not older than 15 anyhow leave their soft drink cans everywhere. Ask them to throw they will ignore you",
          "score": 2
        },
        {
          "text": "ive seen people toss stuff on the floor with the green bin right next to them, its incredible",
          "score": 1
        },
        {
          "text": "for real, garbage and food waste all over void decks are from neighbourhood people",
          "score": 1
        },
        {
          "text": "enforcement costs money, it wont happen",
          "score": 1
        },
        {
          "text": "That one is contaminated plastics. Ideally the plastics collected from the Container Return is clean. Even if it’s not, it’s all of the same known kind which is purely PET.  PET can be recycled over and over.",
          "score": 1
        },
        {
          "text": "singapore gets clean up by migrant workers daily but littering is still a huge problem, this aint a clean streets type of city",
          "score": 1
        },
        {
          "text": "You see the trash on Monday morning in the places where they congregate on Sunday night. It's pretty darn obvious.",
          "score": 0
        },
        {
          "text": "you have to build the habit first before it becomes economical to build a plant",
          "score": -1
        },
        {
          "text": "as the tray return scheme has shown, simply expecting people to do good isn't going to work the best motivator have always been fines or financial incentives",
          "score": -1
        },
        {
          "text": "because they'd throwing money on the floor",
          "score": -2
        },
        {
          "text": "No, people don’t usually leave bottles and cans lying around. If there’s no recycling bin we will throw them in the trash. At home in HDB flats, some people can be bothered to bring down to recycling bin, some throw them into the chute. No one is littering drink containers at home. Strangely enough the only demographic that I see littering drink containers pretty often are the same migrant workers tasked to do the cleaning. Or maybe it’s the construction workers littering for their cleaner brethren to deal with.",
          "score": -3
        }
      ]
    },
    {
      "id": "t3_1qr02pv",
      "subreddit": "askSingapore",
      "title": "Isn't making Thaipusam a public holiday long overdue ?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qr02pv/isnt_making_thaipusam_a_public_holiday_long/",
      "score": 582,
      "num_comments": 118,
      "created_at": "2026-01-30T16:40:48",
      "selftext": "I saw in The Straits Times that about 16,000 people are celebrating Thaipusam this year, with high footfall and the usual procession. As expected, there are road closures and motorists are advised to take alternative routes. Our Indian friends have been celebrating Thaipusam for many years already.\n\nI was discussing with a coworker, and he mentioned he was quite relieved that it falls on a Sunday this year, so he doesn’t need to take leave. And it would be nice if everyone could get one more public holiday, since Chinese and Malays already have two religious holidays each.\n\nWhy hasn’t Thaipusam been made a public holiday by now ? When it falls on a weekday, many people take leave anyway, which affects productivity regardless. Wouldn’t it make more sense to just formalise it as a PH ?\n\nAlso, Vesak Day is celebrated by Buddhists, who are mostly Chinese. I'm yet to meet a Indian Buddhist so I’m not entirely sure why Vesak Day is grouped under Indian holiday. Might be there in other countries. Happy to be corrected on this.\n\nAlso there is another festival pongul for Indians which is celebrated for a few days. Atleast give us 1 more PH la.\n\nCurious to hear what others think.\n\nEdit : I understand there are many other Indian communities other than Tamil. Respect that. I want to focus on Thaipusam since it is widely known.\n\nEdit : like someone mentioned I won't be surprised we might get a founder's day before we get another PH for Indians lol.",
      "comments": [
        {
          "text": "Yes, should have been made a public holiday, need more public holidays in Singapore tbh.",
          "score": 552
        },
        {
          "text": "Because a single additional public holiday still cause Singapore to lose competitiveness, foreign firms will flee Singapore and all of us have to work in Malaysia",
          "score": 401
        },
        {
          "text": "Ya lo! I heard our gdp dropped 1000% because we got that sg50 holiday back in 2015!",
          "score": 134
        },
        {
          "text": "Frankly, we can afford more PHs. We want our people to embrace multiculturalism. But also want people to work hard all day everyday. Isn't it tiring?",
          "score": 131
        },
        {
          "text": "3 October 2022 NOTICE PAPER NO. 1391 OF 2022 FOR THE SITTING ON OR AFTER 3 OCTOBER 2022QUESTION NO. 3464 FOR WRITTEN ANSWER MP: Assoc Prof Jamus Jerome Lim To ask the Minister for Manpower (a) whether the current approach to gazetting public holidays retains the historical colonial-era practice of allocating two holidays per ethnic group; (b) if not, what considerations led to the abandonment of this principle; and (c) if so, whether the Government can explain the current mapping of holidays by ethnic group. Answer:",
          "score": 115
        },
        {
          "text": "And make us lose our competitiveness! /s",
          "score": 87
        },
        {
          "text": "Since 1968 lol. We still have many policies that we follow for many years. That's why we need a revamp.",
          "score": 69
        },
        {
          "text": "Yea, we also should win in most public holidays",
          "score": 60
        },
        {
          "text": "Are you slightly regarded? That’s clear sarcasm",
          "score": 58
        },
        {
          "text": "And our women will have to travel out to work as maids!! Shocking! Best to reduce holidays",
          "score": 53
        },
        {
          "text": "They want us to happily take lower pay and longer working hours and have fewer rights and protections and never see the sun but also somehow date, marry, have and raise lots of children to be worker bees.",
          "score": 36
        },
        {
          "text": "I think the lobbyists need to change up their sales pitch a bit. The race and religion card is clearly not working. But perhaps they can pitch it as a boost for fertility and conception, as studies showed that public holidays tend to boost birth rates 9 months later. The lesser stress and social lubrication of the holidays seems to be a good aphrodisiac. Plus given how abysmal our birth rates are, we shouldn't pull back our punches to tackle it. Haha.",
          "score": 30
        },
        {
          "text": "lol added the word “slightly” for safety",
          "score": 22
        },
        {
          "text": "I know it’s sarcasm but Malaysia has way more public holidays than us and they are fine 😂",
          "score": 14
        },
        {
          "text": "Funniest shit I've read all day",
          "score": 8
        },
        {
          "text": "Woosh……",
          "score": 6
        },
        {
          "text": "One more day of holiday won’t die",
          "score": 5
        },
        {
          "text": "Give an inch, take a mile.",
          "score": 1
        },
        {
          "text": "Dingdong",
          "score": 1
        },
        {
          "text": "But the GDP!",
          "score": 1
        },
        {
          "text": "GDP =/= improvement in citizens life if it only benefits the top % of society.",
          "score": 1
        },
        {
          "text": "I'll say dude is well regarded. No /s in case they think it's sarcasm.",
          "score": 1
        },
        {
          "text": "Who said anything about improving norma sinkies lives?",
          "score": 0
        },
        {
          "text": "Yes, and? That’s my real question. Who said that?",
          "score": -31
        },
        {
          "text": "Who said that? Show us the analysis. Edit: fuck those who are downvoting and still can’t give any reference to this “sarcasm”.",
          "score": -74
        }
      ]
    },
    {
      "id": "t3_1qqzkcw",
      "subreddit": "askSingapore",
      "title": "What is the wildest incident or event that ever happened in your workplace or office?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qqzkcw/what_is_the_wildest_incident_or_event_that_ever/",
      "score": 121,
      "num_comments": 195,
      "created_at": "2026-01-30T16:09:25",
      "selftext": "This is the hot topic of discussion. During the few days.",
      "comments": [
        {
          "text": "One of the big boss resigned after he was forced to choose a list of people to be retrenched… Was lowkey very sad for such a cheerful and a gentleman leave the company he carried on for 15 years",
          "score": 244
        },
        {
          "text": "A stray cat hiding underneath a machine gave birth to a litter.",
          "score": 236
        },
        {
          "text": "Some idiot left a window opened and whole office got ransacked by crows. Documents fly everywhere. Rubbish all over.",
          "score": 124
        },
        {
          "text": "Yeah, he rather one for the team, then to make team experience retrenchment. Great leader, I guess he is prepared to move on with his life.",
          "score": 114
        },
        {
          "text": "Came back from a meeting, to see everyone standing on their chair and screaming… Turns out a rat ran in and no one could find it",
          "score": 88
        },
        {
          "text": "Wow happiness and red egg for everyone.",
          "score": 83
        },
        {
          "text": "Plot twist: Management wants him to retrench the tram before retrenching him.",
          "score": 30
        },
        {
          "text": "Wow did your office adopt the lot?",
          "score": 26
        },
        {
          "text": "Boss checked the cctv.",
          "score": 23
        },
        {
          "text": "Probably not. Which means he simply left to avoid a difficult task No one wants to retrench anyone, but if it's my own team, I'll damn well make sure I give the news rather than some random HR they don't know",
          "score": 22
        },
        {
          "text": "Now they retrench the whole team instead of stopping at 15",
          "score": 20
        },
        {
          "text": "So interesting. How did you guys find out that it's crows? Were the crows still there flying around when you got back?",
          "score": 20
        },
        {
          "text": "Do you work in the Pitt?",
          "score": 19
        },
        {
          "text": "Depends if management honors his sacrifice",
          "score": 18
        },
        {
          "text": "But did his act stop the retrenchment from happening?",
          "score": 17
        },
        {
          "text": "lol, I thought it’s going to be monsoon rain, and the office is flooded. I guess someone kept food stuff in the office.",
          "score": 13
        },
        {
          "text": "He had to cos somehow company is in a bad shape and he resigned citing that it will save on the costs too",
          "score": 7
        },
        {
          "text": "Have no issue retrenching people after I fight for them, but damn those clowns who require me to badmouth people to deprive them of their severance.",
          "score": 6
        },
        {
          "text": "No, manufacturing",
          "score": 5
        },
        {
          "text": "No, he couldn’t and he was cornered. And he left the same day the team left. And management knew this and made an exception for his 2 months notice.",
          "score": 4
        },
        {
          "text": "Oh what! He had to choose people to retrench and then after he did that he resigned? What a sad deal.",
          "score": 3
        },
        {
          "text": "Bank?",
          "score": 3
        },
        {
          "text": "Nope.",
          "score": 2
        },
        {
          "text": "What an admirable man",
          "score": 2
        },
        {
          "text": "Sounds like an episode of the Office, except that Michael Scott didn’t have another co-manager to bounce off ideas with",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qqvnt1",
      "subreddit": "askSingapore",
      "title": "A neighbour from hell and how to deal with her crazy ass",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qqvnt1/a_neighbour_from_hell_and_how_to_deal_with_her/",
      "score": 88,
      "num_comments": 71,
      "created_at": "2026-01-30T12:35:11",
      "selftext": "Hi everyone, a neighbour just moved into my block early last year. We live on different floors and don't talk to one another. We have cross paths downstairs before but no words were ever exchanged though I notice she would stare at me when we walk past each other. She's had several complaints from other neighbours regarding her noisy dog, her constant loud arguments with her son and her loud banging of doors and windows before. \nJust a month ago I noticed she has been walking past my unit and staring into my home. I left my windows open so she knows I live in this unit. Yesterday she came to my unit at 5.40am to smear feces on my window ledge and pour white plaster on my window pane causing my 3 panals of window to shut. I had to scrape off the dried plaster to get my windows to open up. I confronted her with my cctv evidence which shows her face but she still denied it and slammed the door in my face. Have since reported her to the police. She's got 2 cctv outside her home and it's obvious that she might delete her cctv recording when she stepped out of the house. What else can I do to deter her from harassing my unit and is there anyway to get a restraining order so she never comes to my floor again ? Many thanks!",
      "comments": [
        {
          "text": "After seeing so many neighbors from hell i have come to the conclusion that you can only fight fire with fire.",
          "score": 114
        },
        {
          "text": "Smear faeces? Gg how to communicate with siao kia",
          "score": 40
        },
        {
          "text": "If u dont fight then u are only purely suffering. If u fight back both suffer together.",
          "score": 21
        },
        {
          "text": "Install CCTV inside your home (between door and gate), record and send to police, MP, town council, HDB. At most she will get fined. Like my ex-neighbour get fined multiple times (I have since moved out after suffering for 4 years). If your neighbour is able to pay the fines, you can bet the \"revenge\" actions will get bigger each time.",
          "score": 16
        },
        {
          "text": "but sometimes you really shouldnt fight crazy with crazy. no one really wins",
          "score": 15
        },
        {
          "text": "Your neighbours are crazy. But are you as well? Your neighbours might end up grabbing a chopper and.... (My ex-neighbour who were crazy did grab a chopper and chased after us)",
          "score": 14
        },
        {
          "text": "so... op should put piss disks in the neighbour's house?r/UnethicalLifeProTips",
          "score": 12
        },
        {
          "text": "agree..with so many neighbours from hell nowadays getting reported and the authorities is not even doing anything to resolve all this issues sometimes the only way is to fight fire with an even bigger fire,\ncausing fear to someone is the only way to stop their mad behaviours\nsince authorities will not step in to help then there is no choice because in the end its either you suffer or you move out of the neighbourhood and then another poor soul will pay the same consequences as you",
          "score": 12
        },
        {
          "text": "We started to look for new flat. You can't win crazy people unless you are crazy yourself. That old man shouted \"I am already so old, I have nothing to lose by killing you!\" while brandishing the chopper and running to us.",
          "score": 11
        },
        {
          "text": "Report to the police. And forward a copy to town council and HDB. And go see your MP with the police report.",
          "score": 11
        },
        {
          "text": "I have a cctv outside that's how I know what time and who did the act. Confronted her with the evidence but she vehemently denied it and slammed her main door in my face",
          "score": 8
        },
        {
          "text": "Set malicous trap at ur windows. If u dont want to attack them.",
          "score": 6
        },
        {
          "text": "No witness..... That time lift lobby still no cctv.... He took the chopper from the kitchen, rushed to the metal gate and still have to unlock his gate. We had time to run away. We came back with the police and they only gave him a verbal warning. Young people who have plenty of years left to live are on the losing end.",
          "score": 6
        },
        {
          "text": "You're not expecting me to smear feces and pour plaster on her unit do u? She's got cctv outside her unit too. I know what she works as and with some info I can easily find out where she works.",
          "score": 6
        },
        {
          "text": "That's why mutually assured destruction works!",
          "score": 5
        },
        {
          "text": "That’s honestly terrifying. You did the right thing by leaving because there’s no reasoning with people like that. I wish the government has the balls to prosecute this kind of neighbour or at least send them to mental hospital for health check.",
          "score": 4
        },
        {
          "text": "Have to make it big enough - CC as many pple as possible. If you compliant to MP, usually things move faster",
          "score": 4
        },
        {
          "text": "Throw cockroach bomb into her house sounds more fun.",
          "score": 3
        },
        {
          "text": "What happened after?",
          "score": 2
        },
        {
          "text": "Like that police still cannot catch him/her?",
          "score": 2
        },
        {
          "text": "How do you get enough cockroaches? Pray tell",
          "score": 2
        },
        {
          "text": "I have to disagree, ive out crazied people before:)",
          "score": 2
        },
        {
          "text": "Make a DIY trap put near rubbish chute.",
          "score": 1
        },
        {
          "text": "I like this mindset",
          "score": 1
        },
        {
          "text": "Black magic. U wouldnt want to know..",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qr17zs",
      "subreddit": "askSingapore",
      "title": "market rate for a female PT in SG?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qr17zs/market_rate_for_a_female_pt_in_sg/",
      "score": 58,
      "num_comments": 26,
      "created_at": "2026-01-30T17:51:38",
      "selftext": "a total noob here, never been to the gym and only does running as my form of staying active.\n\nam looking into getting a female PT for myself, and was wondering how much it usually costs for maybe 10-20 sessions for a start?\n\nthanks in advance! <3",
      "comments": [
        {
          "text": "U can go to any gym outlet in sg and ask them if they have any recommendation or partnership. Would be about $80-$100 per session for those under gyms. Private might be cheaper",
          "score": 23
        },
        {
          "text": "i had a pt for 80/hr! included the gym entry (but only when i was w my PT)",
          "score": 21
        },
        {
          "text": "Kudos for you to get a head start at gyming! Gym sessions usually charge based on a per-session or as a package. Generally see per session basis charge 50-90. These trainers usually help to bring a start to how you can gym, including a basic workout plan and the standard form of exercising. Eventually when you get used to the equipment, you might opt for the mid-tiers who might instruct you on how to focus on certain areas of your body. But you will have to decide if the budget is good thereon.",
          "score": 12
        },
        {
          "text": "A PT can cater the training to the specific person and their goals. You can’t get this from youtube. Youtube is great for general info and how-to’s but there are also a lot of conflicting info out there you have to sift through. A lot.",
          "score": 7
        },
        {
          "text": "bruh",
          "score": 7
        },
        {
          "text": "Congrats on trying to achieve a new goal for yourself! ex PT and Gym sales here. For 10-20 Sessions, you're looking at least $900-$1500 for the package ($90-$150 per session). This excludes Gym Membership. But since you're new, I hope you don't mind me dropping some advice on getting one. Before you decide on getting a PT, Ask yourself these questions, how often are you going to work out? What's your goal? Do you want to be fit or look fit? It's okay to enquire about your Personal Trainer's past experience because it will save you a lot of time and money. For example, a bodybuilder PT is not optimal to train you for HIIT unlike the PT who was an athlete or special force. Most PT will try to smoke through everything just to hit KPI, so do not say \"let me think about it\" because they are trained to counter that, instead say \"alright thank you but i gotta rush now, I'll prolly call/come down later\" I might get downvoted here but it's really tough to get a good female PT around unless they are experienced and they usually come at a high cost. If you have any questions do let me know, Good luck!",
          "score": 5
        },
        {
          "text": "Anyone have a female PT to recommend? Total beginner to strength training. Feel abit intimidated to hit the public gym cos not sure how the different equipment works, and want to also make sure i’m doing it in the right form to avoid injuring myself in the long run so thought that having a PT might be a good start. Thanks in advance :)",
          "score": 3
        },
        {
          "text": "Your average PT in commercial gyms have no special skill set lol. Nothing complicated in searching \"how to do ___\", unless they're learning actual complicated movements like what I mentioned which the majority of PTs don't even know how to do properly.",
          "score": 3
        },
        {
          "text": "Can you share your PT details  , please",
          "score": 2
        },
        {
          "text": "Did you try F45 ? Why not join a group session?",
          "score": 2
        },
        {
          "text": "80-100 per hour for private entry level coach. Might be cheaper for female coach who serves only the women gym goers",
          "score": 2
        },
        {
          "text": "If you need recommendation, I can recommend ongweiyu on IG. She is good.",
          "score": 2
        },
        {
          "text": "Try stoic strength!",
          "score": 1
        },
        {
          "text": "About $100 per sesh x 10 on average. Might be cheaper, if you’re near Farrer Park maybe try 24 Ace fitness",
          "score": 1
        },
        {
          "text": "Your comment has been automatically removed because your account is relatively new or you have negative karma. I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns.",
          "score": 1
        },
        {
          "text": "I have a coach who does private or group session either at the gym outside in the public area. She also conducts her session inside her apartment where we sometimes go. Group session about $3-40, private I think $60-80 if we go to her place",
          "score": 1
        },
        {
          "text": "For those who already follow Jeff Nippard or Dr Mike Israetel, and are interested to broaden their perspectives, I would suggest  watching Solomon Nelson’s videos on both of them (be warned they are very long but worth watching) You’ll realise a lot of the science-based YouTubers also do not know basic programming/jump on fads in order to sell you something. Lyle McDonald, Fazlifts, Basement Bodybuilding have better content imo",
          "score": 1
        },
        {
          "text": "Yes Jeff Nippard has built his brand on being science and evidence based, bringing up “the research” very often. However, more critical voices have pointed out that Nippard misinterprets research papers, and jumps on hype in order to sell you a variety of programmes. If he’s as “optimal” as he claims then why does he have high volume, power building and most recently low volume programmes? All purported to give him the best gains of his life? Science is their chosen marketing angle, just like how some use the whole meathead or alpha persona (Van Wyck or Paul Carter). Specific to your question, Nippard was a former client of Solomon Nelson, who acted as his consultant. Solomon has pointed out in a previous video that Nippard’s volume recommendation for his women’s programme just did not make any sense. Another error was Nippard prescribing a very high % of 1RM for multiple sets, which does not make any sense either.",
          "score": 1
        },
        {
          "text": "thank you! i do not know anything on all this topic. would you think Jeff Nippard is considered 'science-based YouTubers also do not know basic programming/jump'?",
          "score": 0
        },
        {
          "text": "not every PT knows their thing. they don't even know the better breathing techniques. and the deep science behind it. carbon dioxide. etc. oxygen for your blood stream. most are clueless about sports science, nutrition and muscle movement and reaction. and even heart rate kind of things. suggest to check out Jeff Nippard on YouTube. he explains a lot.",
          "score": -1
        },
        {
          "text": "Agree here, just watch YouTube, and also other people in the gym. I see PT always getting the people doing some weird exercises lol \nJust run and use the machines is enough to keep fit.",
          "score": -7
        },
        {
          "text": "Personally, I think save the money, buy a Garmin forerunner 165 or similar. Use that to get your aerobic up with maybe a 5km training plan. You can select a pace or heart rate target. Once you are sort of fitter, maybe you can then consider going to a gym otherwise your first few months will be a waste of money. You can also claim ntuc vouchers when you link the Garmin to the health 365 app so the watch pays for itself.",
          "score": -7
        },
        {
          "text": "Just watch YouTube, don't waste your money on gym trainers. Using machines is almost brain-dead , you don't need someone to teach you. Unless you're interested in learning specific movements like olympic lifts or powerlifting lifts. Still , the majority of trainers in the gym aren't worth the price tag.",
          "score": -9
        },
        {
          "text": "Can teach leopard crawl?",
          "score": -13
        }
      ]
    },
    {
      "id": "t3_1qqukpa",
      "subreddit": "askSingapore",
      "title": "Anyone know places where you can sit down and ‘peoplewatch’?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qqukpa/anyone_know_places_where_you_can_sit_down_and/",
      "score": 43,
      "num_comments": 47,
      "created_at": "2026-01-30T11:43:07",
      "selftext": "Anyone know places where you can sit down and have a view of many people walking around/doing normal stuff? Wanna see how people interact normally and learn more about the current state of society",
      "comments": [
        {
          "text": "Punggol Waterway Point Loads of young families there and you can observe whether the dad/mom love their kid(s) or not. See how drained these parents look. Hah, super effective birth control",
          "score": 138
        },
        {
          "text": "Living up to your username",
          "score": 40
        },
        {
          "text": "Depends on what type of crowd you are looking for. East coast park (Families picnic, bbq gathering, cycling and jogging people) Popular shopping malls ( people meeting, going about to do their errands, lunch, dinner, shopping) I heard little india has that 烟火气, I think haji lane, gelang serai market, Chinatown complex all has similar vibe of older people gathering, busting about.",
          "score": 31
        },
        {
          "text": "Hawker centre",
          "score": 27
        },
        {
          "text": "vivo city at night, can try roof or just stand at the railing",
          "score": 21
        },
        {
          "text": "Botanic Gardens. The side closer to Cluny is my preferred option. After a morning walk, I like to grab a cup of coffee and just sit by the lake and watch the world go by. You get a nice mix of people too.",
          "score": 11
        },
        {
          "text": "People's park",
          "score": 9
        },
        {
          "text": "Takashimaya fountain at b2 😀",
          "score": 8
        },
        {
          "text": "do mrt stations or sitting in trains count?",
          "score": 8
        },
        {
          "text": "Neighbourhood cafes with window seats. A few that come to mind just because I happen to have frequented them: Alchemist Khong Guan Building (Tai Seng), House Downstairs (Ghim Moh), Craftsmen Specialty Coffee (window seats near back door) (Holland Village), Wishes Cafe (MacPherson).",
          "score": 8
        },
        {
          "text": "There was a recent case of peoplewatchingobserving in offices. Turned out to be quite popular online",
          "score": 7
        },
        {
          "text": "Orchard/Somerset has a number of good high spaces to just sit and watch. Quite diverse also haha",
          "score": 5
        },
        {
          "text": "Seeing it in real life is much better than reading it online. Go there and you will see parents who have clearly checked out of the family. See how mothers are doing most of the parenting while the dad is on his phone.",
          "score": 4
        },
        {
          "text": "Outside One Raffles Place",
          "score": 4
        },
        {
          "text": "Saturday morning doggo watching at the orchid garden plaza area before Palm Valley",
          "score": 3
        },
        {
          "text": "Haha don't need to go all the way there to see Just lurkr/regretfulparentsis fine too 🤣",
          "score": 2
        },
        {
          "text": "Straight up this is it, i prefer chompang hawker",
          "score": 2
        },
        {
          "text": "Nice",
          "score": 2
        },
        {
          "text": "I like to do it in Funan or Jewel",
          "score": 2
        },
        {
          "text": "Bishan Park, East Coast Park, Alchemist Cafe at The Heeren, any Starbucks or cafe in Joo Chiat, Changi Village, Six Letter Coffee in Tanjong Katong",
          "score": 2
        },
        {
          "text": "The square at punggol coast mrt or kampung admiralty. The steps outside ion/wisma atria. Starbucks 313 somerset at balcony seating can see people walking to 313 or orchard",
          "score": 2
        },
        {
          "text": "Any crowded area, and different area different demographics",
          "score": 2
        },
        {
          "text": "%@313. :D",
          "score": 2
        },
        {
          "text": "Over there only the NONAIRCON place in the Center for you to sit and watch. Where else have place for you to watch??",
          "score": 1
        },
        {
          "text": "wow good idea",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qr1gtu",
      "subreddit": "askSingapore",
      "title": "Is there any student remote jobs in SG?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qr1gtu/is_there_any_student_remote_jobs_in_sg/",
      "score": 30,
      "num_comments": 32,
      "created_at": "2026-01-30T18:05:39",
      "selftext": "I seem to be stuck. My parents don't let me work yet they won't pay for my Hamster's necessities like food and bedding for him.for reference I only get like $50 a month and I don't even have school. Still waiting for my Posting results.\n\nI'm not allowed to go out to work anything and supposed to depend on my savings. I can't survive with $30 or less for a month. Any help for a remote job?\n\nI mean I'm good at Voice Acting and Drawing but is there any remote jobs that actually pay a decent amount?",
      "comments": [
        {
          "text": "I mean at this age surveys be your best bet wont be soo much (actually depends on how much u grind) but can end up with decent change at the end of the month",
          "score": 29
        },
        {
          "text": "Teach tuition online, but you probably need to undercut other people to find customers.",
          "score": 15
        },
        {
          "text": "Please don't fall for those scams where they tell you - earn money from home! And expect you to give them money first.",
          "score": 12
        },
        {
          "text": "If you are good at VA, try affiliate marketing. Quite easy to set on Shopee. Use any products you have around the house and record videos of products with your voiceover reviewing and introducing features on your phone. Post the vids on Shopee feed and tag the correct product listings that gives commission. Learning video editing to enhance the video quality would be a good way to spend your time during holidays. I recommend “VN Editor” which is free and easy to use.",
          "score": 8
        },
        {
          "text": "For VA, try casting call club and its discord. Occasionally there’ll be paid gigs so hopefully you can get those. Art wise just try to get commissions in general. Join art servers and stuff (discord also) but take note that most of them will only pay through PayPal, so it’ll be a little hard for you if you’re not yet 18 (assuming ur 17 cause waiting for posting). Hence that has to wait a year. Singapore wise, you can try to sell some of your stuff through carousel, or really just local based commissions so you can get paid through paynow/paylah.",
          "score": 5
        },
        {
          "text": "You can try getting exposure on social media platforms? Maybe content creation and open to commissions?",
          "score": 4
        },
        {
          "text": "Thanks! Do you know where to find them?",
          "score": 2
        },
        {
          "text": "i lost 9.6k to one of these last last year.. feel so dumb.. its ok.. life lesson..",
          "score": 2
        },
        {
          "text": "Yikes. My friend's mum just fell for one of those, about 20k gone.",
          "score": 2
        },
        {
          "text": "Shopee commissions! But the pay can vary and takes months to cash out",
          "score": 2
        },
        {
          "text": "Shopee collection point?",
          "score": 2
        },
        {
          "text": "Your home can be a shopee collection point.",
          "score": 2
        },
        {
          "text": "Thank you!",
          "score": 1
        },
        {
          "text": "Thank you!!",
          "score": 1
        },
        {
          "text": "I'll try that soon! But I don't think I use shopee much 🤔 Maybe next time I buy my hammie materials",
          "score": 1
        },
        {
          "text": "im down to give suggestions on video editing if you need any.",
          "score": 1
        },
        {
          "text": "Definitely! Any simple no watermark editing software on phone?",
          "score": 1
        },
        {
          "text": "I'll try that!",
          "score": 1
        },
        {
          "text": "I don't exactly have a shop or somewhere to do that",
          "score": 1
        },
        {
          "text": "Unfortunately, I've been doing it as a side hustle for 4 years yet no monetisation or anything.",
          "score": 1
        },
        {
          "text": "ouh, thats unfortunate. I was about to suggest shopee or instagram shop but others have brought it up.",
          "score": 1
        },
        {
          "text": "hello i DM on hamster necessities",
          "score": 1
        },
        {
          "text": "Voice acting? Send me your showreel and if there's anything suitable, I can help lobang",
          "score": 1
        },
        {
          "text": "I will send you some links",
          "score": 0
        },
        {
          "text": "that's something that appeases me.. that other have if worse off..",
          "score": -11
        }
      ]
    },
    {
      "id": "t3_1qr03dp",
      "subreddit": "askSingapore",
      "title": "What does this Singlish term mean?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qr03dp/what_does_this_singlish_term_mean/",
      "score": 30,
      "num_comments": 35,
      "created_at": "2026-01-30T16:41:59",
      "selftext": "I was with a colleague and heard a term I’ve never encountered before - ice cream.\n\nBasically the conversation was about asking up on a meeting with a client, and the reply was basically “wah, cannot la ice cream la that one”. I mean, I gather that it didn’t go so well.\n\nWhat is the actual meaning of it and anyone knows how did it originate?",
      "comments": [
        {
          "text": "First time sia I heard of this term",
          "score": 112
        },
        {
          "text": "https://www.insingapura.com/dictionary/word/ice-cream/ Found from the net, I also have no idea when or where did the term came from but started using it pre-covid as an alternative to jialat. These days, I seldom use/hear it being used anymore.",
          "score": 48
        },
        {
          "text": "It’s basically like doomed. Melted ice cream",
          "score": 32
        },
        {
          "text": "Ice cream in this context means like GG or jialat or gone case. I still hear it being used within my circle of friends.",
          "score": 16
        },
        {
          "text": "HAHAHAHAHA!! Is your colleague Malaysian? My partner said that one of his Malaysian contractors uses this very often when something messes up. He also sends a melting ice cream sticker on wa when texting",
          "score": 14
        },
        {
          "text": "I scream?",
          "score": 14
        },
        {
          "text": "You ice cream already my friend",
          "score": 12
        },
        {
          "text": "yes it did seem to kind of mean jia lat. i’m just surprised i haven’t heard of this term till now",
          "score": 9
        },
        {
          "text": "How did it even start",
          "score": 9
        },
        {
          "text": "Ice cream liao not something new lah. 93 kid here already heard and used it. Nowadays just replaced by siao liao lah, hong gan liao, etc.",
          "score": 8
        },
        {
          "text": "80s kid here and I've never heard of it until today",
          "score": 6
        },
        {
          "text": "U mean.. BING CHILLING?",
          "score": 6
        },
        {
          "text": "92 and I've also never heard of ice cream used instead of jialat",
          "score": 5
        },
        {
          "text": "thanks! melted ice cream does make sense!",
          "score": 3
        },
        {
          "text": "I’m so mad that i understood what it means but couldn’t remember how i knew what it meant lol",
          "score": 3
        },
        {
          "text": "A real Singaporean won't know what the heck that is.",
          "score": 3
        },
        {
          "text": "Out of curiosity, what age range was the speaker from? Wondering if it's a more old fashioned Singlish term, or maybe from some certain demographic",
          "score": 2
        },
        {
          "text": "My reno-contractor calling his guy 'Simple thing also failed, you damn ice-cream sia' because that guy drilled the hole with wrong size bit. That's my first time hearing the word in actual usage, I had to google it.",
          "score": 2
        },
        {
          "text": "No like, ice scream is the slang for i scream",
          "score": 2
        },
        {
          "text": "never hear be444444444",
          "score": 2
        },
        {
          "text": "We used to say that in my previous company and we also use \"BBQ le\" , same meaning",
          "score": 2
        },
        {
          "text": "millennial, around late 80’s, early 90’s",
          "score": 1
        },
        {
          "text": "am pretty sure it was the ben & jerry’s type than a vocal response",
          "score": 1
        },
        {
          "text": "Indeed. These youngsters making new words up.",
          "score": 1
        },
        {
          "text": "lol",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qr6t8v",
      "subreddit": "askSingapore",
      "title": "What happens when a person dies with debt, and the estate is not enough to cover it?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qr6t8v/what_happens_when_a_person_dies_with_debt_and_the/",
      "score": 20,
      "num_comments": 28,
      "created_at": "2026-01-30T22:23:43",
      "selftext": "Specifically: let's say for example I have $30k in debt, but I have more than $30k in savings account/investments like in IBKR. The day before I die I transfer all my money to my parents, such that there's $0 in accounts to my name. What happens to this $30k debt? Is the >$30k I transferred to my parents going to be considered part of my estate? Anything else I should consider? Thanks.",
      "comments": [
        {
          "text": "Im pretty sure if you're in debt, you can't anyhow transfer assets to people then just die, disappear etc. Anyways bro, i hope you're doing well in life, don't anyhow throw your life away then transfer your remaining assets to your family. If I'm wrong, im sorry.",
          "score": 111
        },
        {
          "text": "I'm pretty sure there's some rules in insolvency law that would allow the recovery of those assets. Edit: a quick Google says that under Insolvency, Restructuring and Dissolution Act 2018 (IRDA), there is a 3 year look back period for such transactions, because they were at an undervalue. (I.e. a gift)",
          "score": 37
        },
        {
          "text": "pls call hotline SOS if u need to... dont do the irreversible.",
          "score": 26
        },
        {
          "text": "Money or assets you transfer out of your name are generally no longer part of your legal estate. However, if such a transfer is made to defraud creditors (e.g by leaving yourself insolvent while gifting away significant assets), the transfer can be legally challenged. In that case a creditor or the legal representative could apply to the court to have such a transaction reversed or for the recipient to be held accountable for the value. The timing of the transfer would generally be a strong indicator of intent.",
          "score": 21
        },
        {
          "text": "I mean people try and game the system all the time. You're not the first to think of ways to move your money around and there are plenty of others who are smarter and have more resources than you. So if you think you can just randomly gift your parents 30k ang pow money out of the blue and nobody is going to notice, remember there are others who deal in millions and billions of dollars worth of assets using shadow companies, overseas accounts and crypto wallets everyday. And they still get tracked down eventually.",
          "score": 16
        },
        {
          "text": "Are you opening a kinda microloans biz?",
          "score": 15
        },
        {
          "text": "OP, there are real options out there to help with debt. Banks, credit counselling agencies, and social services can all help you restructure payments, negotiate with creditors, or work out a manageable plan. You are not alone. Many people have been in similar situations and managed to recover with the right support. Even though money problems can feel overwhelming now, they’re only temporary and solvable. Your life, on the other hand, is irreplaceable. You matter more than any debt. Please talk to someone you trust and reach out to professional help. You don’t have to carry this alone, and things will get better with the right support.",
          "score": 14
        },
        {
          "text": "You thought you figured out a loophole huh.",
          "score": 12
        },
        {
          "text": "Do you still have any CPF? If yes, CPF payout will also got to cover debts first. Insurance cash value? Insurance payout? But why are you asking such a question? You are unlikely able to predict the day before you die unless you are planning something...",
          "score": 8
        },
        {
          "text": "Maybe read the following https://mylegacy.life.gov.sg/when-death-happens/settle-outstanding-bills-and-taxes",
          "score": 5
        },
        {
          "text": "Generally the debt is considered cleared if debt > assets for an estate. However for your example, like many others have said, creditors might go after your family if the transactions were recent so not a good idea to give them such trouble.",
          "score": 4
        },
        {
          "text": "If you just give them the 30k yes the debtors can claw. But if you get them to \"sue\" you for parental support and you \"settle\" for 30k then its not claimable since its the proceeds of a legal settlement.",
          "score": 3
        },
        {
          "text": "So do it 3-5 years in advance before your demise",
          "score": 2
        },
        {
          "text": "Depends on who the debt belongs to. If banks/credit cards, they'll get your guarantor(s) to pay it. If HDB still on mortgage and you have no next of kin, HDB will repossess the flat and the proceeds/remaining furniture will pay off the debt. If friends, then I guess nothing happens cos it's not a formal thing. But they might ask from your family. If you have life insurance, that will also pay off the debts.",
          "score": 2
        },
        {
          "text": "Not a legal expert but I remember that CPF monies do not form a part of the decedent’s estate, ie creditors cannot take it. Be sure to have your nominations up to date. The money should flow directly to your nominees. https://www.cpf.gov.sg/service/article/how-will-the-deceased-member-s-cpf-monies-and-assets-be-distributed-if-he-was-a-bankrupt https://papers.ssrn.com/sol3/papers.cfm?abstract_id=952928 https://law1a.nus.edu.sg/sjls/articles/SJLS-Jul-2007-138.pdf(non paywalled) Medisave account, however can be used to fulfil outstanding medical bills.",
          "score": 1
        },
        {
          "text": "No lah. As long as the use his CPF to finance his mortgage, then he will be covered under Home Protection Scheme. So when he pass away, the scheme kicks in and CPF board will settle the outstanding loan (bank or HDB).",
          "score": 1
        },
        {
          "text": "Withdraw the money as cold hard cash and then secretly ask parents to keep the money in milo tins and dig hole in ground to keep it. Traditional method always work.",
          "score": 1
        },
        {
          "text": "OP, I’m not learned enough in this to give an answer to your qn but I just wanna send you internet hugs~ Hope u find strength in speaking to someone when things get rough. Chin up OP!!",
          "score": 1
        },
        {
          "text": "You’re correct they will think it’s not worth it to pursue but wait they will sell it to someone for cents on the dollar who think theycanrecover it and will be worth it to them (this company has their own funding structure that makes this sort of claim their bread and butter) Eventually the debt will find its way into the hands of someone that decidesthisis how I eat today then they will come for you Source: I work in non performing loans",
          "score": 0
        },
        {
          "text": "Aw shucks forgot about cpf. Thanks for the reminder.",
          "score": 0
        },
        {
          "text": "Bro. Whatever it is, please do not consider suicide as an option. I am making a big assumption but wtf, still gotta say it.",
          "score": 0
        },
        {
          "text": "Don’t transfer directly to your parents/family/anyone. Liquidate first, and then dissipate. Legally there are implications, but practically it will be incredibly hard for creditors to recover if you strategise well. But likewise, banks also do some assessment if it were worth their legal expense to recover debt. 30k might slip under the radar, but if it were 30m it’s going to be very different. *this is NOT legal advice",
          "score": -8
        },
        {
          "text": "Don't worry, I'm not in debt. Just wondering if there's a way for me to spend some money while leaving as much as possible to my family at the same time. It's ok I'll think of something else!",
          "score": -23
        },
        {
          "text": "I see, they really thought of everything huh.",
          "score": -38
        },
        {
          "text": "Ah just checked it up, that sucks. The question now is whether 30k (or generally what amount) would the banks consider too little to be worth the hassle to deal with.",
          "score": -40
        }
      ]
    },
    {
      "id": "t3_1qr28dn",
      "subreddit": "askSingapore",
      "title": "Thought experiment: Could Singapore realistically go EV-only for passenger cars by 2030?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qr28dn/thought_experiment_could_singapore_realistically/",
      "score": 17,
      "num_comments": 67,
      "created_at": "2026-01-30T18:50:21",
      "selftext": "This is a thought experiment — not a demand or policy proposal.\n\nGiven Singapore’s size, centralised planning, and existing controls on car ownership, I’m curious whether a fully EV-only passenger vehicle system could realistically work here.\n\nFor discussion, imagine something like this:\n\nNew passenger cars: EV-only by 2030\nTaxis / PHVs: at least hybrid by 2030, fully EV by 2035\nA gradual ICE phase-out, not an overnight ban\n\nOne angle that makes this feel more plausible in Singapore is the COE system. Car ownership here is already intentionally expensive, highly regulated, and largely limited to higher-income households.\n\nBecause of that, the higher upfront cost of EVs may be less of a barrier here than in other countries. COE itself could potentially be used as a policy lever during the transition, for example:\n\nDifferent COE treatment for EV vs ICE vehicles\nUsing part of COE revenue to fund grid upgrades, charging infrastructure, or battery recycling\nIncentivising fleets (taxis, PHVs, corporate cars) to transition earlier\n\nA 2030 target would, in theory, give enough time to scale the electrical grid, roll out charging in HDBs, condos, and workplaces, and gradually replace petrol stations with high-voltage DC fast chargers. It would also give automakers and developers clear signals to plan ahead.\n\nSingapore also has some structural advantages here: short driving distances, high vehicle turnover due to COE expiry, and strong centralised urban planning.\n\nThat said, I’m sure there are real concerns and edge cases I’m overlooking, such as charging access in older HDB estates, grid resilience and peak load, cost pass-through to taxis and PHVs, battery lifecycle and environmental trade-offs, and commercial or emergency vehicles.\n\nTL;DR:\nIf car ownership in Singapore is already expensive and tightly controlled via COE, could that same system make a full EV transition more realistic here than elsewhere — or would the infrastructure and social costs still outweigh the benefits?\n\nGenuinely curious to hear different perspectives, especially from people in energy, transport, or policy.\n\nI think it would be amazing to live in the first country that was full EV.  Just imagine the lesser noise on the roads and highways and no more exhaust smell.",
      "comments": [
        {
          "text": "Honestly there are 2-3 charging ports per hdb carpark and about 100 -200 cars. If all of them are evs we are not going anywhere",
          "score": 53
        },
        {
          "text": "I work in the policy (not sg govt). Based on the scientific research and experiences in high EV adoption cities, it's completely feasible for a ban on ICE by 2030. But we should prioritise increasing public transport share and reducing car use.",
          "score": 17
        },
        {
          "text": "it's definitely not 2030. not even 2035 although likely 2035 will be the year there will be very few petrol cars as compared to EVs.",
          "score": 9
        },
        {
          "text": "I suppose we could, but I guess I don’t really feel that invested in an all-EV future compared to if the resources could be channeled towards improving our public transport infrastructure. Seems like the benefits would be pretty negligible overall.",
          "score": 7
        },
        {
          "text": "If all of them are EVs there will be more chargers",
          "score": 6
        },
        {
          "text": "I agree that this would be a massive stumbling block. Unless battery technology improved to the effect that cars are charging at thousands of volts and took only minutes to be full - having enough space to charge is a problem.",
          "score": 5
        },
        {
          "text": "We wont be the first anyway. Norway is practically full EV already (for new cars)",
          "score": 5
        },
        {
          "text": "EV is not that efficient for long distance trips to Malaysia and Thailand. I ever saw this FB post, this family that drove up to Bangkok and probably further in their Tesla Model 3 charged like so many times",
          "score": 5
        },
        {
          "text": "The current plan js for the end of ICE registration by 2030. But it does not mean all EV but hybrids.",
          "score": 4
        },
        {
          "text": "Cars are a pretty significant source of PM2.5 pollution (tailpipe, brakes, rubber) in the Singapore context so it makes a lot of sense to mitigate the pollution. PM2.5 kills. Fewer cars is best, but EV is still a lot better. Car numbers may not look so bad in SG but our car utilisation is extremely high (something like 200-300% that of comparable cities). Also our public transport utilisation lags comparable cities.",
          "score": 4
        },
        {
          "text": "If we use EVs with battery-swapping capabilities I think it's possible.",
          "score": 4
        },
        {
          "text": "No. Being first country with full EV? Does that benefit us? Having high COE cost is restricting cars on roads which serves what you want. It helps but polluted air from overseas still affects us. Currently, the benefits doesn't outweigh the inconveniences.",
          "score": 4
        },
        {
          "text": "Just the improvement in air quality and noise pollution alone in the world's densest country is enough to justify going full EV. Couldn't happen fast enough though Hope they levy 100% tax on fossil vehicles",
          "score": 4
        },
        {
          "text": "How many Singaporeans drive to Thailand? You can easily do SG-KL without charging.",
          "score": 3
        },
        {
          "text": "Tbf our air quality isnt too bad for a dense country.",
          "score": 3
        },
        {
          "text": "Can the power grid handle that many car chargers though?",
          "score": 2
        },
        {
          "text": "Bro comparing current situation with a future situation but not realising infra will be built if policy changes are made. Took them a few days only to setup the chargers in my hdb carpark.",
          "score": 2
        },
        {
          "text": "I think SG must be at least close to the model for excellent public transit and usage already. With 6 million people and only 600k cars that's 1 in 10. Not bad. Could it be better?  Sure.  However not by huge amounts. Cars will always be present, at some point pushing more people to ride transit when already most do has to have diminishing returns. Instead make it more expensive for those that must have cars and cause greener tech with less pollution - if they insist. I personally think that although technically achievable by 2030 it wouldn't be at all cost effective and only marginally better in other ways like pollution and noise. But it has to start somewhere! It is the way it will be eventually.",
          "score": 2
        },
        {
          "text": "Except how many brands out there are selling cars with swappable batteries lol.",
          "score": 2
        },
        {
          "text": "I’m personally skeptical of whether this is feasible, that’s why I’m asking. Thank you for contributing!  I appreciate the discussion.",
          "score": 2
        },
        {
          "text": "This is word. Someone did not do the math. Given that there are 3 charging slots per hdb carpark\n3 x 24 hours x 7 = 504 charging hours per week and its actually lesser because of imperfect changing between cars. Each EV need about 10 charging hours per week..\nSo 504/10=50.4 ev cars!!!  per week and that’s a very loose calculation ..",
          "score": 1
        },
        {
          "text": "It's a chicken and egg thing. We can't have more chargers if we are not using it. Both have to be upscaled together.",
          "score": 1
        },
        {
          "text": "That’s a pipe dream at this point. No manufacturer will limit themselves by agreeing to a common battery standard for a market like Singapore.",
          "score": 1
        },
        {
          "text": "I hate to break it to you but the “first full-EV country” title is already taken.",
          "score": 1
        },
        {
          "text": "That's why we are getting nuclear power in the future.",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qqzlc2",
      "subreddit": "askSingapore",
      "title": "Looking for my long lost grandfather",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qqzlc2/looking_for_my_long_lost_grandfather/",
      "score": 12,
      "num_comments": 11,
      "created_at": "2026-01-30T16:11:00",
      "selftext": "Hi all, i’m looking for info about my grandfather, who worked as a dentist in singapore around 1940s to 1970s. I only have his full name and his profession to go by (no photos, addresses, etc)\n\nGoogle searches didn’t turn up anything so i was wondering if someone might know other sources to find out. TIA!\n\nP:s// im not singaporean",
      "comments": [
        {
          "text": "Contact Crime Library Singapore",
          "score": 6
        },
        {
          "text": "I also do want to find details about my ancestors but haven't had the time to do so. You can try emailing nlb to see whether are there any records of your grandfather(immigration visa, etc) and get more details like addresses. Some records may be visible if you google them but some of them would require you to email them for details. You can try looking for embassies that approve of the visa process for your grandfather(work) You can also try putting it out on social media as well or enquiring details about your grandfather with your relatives Hope this helps!",
          "score": 5
        },
        {
          "text": "thanks will try this.",
          "score": 2
        },
        {
          "text": "Hi Grandson",
          "score": 2
        },
        {
          "text": "Back with... Milk?",
          "score": 2
        },
        {
          "text": "Dentists will need to be registered and licensed to work here, go check with medical board, there should be a record and maybe a photo.",
          "score": 2
        },
        {
          "text": "thanks will try this.",
          "score": 1
        },
        {
          "text": "A bit more clues would be useful.",
          "score": 1
        },
        {
          "text": "If possible, PM me the person’s name, the parent whom is linked to him. Roughly where the parent was brought up.  Name of dentistry?",
          "score": 1
        },
        {
          "text": "Posting details on social media may help to locate him. Or another way is to do a DNA test and see if it matches with any of his other relatives / descendents then trace from them. It's a very long shot but still possible. I.e 23andme",
          "score": 1
        },
        {
          "text": "Well like i said, i only have those to go by. what else am i supposed to do? lol",
          "score": -5
        }
      ]
    },
    {
      "id": "t3_1qr5wgk",
      "subreddit": "SingaporeRaw",
      "title": "Parent's letter to TOC questions political messaging at Edusave Awards event",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qr5wgk/parents_letter_to_toc_questions_political/",
      "score": 82,
      "num_comments": 18,
      "created_at": "2026-01-30T21:47:08",
      "selftext": "She shared that during registration, staff encouraged attendees to follow Jagathishwaran Rajo—the area’s grassroots adviser—on social media. He was also the one presenting the certificates and taking photos with each family.\n\nHer son, unaware of the political context, assumed he was the Member of Parliament (MP). She had to correct him, pointing out that their actual elected MP is Pritam Singh, leader of the Workers' Party.\n\nJagathishwaran Rajo is also one of the People’s Action Party (PAP) candidates fielded for Aljunied GRC in GE2025—a constituency currently represented by Workers’ Party (WP) MP Pritam Singh.\n\nDespite repeated statements asserting the neutrality of the PA by PA chairman Chan Chun Seng, elected opposition MPs remain excluded from Edusave ceremonies and other grassroots activities in their own constituencies.",
      "comments": [
        {
          "text": "This is their back door way of campaigning and keeping their visibility. They can never live with not having 100% control of the parliamentary seats that they have to resort to such unfair tactics.",
          "score": 55
        },
        {
          "text": "\"Remember little boy, when you are able to vote, remember me.\"",
          "score": 18
        },
        {
          "text": "That's why wp says if opposition win you get 2 for 1 xd not only get opposition mp but also pap as grassroots",
          "score": 17
        },
        {
          "text": "Parents should tell their kids clearly that these are the sore losers of the elections.",
          "score": 12
        },
        {
          "text": "Jaga who? Raja who?",
          "score": 10
        },
        {
          "text": "I should add: on taxpayers' dollars. The money comes from MOE's budget, not PAP's, since it's the Edusave Awards ceremony. People's Association, which appoints so-called \"grassroots advisers\" like Jagathishwaran Rajo, is the dirtiest stat board in Singapore.",
          "score": 8
        },
        {
          "text": "Even giving out citizenship ceremony, it already feel like PAP ceremony all over. Just a way to ingrain some mindset about who they should vote in future.",
          "score": 8
        },
        {
          "text": "Let's all face it. LKY started the PA to serve his party interests to read and manage the ground better; All the talks about it not being politically aligned are a load of bullshits that even the blind can see and the deaf can hear. Even as little kids, hanging out at the CCs for games and other activities, we knew it.",
          "score": 6
        },
        {
          "text": "Wa bro, this “follow me on fb/ig” thing is damn loser. Pathetic way to build your dick size.",
          "score": 4
        },
        {
          "text": "Who is this guy, why keep posting?",
          "score": 3
        },
        {
          "text": "PA should be apolitical but we know this won’t happen.",
          "score": 3
        },
        {
          "text": "Go see the Albatross files at the MLB exhibition and you will understand why fixing the opposition is in the DNA of the pap. there is no way the opposition can make any Headway unless another lky emerges. amongst the opposition.",
          "score": 3
        },
        {
          "text": "“Ah boy, next time if you don’t study hard enough, you have to beg children for followers”",
          "score": 2
        },
        {
          "text": "This has been ongoing for years but they still do it. What does that tell you?",
          "score": 2
        },
        {
          "text": "Is he the dentist who resembles the PS look? *",
          "score": 1
        },
        {
          "text": "Nothing new",
          "score": 1
        },
        {
          "text": "Funny how that the son have no idea but yet assume? Looks more like stirring shit only. Honestly why would you care who give you the Edusave, someone give you take that is all. If you voting based on who give you, it is a you problem. If not it does not matter. Want to shake Pritam hand just go his meet the people session.",
          "score": -2
        },
        {
          "text": "<image>",
          "score": -3
        }
      ]
    },
    {
      "id": "t3_1qr5sss",
      "subreddit": "SingaporeRaw",
      "title": "Can P L B employees share screenshots of the group chat chaos when the video first got leaked",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qr5sss/can_p_l_b_employees_share_screenshots_of_the/",
      "score": 70,
      "num_comments": 20,
      "created_at": "2026-01-30T21:42:54",
      "selftext": "That's all I want to know bc I would be having a field day with my colleagues 🤣🤣🤣",
      "comments": [
        {
          "text": "<image>",
          "score": 124
        },
        {
          "text": "who cares. did they care when they make their colleagues suffer with slutty office politics",
          "score": 78
        },
        {
          "text": "Probably under embargo by the new management",
          "score": 56
        },
        {
          "text": "To be fair if the CEO and the Head of Strategy is removed, then the next logical step for more ambitious people would be to jockey themselves into the vacant positions. To share screenshots and further screw up the brand makes no sense. For lower level people, they are unlikely to be in the management group chat anyway, so the likelihood of further leaks is low. PLB is essentially a business first and the money generated from the past is too big to just rely on a few individuals. The fact is their track record and prices transacted will be the only thing potential sellers look at. Who is Fking who is not an issue. Similarly to the buyers they are buying the house no matter who isntue agent. Just ride through this shit and people forget. The fact that Melvin is the owner of the company means that he just does not feature as the face of the business, but the monies he will receive will not change one bit. The biggest loser in this situation would be the girl. She just lost a $230k job and would have to sort out her husband side. Melvin will just say he repent and work towards to the family and I would say 95% chance that the wife does not leave him as there are implications to get lifestyle and the children's lifestyle. Now she would have the upper hand in the relationship no matter what happens.",
          "score": 23
        },
        {
          "text": "uniquely singaporean: craving watching dramas & people suffering",
          "score": 16
        },
        {
          "text": "The news has now spread to Hong Kong (am730) media after making a sweep in Malaysia.... Tour De Asia",
          "score": 15
        },
        {
          "text": "More more more!!!",
          "score": 10
        },
        {
          "text": "We are all suffering. So we take joy in other suffering",
          "score": 10
        },
        {
          "text": "My friends in Australia have been asking me about it.",
          "score": 6
        },
        {
          "text": "But the funny thing is Melvin is no Edison.",
          "score": 6
        },
        {
          "text": "so sympathy for such activities I guess. although it is human nature but both were way too blatant.",
          "score": 5
        },
        {
          "text": "Singapore is now having its own 'Edison Chen moment'",
          "score": 4
        },
        {
          "text": "Tbf sure since they made others suffer but the sinkie pwn sinkie is so real lol",
          "score": 3
        },
        {
          "text": "If not how to be true blue sinkie?",
          "score": 3
        },
        {
          "text": "I wont be surprise they secretly hate each other",
          "score": 3
        },
        {
          "text": "You mean from the real GC?",
          "score": 2
        },
        {
          "text": "<image>",
          "score": 1
        },
        {
          "text": "All employees getting big fat bonuses",
          "score": 1
        },
        {
          "text": "If grace continue hor can attract more business one. People will look to buy house with benefits",
          "score": 1
        },
        {
          "text": "We do not know how well liked they were.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qqzuuv",
      "subreddit": "SingaporeRaw",
      "title": "ban hps in schools - yay or nay?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qqzuuv/ban_hps_in_schools_yay_or_nay/",
      "score": 68,
      "num_comments": 15,
      "created_at": "2026-01-30T16:27:19",
      "selftext": "",
      "comments": [
        {
          "text": "can ban in workplace also?",
          "score": 16
        },
        {
          "text": "Why is this even a conversation? Right from the start, schools banned the use of gameboys, walkman. Then later PSP, DS. Phones have been included in this pile right from the very start. Now they install phone lockers because the current generation is just too addicted to their phones and can't sit still for more than 30 minutes.",
          "score": 8
        },
        {
          "text": "I would like GST to not become 20% thankyouverymuch",
          "score": 5
        },
        {
          "text": "I agree phones are distracting at work place, but you gonna see more people taking smoke breaks lol",
          "score": 4
        },
        {
          "text": "I bet you went to one that's why you know what a lousy school is like.",
          "score": 4
        },
        {
          "text": "The kids today are still “doing stupid stuff with friends in sch” AND recording with their phones and leaking/publishing them online. They are one step ahead of the you back then. Though arguably it gets them into more trouble because of the evidence online, which I imagine is more stupid of them.",
          "score": 3
        },
        {
          "text": "Esp in parliament",
          "score": 2
        },
        {
          "text": "Why not just ask them to leave it at home. Now taxpayers are paying for phone cabinets too?",
          "score": 2
        },
        {
          "text": "I don't know about other schools but for my school, we will get random bag checks",
          "score": 2
        },
        {
          "text": "Lousy schools student won’t do it",
          "score": 1
        },
        {
          "text": "Ban it",
          "score": 1
        },
        {
          "text": "Ya no shit",
          "score": 1
        },
        {
          "text": "Must be lousy school",
          "score": -2
        },
        {
          "text": "How about signal jammers?",
          "score": -3
        },
        {
          "text": "Ridiculous policy and teachers also either aren't smart to enforce or don't bother to enforce. Just bring 2 phones. Not sure why ppl in sch obsessed with TikTok and insta anyway. I was doing stupid stuff with friends in sch that was funnier",
          "score": -6
        }
      ]
    },
    {
      "id": "t3_1qr0ppv",
      "subreddit": "SingaporeRaw",
      "title": "What do you wish was taught in our SG schools growing up, so we could deal with life better?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qr0ppv/what_do_you_wish_was_taught_in_our_sg_schools/",
      "score": 51,
      "num_comments": 55,
      "created_at": "2026-01-30T17:20:20",
      "selftext": "Besides the content and math/science subjects, what were the real things we should have learnt in school so we are better equipped for…. Life.\n\nOff the top of my head:\n\n- Finance and Investments\n\n- Budgeting\n\n- How to speak and present well\n\n- How to think and frame issues in a systematic way\n\n- Making nice visual slides and infographics\n\n- Fixing household things\n\nWhat else?",
      "comments": [
        {
          "text": "financial literacy is top on my list as well, otherwise, graduates who just enter the workforce are just buffet spread for unscrupulous FAs.",
          "score": 65
        },
        {
          "text": "failure. that failing is okay and we must learn how to deal with it emotionally. this 'failing exams equals the end' mantra is why the kids are having unnecessary high and unrealistic expectations of themselves before they even step into the corporate world.",
          "score": 48
        },
        {
          "text": "To question everything, but that is dangerous to government and religion alike.",
          "score": 19
        },
        {
          "text": "Nurturing curiosity. You rectangular, triangular, or circular, all will be pressed into a cube by 16",
          "score": 19
        },
        {
          "text": "Financial literacy looks very different when you're in poverty vs \"middle\" class vs wealthy. You can't tell a person in poverty to stock up and take advantage of bulk purchasing because they have cash flow problems. Nor can you tell a middle class person to leverage loans to the max like a wealthy person because they have very little assets and only have a normal job to fall back on if an investment fails. And that's not even going into the ethics of business... the teachers will hear complaints from the rich parents who donate to the school if you teach them something they don't like to hear. So many politics, haiz. That's the biggest problem in financial literacy classes, the class and differing worldviews.",
          "score": 18
        },
        {
          "text": "I have met some Singaporean families that kind of shocked me in how they treat their children who are not top scorers at school. Had this one family. The dad basically the kind who like to blow his own trumpet and talk talk talk and brag about his job. But he always blanked his own son or spoke dismissively about him (teenager btw), just because he wasn't a high achieving student like his sister. I met the son and he was introverted but a perfectly normal kid with likely his own passions and strengths. To see his own father be disinterested in him was shocking. I can't imagine how the kid must have been feeling, like he isn't good enough. As for the father, don't have kids if you are going to be a douchebag bozo who just expects some sort of linear line of their life path to be upwards. They will get there and it's okay to go through some up and down waves. Anyways it was kind of eye opening as to this idk rat race ultra competitive environment that breeds highly stressed family members.",
          "score": 12
        },
        {
          "text": "They should have therapy and ‘empathy’ classes lol. There’s moral education so why not emotional education..",
          "score": 12
        },
        {
          "text": "Teach school-going kids about consistently DCA-ing into index funds and watch the entire FA industry crumble.",
          "score": 10
        },
        {
          "text": "grooming yourself. how to look professional during jobs. so they can talk about attire, poise, the way you stand, tone of speaking",
          "score": 10
        },
        {
          "text": "Yes, agree. There is too much emphasis on exams. Fault lies though, in both the system, society and self. This one super tough to untangle. Our \"existential crisis\" in our early years of a nation was one primary driver.",
          "score": 6
        },
        {
          "text": "Moral values!",
          "score": 6
        },
        {
          "text": "Most schools are publicly-funded aside from maybe some of the branded ones that have strong alumni network. I actually generally agree with your points. But I've also seen well-off folks throw away their wealth thanks to shitty ILPs and bad stock picking all because they don't know about index funds investing.",
          "score": 5
        },
        {
          "text": "Can't expect emotionally uneducated and unregulated adult teachers to teach emotional education to Sinkie kids in school.",
          "score": 3
        },
        {
          "text": "Time value of money. I don't get why across all schools, that they did not teach the value of compounding which would have helped level the playing field for many unfortunate kids",
          "score": 3
        },
        {
          "text": "Teaching kids on how to do simple maintenance for household would be most practical:\n- aircon maintenance\n- how to change lighting safely\n- how to rectify leaking tap or pipe joints\n- how to basic cement work",
          "score": 3
        },
        {
          "text": "The real truth of unfairness is the top of the list. We are always  taught the idea work hard and you will be rewarded. Takes years of being played to learn the real truth. Compared to our neighbours who grow up in a hostile environment, we are much softer.",
          "score": 3
        },
        {
          "text": "Home stuff. How to maintain simple things\nCooking\nHow to pack n organize things",
          "score": 3
        },
        {
          "text": "Well, we all have to start somewhere. Some of the stuff you are talking about are quite advanced. Like math and science, there can be multiple levels to it but the basics are still necessary in my books. And ironically, the richer the kid's family, the more they need financial education.",
          "score": 2
        },
        {
          "text": "YES PLEASE",
          "score": 1
        },
        {
          "text": "True. I credit the luck I have in not turning out to be yet another \"pressed into a cube\" Sinkie by the fact that I was all but expelled out from the local schooling system after 16.",
          "score": 1
        },
        {
          "text": "Maybe get the school counsellor to conduct classes lol.. teach classes about bullying and the psychological and emotional reasons behind bullying then school bullies will be shocked pikachu face",
          "score": 1
        },
        {
          "text": "Mental health professional here. As much as I'd love to see it, I can already see many problems with it, the main one being students/kids making fun of an \"emotional literacy\" class. They'll probably take it as seriously as moral education classes",
          "score": 1
        },
        {
          "text": "Last time I remember my sec sch has this paid session. But need money and only 1 day only, could be more yes I agree",
          "score": 1
        },
        {
          "text": "We had all of these taught in art school. Including how to present your portfolio, speak about your skills, how to draft cv and cover letters.",
          "score": 1
        },
        {
          "text": "home economics and army no?",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qr7awv",
      "subreddit": "SingaporeRaw",
      "title": "Churches can ask strangers for donations ah?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qr7awv/churches_can_ask_strangers_for_donations_ah/",
      "score": 37,
      "num_comments": 31,
      "created_at": "2026-01-30T22:42:33",
      "selftext": "",
      "comments": [
        {
          "text": "Catholic here. Looks like an envelope that is placed in the church for people to put money in. People will usually have to take the envelope themselves as it's not distributed to the congregation, much less to the wider public. Someone probably took a photo of the envelope and pasted it at your lift lobby. Frankly super weird for the person to do so. Sorry for your experience though.",
          "score": 23
        },
        {
          "text": "This is considered littering or vandalism, can just report to town council (littering) or police (vandalism). With the lifts' CCTV should be able to catch the culprit.",
          "score": 9
        },
        {
          "text": "Because it is against the law to paste brochures or adverts on HDB lift?",
          "score": 8
        },
        {
          "text": "I am a Christian myself, but this kind of attitude (if it is legit from the Church) is indeed annoying, please feel free to ignore them and throw it away.",
          "score": 7
        },
        {
          "text": "I have gotten letters from temple and church asking for donation before. So not that uncommon but it is their charitable arm and not for their religious arm.",
          "score": 5
        },
        {
          "text": "First time? If not how to fund Chinawine song for our homegrown singer?",
          "score": 5
        },
        {
          "text": "Yeah, it's considered a nuisance and littering/vandalism. If you have a CCTV to capture the act and you can make a police report or report to the town council if the litter falls onto the common areas like the corridor.",
          "score": 5
        },
        {
          "text": "Yeah looks like it’s a kaypoh or over-enthusiastic/insensitive member who might have done it. \nDon’t think the church management would have sanctioned it… like OP said, who would expect non-member to give? \nIt would be different if they were fund-raising for a social service arm or similar project. (Eg. Like temples may fundraise for their free medical clinic programmes)",
          "score": 4
        },
        {
          "text": "Christian here. Okay I have a couple thoughts on this. Firstly, there has to be better ways to ask for donations, not through possibly breaking the law, albeit a minor one. Flag day, asking within your congregation etc. On the other hand, this is where we would need some discernment. My first thought was could it be a form of scam? Religion if used as a tool, is quite easy to scam people of money.",
          "score": 4
        },
        {
          "text": "I only seen brochures or sale pamphlets pasted on HDB lifts when I first moved into my BTOs. Those were promoting renovation, kitchen fixtures and what not. But they were all disallowed once the wooden planks were removed from the new lifts. Brochures soliciting for donations by churches on HDB lifts is illegal!!",
          "score": 4
        },
        {
          "text": "Because it is against the law to paste brochures or adverts on HDB lift? Then is it against the law to receive pamplets placed on your front gates?",
          "score": 4
        },
        {
          "text": "There’s no evidence that the Church did that, been in multiple Churches for decades and none of the Church I attended will do this kind of thing. \nWe even never ask any offerings/donations from other Churches let alone from other people outside the Church.\nAnd when the Church is asking for donations (internally within its congregation), it is not compulsory to give, the congregation can choose to give or completely ignore it. So yeah, I never encountered such pamphlets or brochures before, but doesn’t mean others not too. Feel free to highlight it to Town Council so that they can examine the CCTV to identify who did it, and if the Church did it then tell them not to do it again.\nI believe the Church is wise enough and will stop doing it.",
          "score": 3
        },
        {
          "text": "Looks dodgy. Never came across any church that does this. This church is a Catholic church and frankly, they don't do this kind of thing.",
          "score": 3
        },
        {
          "text": "That is for mass offering and it's supposed to be an envelope not an A4 size paper. Mass offering is a monetary gift given to a Catholic priest to pray for a specific intention, such as for a deceased loved one, a person who is ill, or in thanksgiving. It is not a \"fee\" for a sacrament, but a voluntary donation that supports the priest's livelihood, rooted in the early Church tradition of offering fruits of labor. Purpose: The intention is for a particular person or cause, bringing spiritual, propitiatory (forgiveness of sins), and satisfactory (remission of punishment) benefits to that intention. Common Intentions: Frequently offered for the deceased, on anniversaries, birthdays, weddings, or for healing. Symbolism: It represents a, \"offering of ourselves,\" connecting the donor to the sacrifice of the Mass.\nStipend Structure: While donations are voluntary, dioceses usually suggest a nominal amount $10. Priest's Support: Historically, this was the primary income for clergy; today, in many places, these offerings are sent to missionaries or priests in poorer countries.  Priests don't get salary. In the event you wish to offer mass without donating the $10, you can ask a priest to offer for you or you attend a mass and offer it up yourself.",
          "score": 3
        },
        {
          "text": "<image>",
          "score": 3
        },
        {
          "text": "Unfortunately, such actions are considered littering or vandalism. Littering comes with a fine (under NEA, first offender of littering is $300) or jail if cannot pay fine. If it is considered as vandalism then the penalty will be more severe.",
          "score": 2
        },
        {
          "text": "If temples can ask strangers for donations, why not churches?",
          "score": 2
        },
        {
          "text": "Street is public space. Your front door and house lift is infringing liao...",
          "score": 2
        },
        {
          "text": "This is an envelope for mass intentions, never to ask for public donations. You generally don’t offer up masses for non-Catholics so just putting in money and donating isn’t a thing with this envelope. Mass intentions are usually offered up for the dead and less often, special intentions and thanksgiving. And you can offer up masses WITHOUT a single cent. That parishioner is probably unsound or does not understand his own religion well enough. Just a thing of note, St Stephen is the poorest Catholic parish in Singapore as it’s filled with many needy migrant workers. The way they or any parish have been seeking donations are through the faithful from other parishes either through selling funfair tickets or offerings, not put up photocopies of envelopes to beg for money at some random lift. And saying no other religion does this is disingenuous because I see crescent moon and temple stuff from time to time seeking donations inappropriately.",
          "score": 2
        },
        {
          "text": "This guy is clueless. This is obviously not put up the church. I am 100% certain. It could be another clueless guy anyhow put it in. Either misguided or pranking.",
          "score": 1
        },
        {
          "text": "Please log a case with our wonderful LIFESG app. And if you have the SGSECURED app, please do it too.",
          "score": 1
        },
        {
          "text": "Got temple go to our block ask for donation mei?",
          "score": 1
        },
        {
          "text": "Got temple go to our block ask for donation mei? You never encounter monks on the streets asking for donations?",
          "score": 1
        },
        {
          "text": " https://youtu.be/QZ8hefESt7c",
          "score": 0
        },
        {
          "text": "Because God needs MONEY!!! 💵💰🫰🤑",
          "score": -1
        }
      ]
    },
    {
      "id": "t3_1qr08jd",
      "subreddit": "SingaporeRaw",
      "title": "Public can use ez-link card to get 10-cent refund when recycling drink bottles, cans from April",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qr08jd/public_can_use_ezlink_card_to_get_10cent_refund/",
      "score": 30,
      "num_comments": 27,
      "created_at": "2026-01-30T16:51:00",
      "selftext": "",
      "comments": [
        {
          "text": "I swear this is thestupidestimplementation of recycling deposits/refunds in the world: The scheme caused a stir over the past weeks when smaller producers were reported to be struggling with the costs and logistics involved in complying with the scheme. Compliance costs include a one-time registration fee of $500 and a 10-cent deposit for each drink container put on the market. Importers also need to pay for deposit marks and barcode stickers that are manually pasted on imported drinks. Some smaller producers said the additional costs and work might force them to push up their drink prices by 25 cents to 70 cents. In other European countries, if a drink can't be recycled, the machine automatically rejects it (and it just goes into the usual metal/plastic recycling bin). I don't think there are regulations elsewhere in the world requiring importers tomanuallypaste a barcode sticker. The PAP has a knack for introducing complexity and causing inflation and the cost of living to skyrocket, just like when Lawrence Wong increased the GST in two steps. Talk aboutincompetence. 65% voted for this stupidity.",
          "score": 79
        },
        {
          "text": "The PAP has a knack for introducing complexity and causing inflation and the cost of living to skyrocket, Agreed. The root cause for such anal ideas is because their main motivation is to: 1) Make more money and collect more revenue. 2) Ensure everything implemented is to their convenience without any additional costs to the government. 3) Boost to the rest of the world what an innovative and state-of-the-art project implemented nowhere else but in SG. As you can see from the above, the welfare of the people is nowhere in their calculations.",
          "score": 19
        },
        {
          "text": "Charge you at least 60 cents increment to get 10cent refund. Win-win for all",
          "score": 12
        },
        {
          "text": "This is just green washing.",
          "score": 10
        },
        {
          "text": "Like someone else said, it's just gonna increase production costs for the barcode, which will then be passed down to consumers. No-one even asked for this nonsense, when the majority of recyclable waste comes from takeaways and hawker food anyway 🤦",
          "score": 8
        },
        {
          "text": "Don't forget giving their cronies contracts. Hence why the system is so brain dead, it has to be wasteful to maximize the no. of contracts. Taxpayers foot the bill every time.",
          "score": 7
        },
        {
          "text": "Incorrect this is funnelling taxpayer monies into the pockets of their cronies.",
          "score": 5
        },
        {
          "text": "How many bottles need to be recycled to break even the production and logistics cost of the machines? Heck, compressing the can properly produce more carbon in power consumption than burning the bottle.",
          "score": 5
        },
        {
          "text": "Oh yeah, good catch!",
          "score": 4
        },
        {
          "text": "It's because they don't want people to cheat the system. Which might involve buying (or collecting) cans and bottles from Malaysia and recycling them in Singapore. 4 bottles and you get ~1RM. Who wouldn't do this. Of course the whole forcing the burden onto Singaporeans using their taxpayer monies is also insane but otherwise GovTech will have nothing to do to justify their existence. Edit: I am referring to the part where they are forcing companies to add additional marks onto their products and charging money for it too. It is to prevent cheating by importing empty bottles and cans from overseas (most likely Malaysia).",
          "score": 4
        },
        {
          "text": "The cost of QR and associated technology behind probably goes above the 10cent monetary amount.",
          "score": 4
        },
        {
          "text": "Bo bian leh, it's all about KPIs. if not what do you expect amy khor to write in her mid-year appraisal and how to pay her bonuses???",
          "score": 3
        },
        {
          "text": "It's because they don't want people to cheat the system. Which might involve buying cans and bottles from Malaysia and recycling them in Singapore. That's what the barcode is for. But they don't need to force manufacturers and distributors tomanuallypaste barcode stickers. Of course the whole forcing the burden onto Singaporeans using their taxpayer monies is also insane but otherwise GovTech will have nothing to do to justify their existence. Ironically, this will likey have nothing to do with GovTech. The article has mentioned that they're going to use off-the-shelf solutions from TOMRA and others.",
          "score": 2
        },
        {
          "text": "From the article: Importers also need to pay fordeposit marks and barcode stickersthat are manually pasted on imported drinks. Some smaller producers said the additional costs and work might force them to push up their drink prices by 25 cents to 70 cents.",
          "score": 2
        },
        {
          "text": "Please do not bring facts and logic to this money-wastingscamscheme. 65% voted for this. Mandate given, enjoy your more expensive beverages (I'm just going to buy them in Malaysia now).",
          "score": 2
        },
        {
          "text": "It will be funny if it cause Singapore to lose more jobs in beverages industries.",
          "score": 2
        },
        {
          "text": "If you mean product barcode. That is for inventory purposes. A product made in Malaysia can have a Malaysian product barcode and still be sold in Singapore.",
          "score": 1
        },
        {
          "text": "Yes, that is an additional mark. It is not related to the original product barcode. It is the government's barcode mandated onto producers which is where the extra costs come from... I literally wrote this to comment on that fact. > It's because they don't want people to cheat the system Those labels are so you can't just bring empty cans and bottles from Malaysia and recycle them in Singapore. Which obviously people will do, but the problem is not the people. It's the government coming up with stupid policies. Edit: Also \"use off-the-shelf solutions from TOMRA and others\" Like I'm going to believe them.",
          "score": 1
        },
        {
          "text": "Yes, that is an additional mark. It is not related to the original product barcode. I didn't mention anything about the original product barcode? Those labels are so you can't just bring empty cans and bottles from Malaysia and recycle them in Singapore. Which obviously people will do, but the problem is not the people. It's the government coming up with stupid policies. The government definitely has looked at solutions in Europe.All the cans in Germany have a barcode on the labelas well. If people buy cans and bottles from Malaysia (or old cans), the machine would just reject those.",
          "score": 1
        },
        {
          "text": "> I didn't mention anything about the original product barcode? > That's what the barcode is for. You said \"the barcode.\" Which implies the original product barcode. You should have said \"policy's barcode\" to specify that you are taking about an additional mark. Like seriously. >have a barcode on the label Dude, read your own citations. They are additional marks not related to the product barcode. Why is that? Because companies can also export their products to other countries and barcodes follow an existing standardised format. > the machine would just reject those. Literally what I implied in my original reply. What are you arguing about?",
          "score": 1
        },
        {
          "text": "You said \"the barcode.\" Which implies the original product barcode. You should have said \"policy's barcode\" to specify that you are taking about an additional mark. I don't know, I'm just using the term as mentioned in the article: \"deposit marks and barcode stickers\". Literally what I implied in my original reply. What are you arguing about? You said \"those labels are so you can't just bring empty cans and bottles from Malaysia and recycle them in Singapore.\".",
          "score": 1
        },
        {
          "text": "Yes the labels that they will forcing manufacturers / sellers to add onto their packaging. Since the deposit is \"per product.\" This will likely force manufacturers to create a segregated production line to create a \"Singapore specific\" product with the additional marks. Because if they simply slapped those additional marks onto a product and then sold them everywhere the same problem would occur anyway. E.g., Yeos makes all their drinks in Malaysia and the bottles sold in Msia / SG are identical. If they simply slap the additional marks onto their products and sold them in both countries, you just buy in Msia and bring it into SG. Honestly I wouldn't be surprised if companies just started selling their drinks in paper cartons or plastic bags (Like milk in Canada) to avoid this bullshit. They are going to start getting very creative and guess who will suffer.",
          "score": 1
        },
        {
          "text": "agree. stupid af. if you dont see other countries coming up with this kind of idea, you should go one corner and reflect why you even think of it",
          "score": 1
        },
        {
          "text": "When prices go up, their salaries must be adjusted to go up as well!",
          "score": 1
        },
        {
          "text": "CCC Chair? PBM awardees?",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qqvjw0",
      "subreddit": "SingaporeRaw",
      "title": "What does it mean for s'poreans and M'sians if no longer SGD1:MYR3?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qqvjw0/what_does_it_mean_for_sporeans_and_msians_if_no/",
      "score": 32,
      "num_comments": 52,
      "created_at": "2026-01-30T12:29:54",
      "selftext": "the business in JB will suffer since it's no longer cost effective for S'poreans to shop there over the weekend?\n\nWe going to see more M'sians heading home to seek employment?",
      "comments": [
        {
          "text": "It’s not singaporean responsibility to keep malaysian businesses alive It’s not malaysia’s responsibility to provide cheap goods/service for singaporeans",
          "score": 209
        },
        {
          "text": "Ppl has been going since 2.5 la. No matter wat still cheaper than SG. At most just spent lesser abit.",
          "score": 50
        },
        {
          "text": "Singaporean will still flock to JB to shop\nMalaysians will still come to sg to work Nothing will change until something more drastic happens",
          "score": 40
        },
        {
          "text": "Malaysian here. As long as it remains above (SGD1 - RM2.5 and above), things will be fine. You still get a good bang for buck with the SGD coming over to Malaysia for holidays / food / shopping. As for employment, i also doubt it. For example, if a M'sian makes SGD 1800 as a security guard, they are still taking back (RM 5500+) much more than the average office worker salary in Malaysia. Heck that is earning more than some junior medical graduates in Malaysia. Lastly, this bull run will not continue indefinitely, we have elections coming up soon and nobody knows if Anwar will be a 2 term PM. Any changes will likely mean someone from UMNO or worse Perikatan Nasional running the country and all the positive changes made goes away. If those things happen, i expect the governance of this country to go back to the usual rampant corruption and lack of performance. Our currency will weaken when it happens.",
          "score": 25
        },
        {
          "text": "Yeap. People forget 3:1 is relatively recent. Singaporeans have been flocking to Malaysia since 2.5 like you mentioned",
          "score": 17
        },
        {
          "text": "It means different things to different people. To me as a Singaporean, I am not interested in the JB outings that some are doing - waste of time, and energy in my opinion for cheap(er) food / thrills. For those that are interested, we would need to understand their supposed cost saving threshold for them to stop heading to JB totally. Now, people heading there think they are getting a 50% or more cost savings - if they are only getting 15% cost savings, will they still visit JB? On the inverse, I think M'sians is unlikely to head home to seek employment as the job market in SG is generally better. They would also now have to find a local company that is willing to pay them their previous SGD salaries (else they need to think of a pay cut). Some have already rooted here for some time (family, friends, housing, children), so there are those opportunity costs too.",
          "score": 13
        },
        {
          "text": "JB has affordable retirement/vacation homes for Singaporeans. Couple that with the ability to buy cars, explore nature, lower population density (outside of malls and on non holiday periods). The generally more laid back, not so kanchiong spider vibe is what makes Malaysia attractive for me. Singapore is just too densely populated, too many building everywhere. Nice to work but not nice to relax. Cheaper electricity, water. If you steer away from the typical cafe hopping and touristy areas, life is chill and more affordable…",
          "score": 13
        },
        {
          "text": "The currency is expected to strengthen given the amount of jobs being offshored to Malaysia. If these jobs not offshored to Malaysia, Singapore cannot move up the value chain and pump the HDB even more.",
          "score": 6
        },
        {
          "text": "from what i see\nif that really happens for e.g if SGD1:MYR1? no malaysians will be flocking nor will they come to singapore for work, most likely majority of malaysians will go back to their own country for work but the disadvantage is the economy in malaysia will start to become much more expensive progressively\nmalaysian companies will decrease existing salaries to match alot of other foreigners will start to flock to malaysia for work as a second alternative to singapore.. alot of businesses will shut as things starts to get even more expensive to maintain lesser singaporeans will travel to malaysia for shopping and will most likely go to indonesia or thailand instead for shopping lastly more singaporeans will travel to malaysia for work as another alternative\nsingapore housing will become slightly cheaper? as most will migrate over to malaysia singapore population decrease while malaysia population increases.",
          "score": 5
        },
        {
          "text": "Malaysian ringgit strengthened when US interest rates were low, which is what is happening right now. One thing corrupt people love is money, so they're not going to tank the economy and make themselves poor. Most likely if PN takes power, they'll just do nothing substantial, so existing policies will remain in place.",
          "score": 4
        },
        {
          "text": "If that happens, the cost of living in Singapore could rise significantly. A large portion of our raw produce is imported from Malaysia, so any price shifts there will directly affect prices here. Over time, goods may start to be priced in Singapore dollars at levels similar to their Malaysian ringgit prices. For example, a drink that costs RM4.90 in Malaysia could end up selling for S$4.90 in Singapore — otherwise, sellers would be operating at a loss.",
          "score": 4
        },
        {
          "text": "I don't disagree. There are many acquaintances of mine whom I've heard want to settle down in Malaysia or already had plans to buy property there - JB, Penang, you name it. Same can be said the same for people who are earning SGD and can buy multiple condos in Thailand / Vietnam etc. That is assuming the constant does not change: the constant here refers to the longevity of earning a SGD salary and spending it in a lower-cost market.",
          "score": 3
        },
        {
          "text": "Just dont go JB lor, so simple",
          "score": 3
        },
        {
          "text": "it means i need a new retirement plan",
          "score": 2
        },
        {
          "text": "Rts ridership at risk",
          "score": 2
        },
        {
          "text": "nah. it won't make much of a difference. Singaporeans will still spend because it is still cheap, Malaysians who work here is still get paid well even if it is 2.5 to 1.",
          "score": 2
        },
        {
          "text": "The lower the rate, the lesser some groups of people will go, prices will drop and those whom did not go due to the rate will be happier. For MY working in SG, it is not just about the rates, it's also about the good jobs and availability.",
          "score": 2
        },
        {
          "text": "Got one MP in Malaysia saying he looks forward to the day Singaporeans head over to Malaysia to work.",
          "score": 2
        },
        {
          "text": "He can continue to look forward. It’s free and don’t cost money to dream",
          "score": 2
        },
        {
          "text": "People's memory very short leh. MYR used to be 2.5++ and Singaporeans were still flocking to JB.",
          "score": 2
        },
        {
          "text": "For those who think when it was 2.5, sinkies still flock to JB. HELLO HIGH INFLATION SINCE THEN!! Think before commenting.",
          "score": 2
        },
        {
          "text": "Yes definitely. Business in JB already affected since MYR strengthened in the last quarter.",
          "score": 2
        },
        {
          "text": "No worries, still got Bintan, Batam and Tanjung Balai Karimun to spend money",
          "score": 2
        },
        {
          "text": "The political risk is very much understated.",
          "score": 1
        },
        {
          "text": "actually true, i do agree singapore resources will be much expensive as well, i remember during the covid times chicken and pork directly from malaysia was increased in price due to the lesser supply.. but i also feel it would impact malaysia as well because businesses would move due to expensive prices, both import and export, i feel the only way singapore can mitigate against it is if Indonesia increase their import supply to singapore, therefore Indonesia produces would be in high demand.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qrp9qx",
      "subreddit": "SingaporeRaw",
      "title": "Anyone disappointed with Task Force Man?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qrp9qx/anyone_disappointed_with_task_force_man/",
      "score": 27,
      "num_comments": 23,
      "created_at": "2026-01-31T09:59:21",
      "selftext": "During the GE, the media hyped him as the “task force man”, the steady hand Singapore supposedly needed to navigate an uncertain world, without whom the country would collapse. One year on, it has amounted to little more than a flashy press conference and “seven strategies” that read like motherhood statements an AI could generate in seconds.\n\nWhat annoyed me the most is one of the minister frantically scrolling through his ipad during the press conference. If you're good and know your stuff, you don't need that ipad by your side.",
      "comments": [
        {
          "text": "Someone bought it right?",
          "score": 21
        },
        {
          "text": "In all honesty, which minister really is doing their job in a way that deserves recognition? Starting from our PM playing guitar, our other ministers being more concerned about the WP …",
          "score": 14
        },
        {
          "text": "lol. During GE, they can say whatever they want, just to impress the voters or rather “convince”. Now that we have placed the votes. They are secured for the next 5 years. Do you think they really care about what they have said during GE? Maybe yes, maybe no? But what can you do about it, now that they have secured their seats for the next 5 years. Nothing, only can Kpkb in online platforms",
          "score": 13
        },
        {
          "text": "1st time? Lol 65.57% loves drinking the Kool-Aid",
          "score": 7
        },
        {
          "text": "Very true. If the most significant thing is being concerned about bringing down someone from a rival party, it really reminds me of the political environment in our dear neighbouring country",
          "score": 5
        },
        {
          "text": "Wasn't expecting anything from him anyway. It's just a typical feel good statement from LW (which primarily defines his PM career so far)",
          "score": 5
        },
        {
          "text": "Not disappointed because i knew it was a show they put up for GE. Honestly never personally believed that a man born in 1959 is up to the task of negotiating with the nation with the largest nuclear arsenal, which has elected an actual paedophile and convicted criminal, who has had no qualms about kidnapping a sitting president, and has been spewing senseless rhetoric and openly supporting far right movements. All this against a backdrop of an easy money policy (the printer is turned on for every little thing now), the threat of AI (what does a 66-year-old man know about context window or RAG or embedding?), and a increasingly divided geopolitical landscape. I don't think he's getting by through shrewd business acumen, but simply because he has access to more info than other people. Basically, you could install a young and successful business leader, give him the same level of info, and he'd probably perform as well as Mr Task Force Man. He really gives off the kindly grandpa vibes though, and unlike his other colleagues hasn't been politicising everything, so I guess there's that.",
          "score": 5
        },
        {
          "text": "Anyonesurprised? If yes...what rock have you been under?",
          "score": 4
        },
        {
          "text": "At least 55% of Punggolians should be surprised.",
          "score": 4
        },
        {
          "text": "It is clear - they will put on the record that due to citizens not giving birth, they will bring in foreigners. Citizens, who do not like foreigners, will be blamed for the influx of foreigners. But I do hope that they will open up the civil service to WP, S pass and EP holders too.",
          "score": 4
        },
        {
          "text": "He was never the main man during LHL's  era. He is just getting all the lime light because LW feel most comfortable with him. LW probably feels insecure also relative to OYK and CCS.",
          "score": 3
        },
        {
          "text": "Already gave green light for these 5years, they can do whateva the fk they want.",
          "score": 3
        },
        {
          "text": "A little bit, maybe... But he's also the DPM, not the PM. The grand ideas are supposed to come from LW, not him.",
          "score": 2
        },
        {
          "text": "The public bought the narrative. He got his retirement.",
          "score": 2
        },
        {
          "text": "lol you all taking the superman meme too literally right? With how chaotic every country is, getting a button done is going to be a lot harder than in the past.",
          "score": 2
        },
        {
          "text": "Everyone knew it was forced. But looking at the results, they almost lost that GRC even with the supposed popular SXL.",
          "score": 2
        },
        {
          "text": "Only kumgong sinkies bought into that shit.",
          "score": 2
        },
        {
          "text": "Am okay. He's doing a lot for his ward though - lots of friends living at Punggol saying there's high visibility of him being around. Also, if you know friends who work in the ministry, minister's scripts are often written by sormone else =). Nth wrong for him to scroll the iPad lol.",
          "score": 2
        },
        {
          "text": "<image>",
          "score": 1
        },
        {
          "text": "Why is this picture so fucking funny lol",
          "score": 1
        },
        {
          "text": "Remind me please who is task force man?",
          "score": 1
        },
        {
          "text": "We should get Reddit live with the ministers. All questions unscreened, have the ministers answer the questions live. Honestly speaking, some of the people in Reddit ask questions are seriously way deeper thinking that those questions asked to the ministers.",
          "score": 1
        },
        {
          "text": "More than half of Punggol GRC bought it... Even against the chiobu Alexis Dang (stop simping or Hapoon Singh will Harpoon you deep deep). So why are you disappointed? 😂",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qr1y4m",
      "subreddit": "SingaporeRaw",
      "title": "[SERIOUS] How can I learn to become a Taoist priest?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qr1y4m/serious_how_can_i_learn_to_become_a_taoist_priest/",
      "score": 20,
      "num_comments": 35,
      "created_at": "2026-01-30T18:33:39",
      "selftext": "Like those that can really do spells.\n\nNon-believers...sorry for this topic.",
      "comments": [
        {
          "text": "Can ask QZ Taoism on TikTok. He's a young man that has become a Taoist priest. Recently been on a number of interviews.",
          "score": 43
        },
        {
          "text": "Usually is father pass to sons, without family background abit hard lol",
          "score": 29
        },
        {
          "text": "Even Taoist priesthood practice nepotism.",
          "score": 27
        },
        {
          "text": "You'll need to learn from a master and after sufficient training he will introduce the spirits to you when he deems that you are able to handle it. Different Taoist / spiritualists deal have different methods and spirits / entities. It would not be wise to venture into this without proper guidance.",
          "score": 25
        },
        {
          "text": "Mind if u share his story iydm? That sounds really interesting",
          "score": 21
        },
        {
          "text": "Taoist or Maoshan ?? My grandpa was one (Maoshan)..... I'm still suffering from the bad karma he accumulated...... 😭",
          "score": 20
        },
        {
          "text": "Thanks to absurd tyranny we migrated en mass",
          "score": 15
        },
        {
          "text": "Have you tried looking at the Skillsfuture Jobseeker support scheme?",
          "score": 11
        },
        {
          "text": "No idea, my grasps of the Chinese language and material sources currently is insufficient to delve into this topic. I do specialize in demonology and angel summoning through Greater and Lesser Solomonic magic, as well as shamanic knowledge from the Yaqui way of living described by Carlos Castaneda and works of George Gurdjieff from the 4th way. There are elaborate purification and protection rituals described within Solomonic magic if one does decide to carry out a summoning. Some lasting months consisting of dietary practices, bathing at particular intervals while reciting specific verses. I believe Taoist masters have similar methods of purification and protection rituals against the spirits. Shamans have a way of inducing the spirita via external stimulus like psilocybin and mescaline (mescalito) for divination purposes. Both of which are controlled in Singapore. The 4th way is slightly more abstract and talks about adopting a correct mental state to do 'work' that is able to elevate one to a higher consciousness, not unlike Tibetan meditation but focusing your attention in a day to day basis. Surprisingly all 3 above share a common denominator of maintaining consistent focus and attention through various means (i.e. meditation, substances, rituals etc), in order to attain an elevated consciousness that may be able to communicate with non-human entities on a possibly higher plane of existence. My interest is purely academic of course.",
          "score": 7
        },
        {
          "text": "+1 to this.",
          "score": 3
        },
        {
          "text": "He died before I was born...... But supposedly he used his skills not in good ways...... And I have been having bad luck for decades",
          "score": 3
        },
        {
          "text": "More and more arcane. More and more power, more and more mystic. In the end still harassed and slapped around by demons, because they will have their legal pound of flesh from you in the end until you cry out for help to the One whom demons flee from.",
          "score": 3
        },
        {
          "text": "That would be a sorcerer. Taoist occult is not like orthodox Taoism even though Taoist priests also learn talismans and incantations. There are several Taoist Magick lineages but you won't be able to find much here in Singapore. Taiwan is a better place. Also if your intent is not right, you might not even get to join in their particular lineages as well. When you enter a lineage you are made to swear and there are consequences. Maybe you should think about it properly. If you do wanna properly learn Taoism, the orthodox way, you should look at QZ Taoism's videos on tiktok.",
          "score": 3
        },
        {
          "text": "Need to ask nacht Spyder the legend",
          "score": 3
        },
        {
          "text": "Do your own research. This is the era of the new renaissance. You can learn whatever you want, every bit of information is out there easily accessible. All you have to do is go look for it. Infinity is staring at you in the face. Do you have the resolve to stare back at it? 🤔",
          "score": 2
        },
        {
          "text": "Best answer",
          "score": 2
        },
        {
          "text": "Why does this feel like an edmw thread",
          "score": 2
        },
        {
          "text": "+2!",
          "score": 1
        },
        {
          "text": "+3 to this!!",
          "score": 1
        },
        {
          "text": "Interesting. So what kind of spells can these Taoist masters do? What kind of spirits they use?",
          "score": 1
        },
        {
          "text": "Do you provide cursing services? Lol Recently saw a video got one ah ma help to 大小人",
          "score": 1
        },
        {
          "text": "No. My interests are purely academic in the search of a higher consciousness.",
          "score": 1
        },
        {
          "text": "Need to enroll in Tao Nan school",
          "score": 1
        },
        {
          "text": "So cheam 😂\nBut thank you for the detailed write up. Appreciate it. Just that I dont understand. Is there a simpler/ layman ans to my qn though? Hehe",
          "score": 0
        },
        {
          "text": "Lol",
          "score": -4
        }
      ]
    },
    {
      "id": "t3_1qr94jd",
      "subreddit": "SingaporeRaw",
      "title": "Is it wrong to stay at my mum’s place when my husband travels overseas, instead of staying alone with my in-laws?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qr94jd/is_it_wrong_to_stay_at_my_mums_place_when_my/",
      "score": 16,
      "num_comments": 50,
      "created_at": "2026-01-30T23:50:05",
      "selftext": "Hi all, hoping to get some perspectives here — especially from daughter-in-laws or even MILs.\n\nFor context, I’m getting married soon and am currently staying with my future in-laws. When my fiancé is around, things are generally fine. But when he travels overseas for work, I honestly don’t feel comfortable staying alone with them.\n\nOne incident that really stuck with me: there was once I went out for dinner and came home late, and his mum 打小報告 (aka told on me / tattled) to my fiancé that I came home late — even though he already knew where I was and what time I’d be back. It may seem small or unintentional, but I took it to heart (yes, maybe a bit petty, I admit).\n\nSince then, I’ve felt a bit “watched” and uneasy being alone there without my fiancé as a buffer. So when he’s overseas, I’d much rather go back and stay with my mum for peace of mind.\n\nI mentioned this to a guy friend, and he said that in the future if I’m already married, that house is technically my place of residence, and it “shouldn’t be like this” anymore.\n\nSo… am I being unreasonable? Is it wrong to want to stay with my own mum when my (future) husband isn’t around, even though I’m married? Would love to hear honest opinions — especially from people who’ve been in similar situations.\n\nTL;DR: Getting married soon and staying with future in-laws. When fiancé travels overseas, I don’t feel comfortable staying alone with them due to past “tattling” incident by his mum. I prefer staying with my mum for peace of mind. Friend says I shouldn’t after I’m married. Why not? Is it wrong if I continue doing this after marriage?\n\nP.S. do not give suggestions like \"you guys should shift out and not stay with them\" because we're waiting on our BTO.",
      "comments": [
        {
          "text": "Nothing wrong. Just tell them you wanna spend more time with your own fam before u get married",
          "score": 65
        },
        {
          "text": "Nah, your mum's place is still your place. It was your house before you moved into your new home. Of course , your in laws might mind a bit, but end of day, your own parents gonna understand you rather you feeling watched and all. End of day, it's how you tell your husband, and that you're more comfortable at your own home when he's overseas. But you're not wrong to stay at mums place. Be safe :)",
          "score": 40
        },
        {
          "text": "Your husband needs to play the part So do tell him that he need to squash this \"make small report\" behaviour with his mum next time she brings up to him again. It is important to sort this out before it gets distrust and stir shit.",
          "score": 31
        },
        {
          "text": "Fk em ppl that tells you it's wrong.",
          "score": 15
        },
        {
          "text": "My mil questioned my husband y am I still gng to my parents' place/visit my mum once every week, specifically bc my mum has declining dementia...like hello, not like my mil hadn't seen her in a wheelchair condition when my mum came to visit me back then. And my mil is staying in my place, I am e owner of my own house, she is e occupant. I dislike anyone minding my biz wher and how I live my life. Back to yr qns, definitely yes, I will choose to go bk as and when I like or stay over if fiance/husband is station overseas, its your life, your call y care how other ppl think.",
          "score": 13
        },
        {
          "text": "Stay with your mum. Thats better.",
          "score": 12
        },
        {
          "text": "No such thing. You are an adult and you can do whatever you like. If you want to sleep in void deck they also can’t do shit (please don’t)",
          "score": 11
        },
        {
          "text": "Bro just do what makes you happy. We are not tied to the previous generation's expectations.",
          "score": 8
        },
        {
          "text": "Better set the record straight before marrying. If not once you practice something, might set the precedent. Nothing wrong at all going to parents' house. Infact my husb and I moved out to our own place and we visit my side of family more. See which side less toxic. My husb acknowledges the fact tht his mom can be hard to bear at times, so most importantly is husband's support.",
          "score": 7
        },
        {
          "text": "Small report is one thing But if they start spinning bullshit or want their gossips to be gospel , you must bite back~",
          "score": 7
        },
        {
          "text": "in this situation, does your husband stand up for you or take your side when your mil raised that question? 🥺",
          "score": 6
        },
        {
          "text": "Stay with your mother. Your in laws seemed toxic. What are they expecting? To have you as an extra to help in their household? Your husband should also warned his parents not to kacau your affairs.",
          "score": 6
        },
        {
          "text": "From a practical point of view, it may not be wise to stay with him and his family before marriage. This is not about moral standards, but about protecting your own dignity and boundaries. Their behaviour may reflect a lack of respect, possibly because living together before marriage can lead them to take you for granted. This has little to do with love, and more to do with how boundaries are perceived. It may be healthier to move back to your parents’ home before marriage, so you can establish clearer boundaries and be treated with the respect you deserve.",
          "score": 6
        },
        {
          "text": "Agree with that. So long as ur husband is aligned with you, you do you.",
          "score": 6
        },
        {
          "text": "For your peace of mind and peace of everyone just stay with your mum. You can have a good time and not think of being watched",
          "score": 5
        },
        {
          "text": "U’re already very accommodating to even consider staying with ur ILs. Personally, I’d rather have my own place, even if renting, to avoid the ‘future’ tension. When ur hub isn’t around, small things can easily get misunderstood or reported in the wrong way. Better to stay where u feel comfortable. U are her DIL, but u are also ur mother’s daughter, why can’t stay with ur mom? No matter how much u accommodate, MIL will still complain. So just do what feels right for u. It’s not ur job to please everyone.",
          "score": 4
        },
        {
          "text": "Nothings wrong. Even if you are married, you dont have to stay with your in laws. A cordial relationahip doesnt mean have to stay in",
          "score": 4
        },
        {
          "text": "Don't feel bad for staying with your mom, we get less and less opportunities to do so, or even spend quality time with our own parents, as we get older and have more responsibilities 🥲",
          "score": 4
        },
        {
          "text": "What about your husband?",
          "score": 3
        },
        {
          "text": "Getting married doesn't mean you have to move in together immediately. You can both stay at your own parents' place until you get your BTO, especially if chances of conflict with parent-in-laws are high. Just to give you another option.",
          "score": 3
        },
        {
          "text": "It's normal to me. My (female) friends in the same situation do it all the time. You're just spending time with your family. Even when they're staying with the fiancé'/husband's family while waiting for their bto, some of them go back to their parents' place for the weekend. Even after you guys move out, it's perfectly fine to stay with your parents while your husband is overseas for work. Your fiance should be the one dealing with his mum. He shd tell her that he knows, he's fine with it and stop tattling cos you're both adults.",
          "score": 3
        },
        {
          "text": "Don't see any wrong. Besides it's a good opportunity to spend time with your own parents as well if they don't mind. Having said that put yourself in your MIL shoes when she rattled that small details to your fiance. It could be genuinely out of concern and looking out as assuring your fiance that you are back home and safe. Of course if there are other details mentioned like \"she shouldnt come back so late etc\" then I think it warrants you to have a conversation with your fiance to let him manage his parents cuz you are an adult, have your own life and can make your own decision as well.",
          "score": 3
        },
        {
          "text": "Nothing wrong with spending more time with your own family.",
          "score": 3
        },
        {
          "text": "Short and only answer: no. You are still your mum's 宝贝女儿",
          "score": 3
        },
        {
          "text": "<image>",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qr1fvn",
      "subreddit": "singaporefi",
      "title": "Diversifying into gold",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qr1fvn/diversifying_into_gold/",
      "score": 19,
      "num_comments": 37,
      "created_at": "2026-01-30T18:04:05",
      "selftext": "My mum(59) and I(32)had just received our 1 year Jan t-bill payout last week and the sum have been sitting in the bank for now, roughly around 21k for myself. I don't restrict how much she wants to put in for t-bill but at her comfortable level, but will help her to buy t-bills so that her money doesn't left stagnant in the bank.\n\nWith the rates currently at all time low while gold keeps rising, what are some considerations that I should take in buying gold (bullions), or should I just stick to t-bills with that low rates?\n\nEdit: I do invest mainly CSPX, Nvidia and Amazon.",
      "comments": [
        {
          "text": "it’s time to sell boys",
          "score": 67
        },
        {
          "text": "Gold is like boomer's first taste of a meme stock",
          "score": 56
        },
        {
          "text": "Depends on your investment timeframe. Bear in mind that gold has already been on a parabolic rally, and the risks may far outweigh the reward at this point. You may refer to 2011 as an example - after hitting nearly $2,000, it then proceeded to drop 40% over the next four years. It took almost 10 years to get back to the same level, and if you factor in inflation, gold actually lost value as a hedge. Does that mean that the precious metals rally has no more room left? No, it can certainly extend. But you may be risking a small gain for a very large drop. If you’re looking at several decades, then sure, by all means, go ahead. But given your mom’s age, that may not be the most prudent way to preserve capital.",
          "score": 30
        },
        {
          "text": "Well it’s 10% cheaper than it was yesterday.",
          "score": 20
        },
        {
          "text": "Nothing wrong with gold if the plan is to hold long term. Buying gold bullion will involve fees, and selling it will also involve fees. So if these monies are required to be liquidated in the event of emergency in the short term, dont get into gold. If you look at the price today, gold has came down from the peak. So if you bought gold a few days ago, you might be asking should you sell gold today because of the drop.",
          "score": 13
        },
        {
          "text": "as a financial guru 69x time ToT, CoT, MDRT and recipient of all other prestigious awards ever known to humans, you must go ALL in on gold NOW. Gold will go to fly to the moon and beyond. Please, believe me. ALL IN.",
          "score": 9
        },
        {
          "text": "Rmb it only took 28 years for gold to recover since 1980",
          "score": 6
        },
        {
          "text": "Gold can easily reverse course now, when every auntie also want to buy. Somehow the nearly 5% drop yesterday didn't scare you off or you think it's buying the dip?",
          "score": 6
        },
        {
          "text": "As a financial adviser who market ILPs, and also just like you have achieved all industry awards, with 10x TOT, 20X COT and 69X MDRT. I can safely and surely say that gold is the way to go now. My clients who bought over 50 ILPs from me are super happy with the fund performance. And without a shadow of doubt, gold is 100% the way to to go. Having 0 complaints to FIDREC over the last 10 years experience, you can trust me. Just trust me bro.",
          "score": 5
        },
        {
          "text": "Make sense too, nobody knows what the future lies. Tendency of gaining more is lower, something to consider. Nope, I also do agree with you that the investment horizon for my mum is shorter, I would definitely not consider gold investment for her, but rather much safer ones like t-bills.",
          "score": 4
        },
        {
          "text": "Read that again. You got it the other way around.",
          "score": 4
        },
        {
          "text": "Sold and kept 15%. Could've been 20, but it's about time to get off the train. /u/Eddielogy, investing is easy. Figuring what to invest is the confusing part. May I suggest you take awhile to read up first?",
          "score": 3
        },
        {
          "text": "Hello polis.",
          "score": 3
        },
        {
          "text": "So accurate!",
          "score": 2
        },
        {
          "text": "brother i will see you at our fully sponsored trip to the Bahamas and sip on our martini as Singapore’s number 1 financial advisors",
          "score": 2
        },
        {
          "text": "It comes to mind a bit late.",
          "score": 2
        },
        {
          "text": "Buy Gold during Pullbacks.. like right now as we speak. DCA and know that you are investing in the long term. Normally metals have Looooong periods of underperformance. One could say stocks have a more sustained uptrend",
          "score": 2
        },
        {
          "text": "So did you buy gold when it dipped below 5K per troy ounce just now? You would have gained 150 USD. Just be prepared to hold for years if you want meaningful gains. I gained back 2x.",
          "score": 2
        },
        {
          "text": "Okay. Now that you see Gold drop by 10% overnight. You still want?",
          "score": 2
        },
        {
          "text": "Figuring when to sell is the holy grail",
          "score": 1
        },
        {
          "text": "The bulls would say that consolidation's done, time for liftoff. /s I think thatthis WSB commentis so true though: A major global hard asset moving like it's a pump dot fun token",
          "score": 1
        },
        {
          "text": "Is gold actually a meme stock chat?",
          "score": 1
        },
        {
          "text": "depends on whether u are in it for the short term lols or holding it for decades",
          "score": 1
        },
        {
          "text": "Trump constantly meddling FOMC's affairs and USD has been devaluing. The timing of t-bill payout coincides with recent events, hence precious metal comes into my mind.",
          "score": 1
        },
        {
          "text": "The best time to invest was yesterday. The second best time to invest is now.",
          "score": -17
        }
      ]
    },
    {
      "id": "t3_1qqwgpm",
      "subreddit": "singaporefi",
      "title": "Which joint account system do you employ?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qqwgpm/which_joint_account_system_do_you_employ/",
      "score": 8,
      "num_comments": 3,
      "created_at": "2026-01-30T13:14:57",
      "selftext": "Gotta start saving for renovation and thinking of setting up a joint savings account.\n\nIs UOB stash a good option?\n\nFor context: $1,000 combined contribution each month. Assume no salary crediting because both salaries go to individual accounts.\n\nWhat is a good practice for households?",
      "comments": [
        {
          "text": "The best system is for each to save in their own HYSA where they do their salary deposit. Or you could also both contribute to a money market fund, but it will be in one person's name. Or I suppose you can each do an MMF in your own name, but give the other person the login credentials? Not many good interest options for joint accounts, so trust between a married couple is required for the most profitable option. For a household expenses spending account, joint is ok as the balance will just be ~1 month worth of expenses.",
          "score": 9
        },
        {
          "text": "This is more of a personal question than a financial one, TBH. It depends on what's acceptable to both you and your partner. And also how you divide your bills. Decide on that first then look around for an account. Though most accounts don't yield much then you don't credit salary. That said: my wife and I contributed same amount to a joint account monthly. Then after we bought an investment property, the rental goes to the joint account and that's enough to cover most stuff.",
          "score": 3
        },
        {
          "text": "I echo other comments about personal preference. In my own experience, we just use one person's HYSA, and log the contributions and outflows in a spreadsheet. Interest is apportioned in an agar-rated manner",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qqyia5",
      "subreddit": "singaporefi",
      "title": "Hdb 2 Room Type 1 vs Type 2",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qqyia5/hdb_2_room_type_1_vs_type_2/",
      "score": 8,
      "num_comments": 27,
      "created_at": "2026-01-30T15:06:17",
      "selftext": "Hi guys!! Not sure if this is the right place to ask.\n\nI am having some problem in choosing. I was given an appointment by HDB for flat selection and currently based on my prediction, by the time it is my turn I might left with the Type 1 unit to choose. There might be a small chances that there might have Type 2 left but it will be low floor (eg: 2nd or 3rd level).\n\nWhat will you guys choose?\n\na) Go for Type 1 unit but high floor (eg: level 8 above) or\n\nb) Go for Type 2 unit but low floor ( eg: 2nd or 3rd level)\n\nAppreciate your advise! 🙏\n\nAdditional info: I’m single and have no kid and pet",
      "comments": [
        {
          "text": "Yes. Got house > no house. BTO is not easy to get at all, if you give this up it may take you many years before getting 1 agai",
          "score": 14
        },
        {
          "text": "If you know that it's likely to be your forever home, and you're unlikely to find a partner etc, I would consider type 1. Do also consider it it's big enough for your needs (might be an issue if you wanna have guests over / enough storage space for your stuff etc)",
          "score": 10
        },
        {
          "text": "Will go for type 2. It’s significantly bigger. 2 room flats rent big to begin with, that additional space is very useful",
          "score": 8
        },
        {
          "text": "As someone who lived mid-floor (6 floor) and now living on the 3rd floor, i thought the noise would initially bother me but it didn't and if ppl hanging out under the block once in a while had a loud conversation, it is not a trouble to just close your window and turn the air con on. As one reply has stated, larger floor area trumps smaller floor area and having a house trumps having no house",
          "score": 8
        },
        {
          "text": "Low floor is super noisy, you'll get to hear traffic noises as well as convos of ppl passing by the void deck or construction if they carry out any around the estate. I'd rather take a type 1 higher floor than type 2 lower floor if there's really no higher floor options left.",
          "score": 4
        },
        {
          "text": "If you pass up, you might be waiting another 2 or 3 years. Just take what is available.",
          "score": 2
        },
        {
          "text": "Thanks for sharing this with me!",
          "score": 2
        },
        {
          "text": "i was in the same situation as you. i didnt even go see how it'd look like at sales gallery (i think you should if you havent), and chose the smaller 2rm bto. im on a high floor, with nice view... but it's just too small imo, can't even place a dining table 😩 im selling it off after mop.",
          "score": 2
        },
        {
          "text": "Hopefully by then still have Type 2 for me to choose! Keeping my fingers crossed! 🤞 \nAnyway, thanks for your advise!",
          "score": 2
        },
        {
          "text": "Thanks for your advise! 🙏",
          "score": 1
        },
        {
          "text": "Thanks for your opinion! How about if it only left with Type 1. Will you go for it? :)",
          "score": 1
        },
        {
          "text": "Yea!! It is getting more challenging to secure a unit! Anyway, thanks for your advise!",
          "score": 1
        },
        {
          "text": "Yea, that’s what I thought so too! Thanks for your advise, anyway!",
          "score": 1
        },
        {
          "text": "if worse case scenario then take the small unit at the highest floor, remember, away from lift, stairs, corners w smoking space, not south facing.",
          "score": 1
        },
        {
          "text": "Thanks for your advise!",
          "score": 1
        },
        {
          "text": "Thanks for your advise!",
          "score": 1
        },
        {
          "text": "Oh dear! I’m going to go to the showroom and take a look first. Hope you find a place you like after MOP. How long more to go?",
          "score": 1
        },
        {
          "text": "Go for Type 2 if can, but I think either one is fine :) Keep your fingers crossed 🤞🏼",
          "score": 1
        },
        {
          "text": "Get as big as you can afford",
          "score": 1
        },
        {
          "text": "Thanks for your advise!",
          "score": 1
        },
        {
          "text": "always choose the bigger size one. i also wanted any floor above 10 but i was left with your same options. size matters, so i didn't get the smaller ones even if they were all > level 10.",
          "score": 1
        },
        {
          "text": "Oh then you end up giving up your chance?",
          "score": 1
        },
        {
          "text": "i took the bigger sized 47sqm on a low floor, not level 1 la.",
          "score": 1
        },
        {
          "text": "Look at the actual units first - low floor doesn't really bother me since my windows are permanently closed and I usually have music playing 24/7, but some people are very sensitive to noise and can't stand hearing passing traffic. I'd go for the larger units since I like having lots of shelf space, but if you're not the type to enjoy cooking or having guests over the smaller space might already be enough for you.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qqy8qi",
      "subreddit": "singaporefi",
      "title": "Would yall buy this plan as estate planning",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qqy8qi/would_yall_buy_this_plan_as_estate_planning/",
      "score": 8,
      "num_comments": 41,
      "created_at": "2026-01-30T14:50:50",
      "selftext": "Principal sum: 1million dollars (can be paid over 5 years)\n\nGuaranteed payout up to 100 years, each year 50,000 back.\n\nPayout only starts after 7 years\n\nEdit: the 1 million will be withdrawable anytime, the sum will not change",
      "comments": [
        {
          "text": "This is a horrible deal for you… and a great deal for whoever is offering it to you. Edit: to elaborate a bit more First, the 50K per year is only 5% of total, but pays out only after year 7. If we take the million and invest for even 5% similar returns, you get 1.4m after 7 years, do the 50k a year is only 3.5% or so. It’s worse if you can get more than 5% on your money. Second, the 50k is NOT inflation adjusted and will be worth significantly less over time. Even after 30 years, forget about after 100 years. This is why I would also want to offer this deal to you if you want to take it. The company offering this is guaranteed to make money.",
          "score": 52
        },
        {
          "text": "Ran XIRR on the numbers, if factoring 2% inflation rate, the plan needs ~36 years to break even.",
          "score": 12
        },
        {
          "text": "Lol at the tag",
          "score": 11
        },
        {
          "text": "Another way to think about this is “Would you lend $1m to someone for them to then pay back only after seven years and only at 5% of your principal each year?”",
          "score": 8
        },
        {
          "text": "is this ragebait",
          "score": 8
        },
        {
          "text": "I wouldn't buy it, but I would happily offer it to you. Would you buy it?",
          "score": 8
        },
        {
          "text": "Thanks! And this is just getting back the principle, not even factoring in the opportunity cost and lack of liquidity.",
          "score": 6
        },
        {
          "text": "Low effort way for the FA to earn commission.",
          "score": 5
        },
        {
          "text": "Yesterday toto if you won $10mil, you want it lump sum or for $1000/mth to be given to you for the rest of your life? For your case, assuming year 1 outflow of $1mil and $50k starts at year 8, breakeven point is year 27. Total IRR is 3.87%. But you lose a lot to inflation over the years.",
          "score": 5
        },
        {
          "text": "It's a great plan for your FA to retire. Not you.",
          "score": 4
        },
        {
          "text": "even the basic cpf oa can beat this plan. Rather you all in local banks and start getting 5% straight",
          "score": 4
        },
        {
          "text": "Came to this sub some more right",
          "score": 3
        },
        {
          "text": "I like this perspective. Will be adding it to my logic arsenal",
          "score": 2
        },
        {
          "text": "A little puzzling to me as there is no fees ? Free estate planning ? Or the cost is factor into the 7 years no payout period ?",
          "score": 2
        },
        {
          "text": "Possible that it’s all baked in. It’s also possible that the OP didn’t share the full information. The fact that they say that they can get $1m back at anytime sounds dubious, there’s usually lock in and some penalty for breaking the policy. Having full liquidity at any time with no penalty is actually a red flag rather than a green flag actually since no investments (unless it’s cash or cash-equivalents have that kind of liquidity with 0 penalty.)",
          "score": 2
        },
        {
          "text": "Friendly neighbourhood advisor here, I am a salaried advisor. No. The returns are horrible. And why you need to distribute this for 100 years? It’s too long a time to not be concerned with so many variables. By then, due to inflation, $50k will be worth less than $10k in today’s money. You handing over $1 mil in today’s spending power without drastically improving the spending power years later from this pile of money.",
          "score": 2
        },
        {
          "text": "And honestly,even if SRS monies grew to a point the tax on 50% withdrawal is 15% or more,  thats still a good problem. The 15% taxed might remain the same number, but you get tax savings up front and before inflation.",
          "score": 2
        },
        {
          "text": "Agree, I have bought similar endowment plans too before and regret it so much. Thankfully the plans were matured and I collected the proceeds.\nBut if I were to invest it myself I could have earn 2.5-3x my capital. Lesson learnt the hard way indeed.",
          "score": 1
        },
        {
          "text": "OH investing from the POV of the FA 😂",
          "score": 1
        },
        {
          "text": "How does it work can you elaborate more? I am interested to know",
          "score": 1
        },
        {
          "text": "Nope!",
          "score": 1
        },
        {
          "text": "Huh. Buying an endowment, annuity for estate? Siao ah",
          "score": 1
        },
        {
          "text": "I may consider buying this with my SRS funds to overcome the $400k withdrawal cap.",
          "score": 1
        },
        {
          "text": "There's no cap for withdrawal, it's that portfolio value above 400k will end up have to pay income tax. So what if you're withdrawing >40k per year? The effective tax rate is quite low as long as you don't hit the 11.5% bracket. Usually those that do SRS have very high salary (assuming 120k and above) and that's the 15% (or more) bracket. When you withdraw SRS and the tax bracket is lower than what you originally have, it's a win already. Why so obsessed with zero tax?",
          "score": 1
        },
        {
          "text": "There's no cap for withdrawal I know that. I'm just too lazy to type out the full description. It was not meant to be an information piece for others. So what if you're withdrawing 50k per year? The example given is $1m so I'm considering if my SRS crosses a million, which is possible. That's at least 100k per year. At 50%, will be taxed at the 50k tax rate, which i know is still better than the taxes I saved. But I'm not saying don't contribute SRS, am I? I'm talking about paying the taxes for this 50k per year, or put it into a life annuity to avoid paying it at all. Who wants to pay more tax when you can don't?",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qqyg9h",
      "subreddit": "singaporefi",
      "title": "Analysis Paralysis: Request your inputs please",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qqyg9h/analysis_paralysis_request_your_inputs_please/",
      "score": 4,
      "num_comments": 15,
      "created_at": "2026-01-30T15:03:00",
      "selftext": "Hi all, thank you everyone - have truly learnt a lot in the past few years. I am trying to figure out next steps and am quite lost, and need some inputs. Please see the following ways I have invested.\n\nRecently opened POEMS as well, and even more blur whether I move SRS and CPF to POEMS. Late thirties guy, cant buy a house - and kinda late to the game and swamped with info from YT (kelvin, honeymoney, ray seet, etc.) and the subreddit.\n\nTHANK YOU FOR HELPING!",
      "comments": [
        {
          "text": "Poems is good for cpf OA investing because cheaper but sucky UI and cannot redeem odd lots unless you send in the redemption form for full redemption",
          "score": 2
        },
        {
          "text": "As others have commented about point 2&3, I'll comment about point 1 I shall add that international diversification is important, given the recent USD devaluation and the recent growth of emerging markets. If you want a set it and forget it fund, this sub's standard advice, is VWRA irish low cost ter (0.19%) international. I personally do a mix of SWRD(89%) + EIMI(11%) It basically achieves or tracks the same stocks as VWRA but it adds a component of small cap EM stocks which over the long term gives a slight risk premium which should give higher returns compared to VWRA over a long time frame (20Y) but that's really marginal. just invest is the most important edit: I didn't know SPYL is the Irish docimiled version of S&P500. I stand corrected.",
          "score": 2
        },
        {
          "text": "SPYL is the London domiciled version of SPY... In this case, SPYL has a strictly better cost performance than CSPX. Imo, the real \"cost\" of SPYL vs CSPX is the lower volume and thus --> looser bid-ask spread when purchasing SPYL as compared to CSPX. These are minor optimisations...",
          "score": 2
        },
        {
          "text": "Ty for clarifying. I have edited my comment to remove the mistake.",
          "score": 2
        },
        {
          "text": "Why do you love America so much? If Poems is too irritating, then Endowus.",
          "score": 2
        },
        {
          "text": "you are assuming that dividend yields hold constant as well as the value of the reits remain constant no? what happens in the event of 2023 where interest is raised ?",
          "score": 2
        },
        {
          "text": "Yes, switch to SPYL, SWRD or ACWD on IBKR LSE. Amundi World. Amundi World if you don’t need for housing.",
          "score": 1
        },
        {
          "text": "There is also fwra tho that will overlap with your cspx",
          "score": 1
        },
        {
          "text": "You can link your SRS and CPF to POEMS. The funds will only be inside POEMS when you buy in POEMS. You can keep the Endowus Amundi funds. If you want to switch to POEMS, then you will have to sell in Endowus and buy in POEMS again iirc.",
          "score": 1
        },
        {
          "text": "Why cannot redeem odd lots? I just did it recently via POEMs app for Amundi MSCI World with cpf oa. Not full redemption.",
          "score": 0
        },
        {
          "text": "OA buy CFA reits safer, 5+% yield",
          "score": 0
        },
        {
          "text": "Srs and cpf move to poems. That one is no brainer. Endowus interface nicer and easier. But not sure if it is worth paying $500 per year",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qrpsld",
      "subreddit": "singaporefi",
      "title": "Old whole life policy - surrender or not?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qrpsld/old_whole_life_policy_surrender_or_not/",
      "score": 4,
      "num_comments": 14,
      "created_at": "2026-01-31T10:22:12",
      "selftext": "Hey all, I have a whole life policy bought for me by my parents when I was a kid. Thing is, protection is pretty minimal at this point (Death 50k, TPD 5k), and I'm already well-covered with another term life policy bought more recently.\n\nThinking of surrendering, but also considering keeping to let it accumulate what little value it can on the side, since I can afford it comfortably. Catch is that the premiums are payable for 52 more years......\n\nCurrent surrender value: ~$27kPremium: ~$700/yearTotal premiums paid (26 years): ~$17k*edit: Projected surrender at age 65: ~$165k\n\nIs it worth to keep on the side as a 'safer' method to accumulate a little cash, or just cash out the SV and put into index funds? (Been buying VWRA and other stocks on the side.) Thanks!",
      "comments": [
        {
          "text": "At this point; forget the coverage. $50k back then was alot but can hardly cover 1 year of family expenses now. Think of it as a higher interest savings account that you can liquidate anytime if you really want to. Old policies have a higher bonuses credited. If you are confident in the market or your own investments however, then of course sell it. Otherwise treat it as part of low risk asset to your portfolio.",
          "score": 3
        },
        {
          "text": "The past is irrelevant. Think of it in reverse - would you pay $27k right now AND another $700 per year for a 50k whole life insurance? The plan sounds so ridiculous actually, $700 per year for ~80 years for a 50k payout? That’s almost like getting 0 interest unless you die really early. Lastly, buying life insurance for a kid is completely the wrong use of life insurance.",
          "score": 2
        },
        {
          "text": "Oh the projected surrender value by age 65 is ~$165k. Forgot to put this in. Of course, value is not guaranteed, but there is stillsomeaccumulation at least. Though i'm not sure it's worth it.",
          "score": 1
        },
        {
          "text": "That is a lot better, you didn’t mention other details so it wasn’t clear if you could get more than the 50k coverage. If you do get 165k at 65 it’ll be about 5% interest. Of course as you mentioned it’s not guaranteed so you should assume less. The insurance portion is not worth much at this point so just judge if that interest is good enough for you.",
          "score": 1
        },
        {
          "text": "How long till 65? Im having a hard time running some rough calculations. I suspect it might be better to hold the policy since its quite long already...",
          "score": 1
        },
        {
          "text": "33 years to 65! I'm 32 :)",
          "score": 1
        },
        {
          "text": "I’m not sure why, but far too many Singaporeans have this unquestionable faith in insurance. Parents buy whole life insurance for their kids, and endowment insurance for education. It’s at best a poor investment vehicle and at worst a money sink through hefty fees. I’m stuck with two ILPs that my parents insisted I get, and whenever I tell them I want to surrender these policies they get all offended and think I’m stupid.",
          "score": 1
        },
        {
          "text": "Back then it was probably a lot harder to invest along with a lower financial literacy populace (no friends or internet to ask). So ILPs, whole life insurance, endowments would be one of the easier and well known ways to get better returns than just bank interest. In a sense the fees were justified by the service provided, since the insured didn’t know how to do it themselves (just like how you pay any trades worker for services you can’t do yourself even if the work itself only takes 5 minutes). But of course now it is a lot easier to invest so the fees that haven’t changed since then feels like a scam.",
          "score": 1
        },
        {
          "text": "Any early CI ?",
          "score": 1
        },
        {
          "text": "Nope, this policy literally only has death+tpd only",
          "score": 1
        },
        {
          "text": "If well covered, can cash out.",
          "score": 1
        },
        {
          "text": "Hahaha i have similar plan.. John Hancock",
          "score": 1
        },
        {
          "text": "That’s old.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qrn200",
      "subreddit": "singaporefi",
      "title": "How to deposit USD into IBKR directly without fees?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qrn200/how_to_deposit_usd_into_ibkr_directly_without_fees/",
      "score": 4,
      "num_comments": 12,
      "created_at": "2026-01-31T08:22:12",
      "selftext": "I have an ocbc multicurrency account with usd inside, but when I try to deposit overseas transfer to my ibkr citbank na account it shows a 15S$ fee. Is there any way to transfer usd directly to ibkr without fees? Or is the most efficient way to transfer SGD to ibkr and then convert on the platform?",
      "comments": [
        {
          "text": "Just get the bank to issue a USD Cheque and transfer it to DBS. Then dbs transfer to IBKR",
          "score": 4
        },
        {
          "text": "This is good. Surprisingly no fees for the local clearing USD cheque.",
          "score": 3
        },
        {
          "text": "DBS multi currency account to IBKR’s DBS account. But then the problem is, to get the USD from OCBC to DBS, also need to pay bank fees. So depending on the amount involved, you could either suck up the $15 fee this time, or change it back to SGD in OCBC losing maybe 1% in spread (don’t do this on weekend as rates might be worse).",
          "score": 2
        },
        {
          "text": "If it were DBS, he could use \"remit\" to send to other bank accounts for free. Is there similar function for ocbc?",
          "score": 2
        },
        {
          "text": "The other guy had the right answer. Do some leg work and get the local clearing USD cheque to transfer to DBS. DBS remit is very different (and awesome) compared to other banks’ multi currency offerings.",
          "score": 2
        },
        {
          "text": "Remit is for normal account or the multi currency?",
          "score": 2
        },
        {
          "text": "Can I use hsbc multi currency account to transfer to ibkr without any fees? Anyone knows if that works ?",
          "score": 2
        },
        {
          "text": "I think any normal account can remit SGD to become another currency in another country? You go to the website and see. Depends on what your use case is.",
          "score": 1
        },
        {
          "text": "It would be strange if HSBC doesn’t charge for USD transfer to another bank.",
          "score": 1
        },
        {
          "text": "When I go to do it. Says no fees.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qrana9",
      "subreddit": "singaporefi",
      "title": "CI coverage till 50 vs 65 if planning FIRE at 47?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qrana9/ci_coverage_till_50_vs_65_if_planning_fire_at_47/",
      "score": 3,
      "num_comments": 9,
      "created_at": "2026-01-31T00:44:22",
      "selftext": "Hi all, would like some views on a early critical illness insurance decision.\n\nI’m 35 this year and planning to reach financial independence around age 47. The plan is to build a portfolio of about $1.5M and withdraw around 4% per year (~$60k) to fund retirement.\n\nI’m considering a early critical illness rider of $300k with great term, mainly to cover things that my Shield plan won’t fully pay for (like certain cancer drugs) and to give me the option to stop work for a few years if I get seriously ill.\n\nI have two options:\n\nCover till age 50: about $1,120 per year\n\nCover till age 65: about $1,600 per year\n\nSo the difference is about $480 per year.\n\nMy thinking:\n\nIf I hit FIRE by 47, I technically won’t “need” income replacement after that since living expenses should be covered by investments.\n\nBut CI risk (cancer, heart issues, etc.) increases after 50, and my dad passed away from a cardiac arrest attack at 67.\n\nI’m also thinking that if I get early-stage cancer between 45–55, having CI payout might let me fully stop work for a few years to focus on treatment and recovery.\n\nCurrent coverage:\n\n$1M term life cover\n\n$100k multi-pay CI (Singlife) till 65\n\nMortgage 1.4m\n\nSo this new $300k CI rider would be additional on top.\n\nFor those who are more FIRE-focused or familiar with insurance planning: Would you optimise for shorter coverage (till 50) since the goal is to be financially independent by then, or is it wiser to stretch to 65 given health risks tend to rise later?\n\nAppreciate any perspectives.",
      "comments": [
        {
          "text": "Here’s my perspective. Build the $1.6k into your FIRE plan, so maybe an extra $40k @ 4%? So perhaps it means working half a year more to 47.5, but at least when you retire you have peace of mind and know that you’ve done your best to cover for everything.",
          "score": 6
        },
        {
          "text": "I do not believe that you can project with any degree of confidence at age 35 that you can retire in 12 years. You lose this current job and you may never find one as high earning. If the difference is only $500 a year, not a month, stop trying to pinch pennies! Besides, if you want fancy cancer drugs and not just income replacement, then of course you can’t stop the CI at 50.",
          "score": 3
        },
        {
          "text": "You can always choose other ages. Based on planned FIRE at 47, I would cover till 53-55 to give some buffer in case FIRE plans get delayed",
          "score": 2
        },
        {
          "text": "Thanks for the thought. Sounds logical too!",
          "score": 1
        },
        {
          "text": "I think from Age 50 --> Age 65 the bump is not bad. But if 65 --> 75 the increase in premium is so much. So we want to kind of minimise the premium paid but maximise the Age. And in SG, its just at 65 :).",
          "score": 1
        },
        {
          "text": "Thanks for the thought. Sounds logical too!",
          "score": 1
        },
        {
          "text": "It’s not much. Get the higher cost item",
          "score": 1
        },
        {
          "text": "Hi OP, congrats on your journey to FI.\nIs your $1m coverage includes late stage CI?\nDoes your mortgage has separate insurance to cover?\nCardiac arrest is different from heart attack. Cardiac arrest can happen to anyone even the young one, while heart attack is due to heart area problem.\nIf you think the additional few hundred doesn't impact your FIRE or give your peace of mind, that's totally alright.\nMaybe you might think why you want to buy ECI vs normal CI? For me personally, I consulted 2 agents and think the expected expenses of ECI is about $100k and the premium is much higher, so I decided to take the risk, but I do purchase normal CI. Do you mind to share how do you determine the sufficient coverage for the sum assured for death/CI? Separately, if these few years are critical for your FIRE, the disability income insurance is often the one underrated. You might take a look.",
          "score": 1
        },
        {
          "text": "$1m death only. My mortgage only has this $1m coverage for now. Yeah dad had heart attack at 35 yo, then past away with anopther heart attach that led to cardiac arrest at 67. why buy eci cause had a friend who had stage 2 cancer that requires chemo, which means time away from work and some expensive procedure and cancer drug, so thought that eci will be good to cover. My multipay plan with aviva covered 300% of $100k for late stage. Or $100% for early ci.But feels insufficient? i feel that sufficient coverage is around 2 years of annual income that allow me not to reduce standard of living by 2 years if i choose not to work if similar cancer happen. Will check out the disability income insurance. thanks!",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qr9xwt",
      "subreddit": "singaporefi",
      "title": "How much more insurance should I buy?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qr9xwt/how_much_more_insurance_should_i_buy/",
      "score": 3,
      "num_comments": 6,
      "created_at": "2026-01-31T00:19:27",
      "selftext": "I’m 29M, single, parents in their 60s\n\nCurrently I have\n\nI’m super new to insurance and need some help please.. should I cancel or upgrade any of the above?\n\nI was thinking of adding on another whole life with ECI/CI as rider? Any thoughts will be helpful, TIA 🫡",
      "comments": [
        {
          "text": "Why you mention your parents? Are they reliant on you to pay for their retirement? You got more than enough already dude. Don’t buy whole life lah! Whole life is investment plus insurance, and you shouldn’t mix investment and insurance.",
          "score": 3
        },
        {
          "text": "Why do you need life insurance for if you have no dependants",
          "score": 2
        },
        {
          "text": "Why not hospitalisation insurance then?",
          "score": 1
        },
        {
          "text": "My prushield plus is a hospital insurance - thinking should I upgrade to premier for private?",
          "score": 1
        },
        {
          "text": "Hello Op, agent here. What you have is good enough for a single guy without dependants. Have you done your nomination? You could consider a term eci or multipay eci. Getting a wholelife plan with eci rider is much more expensive, you would be paying for the cash value accumulation. Mindef group term top up living care rider for CI coverage. A separate eci single or multi claim plan. These 2 plan will pay out money while you are alive, money for YOU to use as you see fit. Group term and your other life plan the payout would be after you are dead.",
          "score": 1
        },
        {
          "text": "Thank you so much for your input. How much coverage do you think it’s necessary for ECI/CI As I’ve read elsewhere that mindef policy should be layered on top of my own policy hence I thought of getting more coverage..",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qrnye1",
      "subreddit": "singaporefi",
      "title": "Weekly Celebratory Thread!",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qrnye1/weekly_celebratory_thread/",
      "score": 0,
      "num_comments": 2,
      "created_at": "2026-01-31T09:00:34",
      "selftext": "This thread is for those looking to share hitting their milestones!\n\nCongratulations on being one step closer to FI!",
      "comments": [
        {
          "text": "Positive for Jan and broke my 400k milestone!",
          "score": 3
        },
        {
          "text": "Congrats!  Green is good :)",
          "score": 2
        }
      ]
    }
  ]
}