{
  "schema_version": "raw_scrape_v1",
  "report_id": "2026-01-30",
  "scraped_at": "2026-01-30T13:06:32.377928",
  "subreddits": [
    "singapore",
    "askSingapore",
    "SingaporeRaw",
    "singaporefi"
  ],
  "total_posts": 40,
  "total_comments": 833,
  "posts": [
    {
      "id": "t3_1qq49d9",
      "subreddit": "singapore",
      "title": "Former actor Edmund Chen gets jail and driving ban over collision that left motorcyclist with fractures",
      "url": "https://old.reddit.com/r/singapore/comments/1qq49d9/former_actor_edmund_chen_gets_jail_and_driving/",
      "score": 382,
      "num_comments": 121,
      "created_at": "2026-01-29T17:42:44",
      "selftext": "",
      "comments": [
        {
          "text": "Prosecutor: Fine. Defense: Okay. Fine. Judge: Cheebye la go to jail",
          "score": 509
        },
        {
          "text": "both sides asked for a fine. judge must have really hated the shows edmund starred in",
          "score": 416
        },
        {
          "text": "Prosecution didnt ask for jail, still got jail 😪 Anyways what do people with long driving bans usually do with their cars?",
          "score": 262
        },
        {
          "text": "At the peak of his career he was literally on \n530pm (rerun of the older 9pm show)\n7pm\n9pm\nTV show in the same week..",
          "score": 132
        },
        {
          "text": "Jam brake and filter on the chevrons. Biker left with multiple fractures and 99 day hospitalization leave.",
          "score": 128
        },
        {
          "text": "Prosecutor: present him fine\n                            \nDefense: present him fine \n                                                      \nJudge: ok prison him with fine it is.",
          "score": 92
        },
        {
          "text": "I can only remember him acting in a bizarre TV drama called Zero to Hero which was donkey years ago",
          "score": 55
        },
        {
          "text": "Im sure the insurance",
          "score": 39
        },
        {
          "text": "Wasnt he some lead actor about a traffic police officer, back in late 80s/early 90s?",
          "score": 36
        },
        {
          "text": "Omg 快乐鱼, thats 喜临门",
          "score": 34
        },
        {
          "text": "I only rmb the 快乐鱼 about the famous fish and chips with li jin mei",
          "score": 33
        },
        {
          "text": "who paid for the 99 day hospitalisation bill and the salary after 60 days of hospitalisation and bike repair?",
          "score": 25
        },
        {
          "text": "One of the goats with one of the best songs too",
          "score": 25
        },
        {
          "text": "i think its kind of a good move, singapore cars dont show motorcyclists enough respect. should be harsher on the accidents involving vulnerable road users, such as motorcycles, pedestrians",
          "score": 18
        },
        {
          "text": "Judge doing justice",
          "score": 16
        },
        {
          "text": "Yes! I think it's call Patrol. He acted as a TP officer then a CID officer",
          "score": 16
        },
        {
          "text": "Usually insurance.",
          "score": 12
        },
        {
          "text": "He met XY on 铁警雄风 where he was acting as a TP, the irony",
          "score": 4
        },
        {
          "text": "Serious offense. Go to jail. Lucky for him, it's 5 days only. I'm glad he was remorseful.",
          "score": 3
        },
        {
          "text": "Thank you for the laugh. I really needed it today. :)",
          "score": 3
        },
        {
          "text": "Wife drives or sell it.",
          "score": 2
        },
        {
          "text": "hire a driver?",
          "score": 1
        },
        {
          "text": "Oh ya now I remember alr 😂😂😂 such a classic long drama",
          "score": 1
        },
        {
          "text": "are you serious or sarcastic? how do you know he was remorseful?",
          "score": 0
        },
        {
          "text": "What?!",
          "score": -6
        }
      ]
    },
    {
      "id": "t3_1qq2ljj",
      "subreddit": "singapore",
      "title": "Melvin Lim, Grayce Tan step down from KW S’pore leadership roles; Jonathan Lee appointed to lead agency",
      "url": "https://old.reddit.com/r/singapore/comments/1qq2ljj/melvin_lim_grayce_tan_step_down_from_kw_spore/",
      "score": 361,
      "num_comments": 199,
      "created_at": "2026-01-29T16:00:41",
      "selftext": "",
      "comments": [
        {
          "text": "I would avoid this company. The CEO has drained all talent or goodwill in the company by prioritising his Self interest over others. The Rot runs deep and it is the people that makes the company. I only pity the other employees that have to put up with this selfish behaviour",
          "score": 362
        },
        {
          "text": "When Grayce became VP, what did they write? What experience did she bring to the table? Reddit, I challenge you to write a press statement introducing her.",
          "score": 145
        },
        {
          "text": "Interesting... “To ensure stability and operational continuity, Jonathan Lee has been appointed to lead KW Singapore in the interim,” the agency said. “Jonathan brings extensive regional experience, having previously served as regional director of KW Malaysia and currently as a growth consultant for the Keller Williams Worldwide (KWW) Asia Pacific Hub.”",
          "score": 127
        },
        {
          "text": "experienced with tablessssss",
          "score": 107
        },
        {
          "text": "\"formerly director of growth\" Clearly very skilled at making things grow.",
          "score": 99
        },
        {
          "text": "lol and whoever working in the companies with any talent would’ve quit. But then they can just rename themselves",
          "score": 72
        },
        {
          "text": "And spreadsheetsssss",
          "score": 71
        },
        {
          "text": "I think it’s because nothing to write",
          "score": 47
        },
        {
          "text": "I tried to dig out the press release about that but either they hide it or they didnt even bother to write one for the mistress",
          "score": 38
        },
        {
          "text": "Yes. That’s the joke genius.",
          "score": 33
        },
        {
          "text": "Wdym! Grayce got a lot of great skills.",
          "score": 27
        },
        {
          "text": "hawk tuah and spit on that thing",
          "score": 22
        },
        {
          "text": "Not condoning any behaviour but I work in sales, some agents might not quit to continue serving their existing clients etc (I am not 100% sure if this is how it is in ppty). But the guys who stay behind have the burden to carry and will have chance to want to work doubly hard to prove they are sincere etc. The rot is in the organisation infected by the few individuals but there’s a lot a lot of workers within that put in effort into their work. I am not vested or know any of them.",
          "score": 19
        },
        {
          "text": "Should change to Director of Moans",
          "score": 18
        },
        {
          "text": "- Takes a hands-on approach - Embraces hard situations with zest and passion - In-depth engagement with stakeholders",
          "score": 17
        },
        {
          "text": "Market Operations And New Sectors?",
          "score": 10
        },
        {
          "text": "Avoid all companies and businesses associated with them",
          "score": 7
        },
        {
          "text": "luck has run out for both of them, it's time to pay off their karma",
          "score": 2
        },
        {
          "text": "what do you mean? can do anything they want monday to saturday as long they go in on sunday to repent?",
          "score": 1
        },
        {
          "text": "Think he’s just pointing out the irony",
          "score": 1
        },
        {
          "text": "Yah sadly. Other religion also got bad apple. Like Sofian. Nurul Aini husband f his colleague.",
          "score": 1
        },
        {
          "text": "All for a publicity stunt",
          "score": 1
        },
        {
          "text": "That is actually literally the teaching in some churches. Not the good ones obviously but some.",
          "score": -1
        },
        {
          "text": "Yes I’m pointing it out",
          "score": -1
        },
        {
          "text": "yeah me too. haha",
          "score": -2
        }
      ]
    },
    {
      "id": "t3_1qpzs9t",
      "subreddit": "singapore",
      "title": "'Work hard on having more babies', Gan Kim Yong tells student",
      "url": "https://old.reddit.com/r/singapore/comments/1qpzs9t/work_hard_on_having_more_babies_gan_kim_yong/",
      "score": 303,
      "num_comments": 232,
      "created_at": "2026-01-29T13:24:23",
      "selftext": "",
      "comments": [
        {
          "text": "Got tell the PM or not?",
          "score": 736
        },
        {
          "text": "Talk easy leh",
          "score": 422
        },
        {
          "text": "He didn't use to talk this much cock",
          "score": 369
        },
        {
          "text": "And leader of house?",
          "score": 290
        },
        {
          "text": "Not sure, but confirm got tell Melvin and Grayce",
          "score": 209
        },
        {
          "text": "Easy for a millionaire minister",
          "score": 206
        },
        {
          "text": "I met him in person. He has some mad talk cock skills with his residents back in CCK",
          "score": 161
        },
        {
          "text": "PAP: Commands you to have kids, by hook or by crook WP: Doesn’t tell you to have kids, but wants to make life easier for people who wants to have kids.",
          "score": 109
        },
        {
          "text": "His advice gan bo yong.",
          "score": 106
        },
        {
          "text": "ORD mood already.",
          "score": 59
        },
        {
          "text": "Indranee only bangs tables, can't get pregnant from that",
          "score": 57
        },
        {
          "text": "Have more babies? Indranee: Not mee",
          "score": 50
        },
        {
          "text": "Lawrence effect",
          "score": 45
        },
        {
          "text": "Resident of Punggol / Northshore will be listening to him shortly.",
          "score": 35
        },
        {
          "text": "Easy to make babies. Not easy to raise babies.",
          "score": 21
        },
        {
          "text": "ORD mode",
          "score": 21
        },
        {
          "text": "MR mood",
          "score": 18
        },
        {
          "text": "Waiting for this comment to chio ka kong kah liao.",
          "score": 13
        },
        {
          "text": "Putting the cock in CCK",
          "score": 13
        },
        {
          "text": "Sounds like korean oppa suddenly",
          "score": 8
        },
        {
          "text": "flip table",
          "score": 6
        },
        {
          "text": "Upvote!! 😂",
          "score": 6
        },
        {
          "text": "😂😂😂",
          "score": 5
        },
        {
          "text": "They broke their words so that they can follow the call of DPM and make greater contribution to Singapore's future",
          "score": 3
        },
        {
          "text": "Didn't they already sign exclusive baby making contracts with other people??",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1qqomaw",
      "subreddit": "singapore",
      "title": "S'porean man, 26, shows lewd note on phone to teen girls on MRT, gets 12 days' jail",
      "url": "https://old.reddit.com/r/singapore/comments/1qqomaw/sporean_man_26_shows_lewd_note_on_phone_to_teen/",
      "score": 270,
      "num_comments": 69,
      "created_at": "2026-01-30T07:23:40",
      "selftext": "",
      "comments": [
        {
          "text": "Tan Tee Yong, 26 The 16-year-old victim made a police report hours after the incident, stating that a man \"in his 30s\" Not the point of this article but this part made me laugh",
          "score": 352
        },
        {
          "text": "\"It's just that he did not realise the seriousness of what he has done,\" the lawyer added. Solid defence /s",
          "score": 272
        },
        {
          "text": "Getting called auntie/uncle while in my young 20s be like",
          "score": 118
        },
        {
          "text": "When I was in my early 20s a father and his child got into the same lift with me. I was pressing the lift button to hold the doors open and he told his child to thank the nice auntie. Hello what is this friendly fire",
          "score": 102
        },
        {
          "text": "Mindblown excuses",
          "score": 50
        },
        {
          "text": "How do you even defend for this case",
          "score": 43
        },
        {
          "text": " This is what the defense thought the judge would say",
          "score": 39
        },
        {
          "text": "Does the caifan auntie call u auntie tho... They still call me \"boy\" lol (early 20s)",
          "score": 30
        },
        {
          "text": "It is correct for a child (under ~12) to address someone in their early 20s as auntie. There is a generational difference.",
          "score": 18
        },
        {
          "text": "It’s 2026, we can’t flirt with customers, only the VP of strategy lol",
          "score": 15
        },
        {
          "text": "Top notch lawyer",
          "score": 14
        },
        {
          "text": "It's pretty obvious the lawyer is grasping for straws at this point. Calling him useless is uncalled for imo.",
          "score": 13
        },
        {
          "text": "Im in my 30s and caifan auntie still call me boy...",
          "score": 13
        },
        {
          "text": "Casually pedo. Even worse leh",
          "score": 9
        },
        {
          "text": "Bro hit the unc stat early 😢",
          "score": 8
        },
        {
          "text": "don't like that, bro is trying his best with what he is given,",
          "score": 6
        },
        {
          "text": "No leh, friendly fire usually hits ppl in same team. But you weren’t in their team wor 😂",
          "score": 6
        },
        {
          "text": "stating that a man \"in his 30s\" \"I'm sorry officer, I didn't know I couldn't do that.\"",
          "score": 4
        },
        {
          "text": "Huh I thought they call everyone 帅哥?",
          "score": 4
        },
        {
          "text": "I mean for the child, you are an aunty. I do the same. I also address people who block escalators and travelators as aunty when I ask them to politely move. Got myself many a death stare.",
          "score": 3
        },
        {
          "text": "🧒",
          "score": 1
        },
        {
          "text": "Even visibly elderly folks from my parents’ generation also call me uncle. I had an elder classmate from sign language class, when he saw my mum he also called her auntie. Its uncles/aunties all the way down",
          "score": 0
        },
        {
          "text": "Lawyers in Singapore fkin useless I swear 😂",
          "score": -1
        },
        {
          "text": "okay, let me try to understand the lawyer: it is like in a company situation, you tell what you think was a harmless joke (because you heard your NS mates tell it) to your fellow colleagues, but they got offended and they reported you to HR. Then you got a warning and put under probation.... OR The lawyer is real shit.",
          "score": -3
        },
        {
          "text": "I’m not a lawyer but I’m pretty sure in this situation that lawyer is useless as shit",
          "score": -11
        }
      ]
    },
    {
      "id": "t3_1qqr397",
      "subreddit": "singapore",
      "title": "Heads up - Circle Line slightly delayed in both directions due to a signal fault",
      "url": "https://old.reddit.com/r/singapore/comments/1qqr397/heads_up_circle_line_slightly_delayed_in_both/",
      "score": 225,
      "num_comments": 25,
      "created_at": "2026-01-30T09:06:47",
      "selftext": "Heard from an announcement over the PA system at Serangoon (that's the localised updates system for you). No known additional time expected was given and the train arrival time screens are also down.\n\nExpect unusual crowds on trains toward Paya Lebar and some extra waiting time, especially at interchange stations. Otherwise the trains seem to be operating at normal speeds.",
      "comments": [
        {
          "text": "Here we go",
          "score": 94
        },
        {
          "text": "Same experience this morning around 740am, as usual radio silence at the station and in the cabin itself. Not reported faults won't affect KPI and reliability, like the NSL one on Wednesday evening :)",
          "score": 76
        },
        {
          "text": "Crowd-sourced reports of delays near one-north too.https://www.sgtrains.com/guide-status It’s still not showing up on LTA’smytransport.sg.",
          "score": 54
        },
        {
          "text": "LTA & SMRT's renewed transparency plan = treat the incident as if its transparent/invisible. Hence, there's no problem so no need for any reporting. Majulah sinkapura 😊",
          "score": 47
        },
        {
          "text": "LTA be like: if I don't report it, it's not happening ",
          "score": 25
        },
        {
          "text": "Sgtrains are godsend",
          "score": 23
        },
        {
          "text": "Classic peak hour nonsense. If can, bail one stop early and loop back. If not, congrats, today we're all canned sardines.",
          "score": 11
        },
        {
          "text": "Was at CCL Serangoon at 7.30 and it was double the crowd (compared to the last few days, even with the crowd control). Train waiting time was 6mins (noticeably longer than previous days.",
          "score": 10
        },
        {
          "text": "Was on the train at buona around 9am when it behave Abit erratically, decelerating and accelerating seemingly at random (possibly cuz of train infront) and then stopped for a few minutes just before buona vista, luckily the train infront managed to depart and we managed to alight, not sure what happen after that. All the time they were announcing some delay due to signalling fault",
          "score": 9
        },
        {
          "text": "Really ah? I was at serangoon at 7.40am, i didnt realise there was anything wrong. No announcement or extra crowd, train was normal.",
          "score": 8
        },
        {
          "text": "Again, Same old sh*t again",
          "score": 6
        },
        {
          "text": "Circle Line getting nerfed within the past 5 months",
          "score": 6
        },
        {
          "text": "Love this, thank you for this creation",
          "score": 5
        },
        {
          "text": "Need to up fare for maintainace again liao. Or will eat into profit hor",
          "score": 5
        },
        {
          "text": "Oh, I’m not involved in sgtrains at all. Don’t thank me haha",
          "score": 3
        },
        {
          "text": "A full circle",
          "score": 3
        },
        {
          "text": "Yup fuck you Singaporeans who aren’t rich enough to own a car! Suck it up and use our worldddd classs transport while those in charge are chauffeured to work",
          "score": 3
        },
        {
          "text": "I guess it doesn't feel their definition of delay",
          "score": 2
        },
        {
          "text": "ISOLATED!",
          "score": 2
        },
        {
          "text": "Still kena shot by those on reddit",
          "score": 1
        },
        {
          "text": "No wonder there were some muffled announcements made by the train driver earlier. It was accompanied by the annoying peeping sounds. Had no idea what was going on.",
          "score": 1
        },
        {
          "text": "Just see grab surge can guess if mrt is alright",
          "score": 1
        },
        {
          "text": "Ah when i reached the ccl platform, the train just arrived, then i squeezed into the small gap. Maybe that explains why i didnt feel that there was any delay. I dunno if the train platform was more crowded or not since i just straightaway chiong into the train. I only know the conga line on the way to the platform seems to be the same as yesterday.",
          "score": 0
        },
        {
          "text": "Nvm la tgif",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qq0jv6",
      "subreddit": "singapore",
      "title": "Malaysia to ban the purchase of RON95 petrol for foreign-registered vehicles from April 1",
      "url": "https://old.reddit.com/r/singapore/comments/1qq0jv6/malaysia_to_ban_the_purchase_of_ron95_petrol_for/",
      "score": 207,
      "num_comments": 75,
      "created_at": "2026-01-29T14:04:05",
      "selftext": "",
      "comments": [
        {
          "text": "Why wasn’t this a thing earlier",
          "score": 203
        },
        {
          "text": "All along Singaporeans can't pump RON95. Just that now any foreign vehicles also can't. Not even a Malaysian citizen and Singapore PR who drives a Singapore registered vehicle. To all the Singaporeans who visit Malaysia, they have been pumping RON97 anyways.",
          "score": 101
        },
        {
          "text": "last time only the petrol station kena penalized",
          "score": 82
        },
        {
          "text": "It was but currently the offenders(like the Yishun couple) won’t be penalized, only the petrol operators. They trying to penalized the offenders from Apr 1",
          "score": 68
        },
        {
          "text": "Wasn't it already banned?",
          "score": 58
        },
        {
          "text": "To be more accurate: RON95 only for Malaysia registered vehicle, they don't care what is your nationality. I pumped RON95 all the time when I was in Sabah driving tour BUDI95 need check Malaysian driver licence + MY registered vehicle RON97 and above: No restrictions",
          "score": 43
        },
        {
          "text": "The lasting legacy of Mr SLJ8967M aka “LJ8967”.",
          "score": 38
        },
        {
          "text": "All along foreign registered vehicles cannot pump 95 be it Malaysian or not. Only change they are trying to legislate is that instead of only petrol operators getting penalized, the offender(ie kiam siap Singaporeans/PR) will also be penalized",
          "score": 35
        },
        {
          "text": "Likely PRs and ex-Malaysians tying to rekindle fond memories of home.",
          "score": 31
        },
        {
          "text": "Already a dollar a litre for ron97.. still want to steal from their fuel subsidy?",
          "score": 27
        },
        {
          "text": "Not sure if there is awareness, but there are feedback that the quality of RON95 still ain't quite the same as the Singapore equivalent of 95%, engine isn't as smooth running on RON95.",
          "score": 17
        },
        {
          "text": "Why would it, how would the science even work. 95/97/100 difference is the additives added to it not the amount of energy the fuel contains",
          "score": 13
        },
        {
          "text": "As an Indonesian, this put a question mark. Why would they ban the good petrol for foreigner? Only to realise, RON95 is the subsidised petrol there *cries in Indonesia",
          "score": 12
        },
        {
          "text": "Just that now any foreign vehicles also can't. I thought all along, all foreign-registered vehicles can't pump RON95",
          "score": 11
        },
        {
          "text": "he talk cock lol",
          "score": 11
        },
        {
          "text": "Singaporeans can pump 95 but must drive malaysian car",
          "score": 10
        },
        {
          "text": "not additives, it’s to prevent premature combustion (knocking) on cars that require higher octanes.",
          "score": 9
        },
        {
          "text": "really the ron100 gives more range?",
          "score": 8
        },
        {
          "text": "See his car plate u go smlj. Lol...",
          "score": 6
        },
        {
          "text": "Depends the kind of vehicle you have lor. My bike rated for RON 89, i pump RON100 also not much difference. If you got a high performance engine, the difference is more tangible",
          "score": 5
        },
        {
          "text": "This is fair.",
          "score": 5
        },
        {
          "text": "Anyone knows if RON97 is really 97 in Malaysia? Car is tuned to run on 98 minimum. Does Malaysia has 20% ethanol + 80% petrol?",
          "score": 4
        },
        {
          "text": "Probably not 100km more but there can be some effect. This is actually quite complicated. Increasing the Octane number introduces factors that both increase and reduces your fuel burn and hence increase range. Factors that lower fuel burn: - Higher RON allows the engine to operate more efficiently by generally increasing compression in the engines. This can be achieved through variable valve timing, increasing the spark advance or increasing the allowable boost from turbochargers. OTOH, this effect is most visible at high load. If you are cruising at highway speed, this effect is likely negligible. - Higher RON allows the engine to avoid running a rich mixture to avoid knock. Knock is a destructive premature ignition phenomena. Running a rich mixture prevents knock as the excess fuel acts as a coolant which delays pre-ignition. Octane rating is a measure of a fuel's resistance to knock. Increasing resistance to knock allows the engine to dispense with knock prevention enrichment. That said, at highway speed, this effect is likely minimal. Factors that increase fuel burn. - RON numbers are increased in petrol by adding knock resistant additives. Common additives are alcohols like Ethanol and Methanol. These have improve RON, but have lower energy density. Diluting the fuel with these alcohols slightly lowers the energy density of the petrol, increasing fuel burn. The presence of these alcohols is generally good for emissions and reduces air pollution, but they are often hygroscopic and can attract and hold moisture from the air. The effects of increasing RON are likely most pronounced and most positive at high engine loads, I think if the OP saw a large range increase from using a higher RON, he was probably driving very very fast or he was using his car to tow a leopard tank or maybe he was lugging back 60 tons of shopping from Mid valley...",
          "score": 2
        },
        {
          "text": "BUDI95 also requires MY IC",
          "score": 0
        },
        {
          "text": "Ya 97 also dirt cheap so why bother with 95 lol Hell otw back to singapore i always pump ron100 and watch my range jump by another 100km",
          "score": -9
        }
      ]
    },
    {
      "id": "t3_1qq1wqk",
      "subreddit": "singapore",
      "title": "Jail for man who took photos and videos of ICA officer at Woodlands Checkpoint and lied to police",
      "url": "https://old.reddit.com/r/singapore/comments/1qq1wqk/jail_for_man_who_took_photos_and_videos_of_ica/",
      "score": 147,
      "num_comments": 39,
      "created_at": "2026-01-29T15:20:00",
      "selftext": "",
      "comments": [
        {
          "text": "I bet it's the guy from the CNA episode right. His attitude like 6 yr old tantrum lmao",
          "score": 132
        },
        {
          "text": "Lol at CNA telling us he appears in theCNA documentary Dude was censored in that doc too",
          "score": 65
        },
        {
          "text": "Goes to show everyone grows old, but not everyone grows up",
          "score": 44
        },
        {
          "text": "It is. The article confirms: Wong's incident at Woodlands Checkpoint was shownin a documentary by CNA Insider titled World's Busiest Land Crossing: Inside Singapore Woodlands Checkpoint, under the subheading 'The rude traveller'.",
          "score": 43
        },
        {
          "text": "Yup that’s the guy lol",
          "score": 30
        },
        {
          "text": "Ahaha jail AND fine for this idiot. Act big lah, act some more. This should serve as a lesson for those idiots who think they really damn big shot.",
          "score": 29
        },
        {
          "text": "Wong's lawyer, Mr Anil Singh Sandhu, said his client was very sorry for the offences he had committed. He said Wong was taking on odd jobs to support himself and his aged mother and wishes to put thisepisodebehind him. The lawyer also punny",
          "score": 28
        },
        {
          "text": "He is sorry and remorseful? I thought he said he's not scared?",
          "score": 26
        },
        {
          "text": "He said Wong was taking on odd jobs to support himself and his aged mother and wishes to put this episode behind him. That episode is righthereif anyone else is interested.",
          "score": 23
        },
        {
          "text": "i legit thought it was an actor reenacting for cna documentary 😭😭",
          "score": 17
        },
        {
          "text": "When I was younger, I thought all the adults in the world had their shit together. The older I got though, the more I realized that some people just don't mature alongside their age. A fiancee, a car, probably a decent amount of wealth... and yet somehow is a big baby. For shame.",
          "score": 16
        },
        {
          "text": "All these people damn funny one. Act big in front of police. \"Not scared la\", \"you stupid dno how to do your job la\", scold here scold there. Then when kena charged, suddenly become 'remorseful', 'very sorry', 'wishes to put episode behind them'. He never cite mental issues already a bonus liao...",
          "score": 14
        },
        {
          "text": "odd jobs can afford to drive? must be very odd jobs.",
          "score": 11
        },
        {
          "text": "“He has past convictions from 2004, with a relevant one in 2021 for voluntarily causing hurt, for which he was jailed.” A leopard doesn’t change its spots",
          "score": 11
        },
        {
          "text": "Orby good",
          "score": 10
        },
        {
          "text": "lol love it when stupid people self own themselves on social media",
          "score": 9
        },
        {
          "text": "Fucking loser. These people really cannot control their anger and challenge officers and the law.",
          "score": 9
        },
        {
          "text": "38 fricking years old. wah lau wei seriously a joke",
          "score": 8
        },
        {
          "text": "Right or wrong, I don't understand people who argue or make problems with immigration officers. Like that's just putting yourself into a whole lot of problems to deal with.",
          "score": 7
        },
        {
          "text": " Serve you right!",
          "score": 7
        },
        {
          "text": "Lying is wrong. Period.",
          "score": 4
        },
        {
          "text": "Don't think Crimewatch or MediaCorp allow swearing lol",
          "score": 3
        },
        {
          "text": "Play stupid games, win stupid prizes. Dude got everything he deserves.",
          "score": 3
        },
        {
          "text": "He’s the stupid one.",
          "score": 3
        },
        {
          "text": "must be a very big shotttttttttttt otherwise how to xplain such big egoooooo",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qq3v1u",
      "subreddit": "singapore",
      "title": "'Not closed off to any ideas': Desmond Lee says MOE to study how to reduce exam stakes further",
      "url": "https://old.reddit.com/r/singapore/comments/1qq3v1u/not_closed_off_to_any_ideas_desmond_lee_says_moe/",
      "score": 142,
      "num_comments": 103,
      "created_at": "2026-01-29T17:17:54",
      "selftext": "The whole issue IMO is this:\n\n- Everyone wants to earn more to survive in this increasingly challenging environment\n\n- How much you earn largely depends on your educational level\n\n- Your grades determine where your educational level stops\n\n- Parents would want the best grades for their children\n\n- Parents would pile them up with tuition\n\n- Schools would be pressured by parents to produce grades\n\n- Schools would resort to overwhelming number of worksheets as proof of learning for parents to see\n\n- Rote learning and frontal teaching is used due to the sheer number of worksheets\n\n- Students do work for the sake of completing work so they can breathe\n\n- Students don’t really learn anyway\n\n- Students get more tuition",
      "comments": [
        {
          "text": "Reduce the class size from 40 pupils to 20 pupils. Class number will be doubled. Fund the MOE more to hire more teachers. Then school hours no need to be so long and inefficient anymore. We have been saying this for years. No need to change the PSLE and O Level and A Levels.",
          "score": 152
        },
        {
          "text": "The day our ministries hire due to some metric that’s unrelated to grades, I’ll believe Desmond Lee and his MoNiTOrInG. Edit:Here’s my thoughts on the solution.I’m not paid as highly and definitely not in a position to make change like Desmond Lee though.",
          "score": 105
        },
        {
          "text": "Whatever metric they shift to, the rat race will just shift to that. The source of all this stress is competition and competition is never going away.",
          "score": 53
        },
        {
          "text": "Yes, and teachers can actually focus on the quality of learning instead of sheer quantity (of students). Here’s my take on the solution:https://www.reddit.com/r/singapore/s/w14uer5K1T",
          "score": 42
        },
        {
          "text": "what metric can showcase competency better than grades?",
          "score": 24
        },
        {
          "text": "i do like your ideas, but i also think its a bit idealistic. to focus more on research, discussion and collaboration would require an entire overhaul of the system from the ground up. Parents and students alike must be convinced of the new approach and must be willing to accept the changes, which is not easy because it deviates far from the status quo. i really wonder if implementing such a holistic approach to education is possible in the short term. i just feel that so far, govt has been saying all sorts of nonsense about trying to make it less competitive and easier for students, but all i see is rising stress levels. (source: am an educator myself. i don't see much of anything MOE is doing to make things easier for students)",
          "score": 22
        },
        {
          "text": "My opinion is that it’s not so much of changing the use of grades, but the components that make up that grade. The mindset needs a reset. Current system tests students on memorisation, rote learning and pattern recognition (which can be mugged). Both parents and schools (and tuition industry) focus onquantity over quality. Students do 100s of practice papers and make the same mistakes over and over. Teachers are forced to teach frontally, students listen passively because of the sheer amount of worksheets. Why? Parents want to see quantity. If their children aren’t doing too much, they aren’t learning. Schools with dinosaurs in charge subscribe to that mindset as well. We’ve all been students before and (hopefully) have encountered at least one good teacher who dares not to follow the prescribed quantity mill. Did you learn better listening to the teacher drone for hours, or did you learn better through experimentation, research, discussion and collaboration? The latter takes so much more time, which means fewer worksheets. It’s just not palatable to parents. Edit: If you’re downvoting this, I would love to hear your thoughts. This would be a wonderful discussion point.",
          "score": 21
        },
        {
          "text": "Please write in, if enough of us do, then there’s hope for change",
          "score": 11
        },
        {
          "text": "Sure. Just curious if you have anything in mind.",
          "score": 11
        },
        {
          "text": "One issue with this is that teachers are actually poorly paid - honestly, the academic cutoff for teachers is quite poor (both PDGE and NIE): why would competent graduates that can earn double or triple the salary willingly choose to take up a teaching career? The incentive is very low here. If the teachers themselves are poor learners and don't understand the process well enough to even achieve a second upper in the primary major they are studying, they are unlikely to communicate good learning practices well. Very few MOE teachers were straight A students in their time, yet we expect them to churn out or mentor straight A type students? Also, your idea is good but presupposes that the teachers will be motivated enough to make this work - you need to have reward scale to the effort and quality. Two things need to happen concurrently: (1) Pay needs to be high enough such that on equilibrium, you have high quality candidates coming in, (2) at the same time, the screening process needs to also do a good job of screening for motivation and passion accounting for #1. You need to have both motivated and capable teachers. Being motivated and passionate is not enough when they are mediocre (in understanding the process of learning and the content matter). Increasing the number of teachers alone doesn't solve the problem that you have mediocre people passing down poor learning habits to the students. They don't inspire, nor are they likely to be good enough to understand how to nurture bright, young minds. All it does is improve the class management part of managing the young (which I agree is 100% important at primary school). You need more than (child management skills) that for secondary and JC.",
          "score": 9
        },
        {
          "text": "Actually it can already be done with the current syllabi if MOE pushed for it by allowing teachers to actually teach. Teachers just need more time to explore and innovate (which they currently don’t have because they’re bogged down with a mountain of worksheets and admin work). If parents disagree with this idealistic approach, MOE can just veto parents’ concerns for the greater good. That’s the power of a one-party system where they can actually make drastic changes to benefit the long run. How can this work? Here’s an example of how to teach studentshowto think instead ofwhatto think. Practice papers. The sheer quantity way is to throw students 20 practice papers, mark and go through. Students copy annotations. Do they learn? I’d argue no. How fast can this be done? Pretty quick actually. The alternative? Get students to work in groups (or solo depending on strength and pace of the class), provide them with guiding questions to build their thinking process when they see questions. Using those guiding questions, they annotate the clues. If they work in groups, they can discuss and build knowledge. Weaker ones can actually learn from their peers and the stronger ones hone their mastery by teaching. Why do students not understand how to annotate or find clues that help after 10 years of formal education? Because we’ve been focusing on rote learning and quantity, not the thinking process.",
          "score": 6
        },
        {
          "text": "that;s at university level. not at primary school level. and its not the same as just telling the 40 kids to break into groups and discuss.",
          "score": 5
        },
        {
          "text": "It will not fix anything. If the parents keep thinking tuition is the only way to all problems. Until we can see school as a place to learn how to learn. The whole education systems is stuck, my son do reasonably ok but he have interest for math, instead of letting him focus on that, my ex wife decided the best way to do it is to have more tuition, stacking the bills into thousands. \nParents need to accept that no world class education system can change your gene make up, if both the parents are academically weak not because of lack of opportunity, no amount of tuition will give you miracle. Why not explore something else your kids is good at and let him have a shot at it.",
          "score": 5
        },
        {
          "text": "Actually will la. The benefit will not be immediately obvious. But maybe in 2 to 3 years, we will see changes.",
          "score": 5
        },
        {
          "text": "Note that University teaching is all over the place, and you the student is just an additional income source, so kinda bad to compare with.",
          "score": 2
        },
        {
          "text": "It starts with parents’ expectations, then Dinosaur school leaders who decide quantity is the way to go. MOE themselves with their justification on how much work teachers are made to do also plays a big part. If Desmond Lee can spout untruths under oath - Teachers can take leave when there’s no lessons, then nothing will change. There’s no good answer to this, since so many stakeholders are involved.",
          "score": 2
        },
        {
          "text": "Good ideas, but still abit idealistic. Group work or discussion can also introduce more distraction or disruption to lesson time. Kudos to your passion in this topic",
          "score": 2
        },
        {
          "text": "problem is the guiding - a teacher cannot guide if there are 40 over kids and 10% of them have behavioural issue.",
          "score": 2
        },
        {
          "text": "Yes, increasing pay would definitely attract more talents. I heard that MOE in the past decade has increased the requirements to at least a second upper to be considered. But then they also deliberately slowed down recruitment One thing you didn’t mention is that the bulk of a teacher’s job today is admin. Teachers actually have extremely little time to plan and prepare for lessons. One reason why current teachers seem not to have capability is due to management thinking quantity is still the way in 2026. How do teachers hone their craft and continually improve if they don’t have time? Teachers don’t improve because they’re sent for some lousy course or attend some school based professional development meeting.",
          "score": 2
        },
        {
          "text": "That is the problem with the mindset, we need to move past the teachers teaches the topic instead of facilitating the learning process. If you look at the top university in the Ivy League level, they do not focus on one on one teaching, they look at teaching you how to learn not from them but from everywhere. \nConsidering parents are paying top dollar for Montessori learning method why are the child not using the same way later in the life?",
          "score": 1
        },
        {
          "text": "Tuition is the way to play the current academic game. You can grind results out, just that existence is quite miserable if a child just keeps going tuition to tuition weekly.",
          "score": 1
        },
        {
          "text": "Yes, they need to change PSLE, O and A levels. You can be competitive and have models similar to IB programme (removes PSLE and O levels) and IB is much more holistic, their final results is based on assessments throughout the year.",
          "score": 1
        },
        {
          "text": "That’s up to the teacher’s skill in classroom handling. You’d be surprised how group work can result in much better outcomes as compared to seated individual work. That’s with the added benefit of letting children experience how to work cohesively with others - a skill sorely lacking in today’s digital world.",
          "score": 1
        },
        {
          "text": "Remove the executional and procedural teaching with solution based…",
          "score": 0
        },
        {
          "text": "We wait for the results of Desmond Lee’s study ok? Hopefully we will get something. Unlike the fabled East Coast Plan.",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qq4gia",
      "subreddit": "singapore",
      "title": "'Smoke hasn't reached Singapore's airspace': Johor deputy fire chief on Kota Tinggi peatland blaze",
      "url": "https://old.reddit.com/r/singapore/comments/1qq4gia/smoke_hasnt_reached_singapores_airspace_johor/",
      "score": 141,
      "num_comments": 63,
      "created_at": "2026-01-29T17:54:35",
      "selftext": "",
      "comments": [
        {
          "text": "Sometimes I pity Anwar. He wants to change the country for the better, he has plans, but the people he is stuck with is totally shit. What do you mean by the smoke hasn’t reached Singapore? People here can already smell it. And just a few days ago, his minister said that stress turns people gay.",
          "score": 286
        },
        {
          "text": "singaporean noses in the east speak for themselves we can smell it yk",
          "score": 274
        },
        {
          "text": "Maybe we should be more thankful to Malaysia for fresh air. We only thank Indonesia.",
          "score": 98
        },
        {
          "text": "Dunno what Abang is smoking if he thinks the smoke hasn't reached our airspace?!",
          "score": 50
        },
        {
          "text": "You want to win elections you gotta partner with the Muslim right wing. Even LKY had his fair share of unsavory political bedfellows. _Until the cleansing_…",
          "score": 33
        },
        {
          "text": "naaaaa its just my clogged nose imaginationnnnnnn",
          "score": 28
        },
        {
          "text": "Kukubird then the haze smell come from where? Their assholes ah",
          "score": 27
        },
        {
          "text": "It's work stress.",
          "score": 22
        },
        {
          "text": "He is saying what you see when you look overhead is Malaysian airspace.",
          "score": 20
        },
        {
          "text": "Ha, gay",
          "score": 18
        },
        {
          "text": "This has nothing to do with Anwar. Unlike Singapore, Malaysia has different levels of government. This comment is made by the Johor fire chief, and not the federal government.",
          "score": 18
        },
        {
          "text": "He could go full LKY if he really wanted to change for the better cause it ain’t changing with whatever status quo they have atm",
          "score": 12
        },
        {
          "text": "we don’t even go for our acting minister of transport LOL",
          "score": 10
        },
        {
          "text": "That's why need secretary to piak piak right? Construction damn stress",
          "score": 7
        },
        {
          "text": "Ya lor. Never thank mareysha. Now kenna already",
          "score": 7
        },
        {
          "text": "Self proclamation of not working hard enough thats why he ain't gay!",
          "score": 6
        },
        {
          "text": "Mahathir: the tilam so big you all never see ah",
          "score": 5
        },
        {
          "text": "Have you said thank you to Malaysia once? ",
          "score": 5
        },
        {
          "text": "Maybe vape?",
          "score": 3
        },
        {
          "text": "Singaporeans would’ve gone for the heads of the minister in charge of the fire chief.",
          "score": 1
        },
        {
          "text": "My nose has been shot since Sunday and I don't even live in the East.",
          "score": 1
        },
        {
          "text": "Not like our government thinks particularly highly of the LGBT community either",
          "score": 0
        },
        {
          "text": "What did you do to Vance dude",
          "score": -1
        }
      ]
    },
    {
      "id": "t3_1qqn0v7",
      "subreddit": "singapore",
      "title": "P1 registration system being reviewed to improve social mixing in primary schools: Minister",
      "url": "https://old.reddit.com/r/singapore/comments/1qqn0v7/p1_registration_system_being_reviewed_to_improve/",
      "score": 100,
      "num_comments": 126,
      "created_at": "2026-01-30T06:20:14",
      "selftext": "",
      "comments": [
        {
          "text": "I was a poor kid with no connections that balloted successfully into an elite girls' primary school in Bukit Timah in the 2000s and here is the tea - the rich girls form cliques within themselves and the non rich kids go together. Its funny how some of the rich girls PSLE just cmi, like they mostly qualify for NA and then parents pay for their overseas education after secondary school 🙄 If you are not rich, even in the same school, you won't be part of those elite circles lol there is a lot of subtle exclusion I experienced. So even if at policy level you try to make it more diverse, rich parents still gonna game the system. Then it begets the question - should parents not give their kids the best? This feels contradictory when you actually pick it apart. But what does it matter? In life, I have met lots of people that never went to elite primary schools making it to NUS/NTU/SMU or even overseas uni. Parents are just too anxious I feel.",
          "score": 115
        },
        {
          "text": "Let's take some guesses on what will be the changes. Less slots for Phase 2A and 2B? Remove parent affiliation altogether? Address used for proximity must be lived in for X number of years? Introduce EIP quota for P1 balloting like in housing?",
          "score": 94
        },
        {
          "text": "Suggestion: Household income less than X k, gets guaranteed placement in any chosen school. Solution: parents take 1-year sabbatical from work for ✨️mental health reason✨️ which happens to be a year preceding p1 registration",
          "score": 55
        },
        {
          "text": "Household income must be less than $3k/pax. Will bring lulz  when parents try to game that as well.",
          "score": 49
        },
        {
          "text": "the rich girls form cliques within themselves and the non rich kids go together. Spoke to an elite sec sch alumnus who is of minority race and he also shared this experience. Cliques are mostly divided by race - within the race also further divided by SES. And this was not my experience at all in the \"neighbourhood\" schools. My clique got different race, different SES. And going on to sec sch also, express/NA/NT we all hang out after school together",
          "score": 30
        },
        {
          "text": "IRAS huat",
          "score": 23
        },
        {
          "text": "And this was not my experience at all in the \"neighbourhood\" schools. My clique got different race, different SES. And going on to sec sch also, express/NA/NT we all hang out after school together That is really nice. If I had a do over in my life I might have chosen a neighbourhood sec school. Went to an SAP secondary school which only had express stream and my god it was crazy competitive there.",
          "score": 14
        },
        {
          "text": "My friend did that salary give very low for his own company then give dividend instead.",
          "score": 9
        },
        {
          "text": "average across the previous 3 years",
          "score": 8
        },
        {
          "text": "Must live at address for x number of years? Watch the fertility rate decrease. “I can’t give birth yet, we’ve only lived here for x years! We need to hit the minimum first!”",
          "score": 7
        },
        {
          "text": "what merit...? these are primary schools...?",
          "score": 7
        },
        {
          "text": "That's not my experience at neighbourhood school. Race generally don't clique together, though there's no animosity and we like each other. I'm from express and we really don't hang with the NA/NT students. That's the biggest divide in my opinion. Consciously, I think it's because there's no chance of us mixing in classes as we go from sec1 to 4, subconsciously, maybe it's because we have the perception of them being bad students especially with some ah beings and Lians that are loud. But whenever I play basketball, I have the chance to mix with them and there's really no difference. I mean there's only that many people who can hang around with, and we choose those that are similar and look like us. I think social engineering can indeed improve mixing.  Especially since kids nowadays only speak one language.",
          "score": 7
        },
        {
          "text": "Removing slots for 2A and 2B means it's more important to live 1km within the schools in Bukit Timah?",
          "score": 6
        },
        {
          "text": "Why should primary 1 admission be merit based? He got tution a 1yo?",
          "score": 4
        },
        {
          "text": "Now imagine planning years in advance for pri sch placement then have the govt troll you by relocating the school",
          "score": 3
        },
        {
          "text": "Retired second gen huat lo",
          "score": 2
        },
        {
          "text": "this one will be really hurting all the 'popular' schools.",
          "score": 2
        },
        {
          "text": "Like that drive up property price. lol. Not just schools around bukit timah, those popular neighbourhood schools also. Good la. My parents can sell their property for higher price, they live 2 blocks behind a over sub pri school. lol",
          "score": 2
        },
        {
          "text": "Yes pls",
          "score": 2
        },
        {
          "text": "Imagine if they introduce admission exam for P1",
          "score": 2
        },
        {
          "text": "adding even more stress, who will want to have kids even!",
          "score": 1
        },
        {
          "text": "I think also neighbourhood schools dont have enough rich kids to form their own cliques. Cliques formed around interests so we had the football group, the table tennis group, the basketball group, the library gang and the bengs and lians.",
          "score": 1
        },
        {
          "text": "then they should be based on needs such as distance to home, not race",
          "score": 0
        },
        {
          "text": "secondary school days are some of the best days of my life where I reminiscence regularly. i can imagine how you are toughened up during those days and may be best for your career, but damn, i wouldn't give up my enjoyable secondary school journey for getting an (assumed) edge in my career.",
          "score": 0
        },
        {
          "text": "Why would you bring EIP into it? That means in some cases, certain races can easily enter certain schools based off this policy and not merit",
          "score": -4
        }
      ]
    },
    {
      "id": "t3_1qq2ond",
      "subreddit": "askSingapore",
      "title": "Friend in huge car debt - what to do?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qq2ond/friend_in_huge_car_debt_what_to_do/",
      "score": 158,
      "num_comments": 216,
      "created_at": "2026-01-29T16:05:34",
      "selftext": "a friend of mine bought a new car at zero downpayment. His monthly repayment is 3k+ and he is unable to pay off. he is looking to sell off the car, but his settlement amount is 300k, but his car is only worth 200k. Apart from forking out 100k cash to sell off the car, what else can he do?",
      "comments": [
        {
          "text": "0 down payment is a scam. That’s why govt mandates 40/60 rule to avoid such situations. Declare bankruptcy and let the car be repossessed is one solution. Or option 2: use the car to drive grab as a 2nd job to pay car loan",
          "score": 329
        },
        {
          "text": "If he declare bankruptcy, it solves the car problem.  In future, cannot apply for credit card or housing reno loan.",
          "score": 105
        },
        {
          "text": "given the friend got themselves into this situation to begin with, i’d say thats a plus not a downside",
          "score": 30
        },
        {
          "text": "Option 3) Sell off. Then try asking relevant government agencies for help. For example:https://io.mlaw.gov.sg/debt-repayment-scheme/about-debt-repayment-scheme/ Since the amount is less than 150K after selling the car to pay the loan, this option is available. However, need to ownself calculate a bit. If he can drive Grab (as a side gig) and make more than the required amount to pay off every month using the debt repayment scheme, then it would be wiser to just go with option 2. edit: assuming OP's friend sold the car and he's left with 100K payment. The debt repayment scheme allows you to manage the debt but musn't be more than 5 years. So, at best, it would be around $1,677 per month. That means he has to find a side gig or cut down on his expenses. I would personally  go with option 3... Rather bite the bullet than suffer the pain and uncertainty in the long run. You don't know if the car breaks down and how much the repairs would be in the next 10 years or so. Also, how much the petrol price may hike, how automated driving cars may impact Grab in future, what if people are saving up and starts taking public transport instead of Grab, the excess supply of drivers vs demand, .etc.",
          "score": 26
        },
        {
          "text": "0 down payment is a scam Indeed, it always comes with much higher interest rates & you imagine taking a 10yrs loan on that full principal amount. Really siao liao",
          "score": 20
        },
        {
          "text": "0 downpayment or not, why would he even consider a 300k car 🙄 what was the use of having the car anyway? I'm amazed how some people can reach adulthood with nary a shred of common sense. In this case, my best advice is to lose the friend. Don't even have any brains better stay far far away - \"you are the average of the five people you spend the most time with\" Also to preempt those saying the advice would be recommending others to be \"fair weather friends\", it is not. If a friend has been responsible, disciplined, and had any brains, but ran into problems through little/no fault of his own, then sure, offer help in whatever capacity you're comfortable with. This case is complete utter foolishness. Let him stew in his foolishness before he propagates his stupidity with a family.",
          "score": 12
        },
        {
          "text": "Hmm, then your friend may want to consult CCS: https://ccs.org.sg/consumer/debt-management/ The people there will try to assess his situation and advise him. He can make an appointment with a credit counsellor too. Good luck and hope for the best for your friend.",
          "score": 11
        },
        {
          "text": "300k car to do grab. Maintanence and fuel cost will kill his profit.",
          "score": 11
        },
        {
          "text": "The car is 200 k. But the loan due to interest becomes 300 k. Still why would someone whom cannot afford consider a car, let alone 200 k car.",
          "score": 10
        },
        {
          "text": "At this point it's about remaining solvent, not so much about profit",
          "score": 8
        },
        {
          "text": "thanks. but likely he needs the 100k upfront to even allow the car to be sold. so he needs they money from somewhere, then apply for the debt repayment scheme. im not quite sure if this is how it works.",
          "score": 5
        },
        {
          "text": "And a lot of people do not understand that car is basically a deficit, aka money you burn away. Unlike house that even if they lose money it is over 100 years and you can sell it easily while car like diamond the moment it is out of the shop the value drop 1/3",
          "score": 5
        },
        {
          "text": "Second option actually makes sense too by turning it into a side hustle to cover the loan.",
          "score": 4
        },
        {
          "text": "The alternative is -100k.",
          "score": 3
        },
        {
          "text": "OP states worth - doesn't mean price he paid for it. Could have paid $250k for it and now secondhand only worth $200k",
          "score": 3
        },
        {
          "text": "let alone a 200k car? do u know even a simple bread & butter hyundai avante is 200k today.",
          "score": 3
        },
        {
          "text": "Not just the higher rates. Even the early redemption penalty rates on some of the contracts are downright ridiculous if not criminal.",
          "score": 1
        },
        {
          "text": "Got 3 outcome. Profit.\nBreak even.\nLoss. Right now he is in the state of -100k loss. To break even is already so hard, no need to talk about profit until he manage to reach the baseline 0.",
          "score": 1
        },
        {
          "text": "Jesus, I am talking about making profit driving Grab.",
          "score": 1
        },
        {
          "text": "U sure below 160k and the car is quality? Pls list what such car it is",
          "score": 1
        },
        {
          "text": "You want b & b or quality. Pick 1. I just went sgcarmart and sort by cheapest. 1st page are all below 160 k.",
          "score": 1
        },
        {
          "text": "omg. the interest is 100k?! woah it's practically loan shark interest...I don't even dare to get a 200k car when my parents want to give me money to get one.The car prices these days are nuts.",
          "score": 1
        },
        {
          "text": "If you aren't making a profit, what's the point?",
          "score": 0
        },
        {
          "text": "If he isn't making any profit from driving Grab, he's still -100k. That's what profit means.",
          "score": 0
        },
        {
          "text": "I found many new cars below 160 k. I never thought cars like avante is bread and butter. Seems like this brand doesn't bring their cheaper models to SG.",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qqb7ak",
      "subreddit": "askSingapore",
      "title": "Advice on Performance Review Programme (PIP in other words). I am working in a stat board.",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qqb7ak/advice_on_performance_review_programme_pip_in/",
      "score": 157,
      "num_comments": 79,
      "created_at": "2026-01-29T23:13:30",
      "selftext": "Hi all, I have worked in the government job for 10 years, had various stints at statboard and ministries alike. most of the times, I get C or C+, though I never gotten Bs, but I was never the worst performer. Last week, I had been called in for a performance review to be put on PIP.\n\nGranted I am not a stellar performer, but I do my job diligently and try my best. In the first year, I think I was not performing up to standard according to my boss and was asked what are the reasons. I explained that I think there is a job mismatch but I will try my best to learn. However, I find the directions given to me very vague and a lot of times, I just could not nail it. My boss also mentioned that when she hired me, she thought that I am well-versed in handling media. However, I mostly did events  where some were quite high profile and were covered by medias. I guess it is on me that I thought that those were the same as media engagement.\n\nAfter 6 months, I realised that the scope of work is totally off and anything I proposed were just getting shot down. After that, I lost confidence and kept a low profile. I began doing menial tasks, get heavily involved in other department's work. after 1.5 years, I really just cant seem to get the grip of things.\n\nThat said, my bosses were not great, in fact, the entire department were complaining and looking for other job themselves. Naturally, I started the same and was lucky that I scored some interviews. Recently, I have a few second round interviews with other ministries/agencies, and am waiting for official offer.\n\nHowever, last week's performance review came, and they say that my grading will be recorded and it would be shared throughout the entire government record. They indirectly advise me to leave asap but I was adamant to stay for the bonus. We ended with that I will resign when I qualify for my bonus, which when she said to me that my \"bad\" grading would be included and stay in government records forever, and I better secure the offer before its being included as it would affect my future opportunities.\n\nAlso, not to play the blame game, my bosses are getting absolutely pummeled by the senior management team. Our senior management also commented that the middle management (my bosses) are not up to standard, which further validates my view that as much as I am not up to standard, they cannot just pin all the blames on me alone...\n\nLet say in worse case scenario, I get Ds/Es, how screwed am I? Also, I am afraid that once the PRP sets in, HR would inform my potential new hiring agency/ministry that I am currently on PRP and drop me after HR checks... thanks in advance!\n\n*Edit: My bosses also claimed to have provided email coaching, which for the record, I do not receive much. There is not even face to face consultation. When she asked for a piece of work, I would complete it, check through with my colleague (who is supposedly the best performer) and get her green light. But she will come back with not good enough etc. I have recorded and documented our last 3 months email exchanges and I am quite sure not one is a 'coaching' email... Heck, what is 'receiving coaching through emails' anyway???",
      "comments": [
        {
          "text": "Firstly I’m not from gov but not getting the hang of your dept and work after 1.5 yrs, and you’re not afresh grad, seems to mean you really need to change job/dept. And soon.",
          "score": 186
        },
        {
          "text": "Hihi, if you are officially on PIP, you can forgo any intended bonuses. Do try to secure a job role (be it another stat board or not), and leave asap. Can PM you to share my experience on this",
          "score": 136
        },
        {
          "text": "Theres no performance bonus for D grade so might as well leave for another stat board or civil service, at least you’re guaranteed a C grade in your first year.",
          "score": 84
        },
        {
          "text": "Hi, really sorry to hear of your plight. Not sure how exactly Statboards work. But in some companies if you are on PIP or lowest grading you won't get bonus at all. I have a feeling statboards will be similar so do check. Also, do you mind if i PM you some questions like which statboard? Cause I'm also thinking of applying some roles I saw available recently.",
          "score": 40
        },
        {
          "text": "Just resign, better to forgo 1 or 2 month bonus which you can easily recuperate, over a PIP/bad final appraisal grade which will be on your perm record, esp in public sector. If ask why resign during interview, can cook up some BS reason like family emergency or sabbatical.",
          "score": 32
        },
        {
          "text": "It’s not easy to put someone on PIP - they have to document and show they have tried to help you improve and feedback over a period of time before HR will allow. You also minimally need at least two year of D/bad performance. From what you have written, it seems like you have given them enough to work with. Just leave before PiP even unemployed for a while is better than D/E or PiP on record. You can try negotiate with your boss for a decent referral letter, or at least a short one that doesn’t paint you in a bad light. The more you drag it out the more ugly it gets. How your bosses are perceived by senior mgmt is between them. Nth to do with your PiP and doesn’t validate anything.",
          "score": 31
        },
        {
          "text": "If the bad grading becomes official, it will be there forever. I will leave cause it will affect the next X years of progression.",
          "score": 30
        },
        {
          "text": "Yes. But you don’t seem to believe all the advice in the thread. So just stay, get the bonus, and take the gamble and see if you get PIP and the bad grade what happens?",
          "score": 27
        },
        {
          "text": "At most is you don’t work for govt.",
          "score": 23
        },
        {
          "text": "If you do menial tasks for your dept’s work but get heavily involved in another dept’s work, your boss will only consider the menial work which you did when grading",
          "score": 22
        },
        {
          "text": "yes, I am trying my best to get out... but like what i said, i am just really insecure about my current performance defining my future..",
          "score": 17
        },
        {
          "text": "How long have you been in your current position? 10 years in PS but how many in current matters. If you are still in the same position after >2years, it's on you. I have both experience in public and private; I was in a similar position and the difference is the department and bosses did not value my skillsets - they quite literally prefer doing things the same way for >10 years and it was very painful. It was the equivalent of explaining an iphone to someone living in the 1940s; what they cannot comprehend, they fear and distrust. So I looked for somewhere that valued my skills much more. Today my pay is much much higher and I am very valued in the current company - the old place? Still doing things the same old way. Took me only a year+ to figure out the misfit and take action to correct it. Anyone who complains about their bosses and takes no action themselves, have only themselves to blame. If one is truly good, you will find your value somewhere, or, find what is valued and learn it to be of value to others. Also based on your actions, hiding elsewhere, doing menial tasks, doing (unrecognised) work for other departments, you have yet to learn needed basic workplace skills. Your bosses are mediocre but you have your ownself to blame for much of the current predicament.",
          "score": 13
        },
        {
          "text": "This should be easy to grasp. Things like a bonus for a poor score should be well-documented in HR policy. A typical PIP requires multiple years of bad performance or multiple warnings. It is unlikely to be abruptly given as employee can dispute.",
          "score": 12
        },
        {
          "text": "My bad. Actually from reading OP’s replies I can see why their bosses are done with them lol.",
          "score": 12
        },
        {
          "text": "Hey each stat board has its own HR policy usually. And experiences can differ wildly within a single stat board nvm across them. I am unsure how useful OP can be to you in such circumstances. (Also sorry OP I don't know how PIPs are treated at your org but wtf your bosses suck.)",
          "score": 10
        },
        {
          "text": "Perm",
          "score": 9
        },
        {
          "text": "Monday might be the last chance for you to clarify with your boss. You raised valid questions such as the 3 months period , quitting now vs quitting after 3 months. At this point, I think your boss would answer you these details if you asked explicitly. But if you don’t explicitly ask, he may avoid sharing those details with you because he wouldn’t want you to go tell HR “my boss said this so I can xxx”.",
          "score": 5
        },
        {
          "text": "Resign today Friday",
          "score": 5
        },
        {
          "text": "I did not have 2 years of D/bad performance though... so I should leave before PIP end right? cause its starting next Monday hence I would have to resign over the weekend if it is before PIP kicking in...",
          "score": 4
        },
        {
          "text": "sure, please dm me any questions you have",
          "score": 4
        },
        {
          "text": "Need to put the /s clearly in case OP totally misses your point",
          "score": 3
        },
        {
          "text": "Indeed",
          "score": 3
        },
        {
          "text": "even if i quit and join a new agency?",
          "score": -9
        },
        {
          "text": "Hi , can I PM you? I am also looking out for SB jobs",
          "score": -9
        },
        {
          "text": "Thanks for the advice. Would like to ask if the record is only permanent when its at the end of 3 months' period?",
          "score": -14
        }
      ]
    },
    {
      "id": "t3_1qqhfic",
      "subreddit": "askSingapore",
      "title": "Anyone else applied to 1000 job postings?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qqhfic/anyone_else_applied_to_1000_job_postings/",
      "score": 91,
      "num_comments": 49,
      "created_at": "2026-01-30T02:53:46",
      "selftext": "I applied to about 1000 last year\n\nI see people giving up after 150 and i think its crazy its not hard to send applications.\n\nAnyway i landed two offers but not directly related to my degree\n\nBut it took crazy grinding. Am i the odd one out?\n\nedit: am essentially a fresh grad no real swe experience and in tech\n\nit was over a period of 8 to 9 months and i applied even to listings up to a month old and i focused on all tech entry level jobs or jobs not directly tech but accepted tech background, these contribute to the high numbers\n\nand NO i did not apply to any random posting i read all the JDs, it was highly targeted and i'd leave 20% for the maybes and i landed 2 of the maybes.\n\nSME,MNC, Startups all of them\n\nAnyways please dont take this as a complaint, i just found my experience through this process pretty interesting and wondered if anyone sent so much too, all is well!",
      "comments": [
        {
          "text": "It’s not hard to send applications but neither should we apply for a job we don’t like or know we will wanna quit in 3 months or a year…",
          "score": 124
        },
        {
          "text": "No idea how many I applied to in total across different platforms + cold messaging people on Linkedin/emailing directly, but definitely in the hundreds. Only ever got one interview from all that (no offer), ended up working for a few months at a startup I interned at but it ran out of money and shut down. In the end I started my own business, better than trying to find a job in this market haha",
          "score": 51
        },
        {
          "text": "So your interview rate is 1 out of 500 application that is send out? That's pretty bad. That's like a 0.002% hit rate, most people would try to strive for a 5 to 10%+ hit rate. I'm gotta make some several assumptions since your post doesn't contain a lot details. Have you tailored and/or gotten someone you trust to look at your resume? I notice a quite a lot of people have terrible resumes, from poor and unreadable formatting, obvious mistakes, and very generic description like \"I do x\" instead of \"Did X, managed to help company to save Y amount of money, and led to Z improvement\" I'm assuming you are not a person who just graduated from a boot camp applying for PM, design, tech, or some other oversaturated and disrupted fields. And you applying for roles within your weight class.",
          "score": 36
        },
        {
          "text": "I’m on the other side in a hiring position. I can tell which resumes have been spammed. It is bad, references to irrelevant experience, sometimes candidates don’t even bother to change the company name on the intro field. ChatGPT is free, at least do a pass there. I’m sure there are people who are great at spamming which we don’t notice, but if you are doing a 1000 and only getting back a couple non-relevants, sound like it is time to change strategy.",
          "score": 30
        },
        {
          "text": "Designing and manufacturing work, custom parts or small batch production for a specific niche. Most of my customers are in the US or EU, the Singapore market is too small to be profitable.",
          "score": 22
        },
        {
          "text": "i wish you all the best in your business!",
          "score": 12
        },
        {
          "text": "the reason why people are spamming only around 100s is because they are going for jobs that are \"related\" to their studies.. do you think there are 1000 jobs that are available that is related to your studies? some dislike getting a job that isnt relevant to their studies as it isnt in their interest to work just for the purpose of getting a job but good for you for landing a job in this uncertainty.",
          "score": 9
        },
        {
          "text": "That is quite bad tbh. I’m far from an expert but would say you should change up your tactics for this year. \nSee it as a game. Figure out the mechanics. Posting here is a good start. \nMany people still get hired through their network. Do you know anyone in the field? \nMaybe opt to help someone out.. doesn’t have to be for a job directly but maybe you could assist someone with something and that gets you in the door. I’m thinking outside the box here... Like when marketers market a product and only afterwards connect with the company and say, here I did this, wanna hire me? \nBut mostly, I would say, be inventive. The people that you want to work with hang out somewhere and live somewhere, meet people somewhere and connect and go from there maybe? And lastly, don’t go nuts. Be a job seeker for 2-3hrs a day. Full time will drive you nuts. Rest of the day, work on bettering yourself. Relaxing, reading, gaming and workouts? Maybe add to your skillset by taking courses etc. Good luck man. Hope you land something soon.",
          "score": 8
        },
        {
          "text": "I realized cold apply usually result in a very low hit rate. So I’ve decided to up my game a bit, I will list down all my experiences, get the job description that i’m applying, throw to ChatGPT to ask me generate the resume needed to at least clear the ATS. Hopefully this will up the game.",
          "score": 7
        },
        {
          "text": "Spray and pray. Have you considered trying to spend the time to do A/B testing on your resumé and even adjusting your resumé for the job? Rather than do a generic resume that can spam jobs, how about looking it from the HR perspectives and asking yourself if I am HR, what do I want to see from this person in this job?",
          "score": 5
        },
        {
          "text": "I personally wouldn't count applying on mcf and LinkedIn easy apply into your statistics anymore because most of the times they are just obligated to public announce the roles when they already found candidates through refferal or internal hires. I've applied close to 2k if we were to use that as a metric but realistically writing emails and applying directly on company portals it's around 700 for me. If youre getting 0 responses afte for interviews then it's highly a resume formatting issue since ai scanners are starting to be the norm for hiring process. I've been scouted by a couple of companies including meta for interview cause they found my resume but I flopped the interviews cause Im not really a top level engineer. But it tells me at least my resume isn't the limiting factor for job hunting.",
          "score": 5
        },
        {
          "text": "my job rate, but my rate of interviews was horrible too i believe about 2%",
          "score": 4
        },
        {
          "text": "Hello i feel u. Been there done that and over with. So i read some of the other comments and though that one dude didnt phrased it in the nicest way, man’s got a point. U have to cater ur resume for the roles u apply. Just sell the shit out of urself even if ur skillsets aren’t as glamorous as it sounds. If u just came out of cs degree, python’s one of the most sought after skills, put that in the resume and maybe a Git link to a sample app, no need for anything fancy. One that demonstrates ur understanding of algorithms and if u have the time which u probably do, design a well structured one. One that caters to the user’s interactions (UX and UI) impresses most. It could be an app or site that only has a basic page with a list of products on it or whatever, and a login page. If u dont have any of that, then i think it’s time to brush or pick up some skills… youtube and chatGpt is a good source to develop one. Interviewers would be interested in ur thought process during the creation of the app/site - why did u design it this way? How did u do this login page or how do u authenticate and authorise the users? Is the site/app scalable? What’s the architectural design behind this (mvc, mvvm etc)? Thats only if u dont have buffed portfolios like 90% of the fresh grads out there… i have some crazy fresh grad friends that participated/won hackathons, interned at some big named companies and/or has personal projects that can blow one’s minds… Make ur resume stand out and highlight ur best points, essentially coming back to my point - sell the shit out of urself. Always ask urself why would they want u? I hope that helps, good luck!",
          "score": 4
        },
        {
          "text": "What’s your business about?",
          "score": 3
        },
        {
          "text": "the Singapore market is too small to be profitable. Most startups run into this problem, and then bleed out on rental",
          "score": 3
        },
        {
          "text": "LoL, ya know what. Build an n8n that will let you screen and submit 100 application in a click. The moment you get 1 interview, just say i automated my search and apply process that allows me to apply for 1000 jobs in a week. They're either be impressed or horrified. If you know, or know how to ask copilot, you can build a headful selenium python app that lets you crawl and through known jobsites after you login and save the apply links. Then use a separate script to login and mass apply.",
          "score": 3
        },
        {
          "text": "What roles did you get? How are the compensation packages?",
          "score": 2
        },
        {
          "text": "Fresh grad always harder to get through the door de unless they ask for super below market rate",
          "score": 2
        },
        {
          "text": "How many of your \"applications \" include an actual human referral ? Otherwise, online applications are typically useless. You are better off speaking and networking your way to a job.",
          "score": 2
        },
        {
          "text": "I think I have applied to more than 1000. Things are tough.",
          "score": 2
        },
        {
          "text": "Based on the new updates am essentially a fresh grad no real swe experience and in tech Yeah. Tech industry is incredibly terrible right now due to multiple of factors (e.g. AI, Trump, outsourcing, weaken economic outlook, tech bubble burst, bootcamps) I know a couple of 5 to 10 years veterans who are still jobless for more than a year now. The situation is much more grim for fresh graduates who is now completing with more experienced professionals who is willing to price themselves lower. I also notice the tone from tech recruiters who give career advise have change and become more pessimistic, from \"Just cold call and tailor your resume, you will land a role within months\" to \"Expect not being able to get in the industry for 1 to 2 years\" i applied even to listings up to a month old and i focused on all tech entry level jobs or jobs not directly tech but accepted tech background, these contribute to the high numbers Is good that you apply for adjacent roles, consider applying for roles that need your skills and capabilities, even if is not an even 50% match from your expectations. Here is what I recommend/suggest: Option A - If you really really want to get into tech: A stellar resume. A lot lecturers and some career consultant give shit advise on resume because they have been out of the force for a quite awhile. Avoid those aesthetics resume, I notice a lot of my SWE pals have \"fun\" looking resumes that are very difficult to read for HR/recruiter, so they end up in the discard pile. See what common phases and keywords that is written in the JDs, try to input those keywords organically and tailor it. Use ChatGPT if you need help but DON'T BLINDLY ACCEPT IT, take a scan, it has tendencies input random achievements. Expand your network via hackathons, voluntary, networking events if someone has a connection in a role you are interested in they can refer you in organisations or give you advise. This also shows you are passionate about the field. I landed in my current role, because I met 2 people in a community event, one of them give me tips on what to say for that company and other is the colleague of the interviewer, so they vouched for me. Upskill yourself, show you are passionate and willing to learn. Explain how such skills/courses make you a more valuable employee. \"I learn x software, which means I can assist and read Y\". As you scan the JDs, keep a lookout on common skills and keywords they used. Continue be open to roles is adjacent to the industry and roles you have the skill for, since you need a foot in. Example, data analytic, Quality Assurance, Business Analytics, IT Support etc. Lastly, I want to acknowledge the feeling and the experience you have is valid, the economy for tech is bad. Is quite common for people who end up in jobs that they didn't study for in.",
          "score": 0
        },
        {
          "text": "where did u put ur resume to be scouted?",
          "score": 0
        },
        {
          "text": "I'm not sure how but the meta recruiter found me from mcf. Foundit/monster is another platform but most of them are automated spams.",
          "score": 0
        },
        {
          "text": "I don't know why people think sending out 1000 job applications automatically mean that the applicant is the one with problems. I also remember sending out 600+ applications when I was jobless after getting laid off (not now though). Even with years of experience and a tailored resume, it still wasn't easy. The job market IS shit.",
          "score": 0
        },
        {
          "text": "im not trained in HR, where do i start?",
          "score": -4
        }
      ]
    },
    {
      "id": "t3_1qq0fly",
      "subreddit": "askSingapore",
      "title": "What are the best towns to live in Singapore, and what makes them good in your opinion?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qq0fly/what_are_the_best_towns_to_live_in_singapore_and/",
      "score": 86,
      "num_comments": 129,
      "created_at": "2026-01-29T13:58:13",
      "selftext": "As per title, just curious to hear everyone’s thoughts on what makes a town great to live in (accessibility, amenities, food, etc.)?",
      "comments": [
        {
          "text": "Marine Parade - a bit of culture but not too pretentious as of yet, though some factions in Katong area are over-designed for expats. Near to East Coast Park, can cycle to Changi or MBS. Good mix of schools, HDBs/Condos/Landed. Classic Parkway Parade and its surrounding area. Travel to the past with Roxy Square and Katong Shopping Centre. Dakota/Paya Lebar - Chill and off-central. There's Geylang (the only authentic place in Singapore), decent shopping malls (good indonesian food in Kinex/City Plaza), Haig Road Hawker Centre, and Sports Hub. Go further up abit you get Geylang Serai. Tanjong Pagar - Amazing mix of HDBs, and private properties. Shophouse landscape with good mix of lame stuff and cool stuff. Maxwell hawker centre. Go down a bit to CBD or Chinatown. High ses and low ses mixed together. Bukit Panjang - Away from everything. HDBs are not too eerie like a Sim City simulation as there;s variety. Bedok - a town with some character, like a real set on a mediacorp Channel 8 show. Good hawker centre, decent shopping malls. Swimming complex.",
          "score": 92
        },
        {
          "text": "Grew up in Katong/Siglap, moved to Tampines, then Bukit Merah after I got married. Every place I've lived has its own charm and amenities, and comparing them like this would be a disservice and possibly tarnish some of the great memories I have of each of these places. Katong has super chill vibes and fantastic food. Proximity to the beach and lots of old school shophouses. Note: this was before the mad condo development and gentrification rush, so ymmv now. Tampines was the HFH 92 community winner, but when we moved there, there was no MRT and a tiny bus interchange at the end of a road. It's URAs town planning experiment done super by the book, and it shows. We used to joke that we didn't need to go anywhere else in SG because you had everything you needed at TPC. Bukit Merah, super central, so it's a short hop to town, with really cool heritage sites nearby. Older (again, gentrified) neighbourhoods with interesting architecture. Sentosa is 10 mins away, and new developments upcoming intending to revitalize the southern waterfront. Should be an interesting next few years.",
          "score": 80
        },
        {
          "text": "my fav is beauty world close enough to greenery with the rail corridor\ngood mix of old school amenities and cafes\nnot prohibitively crowded close contender would be east coast area",
          "score": 62
        },
        {
          "text": "Telok Blangah. Relatively chill and laid back hood. HarbourFront/Vivo, Sentosa and CBD is just a stone's throw away. Lots of nature and greenery here, southern ridges and Labrador park is just next door. Lots of hawker centres nearby too - Telok Blangah, Telok Blangah crescent, Seah Im, Bukit Merah, Redhill, Alexandra Village etc.",
          "score": 46
        },
        {
          "text": "Yeah Bukit Panjang and Tanjong Pagar east side",
          "score": 38
        },
        {
          "text": "lolol there’s no comments about north east",
          "score": 24
        },
        {
          "text": "Cause East side best side.",
          "score": 21
        },
        {
          "text": "Bedok has so much good food, you won’t be bored.",
          "score": 18
        },
        {
          "text": "Not having to leave Tampines because you have everything in Tampines was legit. Showing my age here but before Tampines Mall, Century Square and all the office buildings came up, we had to go to the central area for a lot of retail, f&b, services and entertainmet.  After TM and CS came up, we could just go to Tampines Central to find those same retail, f&B, services and entertainmet. Now different lah.  No need to leave home at all.  Almost everything can be done through the phone. Remember when 3 out 5 of the Easternmost MRT stations had an overload cinemas?  Watch a movie on weekdays and you practically had the whole theatre to yourself.  Good times.",
          "score": 13
        },
        {
          "text": "This is the only answer. Other nature areas in Singapore are useless as they come without shade.",
          "score": 12
        },
        {
          "text": "It developed too fast. Everything looks the same.",
          "score": 12
        },
        {
          "text": "People here turn to dust when exposed to sunlight. You won't find anyone who bitches more about the sun than locals in nature areas :)",
          "score": 9
        },
        {
          "text": "Joining the estate in 2031 when my bto at Berlayer residences is ready",
          "score": 8
        },
        {
          "text": "Yeah!! really love Telok Blangah. Very calm and serene and close proximity to central",
          "score": 6
        },
        {
          "text": "Lucky you!",
          "score": 6
        },
        {
          "text": "Why all east one",
          "score": 6
        },
        {
          "text": "This is the actual reason.",
          "score": 6
        },
        {
          "text": "Siglap has very old money vibe imo",
          "score": 3
        },
        {
          "text": "you mean it's walkable even during sunny days? (genuinely curious)",
          "score": 3
        },
        {
          "text": "And a lot of scenic bus routes that goes to CBD then to Eastside You can just board a bus and enjoy the ride",
          "score": 2
        },
        {
          "text": "TB Represent!",
          "score": 2
        },
        {
          "text": "Not the entire rail corridor la, but enough parts of it. I think if u don't go to the Buona vista direction it's doable, I've done it at the noon timing before. But not like 100% shade either",
          "score": 2
        },
        {
          "text": "I mean no mention of far west, cck etc also mah",
          "score": 2
        },
        {
          "text": "I love Bukit Panjang because of it not being too crowded. Goated DTL and 190 bus.",
          "score": 2
        },
        {
          "text": "Thanks! Modest 3 room only… 4 room is Soo expensive",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qq0bzc",
      "subreddit": "askSingapore",
      "title": "do you work nonstop during work my hours?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qq0bzc/do_you_work_nonstop_during_work_my_hours/",
      "score": 80,
      "num_comments": 52,
      "created_at": "2026-01-29T13:52:52",
      "selftext": "currently on my internship. question here for my working brothers/sisters\n\nfor a white collar job (8-5), do people actually work nonstop from 8-5, less their meal break?\n\nhow’s that possible mentally. if not, are there people who are acting busy, scrolling social media, etc?\n\nplease share your experiences!",
      "comments": [
        {
          "text": "just pick up smoking and you will have a 36 hour work week",
          "score": 128
        },
        {
          "text": "Difference in intensity. High intensity = less time working by prioritising and scheduling it over time. Low intensity = normal mode Nobody can work at high intensity all the time. It's the field of human ergonomics and that's why air traffic controllers have mandatory breaks for the hours they work",
          "score": 125
        },
        {
          "text": "The key to surviving corporate life is to successfully merge looking busy and actual busy seamlessly. Then you will always be busy in the eyes of the others. I have spent the last 27 years in corporate life. The way to always be busy is to work at the actual tasks, and when a little down time is available. Work on an interest related to work, for example building a spreadsheet or automating processes to make your work more efficient. In my case, these small projects actually help me mentally during work hours. As and when it suits your purpose and positioning then you will have projects which will raise efficiency at your disposal for company wide usage to be shared during management meetings etc. Your profile will then be built as the \"useful\" person in the company. Scrolling social media is not the way to go in a professional setting unless it is your lunch break.",
          "score": 52
        },
        {
          "text": "Oh my sweet summer child~",
          "score": 49
        },
        {
          "text": "the answer is very obvious\neven as an intern currently..do you work every second every minute of your time as well non stop? not every job has \"non stop\" work..it isnt like a manufacturing plant where the workers stand there arranging and aligning product that is being manufactured in the process like some factories overseas therefore you should know the answer by now",
          "score": 36
        },
        {
          "text": "nursing kinda feels like working nonstop a lot, esp for am shift in inpatient and pm shift for ed. there are lull periods tho sometimes where ppl will usu use phone for a bit or reset the workstations for later. but usually it feels like non stop work hahaha (probably cuz we are usually understaffed-)",
          "score": 25
        },
        {
          "text": "Fucking true sia. Smokers go puff 2 times a day upper management ignore. I go teabreak with colleague to discuss work stuff kena ding",
          "score": 21
        },
        {
          "text": "Don't even have to smoke, just carry around a pack of cigarettes",
          "score": 12
        },
        {
          "text": "Hahahaha. So True.",
          "score": 9
        },
        {
          "text": "It's all relative tbh. My hyperfocus mode can put me at regular 6h high productivity cycles lol and I feel great after, forget abt toilet water food or standing/stretching, I literally don't move for that 6h. At extremes have sometimes gone 48h with only one 3-5h sleep in between, tho of course will feel like shit after Plus we've all heard of those supersleepers who naturally run on like 4h of sleep a day",
          "score": 9
        },
        {
          "text": "Depends on the industry/period. I felt like i was working non stop 95% of the time, alongside endless meetings and client calls. I think hence the burn out.",
          "score": 9
        },
        {
          "text": "Haha the look stressed work stressed tactics.. Anyways strolling socials during work is unprofessional.\nReddit isn't social media right? /s",
          "score": 7
        },
        {
          "text": "Go refill water at pantry, toilet breaks alr collectively take up a fair bit of time due to multiple times. Plus come in office slightly later than usual. Lunch hour come back at unofficial timing of 2pm hahah",
          "score": 5
        },
        {
          "text": "Kinda. As for the why....insert all the typical stereotypes of singapores working life for any person wanting to outwork the rat race. Whatever you heard about working life ? Its all true. Welcome to the fields buddy.",
          "score": 5
        },
        {
          "text": "When you or your friends gaming, do they game all day? Do they scroll here and there? Same thing",
          "score": 5
        },
        {
          "text": "bedside ward care aka inpatient ward is most busy during am shift. most of our adls are done during this time, like showering patients and changing diapers/bed sheets. a lot of tests like blood work or other specimen collection or doctor rounds are also usually during am so we may need to help then",
          "score": 3
        },
        {
          "text": "Chill not antagonising you or anything lol. How i wish i could take a sabbatical leave tooo. My take is that just a few glances isn't killing anybody's focus at work but I can't stand people fullon engaging with their phones while teammates are drowning in work.",
          "score": 3
        },
        {
          "text": "it depends some days is whole day work other days like today are more chill.",
          "score": 3
        },
        {
          "text": "How about bedside ward care?",
          "score": 2
        },
        {
          "text": "I on sabbatical and chilling at home. If I am at work then my phone is usually on the desk as WhatsApp will be answered on my laptop.",
          "score": 2
        },
        {
          "text": "Did you think workers get hourly reminders to rest? We don't have a bell ringing to end the period.",
          "score": 2
        },
        {
          "text": "Ok thank you for clarifying Also I'm just curious, what do you think of the pay in nursing for degree holders? Like do you think it's good? I mean nurses are not paid enough for the amount of work they do in the SG Public Healthcare System at least.",
          "score": 1
        },
        {
          "text": "its liveable,,, and i think once u climb the ranks and get seniority u can get decently comfy? but lowk ya imo in the public side idt we're rly paid enough for the things we do 👀",
          "score": 1
        },
        {
          "text": "Currently what's the starting pay for a fresh out of Uni inpatient nurse?",
          "score": 1
        },
        {
          "text": "You smoking crack son?",
          "score": -3
        }
      ]
    },
    {
      "id": "t3_1qqpliz",
      "subreddit": "askSingapore",
      "title": "Nursing SG: How is it really like working as a new nurse?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qqpliz/nursing_sg_how_is_it_really_like_working_as_a_new/",
      "score": 49,
      "num_comments": 25,
      "created_at": "2026-01-30T08:03:58",
      "selftext": "I graduated in 2025, but I took about a year off before starting work to rebuild myself and focus on my mental health, which honestly deteriorated during internships. Nursing is not for the weak, and I don’t think people talk about that enough.\n\nA lot of my friends started working immediately after graduating, but many of them quit nursing very early on.. some within 2 weeks, some after a month, some within a year. Almost all of them said the same thing: it wasn’t the workload itself that broke them, but the environment. The way they were treated by senior staff and colleagues, and how toxic the ward culture felt.\n\nOne of my friends shared that when she first started, she felt ignored whenever she asked for help. Some people were rude, impatient, and expected her to know everything from the start. She wasn’t even given time to adjust to different systems, protocols, or ward routines before being judged.\n\nShe also said she felt like an outcast and completely alone. Sometimes being in a crowded room can still make you feel incredibly lonely because the people you work with are what often make the job bearable or unbearable. Supportive colleagues can make even the hardest shifts manageable, while a toxic team can drain you faster than the workload ever could. I know it’s easy for people to say “you need tough skin,” “just persevere,” or “don’t take things personally,” but when you’re new, anxious, and genuinely trying your best, that kind of environment can really wear you down.\n\nI want to be a good nurse, and I do care about patients. I’m planning to start working soon, but I’m anxious about entering a workplace where asking questions makes you feel stupid, where mistakes aren’t treated as learning opportunities, and where burnout feels inevitable.\n\nSo I’m genuinely asking:\n\nWhat was your experience like as a new grad nurse?\n\nDid things improve after the first few months?\n\nIs toxic ward culture really that common, or does it depend on the ward or hospital?\n\nAny advice for surviving the first year without completely losing yourself?\n\nI’d really appreciate honest answers.. the good, the bad, and everything in between.",
      "comments": [
        {
          "text": "Toxic work environment is one thing. Feeling like a foreigner in your own country while everyone is speaking in their own mother tongues and you not understanding anything is another.",
          "score": 55
        },
        {
          "text": "For a male nurse, I felt it was abit tougher cause all your female peers went straight in after their PRCP so they were kinda in tune with the ward and etc. I have a 2 years gap so gearing up as a new nurse was abit tougher. It really helps to get a good preceptor to support you. But this is kinda of luck based. I had a good preceptor that looked out for me and guide me through my first few months. I seen my other batch mates get a ... not so friendly or experienced preceptor then gg. Might help to voice up to your sister if you and your preceptor are not working out. But it sometimes backfires and make you look like a difficult young nurse. Does it get better? It gets easier when you get better at your job and know the routine. But its still tough even for an experienced nurse. You gotta keep learning as much as you can in a really short period. Dont shy away from difficult situations. But know your limits and don't put patients at risk just because you think you know how to do it. A shift with all your friends, knowing everyone will support each other is a dream. I had 1 shift with all our friends, we had 3 resus in a shift in a GW but fuck we felt invincible cause everyone covered for each other. But a shift with shitty co workers makes you very lonely. Nursing is tough and all the best, find good people you can rely on. I wasn't able to last too long cause of toxic management, out after 2 years but still in healthcare.",
          "score": 22
        },
        {
          "text": "I was nervous as a new grad nurse, which was quite natural. All new nurses are obviously afraid to make mistakes that would jeopardise patient safety. You will naturally be abit slower and not all nurses will share about what you have learnt so far. So don't take it it personally if they assume you have learnt a particular skill. Just tell them that you have only done it once/not learnt it before so they can manage their expectations. You might receive harsh comments but you will also make great connections. Try to reflect on the good when you encounter the bad to psycho yourself if it helps. Things might get better after a few months. Reason why i say might is because it depends on your ability/willingness to learn. When you are more competent, naturally people will trust you more and value you more as a team member. You should be receiving less criticism after a few month to a year. BUT all my years of guiding new nurses, i have seen two cases that often get criticised even after they have been working for a year. the ones who have an ego and don't want to listen to constructive feedback. And they think the seniors are being harsh to them. Basically very difficult to teach these kind because they don't self reflect. the ones who just cannot seem to grasp a skill/concept. Maybe they did or did not do their homework or they don't self reflect after work. Please try to understand the POV of the seniors who have been guiding you for a year and need to keep repeating themselves. People also have a limit to their patience too. To those who mentioned about not feeling like a citizen within their own country, maybe it is their ward dynamics idk. But the locals do speak in their own mother tongue too which outcasts the foreigners. It takes two hands to clap. Always put patients safety over everything. Think before you do anything. If you think being slow is being safe despite patient is deteriorating, reevaluate that mindset. Likewise, being fast and being unsafe is also not good. Long story short, learn to prioritise your task to make your life easier so you can go home on time.",
          "score": 11
        },
        {
          "text": "This!! Exactlyy 😭",
          "score": 9
        },
        {
          "text": "If a ward consistently makes you dread coming in, it’s not weakness to leave. Good nurses don’t have to suffer to be valid",
          "score": 9
        },
        {
          "text": "Hmmm ethnic relations and toxic colleagues aside. You can see all those types of posters everywhere can already deduce it is NOT a super fun job... \"dear patients pls don't beat up our nurses\" \"Don't verbally assault the nurse\" \"Don't troll the nurse\" etc Not easy one. My respect to all our nurses. Furthermore not all of them were awarded covid medal or got increments even if they deserved.",
          "score": 8
        },
        {
          "text": "In nursing for around 5 years, not senior by any means. Nursing is a job with a very steep learning curve, from learning to get good at your nursing skills, to learning to deal with difficult colleagues and patients. All while juggling your responsibilities outside of work and on a rotating shift schedule. Time management and emotional regulation is part and parcel of the job. The first 2 years of nursing is grueling, i remember wanting to quit and do something else, but in the end chose to stay on due to life commitments. But after you get the routine of shift work, you get your skills locked in, you know how to deal with colleagues and patients, you are rewarded with an above average blue collar salary. The friendships you build in nursing is something to be treasured as well. I live for the days i work with my friends, it can be 5 nurses against the world and i will be happy. My advice, what exactly do you want? If you want to leave, you should do it before life commitments drag you down, and you’re stuck in this job. If you want to stay, you have to get better. Get better at your job, get better at dealing with colleagues and patients, get better at regulating your emotions. Young nurse, you can do it. I believe in you.",
          "score": 8
        },
        {
          "text": "Yea so relatable. Working in an enviroment where the majority just converse in Mandarin & ignore the non-Chinese staff.",
          "score": 5
        },
        {
          "text": "1) Had a very toxic CI during my PRCP days, literally hated by her fellow staff, students and School instructors. In a way she trained me to be very thick skin. 2) Work environment is honestly a hit or miss. If you don’t like it just throw paper during your probation and go to a new hospital or cluster.",
          "score": 5
        },
        {
          "text": "Some of my friends realised nursing wasn’t for them and went on to sign on, cabin crew and sell insurance.",
          "score": 3
        },
        {
          "text": "I'm not a nurse but I understand the toxic work culture. It seems more prevalent in frontline work and I'll never understand why one has to treat someone else like that. I get frontline work is stressful, but this pushes the idea that we should be supporting each other more through the hard times and not wasting energy to try and bring someone else down. And I think all these stems to a much deeper root cause if it's not localised to one industry.",
          "score": 3
        },
        {
          "text": "The beginning was tough. I was always ready to run when things got hard but somehow managed to hang on till now. Yes and no? Sometimes things will seem to get better but then suddenly you’ll be faced with a setback. The adjusting period is different for different people. Yes and yes. Try and absorb as much as you can the first few days. Observe and learn the routines. The faster you adapt and start being independent, the faster you gel with your colleagues. (Cause they will appreciate you helping them with the workload.) Learn the people also. This is suuuuper important. Know who to go to and when is the right time to ask questions. If its a really important matter of course clarify your doubt otherwise wait till whoever you plan to ask is a bit less occupied then you’ll get proper answers (and hopefully without sass). Oh and also don’t be so defensive. I realised most people don’t like hearing excuses when correcting someone. The most common issue you’ll encounter (at least for my workplace) is different practices being taught to you. It could be really confusing but try and sieve the information and follow the people you trust (those who practice the right things). Therefore the emphasis on knowing who knows their things and who doesn’t. All the best!! It does eventually get better! Really helpful to have some support system so find people you can talk to.",
          "score": 3
        },
        {
          "text": "Coming from an experienced but relatively young nurse-my advice is to exercise judgement and constant reflection especially when you are new. You may know certain things , but your seniors have been through the beginning and have more experience than you. Experience > knowledge /theory. You need to go through the bad to get to the good. When a senior corrects you, or \"scolds\" you, always say thank you and sorry. Don't need to say or defend yourself too much because it will make you look bad in the end. Constantly reflect after every shift and improve each time, and people will see it. A fast nurse may not always be the safest. But a teachable nurse (even if it means making mistakes, which can be inevitable) will always be the one who brings wisdom. Patient safety is important, so always exercise judgment, but when mistakes happen, it is always a good opportunity to learn (not only yourself, but  systemically), so don't beat yourself up. Environment can be hostile but there will always be places where your experience will be valued. continue to be curious, be hungry for knowledge, continue to learn. You won't lose your license unless you purposely kill a patient, which I believe 99% of the nurses don't.",
          "score": 3
        },
        {
          "text": "for real. sometimes i’m one of the only or only local in my entire shift…",
          "score": 2
        },
        {
          "text": "New nurse here, 7 months in. I didn’t get the department I wanted (ICU/HD) so I got into GW and its contact ward which initially I thought was gonna be so horrible cos of all the donning and duffing. But nope, that wasn’t horrible. I adapted pretty quickly and I prefer my current ward over my PRCP ward. The staff during my PRCP was toxic and bitchy as hell even tho it’s a discipline I enjoy, I didn’t choose to go back. My experience so far has been positive. My NCs are quite supportive and do check in every here and then. I also get along well with most of my colleagues now, we laugh, make jokes and can basically chat a bit. There was an annoying ANC that pissed me off because of her remarks but turned out everyone didn’t like her too and she transferred to another unit few months after. Things improved for me. I was able to show my preceptors and NCs that I’m competent so that gained their trust faster. As a new grad nurse, you really have to study a lot after graduating and read up all your hospital protocols. There are so many protocols and workflows even now I’m still reading up and my SSNs also have to refer sometimes. I’d say this largely depends on the ward. Hospitals in general have toxic working cultures but the ward itself really depends on your colleagues. My colleagues are not that bad, there are 1 or 2 that are annoying but they don’t matter much and I’m a firm person so most of the time they’ll listen I’m still in my first year so can’t comment much. All the best to you!",
          "score": 2
        },
        {
          "text": "go work as a HCA; no need to reveal that you have a nursing cert. There are a lot of places looking for locum HCAs and nurses. Yes you will take a paycut, but it will be worth it to reduce the anxiety and stress you face when you're working as an actual nurse. The point is to determine how YOU cope in a ward setting. Small things like your footwear/ compression socks, how you want to dapao your meals, your routine for preparing for AM/ PM/ ND.",
          "score": 2
        },
        {
          "text": "Thank you for sharing this and the advice :)",
          "score": 1
        },
        {
          "text": "Thanks for the detailed advice, I appreciate u sharing ur perspective. I’ll keep this in mind moving forward",
          "score": 1
        },
        {
          "text": "To add on, never be afraid to ask for help, to ask for a second set of eyes, or escalate any situation. The most dangerous nurses are those who don't even know they made a mistake.",
          "score": 1
        },
        {
          "text": "Just tough it up for one two years, don’t quit until they fire you. Then migrate oversea",
          "score": 1
        },
        {
          "text": "I don’t know well enough but do hang in there for first few months",
          "score": 1
        },
        {
          "text": "First of all thank you for choosing to become a nurse. As a person who has been under nurses care for months, nurses have special place in my heart. From my point of view, hospital is very fast pace, stressful place and running 2 threads at the same time. 1st one is patient care, 2nd is protocol/SOP. Nurses are primary care providers and doctors are like project managers. Those words in your post as other people told you are indeed correct to some extent. Let me assure you, they are not easy thing to say. There are also bad patients (personally witnessed) who are violent and ended up restrained to the bed. But most of us are really grateful to receive your care. Also please take care of your own happiness and well being too.",
          "score": 1
        },
        {
          "text": "Never worked as a nurse but as phlebo in wards, clinics. It honestly looks brutal and I kinda feel like most workplaces are like that. That's why many workers don't feel supported and burn out. It's not only the patients or their family members, it's also your own team. There are people in the team who will provide support and help you definitely. Need to keep your wits about you and take a breather when you can. Working in healthcare is like being in a high pressure pot, everyone's agitated, tired, stressed, etc. You definitely will learn to deal with these things eventually and you'll look back like it's water off the duck's back.",
          "score": 1
        },
        {
          "text": "hi i didn’t wanna reply here so texted u instead :)",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qqisvo",
      "subreddit": "askSingapore",
      "title": "Able to experience Singaporean cuisine with a peanut allergy?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qqisvo/able_to_experience_singaporean_cuisine_with_a/",
      "score": 39,
      "num_comments": 34,
      "created_at": "2026-01-30T03:42:39",
      "selftext": "Hi guys, I was born in Singapore but emigrated at a young age. I've always enjoyed Singaporean food/culture growing up and have recently started visiting.\n\nMy girlfriend is American and we are discussing fitting Singapore into our Asia travel plans this summer. However, she has a moderate to severe peanut allergy (just peanuts, no other nuts). It is not airborne or on contact, but consumption would lead to anaphylaxis, and she carries around an epipen with her when we go out to eat, when she works, etc.\n\nNow, I love Singaporean food, and patronizing hawker centres as well. How safe would it be to experience SG cuisine at hawker centres or restaurants?\n\nWe only know English but she is also strong in Cantonese, but I don't know how commonplace it is with hawkers, so I don't know how viable telling a hawker that she will die if she has any peanuts is.\n\nSome dishes I would love for her to try (in a hawker context or not):\n\nAs an aside we are trying to go to Bali as well. Is that riskier? TIA!",
      "comments": [
        {
          "text": "to be honest, it will be risky. peanut oil is incredibly common in hawkers and chinese cuisine, and not every hawker stall is guaranteed to speak english/cantonese. but you may have some luck with some hawkers that can speak english and even then its not guaranteed they dont use peanut oil",
          "score": 129
        },
        {
          "text": "Hi! I live in Singapore with an anaphylactic peanut allergy. There will always be some risk of cross contamination when eating food from hawker centers because the use of peanuts and peanut oil are quite prevalent in Chinese and other local cuisines. It can also be difficult because such a severe allergy to an ingredient that is so common may not often be taken seriously by hawker vendors, as they do not understand the severity of the situation that someone may die from just a small amount of consumption. However I believe most of the foods stated above should generally be safe and not contain peanuts except laksa. Peanuts are sometimes served with BKT but not cooked inside the soup itself. In my personal experience, I have had allergic reactions from eating kaya toast that has cross contamination from peanuts, because the workers use the same knife to spread peanut butter on one piece of toast and then kaya on another. Hope this helps :)",
          "score": 85
        },
        {
          "text": "Dangerous. The mental condition of peanut allergy basically doesn’t exist here, so the general awareness about it is almost zero. Hawkers especially don’t know and don’t care about it. They’d happily say it’s ok to eat without knowing the trace peanut content in their food.",
          "score": 74
        },
        {
          "text": "I am a Singaporean living in USA right now. My daughter has nuts allergy and the food she is able to consume comfortably are chicken rice, claypot rice, wonton mee, fishball noodles, ban mian, any noodle soup based that doesn't seem to have nuts in them. These are her favorite dishes. She avoid peanut based dishes like mee rebus, mee Siam, popiah, rojak, satay and etc. She has to be careful with chili crab because some use peanuts. Always good to ask food vendor if they use peanuts. Edit to add. \nShe is able to eat laska, carrot cake, char kuey teow, kaya toast, bak ku teh with no problem.",
          "score": 37
        },
        {
          "text": "Ok just being real here there are plenty of good reasonably priced and expensively priced restaurants that serve these foods that operate under huge corporations that would make sure you’re looked after properly so I don’t see taking your chances at the hawker Center being a good idea. In general I would choose sit down restaurants but if you really want hawker like food then plenty of large food courts run by large corporations which will be more professionally run than a hawker store. Eg for bah kut teh just go to ng ah sio or founders, they’re bigger more successful companies they can’t afford to make mistakes lots of foreigners eat there. Etc",
          "score": 16
        },
        {
          "text": "Peanut is not traditional ingredients for laksa (may use cashew nut) but if they use paste, paste might contain peanut.",
          "score": 10
        },
        {
          "text": "Please avoid the satay gravy (Essentially chopped peanuts in chilli sauce)\nAnother key ones are Pophiah (spring rolls) where chopped peanuts are added in the rolls. Ikan bilis (fried anchovies with peanuts) when served with Nasi Lemak Be really careful wi the thick sauces and gravies because it may well contain peanuts. Also if y’all are heading to Thailand and Vietnam, peanuts are also a very common topping.",
          "score": 10
        },
        {
          "text": "My kid is allergy to all nuts. We didn’t have issues with chicken rice and Kaya toast at hawker center. We keep to restaurants usually and it was fine. We didn’t have to use our EpiPen. We visited 3-4 times now.",
          "score": 9
        },
        {
          "text": "Avoid satay (the sauce is made of peanuts), satay bee hoon (noodle dish slathered in peanut sauce), nasi lemak (frequently comes with anchovies and peanuts as a side dish). Peanut oil may be used as a cooking oil so ask the food stall what sort of oil they use. I would think the hawker stalls may  use cheaper alternatives - there are many such as various vegetable oils (soya, canola, corn).",
          "score": 7
        },
        {
          "text": "Song fa, jumbo, restaurants that have a big presence should be okay. Jumbo is a good place because they ask for food allergies so they will ensure the food you choose doesn’t have peanuts or peanut-related items. We go there often with foreign friends",
          "score": 6
        },
        {
          "text": "Yeah, please verify with food vendor when in doubt. You would be surprised the food vendor is fluent in English but a little Mandarin goes a long way. You can use Google translate",
          "score": 5
        },
        {
          "text": "She last visited summer 2024.",
          "score": 3
        },
        {
          "text": "Song Fa okay prolly?",
          "score": 3
        },
        {
          "text": "Song Fa has braised peanut side dishes, as are served at many of the so called larger corporation restaurants. So is eat AOR",
          "score": 3
        },
        {
          "text": "Yeah unfortunately I love satay and Nasi Lemak but no way in hell I would risk it with her.",
          "score": 3
        },
        {
          "text": "Does laksa have peanuts?",
          "score": 2
        },
        {
          "text": "Teochew stores speak teochew, a variant of the Min dialect. \nWhat Chinese dialect we speak depends on what heritage we are from and our families. Just use English, 99% they would understand what peanut is.",
          "score": 2
        },
        {
          "text": "Those dishes all include peanut traces or peanut oil. You better off someone cooking it for you under your supervision.",
          "score": 2
        },
        {
          "text": "If even the smell of peanuts trigger her respiratory or hives, it a serious peanuts allergy. Otherwise cooking oil (peanuts) hawkers or restaurants shouldn’t be a problem. My kid also allergy to peanuts n eggs. A EpiPen  always with him.",
          "score": 1
        },
        {
          "text": "If you want to be safe, you can go to a decent hotel serving Asian food or Asian buffet. The staff usually speak English and are better at understanding the allergy. Nonya style buffet at Swiss hotel Clark quay. Asian food buffet at that Suntec hotel.",
          "score": 1
        },
        {
          "text": "I think for Chicken Rice, maybe avoid the stalls that sell achar along with chicken rice. Some achar contains peanuts and there might be cross contamination.",
          "score": 0
        },
        {
          "text": "Like when you visit?",
          "score": 0
        },
        {
          "text": "Song Fa is a bit risky, since they serve boiled peanuts as one of the side dishes of a set menu. They might not cook the BKT with anything peanut related, but there's high chance of contamination through the utensils and serving dishes.",
          "score": 0
        },
        {
          "text": "Same here, Singaporean with seafood allergy. I eat all the recommended foods without issues. The only time I’ve been surprised was beef noodles with peanuts",
          "score": -4
        },
        {
          "text": "Ah I see. Was confused from the post, sounded like she was eating that stuff in the States. No issues when you visited, esp at hawker centres?",
          "score": -4
        }
      ]
    },
    {
      "id": "t3_1qq3hax",
      "subreddit": "askSingapore",
      "title": "Not sure to stay or quit. New to job and only two weeks to learn from the senior staff of 4 years.",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qq3hax/not_sure_to_stay_or_quit_new_to_job_and_only_two/",
      "score": 30,
      "num_comments": 20,
      "created_at": "2026-01-29T16:54:16",
      "selftext": "The senior staff is leaving company and I am taking over lots of admin work and I will be left alone to handle after two weeks. Now not even two weeks into my new job and I feel like unless the senior staff tell me things I should know otherwise I won't know. Just now I clarify with her and she said I don't understand her so need to get the boss to explain to me. Like I am only two weeks in how much you think I should know and the things are all done by the senior staff and no other people know so I also don't know who to ask when she leaves. Always ask boss also not good and he also wont know.\n\nShould I find another job ?\n\nAnyone experience such things before, like replacing someone who has little to no time to teach or hand over properly to you before that person leaves.",
      "comments": [
        {
          "text": "The company should not expect miracles. If they do, then you know why the seniors left",
          "score": 70
        },
        {
          "text": "i think quite common to have little/ no handover especially when employers only have 1/2 months to hire a replacement and that replacement also have notice period to adhere to. i recommend asking her to send you an archive of her mailbox so you have something to refer to after she is gone.",
          "score": 25
        },
        {
          "text": "Sounds like you have an opportunity to become almost indespensible, but you would have to strugglr through periodd of fogginess while figuring things out. If the management is understanding of the situation and doesnt expect miracle might be a sweet jig.",
          "score": 22
        },
        {
          "text": "Is this SME or MNC? \nYou will need to document as much as you can, find out how to do things, ask actively outside of your team, hope you can pull through it. I was hired as cover and had to pick up where it was left off, it was a mess but really grit through it and things got better now.",
          "score": 12
        },
        {
          "text": "Are you a one-person bao ka liao admin role? Having 4 weeks (I think? You say you're there for 2, plus you have another 2 weeks to learn) to learn is a luxury already. Many jobs have maybe a day or two, or even person left already. It isn't likely to get much better in other jobs. Ask the senior staff who you can ask for the various tasks that you have.",
          "score": 10
        },
        {
          "text": "Are you still happy with the compensation package with additional load they gave you?\nIf yes, then this is your learning opportunity. And… why do you need to worry about the legacy left by your senior? One advice I always gave to the new joiners to my team is, don’t dwell in the past, the fundamental knowledge and facts will remain same, you are hired now, so take this opportunity to keep what works, and get rid of what is not working…",
          "score": 8
        },
        {
          "text": "Still suck if you are the only person left to take over everything, i've been in similar predicament before, only 1 week to learn from senior, 2nd week senior throw MC. Luckily my boss is not the useless kind.",
          "score": 8
        },
        {
          "text": "Just bite the bullet and learn as you go, for next couple of months If not, you can find another job by then, at least you have given it a good shot I got like just a data folder (of predecessor) and 24 hours of learning time, before incident strikes for my former job. No proper handover other than self-learning on the spot :x",
          "score": 5
        },
        {
          "text": "I think it really depends on how nice they are if you ask them When I was much younger I joined a stat board where the person I’m replacing had her last day on my first day of work. She didn’t even do a handover she was busy saying goodbyes all over the office. Then when I took over the role I asked for help and everyone was like this is your portfolio you should know what’s going on, LIKE WHAT?! I literally just joined. It was so ridiculous, I quit like two weeks into the job. The senior mgmt actually came to talk to me to persuade me to stay and I’m like nope. To this day, I’m glad I left that place and it turned me off govt/ stat boards forever though I know not every place is like that",
          "score": 2
        },
        {
          "text": "🚩🚩🚩🚩🚩",
          "score": 2
        },
        {
          "text": "Depends on company I’ve had friends with 3 hour handover or even no handover cause predecessor left & these are in MNCs mind you",
          "score": 1
        },
        {
          "text": "Try to read internal references/documentation?",
          "score": 1
        },
        {
          "text": "Make sure the documentation for sop and bau activities are there for you. You start the tasks and ask the senior to handhold u while u do the job according to the documentation. That's the best advice I can give to make the most out of your current predicament. We do our best with the hand we are given. Good luck.",
          "score": 1
        },
        {
          "text": "If i know I am right and people trying to mess with me, I will just say it out front, irregardless of the position. Bcos we are all just salaried workers. Worked long enough to not care about office politics anymore",
          "score": 1
        },
        {
          "text": "Nah, new people taking over will always have knowledge gaps one, especially when you only have 2 weeks to learn the processes. At most say senior staff never teach. Admin work can write down all the steps then you get the senior staff to confirm if you missed out on any steps? Highly likely they will just glance and say ok, but have it in black and white and point at it to cya",
          "score": 1
        },
        {
          "text": "Sit down with your senior. List; - daily routine, such as check enquiry inbox, collect mail from letter box - monthly, quarterly, annual activities and reports - software used, other than MS Office - location of keys to main door, drawer, spare keys - location of files and documents, stationery supplies - contact numbers of suppliers, cleaning staff - password for computer, online ordering, etc As she is explaining, record on paper. Your memory will be good for a few days.. For week 2, volunteer for her to \"shake legs\" while you perform her duties. 2 weeks is more than sufficient to take over.",
          "score": 1
        },
        {
          "text": "Document. Document. Document. Whatever is possible. Ask senior to make a KT plan and get it approved by boss.",
          "score": 0
        },
        {
          "text": "It’s normal. Brought this up to my boss, he say even for him his eventual replacement will have to go thru the same thing. So just suck thumb and do your best. I asked my senior to document as much as possible. But you go to go thru baptism of fire to reach nirvana",
          "score": 0
        },
        {
          "text": "just learn wot is immediate and critical ezpzzzzzzzz",
          "score": -1
        },
        {
          "text": "Why would you expect someone leaving to baby you? Having them there is already a luxury. It's even more common to be hired as a replacement only after the old staff has left. Get her to produce a list of her deliverables in writing and have her boss sign off on it as her handover. For those items on the list, make a note of those you don't understand how to do and let her boss know. Ask her for notes if she says \"you don't understand her\" so your boss can explain it to you. Anything outside of the list you'll have to pick up as you go along.",
          "score": -3
        }
      ]
    },
    {
      "id": "t3_1qqqamp",
      "subreddit": "askSingapore",
      "title": "What to wear and where to buy plus size clothes?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qqqamp/what_to_wear_and_where_to_buy_plus_size_clothes/",
      "score": 20,
      "num_comments": 59,
      "created_at": "2026-01-30T08:32:47",
      "selftext": "Hello, in a few days I will be in Singapore for a week. I know the weather is pretty humid and also hot. Unfortunately it is currently winter where I live and I am not really able to get hot weather clothes on such short notice. I also don’t want to look odd and out of place. I am obese and always stand out. I don’t want to stick out like a sore thumb and I am very nervous. This is only the second country in (south) east Asia I am visiting but I already had bad experiences in Japan unfortunately. Also generally I try to respect the local culture by not wearing something offensive etc. is it okay to wear shorts if they are above the knees? I know this might sound silly but I am just so traumatised from my previous experiences that I just want to make sure. Also are there any cloth shops for plus size people? What I could gather until now is that people in Singapore are not usually thick or chubby.\n\nThank you in advance and sorry for the weird questions!\n\nEdit to add: I am a woman in my early 30s",
      "comments": [
        {
          "text": "Uniqlo, you’ll fit right in and stores are everywhere. Don’t worry about dressing modestly. You’ll see a wide range of clothes here, from teeny tiny workout sets to full coverage. Bring a scarf for cold air con. If you’re wearing skirts or dresses, I highly recommend biker shorts underneath to prevent chafing. Comfy shoes are a must for lots of walking. Enjoy the trip!",
          "score": 53
        },
        {
          "text": "I'm sorry you feel nervous about your appearance and I hope your experience in SG is better than in Japan! Also a lot of people wear shorts above the knees, the average person dresses very casually! Some shops you could consider are H&M, M&S, All Would Envy or Love and Bravery? Most shops carrying plus size clothes are sadly online only. If you're worried about the heat in Singapore, there are many air conditioned and sheltered walkways but I'd also reccomend bringing / buying a handheld fan. It's not as hot as summer in temperate countries and is a little bit closer to a warm spring climate (IMO) so it should be okay",
          "score": 24
        },
        {
          "text": "ASOS delivers to Singapore too, if you really can't find anything else! We're very flexible on dress codes - people wear shorts almost everywhere. Exceptions that I can think of would be upscale restaurants, luxury brands, and places of worship. For places of worship, you might want to prep a sleeved shirt and a long skirt - you can put the skirt on over your shorts when you enter the place of worship, and then take it off when you exit.",
          "score": 16
        },
        {
          "text": "Uniqlo have their bigger sizes on their site.",
          "score": 13
        },
        {
          "text": "Hi, I am a plus size woman - I wear UK 16 or US 14. I usually get my clothes from ASOS, Next, Uniqlo online, or Shein (especially for occasions where I need to wear something a bit nicer and don’t want to spend too much). For in stores - it’s not always easy to get plus sized clothing. You can definitely try marks and Spencer’s but a lot of the stores here have closed down so it might not be as easy to find. I don’t know what size you are but any size above a US 20/22 might be quite difficult to shop for in most stores - fyi. You mayyy have some luck in some rare shops in the heartlands that advertised their sizes to be “S to XXXXXXXXXXL” - but you may also need to endure some very annoying but very typical fat-shaming there - Asian aunties (the usual ones that man these shops) are very curt and unforgiving. Also to note that the clothes there may or may not be fashionable - I shopped there exactly ONCE in my teens and it’s not a place I’d ever go again BUT if you’re truly desperate for clothes… Btw for the heat - I had a friend who was maybe around a US18/20 come over and she wore a lot of tank tops with a shirt over it - a bit more modest but also allows some ventilation. Also, bring loads of deodorant and body wipes - it’s super humid here and you will sweat to death.",
          "score": 10
        },
        {
          "text": "The Mad Theories at Centrepoint And yes you can def wear shorts above the knees! I’d like to think my own country is quite chill about attire due to the constantly hot and humid weather here. Most importantly is to wear whatever you want with confidence!",
          "score": 9
        },
        {
          "text": "Definitely order online. Can pick up from any store the next day. There are stores seemingly every few hundred metres in Singapore:p",
          "score": 6
        },
        {
          "text": "Uniqlo, just order it online and pick up at store. But the return is a bit tricky for online orders, you cannot return in store and have to mail it back to their warehouse, something to take note",
          "score": 6
        },
        {
          "text": "uniqlo (annoyingly they don't carry it in store if you are bigger than an XL). This is useful information. Unfortunately Uniqlo XL is not big at all. It's Asian mildly chubby only. There's 3XL on their website and it might be possible to order for collection in-store, but that's still troublesome and I don't know if you can return it immediately if it doesn't fit. Delivery is not practical for a tourist.",
          "score": 6
        },
        {
          "text": "Please check their website,  I've found clothes upto 3 Xl",
          "score": 5
        },
        {
          "text": "You can order 2XL and above from uniqlo (annoyingly they don't carry it in store if you are bigger than an XL). For bottoms, a useful \"hack\" is to wear a wrap skirt if you don't mind skirts. I wear batik sarongs all the time when I'm not working - you can find them at various places including: Toko Aljunied (Arab street)\nRatianah (Bussorah street near Arab St)\n(And these two shops are near some interesting and admittedly touristy areas)\nWellie Batik (Holland Village) The other great thing is they then make awesome souvenirs because it's a South East Asian textile and a big part of local culture. Rule of thumb for what to wear:\n- cool and casual. Loose/ flowy clothing helps you stay cool in the heat and protects you from the sun. I notice many white visitors wear as little as possible and they get sunburned. While we are not prudes, when visiting religious sites you will be asked to cover up.\n- be comfy! it's common for locals to wear t shirts, shorts, and sandals or flip flops.",
          "score": 5
        },
        {
          "text": "As a few commenters have mentioned, folks in Singapore are pretty chill about dress codes. The hot and humid weather coupled with the use of public transit means most people prioritize comfort over appearance. So, don’t worry about it! You can take a look at Uniqlo and check out the measurement of their XXL and XXXL clothes to see if they fit. Order it online and collect it in store near your hotel (their stores are everywhere in Singapore). I think they are pretty good value for money and suitable for the weather here.",
          "score": 5
        },
        {
          "text": "It is totally ok in Singapore to wear shorts above the knees. Shorts and T-shirt (or tank top) is totally acceptable as we are casual dressers in general. Wear something nicer for fine dining, but everything else that is touristy is fine. Even if you want to enter a temple or a mosque, they can usually offer tourists something to cover up, or else just don't go inside. Marks and Spencer is a good place to get \"Caucasian plus size\" clothing, not \"local plus size which is just slightly above average in US/Australia\" clothing.",
          "score": 4
        },
        {
          "text": "Thank you, we also have Uniqlo here but the sizes are too small for me. (That’s not their fault tho lol but mine)",
          "score": 3
        },
        {
          "text": "Love.prettyplus",
          "score": 3
        },
        {
          "text": "\"Plus size\" in Singapore is different from plus size Caucasian sizes. It's probably going to be difficult to find in shops or order in advance if you're heading over in a few days. You can try M&S, which has larger sized clothes than the local stores (which I already find too small for me, esp bottoms, as an Asian female).",
          "score": 3
        },
        {
          "text": "Morbid obese guy here. If you're hard for choices in chain shops in a western nation, its worse here in the average mall. But the basement shops in Penninsula Plaza and Queensway Shopping Centre probably have your size. Will be expensive though.",
          "score": 3
        },
        {
          "text": "Shorts is a default for both men and women (ok I mean in normal everyday settings :)). Tshirts are common and even flip flops (but if you’re walking a lot probably sneakers would be best) Of course if you’re going to posh places like higher end restaurants etc then do dress up a bit (smart casual should do). Normal thing applies if you go to places of workship (mosques, templates etc) where you would need to consider religious sensitivities so check online before visiting those specific places. What you might find a bit more challenging is that seat sizes etc can be a bit small (since you have been to Japan you can reference that) especially on buses and trains, and hawker centers/foodcourts. So it might not be the most comfortable. Southeast Asia is generally very chillax about attire. It’s too hot and people aren’t too bothered if you’re not dressed to the nines (East Asia is different and people tend to pay more attention to dressing up) Enjoy your time here!",
          "score": 3
        },
        {
          "text": "You can order on their app or website for bigger sizes",
          "score": 2
        },
        {
          "text": "Oh just remembered! Decathlon has pretty large sizes too and quite affordable! You can shop online and pick up at a store (same day or next day I can’t remember). They have a pretty big store at Centrepoint mall on Orchard Road.",
          "score": 2
        },
        {
          "text": "As a fat guy I would say : Marks and Spencer, I recommend you to go Orchard Wheelock Place (1st choice) or Orchard Paragon(2nd choice). Muji has very lightweight, bright color, airy long sleeve cardigan which is very suitable to outdoor sun and easy to fold & carry indoors. SG is hot country, a lot of girls/women wear shorts here. But again if you are walking outside, don't wear clothes those expose your skin to sun, it's not about culture but it's about your health. Most of the people coming from cold places don't understand how bad the sun is, sometime our UV index is 11 (extremely high). Try to wear something light, airy and cover most of your skin. If you are outdoors person, wear a hat too. I have seen too many white people with bad sunburn. Note : Exposure of skin is not offensive (unless you are visiting temple/mosque)",
          "score": 2
        },
        {
          "text": "Currently uniqlo are selling oversized tshirts. The xl is bigger than regular xl. If you need 2xl then you're out of luck because 2xl is only available online.",
          "score": 1
        },
        {
          "text": "Yup, I am a US size 14, I wear American L. But in singapore, I am wearing 4xl to 5xl I recently bought some dresses US size 14, and they were all too roomy and big for me. I probably can sometimes fit into US size 12 and it still won't be tight. But in singapore, the pants and shirts are depressing, sometimes i think I need 5xl.",
          "score": 1
        },
        {
          "text": "Hmm, I think 4-5 XL sizing system comes from China. Then average Singapore women also have to wear XL. For local shops, an XL might be US size 12. But then they don't sell XXL so you're still out of luck.",
          "score": 1
        },
        {
          "text": "Second the peninsula plaza basement - they cater to large sizes. Don't expect fashionable. Not cheap either. Expect to spend 70-100 for 3-4 pieces.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qqukpa",
      "subreddit": "askSingapore",
      "title": "Anyone know places where you can sit down and ‘peoplewatch’?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qqukpa/anyone_know_places_where_you_can_sit_down_and/",
      "score": 14,
      "num_comments": 33,
      "created_at": "2026-01-30T11:43:07",
      "selftext": "Anyone know places where you can sit down and have a view of many people walking around/doing normal stuff? Wanna see how people interact normally and learn more about the current state of society",
      "comments": [
        {
          "text": "Hawker centre",
          "score": 15
        },
        {
          "text": "Depends on what type of crowd you are looking for. East coast park (Families picnic, bbq gathering, cycling and jogging people) Popular shopping malls ( people meeting, going about to do their errands, lunch, dinner, shopping) I heard little india has that 烟火气, I think haji lane, gelang serai market, Chinatown complex all has similar vibe of older people gathering, busting about.",
          "score": 13
        },
        {
          "text": "vivo city at night, can try roof or just stand at the railing",
          "score": 6
        },
        {
          "text": "People's park",
          "score": 4
        },
        {
          "text": "do mrt stations or sitting in trains count?",
          "score": 4
        },
        {
          "text": "Botanic Gardens. The side closer to Cluny is my preferred option. After a morning walk, I like to grab a cup of coffee and just sit by the lake and watch the world go by. You get a nice mix of people too.",
          "score": 3
        },
        {
          "text": "Orchard/Somerset has a number of good high spaces to just sit and watch. Quite diverse also haha",
          "score": 2
        },
        {
          "text": "Takashimaya fountain at b2 😀",
          "score": 2
        },
        {
          "text": "Hawker centres, ECP, shopping malls, MRT",
          "score": 1
        },
        {
          "text": "Raffles City",
          "score": 1
        },
        {
          "text": "Punggol Waterway Point Loads of young families there and you can observe whether the dad/mom love their kid(s) or not. See how drained these parents look. Hah, super effective birth control",
          "score": 0
        },
        {
          "text": "Living up to your username",
          "score": 0
        },
        {
          "text": "wow good idea",
          "score": 0
        },
        {
          "text": "Haha don't need to go all the way there to see Just lurkr/regretfulparentsis fine too 🤣",
          "score": 0
        },
        {
          "text": "Straight up this is it, i prefer chompang hawker",
          "score": 0
        },
        {
          "text": "Saturday morning doggo watching at the orchid garden plaza area before Palm Valley",
          "score": 0
        },
        {
          "text": "You sit down anywhere with people within 5 mins the world will generate a random insurance agent of some kind to talk to you",
          "score": 0
        },
        {
          "text": "Neighbourhood cafes with window seats. A few that come to mind just because I happen to have frequented them: Alchemist Khong Guan Building (Tai Seng), House Downstairs (Ghim Moh), Craftsmen Specialty Coffee (window seats near back door) (Holland Village), Wishes Cafe (MacPherson).",
          "score": 0
        },
        {
          "text": "There was a recent case of peoplewatchingobserving in offices. Turned out to be quite popular online",
          "score": 0
        },
        {
          "text": "Nice",
          "score": 0
        },
        {
          "text": "Outside One Raffles Place",
          "score": 0
        },
        {
          "text": "Chinatown Hawker",
          "score": 0
        },
        {
          "text": "Cafes in orchard road!",
          "score": 0
        },
        {
          "text": "I like to do it in Funan or Jewel",
          "score": 0
        },
        {
          "text": "Bishan Park, East Coast Park, Alchemist Cafe at The Heeren, any Starbucks or cafe in Joo Chiat, Changi Village, Six Letter Coffee in Tanjong Katong",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qq3sg4",
      "subreddit": "SingaporeRaw",
      "title": "[MEGATHREAD] PropertyLimBrothers' Melvin Lim and Grayce Tan",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qq3sg4/megathread_propertylimbrothers_melvin_lim_and/",
      "score": 418,
      "num_comments": 198,
      "created_at": "2026-01-29T17:13:24",
      "selftext": "There have been too many separate posts about the PLB saga.Please use the megathread for further discussion. Thanks!",
      "comments": [
        {
          "text": "Ngl she needs to problably migrate and start a new life elsewhere. The entire singapore now knows about this. If that’s happen to me i really got no face to go out in public but if i did i wear mask and hat all the time. But for work wise no choice need work elsewhere outside of singapore lmao. But if she stayed in singapore and work then she have a lot of balls (ps: not in her mouth) and i can respect that",
          "score": 202
        },
        {
          "text": "I realised grayce’s hair looks wet in the video. Too sweaty?? Anyway, she has deactivated her IG, looks like she finally woke up and realise everyone is just posting her photos left right centre haha",
          "score": 173
        },
        {
          "text": "To be really frank, that may not be the case at all. You're right that you and I \"normal folk\" will have no face if we're in her shoes. But she's an InFluEnCeR - and she may just double down on this as part of her YT career / journey. Give it 1-3 years time, and she'll hop on a podcast with minimal makeup with a calm background of neutral tones and address how she \"wasn't thinking straight / alot of stress happening in her life or marriage at the time / some bs\", maybe shed a few tears with the fellow podcaster etc. Then done, people move on, she has a following and continues being an influencer. No need to even pursue OF. This has happened so many times already globally.",
          "score": 85
        },
        {
          "text": "I don't think she needs to go that far. Like with most viral scandals, it will be hot for a little while, maybe few weeks. Eventually everyone moves on with their lives. Maybe some people will take pictures of her somewhere :\"omg omg i saw Gracey in Fair price buying shampoo\", but that will be about it. So for her, just lay low and when the heat cools down, resume back career / socials etc.",
          "score": 79
        },
        {
          "text": "she can do onlyfans, start a TG channel and start charging people a premium to join and many thousands a pop.",
          "score": 34
        },
        {
          "text": "Yeah no need go far tbh just lay low at malaysia or Australia somewhere in the neighbouring countries to like rethink her life for a few months then go back",
          "score": 23
        },
        {
          "text": "That’s if she is shameless uh highly unlikely though. Also if she did, it’s just a short term success because of the hype (idk how good she is in bed need to ask melvin on this one). Also she want to do damage control so she doesn’t want to worsen the situation even more and destroy whatever’s left of her reputation",
          "score": 16
        },
        {
          "text": "She this type cmi la.",
          "score": 12
        },
        {
          "text": "Yeah i can see that maybe for a few months either stay at home most of the time jobless rethinking her life or maybe just travel to some other country and stay there for a bit and lay low. After a while come back when ready and do that podcast talking about the position she was in doing cardio when the viral video happened",
          "score": 10
        },
        {
          "text": "she just went to lululemon event sia…",
          "score": 8
        },
        {
          "text": "She’s alrdy famous in Malaysia from what we’ve observed",
          "score": 7
        },
        {
          "text": "Definitely sucked more than money too. Something gooey. On the hindsight this woman really uses sex as her tool to go up career ladder. That crazy loud moan, really serves no other purpose than boost the man ego. And if the man is smart enough, that fake moans is really a huge turnoffs",
          "score": 7
        },
        {
          "text": "Not just sg too.. I have colleagues overseas who asked if I knew about this today 🫠",
          "score": 7
        },
        {
          "text": "😂🤣 people are opening accounts to post it all up though. Too bad for her. ",
          "score": 6
        },
        {
          "text": "I’m old enough to remember Belly Welly Jelly and Bunny Jan Jan",
          "score": 5
        },
        {
          "text": "As much as many say she CMI, I think she can get a lot of simps by showing half ball",
          "score": 5
        },
        {
          "text": "Singapore's Amber Heard?",
          "score": 5
        },
        {
          "text": "She can outdo mspuiyi from bolehland. mspuiyi now millionaire....",
          "score": 3
        },
        {
          "text": "The funny thing about SG is; it's so fucking small but how many of these public figures - from MPs to \"local celebs\" - have you ever seen moving around the island except for publicity stunts (i.e. walkabouts, events, and etc.)? They've got plenty of places to go in SG, and many of such places aren't meant for low-SES plebs and serfs like us.",
          "score": 3
        },
        {
          "text": "Rethink with all the money she sucked",
          "score": 2
        },
        {
          "text": "Has her followers dropped since the saga?",
          "score": 2
        },
        {
          "text": "At least amber heard wasn’t cheating on Johnny",
          "score": 2
        },
        {
          "text": "no need lah so many ckp bosses now wanna hire her",
          "score": 1
        },
        {
          "text": "lol. bellywellyjelly is still thriving and arguably hers is even crazier cos videos live forever. way less people care than you think.",
          "score": 1
        },
        {
          "text": "General Videos: https://www.reddit.com/r/SingaporeRaw/comments/1qnhxq0/plb_the_movie2026audio/ https://www.reddit.com/r/SingaporeRaw/comments/1qn9bcc/melvin_grayce_office_video/ UWU Bird POV:https://www.reddit.com/r/SingaporeRaw/comments/1qp23ae/uwu_bird_pov_camera/ (credu/Tom_Lennon)https://web.archive.org/web/20241008122956/https://saltandlight.sg/business/when-a-4-year-drought-taught-award-winning-propertylimbrothers-to-put-people-before-commissions/ (cred u/LastAcanthisitta3526)https://web.archive.org/web/20250321012355/https://saltandlight.sg/business/we-are-just-managers-god-is-our-boss-how-propertylimbrothers-built-a-culture-of-collaboration-not-competition/",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qq2cbn",
      "subreddit": "SingaporeRaw",
      "title": "Do you know that new citizens can purchase resale hdb below 35 years old?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qq2cbn/do_you_know_that_new_citizens_can_purchase_resale/",
      "score": 194,
      "num_comments": 104,
      "created_at": "2026-01-29T15:45:52",
      "selftext": "Just learned a trick that many new citizens have been using to buy a resale hdb even before they turn 35 years old.\n\nUnder The Non-Citizen Family (NCF) Scheme, it allows a Singapore Citizen (SC) to buy an HDB resale flat with non-citizen family members (e.g., parent, child) who do not hold Permanent Residency. The SC must be at least 21 years old, and the non-citizen family member must hold a valid Long Term Visit Pass (LTVP) or Work Pass.\n\nHence, our dear foreign scholar friends who enjoys a fully sponsored education from secondary school all the way through university and now became a new citizen can simply use one of their non citizen parents’ name to purchase a HDB.\n\nIf you are wondering why your new citizen uni mate already owns a hdb and can always host hot pot parties, this is the reason why 😄",
      "comments": [
        {
          "text": "It's not a new trick. My ex PRC gf did it two decades ago w her brother. For the second part.... HDB relies on trust when asking if you have a property overseas.  There's no global property database",
          "score": 134
        },
        {
          "text": "Not surprised. This country treats foreigners better than locals",
          "score": 126
        },
        {
          "text": "This is why the government is responsible for the high prices of hdb and the property bubble in general.",
          "score": 58
        },
        {
          "text": "Wrong. WE are responsible. Because we voted for this government with this set of policies. If we are a dictatorship like China then maybe we can't shoulder the blame.",
          "score": 29
        },
        {
          "text": "What do you expect them to say? Do you think they will let you know that they cant check?",
          "score": 18
        },
        {
          "text": "From where?",
          "score": 16
        },
        {
          "text": "Unless you have a specific example of HDB nailing someone trying to cheat the system with this purported database, it’s more likely than not that that’s a lame scare tactic",
          "score": 11
        },
        {
          "text": "Profitable to the bto flippers only. What about the rest? Suffer?",
          "score": 10
        },
        {
          "text": "so long as they dont touch the btos.",
          "score": 8
        },
        {
          "text": "There’s only so much they can do. What “records” and how reliable, to they extent the other countries have and are willing to share only go so far. Else there would not be fake degree grads coming thru.",
          "score": 6
        },
        {
          "text": "Hahaha.....agreed, sinkies are so easily scared. Just like ICA keep saying they know which sinkie holding dual citizenship but instances likethis Aussie caseshowed how clueless they are. Of course, once you decided to be a citizen of another country, don't continue to act clueless like this Aussie, please leave your sinkie habits behind or you won't survive.",
          "score": 4
        },
        {
          "text": "The bubble is engineered upwards thru liberal immigration and social policies to inflate economic data to show high growth rate. No inflation = no growth . So in the resulting widened income gap - they throw a teeny bit of the inflated growth money (which had lost value over time due to high inflation) as cdc vouchers.  its an illusion to cover negative effects of unpopular policies like liberal immigation policies, high population density and runaway prices of goods and services.",
          "score": 4
        },
        {
          "text": "Don’t think you’ll ever find out unless you work in hdb",
          "score": 3
        },
        {
          "text": "How?   Via voluntary disclosure? My home countries land titles system cannot be searched by name and fishing expeditions need a court order.",
          "score": 3
        },
        {
          "text": "No, on average only 60% of the electroate voted for these crap policies. The rights of the substantial 40% minority are trampled upon.",
          "score": 2
        },
        {
          "text": "We voted for it.",
          "score": 1
        },
        {
          "text": "No. We are responsible for it. We voted for it, remember?",
          "score": 1
        },
        {
          "text": "Economics is a foreign concept or they failed economics at JC level which is the entry level lmao. You know whenever they say \"GOVERNMENT SHOULD CONTROL PRICES IMMEDIATELY\" that it's pointless. They want: 300 to 400K flats in PRIME areas The amount of excuses when they have to live in \"ulu\" places is hilarious.",
          "score": 1
        },
        {
          "text": "I have a very common name where my properties are.",
          "score": 0
        },
        {
          "text": "Don't understand the downvotes, just sharing my experience. if you guys are blessed enough to have overseas properties already. Just try and apply for hdb or bto and let us know if hdb can find out lo..",
          "score": -1
        },
        {
          "text": "Oh because magically if you voted for opposition the price will go down? Go take a class of economics if you want to blame the government not forcing you to take economics is the problem.",
          "score": -3
        },
        {
          "text": "How ah bro? Can elaborate?",
          "score": -19
        },
        {
          "text": "Agent here. My client tried asking HDB the same question. Their reply was. We will know. So no point trying to hide",
          "score": -29
        },
        {
          "text": "what's wrong with collecting more money? that's the value we live by.. so if it's profitable to have these foreigners in, well, you know what happens",
          "score": -37
        },
        {
          "text": "That’s not true. Hdb does have records.",
          "score": -41
        }
      ]
    },
    {
      "id": "t3_1qqrhgy",
      "subreddit": "SingaporeRaw",
      "title": "They're after our men now",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qqrhgy/theyre_after_our_men_now/",
      "score": 89,
      "num_comments": 57,
      "created_at": "2026-01-30T09:24:05",
      "selftext": "",
      "comments": [
        {
          "text": "She is obviously just very excited to see so many men with good figure, perhaps rare in where she came from. We should enjoy being appreciated! SG men are one of the least appreciated groups ever. All our sacrifices are taken for granted.",
          "score": 69
        },
        {
          "text": "If anything, what that melvin lim saga has taught me, its that for a lot of local (and non local) women, being jacked and having a decent job is not enough. There is always a caveat for wanting more. Even though I feel this lady is just doing it in good fun, at least there are women out there who still appreciates la.",
          "score": 65
        },
        {
          "text": "What's wrong with that. And she looks way better than some local girls",
          "score": 53
        },
        {
          "text": "Isn't that good?",
          "score": 47
        },
        {
          "text": "Should let the Singaporean ladies feel the competition.",
          "score": 25
        },
        {
          "text": "at least someone appreciates the shit we do. what is this anyway, these men look fit man",
          "score": 23
        },
        {
          "text": "I dont see a problem",
          "score": 16
        },
        {
          "text": "Sinkie women are not worthy",
          "score": 14
        },
        {
          "text": "Its a huge upgrade Google Beijing Bikini to find out more.",
          "score": 10
        },
        {
          "text": "Six pack can't beat six stacks🥲",
          "score": 9
        },
        {
          "text": "more competition for bbfas woohoo",
          "score": 7
        },
        {
          "text": "It’s good to see she can appreciate. It is so tiring seeing so many people take a dump on SG men.",
          "score": 7
        },
        {
          "text": "can. Big and flat neh neh all equal",
          "score": 6
        },
        {
          "text": "Ah tiong bu being surprised: in china also have what! Never see before meh? Must be some rural bumpkin AMDL being surprised: Welcome to singapore 🥰🥰 we are a wholesome bunch and have good community spirit",
          "score": 6
        },
        {
          "text": "if gender reverse can?",
          "score": 5
        },
        {
          "text": "VERY HUNGRY!!!!👍❤️⭐😋😋😋😋😆😆😆",
          "score": 5
        },
        {
          "text": "My Singapore son is the fittest guy I know.",
          "score": 5
        },
        {
          "text": "Saga taught me also not only non-local can gongtao local guy",
          "score": 4
        },
        {
          "text": "她好兴奋啊",
          "score": 4
        },
        {
          "text": "Can never satisfy them I guess. Look what Curry kena...",
          "score": 3
        },
        {
          "text": "PRC women cannot BTO with you, and their parents are likely not in Sinkiland. Fighting an uphill battle.",
          "score": 3
        },
        {
          "text": "Then I can move over to China. Reverse UNO.",
          "score": 3
        },
        {
          "text": "but it's the track... obviously there are many men with good figure surely its the same in china running tracks",
          "score": 1
        },
        {
          "text": "And the rich ones who can afford private property will definitely not be interested in the average sinkie male.",
          "score": 1
        },
        {
          "text": "If gender reverse you can be sure someone call police liao",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qqryft",
      "subreddit": "SingaporeRaw",
      "title": "Changi village wildlife! 🐦‍⬛🦜",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qqryft/changi_village_wildlife/",
      "score": 85,
      "num_comments": 15,
      "created_at": "2026-01-30T09:45:21",
      "selftext": "",
      "comments": [
        {
          "text": "They're so adorable and cartoony 😆",
          "score": 6
        },
        {
          "text": "oriental pied hornbill, lots of them spawning",
          "score": 3
        },
        {
          "text": "Aiyo the hopping 🥹",
          "score": 3
        },
        {
          "text": "Wild Bird Paradise",
          "score": 2
        },
        {
          "text": ":0 HORNBILLLLLL!!!!!!!",
          "score": 2
        },
        {
          "text": "Are they waiting for feast?? hahaha i imagine they are best friends xD",
          "score": 2
        },
        {
          "text": "those two i think also hangs around in the east coast area.",
          "score": 2
        },
        {
          "text": "Birb",
          "score": 1
        },
        {
          "text": "Welcome to Singapore Bird Park :-)",
          "score": 1
        },
        {
          "text": "The hornbills might be predators to the chickens?",
          "score": 1
        },
        {
          "text": "They and crows are opportunistic predators of chicks and eggs.",
          "score": 1
        },
        {
          "text": "So cute, 4 species of birds in one vid!",
          "score": 1
        },
        {
          "text": "Beautiful cock.",
          "score": 1
        },
        {
          "text": "i saw a cock.",
          "score": 1
        },
        {
          "text": "is that a bootleg toucannnnnnnn",
          "score": -1
        }
      ]
    },
    {
      "id": "t3_1qqr3ln",
      "subreddit": "SingaporeRaw",
      "title": "Survey ask me what is the reasonable number of leave but reject my answer",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qqr3ln/survey_ask_me_what_is_the_reasonable_number_of/",
      "score": 60,
      "num_comments": 59,
      "created_at": "2026-01-30T09:07:16",
      "selftext": "I feel 100 days leave for below 7 years old is reasonable and everyone is entitled to their own opinions. But as a survey, don't you feel you should take in everyone's consideration rather than make a boundary on what you think is acceptable? Why then do you even bother to do the survey? to fit certain narrative?\n\nFor the curious:\n\nHappyDot.sg-> Rysense ->MDDI\n\nSources:\n\nhttps://happydot.sg/about-us/what-is-happydot-sg/https://www.rysense.sg/about-rysense/",
      "comments": [
        {
          "text": "They just want you to input answer according to their ideal range, so that their ideal range will achieve 100% endorsement. Faked survey🤣",
          "score": 56
        },
        {
          "text": "Oh man, I can understand putting in some limits from a form design perspective to reduce invalid inputs like mashing keyboard. But it should have just restricted to integers from 0 to 365.",
          "score": 17
        },
        {
          "text": "social psych here, sometimes contracted to get survey data for governments and ministries. can give a bit of perspective to this 'debacle': on whether higher management in gov have agendas that they want the survey data to match: generally this is true, but the agendas don't take place at the data collection/vendor level. the reason is because there are much easier ways to misrepresent Singaporeans. instead, what the ministries do is massage the data to come up with 'business insights' or 'sensemaking' to suit their agendas. e.g. they can just filter away all the responses beyond 50 or 100 days and say that these are 'error inputs' and not count them in their total N size. so there is no need for them to enforce strange limits at the data collection level to push for their agenda. what is more likely is that some analyst at the vendor decided to add some business logic to the survey to make life easier later during data cleaning, and to ensure that there are more data points available for analysis",
          "score": 10
        },
        {
          "text": "Welcome to surveys. They aren’t there to collect data on actual ground sentiment, but to support the pre-established narrative management has already set their minds on. \"Fugayzi, fugazi. It's a whazy. It's a woozie. It's fairy dust. It doesn't exist. It's never landed. It is no matter. It's not on the elemental chart. It's not fucking real.”",
          "score": 8
        },
        {
          "text": "Nice lah. Scholar can get promotion",
          "score": 5
        },
        {
          "text": "yes exactly. If the range is 0 to 365 (1 year), then it makes perfect sense to have a range. Otherwise, it will just incorrectly skewed the results to a certain side.",
          "score": 5
        },
        {
          "text": "What’s the highest they can accept",
          "score": 5
        },
        {
          "text": "try 99",
          "score": 5
        },
        {
          "text": "Stress testing the input validation checks huh? 😂",
          "score": 5
        },
        {
          "text": "Bro then you might have bigger problems on your plate. 😭",
          "score": 4
        },
        {
          "text": "That's how survey outcomes are being engineered to show favorable statistics and data. That's why I don't bother doing government surveys. They will always somehow have a way to massage to data to fit their narratives.",
          "score": 4
        },
        {
          "text": "The problem is that this makes the survey completely biased to the scope and view points of the setter and therefore could and should be nullified by virtue of being a dataset that is completely methodolically compromised in terms of trustworthiness and fairness Like there is straight up a level of \"pointing\" and hinting involved, making this questionnaire and its sample size  unreliable",
          "score": 3
        },
        {
          "text": "The question writes \"...per year\" 😅",
          "score": 3
        },
        {
          "text": "\"100\",'100',one hundred,one-hundred,一百,seratus,10^2,10*10,10X10,10-tens,ten-tens",
          "score": 3
        },
        {
          "text": "Even if they allow you to input what you want, they can always remove them",
          "score": 3
        },
        {
          "text": "it's a text input question, no idea what is their highest number.",
          "score": 2
        },
        {
          "text": "Like if you (by you, I mean the author of said statistics) only worry or care about filter - just perform the filtering and data extraction post-processing be it programatically via python, or hell - the most janky method ever that works: just do it with excel in a table with some shellscripting for sorting, cutting or exfiltration of completed data Why force the filter INTO the damn dataset, ruining it and making it \"undemocratic\" (with lack of a better word) in the process",
          "score": 1
        },
        {
          "text": "If you torture the data hard enough, it can tell you anything",
          "score": 1
        },
        {
          "text": "Unemployment leave : ∞",
          "score": 1
        },
        {
          "text": "Yes. A total fait accompli",
          "score": 1
        },
        {
          "text": "Might as well just help us pre-fill the answers they like and we just click okay then give us the points lah. no need ask us for our opinions when they are not interested.",
          "score": 1
        },
        {
          "text": "How surveys actually works, The perfect balanced sample",
          "score": 1
        },
        {
          "text": "The perfect balanced sample indeed.",
          "score": 1
        },
        {
          "text": "above comment needs to be upvoted. so many comments missing the point.",
          "score": 1
        },
        {
          "text": "but what if i believe that a leave longer than a year is reasonable leh",
          "score": -6
        }
      ]
    },
    {
      "id": "t3_1qqq3a7",
      "subreddit": "SingaporeRaw",
      "title": "True or False? 90% of Singapore Women Want the Top 10% of Men?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qqq3a7/true_or_false_90_of_singapore_women_want_the_top/",
      "score": 45,
      "num_comments": 62,
      "created_at": "2026-01-30T08:24:27",
      "selftext": "",
      "comments": [
        {
          "text": "<image>",
          "score": 85
        },
        {
          "text": "<image>",
          "score": 31
        },
        {
          "text": "Not mandatory but not complaining if can get.",
          "score": 27
        },
        {
          "text": "Thats why its called settling lol, its not by choice for sure 🤣",
          "score": 26
        },
        {
          "text": "What U want and what U get are two separate things. I also want to marry Scarlett Johansson.",
          "score": 25
        },
        {
          "text": "Being gay is better than being a man in Singapore. Lol.",
          "score": 21
        },
        {
          "text": "<image>",
          "score": 13
        },
        {
          "text": "No. I see plenty of women settling for less.",
          "score": 10
        },
        {
          "text": "But even after failing to get that 10%, being single is also ok for women (not necessarily Singapore but countries like Korea or Japan where theres little benefits and a lot more sacrifice in marriage in their male dominated culture)",
          "score": 9
        },
        {
          "text": "When reach 30+ then say hard to find and no one wants them 🤣",
          "score": 9
        },
        {
          "text": "https://www.nas.gov.sg/archivesonline/audiovisual_records/record-details/68693604-1164-11e3-83d5-0050568939ad Duringthe 1983 National Day Rally, he sparked a controversy dubbed by the media as the “Great Marriage Debate”. At the Rally, he bemoaned the fact that the educated were not reproducing whereas the less educated reproduced more. Down the road, “for every two uneducated workers… we will have four. And for two graduates, you may end up with one,” resulting in an overall decline in standards. He urged male graduates to marry their educational equals, and encouraged educated women to have two or more children. https://cultivate.sg/from-third-world-to-first-lee-kuan-yews-take-on-family-values/ Lee Kuan Yew used to encourage only the educated women to produce more. It just went from education to money, i guess rich and powerful is the sign for \"top merits\".",
          "score": 8
        },
        {
          "text": "But they look like bottom 10%",
          "score": 8
        },
        {
          "text": "most folks (regardless male or female) want to marry up into well to do families. who wouldn't want to? it's like striking the lottery, once in a lifetime opportunity, life changing experience. 1st half of life not so well to do, next half laugh all the way to bank & more!👍⭐❤️🖨️💵🖨️💵🖨️💵🖨️💵🖨️💵🖨️💵",
          "score": 8
        },
        {
          "text": "90% of women want top 10% of men. Fixed that for you. And yes it’s true",
          "score": 7
        },
        {
          "text": "Hypergamy is a thing. For most part though, it's a term to describe a social behaviour, and people are quite realistic of their chances of getting what they want once they take a good look at their own situation. To be fair as well, it can apply to both sexes, even though it is still mostly associated with women.",
          "score": 6
        },
        {
          "text": "The graduate scheme is greatly misunderstood But lky as usual was noticing issues early that we deal with today. Like all the feminism vs redpill stuff, women aren’t traditional vs men aren’t leveling themselves up debate both sides having unrealistic expectations for partners. It’s amazing. https://youtube.com/shorts/6cAe3S-a7YY?si=IXLgBTWPx1bbvCcJ",
          "score": 3
        },
        {
          "text": "Need to lepak more",
          "score": 3
        },
        {
          "text": "Yes",
          "score": 3
        },
        {
          "text": "Top 10% i am not sure but married/ attached men i can confirm",
          "score": 3
        },
        {
          "text": "I remember noting that he regretted giving women equal rights. Actually it's his wife to blame for most of that via the Women's charter.  No only did she give them equal rights - the two of them together managed to give women unequal rights (no NS, usually get more in divorce, presumption of guilt on the man when they scream molest etc).",
          "score": 2
        },
        {
          "text": "What about being a man in China or India? Can't see that going better than Singapore tbh",
          "score": 2
        },
        {
          "text": "Worst.",
          "score": 2
        },
        {
          "text": "Last I heard, gays are still men.",
          "score": 2
        },
        {
          "text": "This isn’t accurate at all. 1.LKY never regretted giving women equal rights or education. I can pull up comments he made in the 1980s and even right before he died where he reaffirmed this. LKY was obsessed with raising the quality of Singapore’s demographics, which is why education was always treated as the top national priority and why Singapore built one of the strongest education systems in the world. His goal was to maximize the potential of every Singaporean citizen through education. At the same time, he believed there was a limit to what even the best education could do, and that IQ and true brilliance were partly genetic. That is why he was concerned when Singaporean men began marrying uneducated women rather than educated or highly capable Singaporean women. From his perspective, this lowered the overall quality of the population over time. This is also why he pushed the Graduate Mothers Scheme and placed such strong emphasis on educating women, while seeing women as half of the workforce and recognizing that it made no sense not to educate them. He acknowledged that when women are educated, birth rates tend to decline as women want more out of life, and that this creates challenges between the sexes. Men often struggled with dating women who were smarter than them, earned more than them, or were harder to lead in traditional ways. LKY understood that this disrupted traditional male–female dynamics. He handled this with nuance. On one hand, he openly challenged men’s insecurities, saying he himself was never intimidated by women who were smarter than him and that he actively sought out his wife, who beat him to valedictorian. On the other hand, he acknowledged that certain forms of feminism could push women toward being more masculine and adversarial in marriage rather than complementary. He even commented on how Japan limited women’s access to universities and instead sent many to finishing schools where they still received rigorous education but were also taught how to be good partners to their husbands. LKY clearly saw the early stages of the men–women dating divide we see today and was trying to address it rather than deny it. 3.As for alimony in divorce and presumption of guilt, I don’t see any extreme bias against men. If anything, it appears the opposite. LKY and the PAP consistently tried to prevent the system from becoming ideologically skewed or hostile toward men, unlike what we now see in the United States in divorce proceedings that do heavily favor the women and cancel culture sexual misconduct accusations.",
          "score": 1
        },
        {
          "text": "Top or bottom?",
          "score": -2
        }
      ]
    },
    {
      "id": "t3_1qq668z",
      "subreddit": "SingaporeRaw",
      "title": "What are your experiences with local influencers ?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qq668z/what_are_your_experiences_with_local_influencers/",
      "score": 39,
      "num_comments": 87,
      "created_at": "2026-01-29T19:33:17",
      "selftext": "Over the years i have seen some drama online about local influencers like xiaxue, dee kosh , NOC etc. Those of you met sg influencers on your own through work/events or just meeting them outside coincidentally , has the experience of meeting them in person match the reality of how they are on tiktok/instagram ? Were they nice/mean to you ?",
      "comments": [
        {
          "text": "Matched with one a longtime ago on a dating app. She was full of herself and always complaining about negative online comments. To keep up with her online persona, most her time spent was on skincare, shopping and marketing.  She also branded herself as entreprenuer, CEO. These two terms are used frequently and it's lame af. If you see it from a birds eye view, she's just a low class pariah living a grand delusion that she's some big time hollywood actress lol. I remember cancelling the date because i couldn't deal with the fact that i might be her photographer haha. I am 37 this year. I am jealous that our father's didn't need to entertain such women during their generation.",
          "score": 202
        },
        {
          "text": "It's in my first sentence........ ni keyi du ma?",
          "score": 136
        },
        {
          "text": "Steven Lim, very friendly and outspoken, interacted with him once many years ago. Despite the online hate, he is actually quite a nice person.",
          "score": 103
        },
        {
          "text": "I saw him infrequently at orchard, trying to get people to sign up with his talent agency, and he is a real hustler. I saw him on my way to my japanese lesson and 3 hours later as I was leaving, he was still there approaching people and still being high energy and friendly. It really changed my perspective of him. It's really a shame he is such a slave to clout and attention.",
          "score": 99
        },
        {
          "text": "Being single is better than being married twice....like you.",
          "score": 56
        },
        {
          "text": "People can say whatever about him, but one thing you can’t deny, is that he is a fucken hustler. I actually think he is a very smart and entrepreneurial person. Insane profit margins at barely any cost",
          "score": 53
        },
        {
          "text": "Charmaine Yee. \nCame for an event after work hours. Never was she rude to the event crew. Even chatted casually with many. No airs or anything.",
          "score": 50
        },
        {
          "text": "The real loser here is you for being married twice lol",
          "score": 42
        },
        {
          "text": "Boy are you blind…",
          "score": 29
        },
        {
          "text": "This is perfect writing 🫡",
          "score": 18
        },
        {
          "text": "i saw him at orchard too beside apple store while walking to the gym. he was giving out flyers and convincing people to sign up for something. he was still there after i was done gymming.",
          "score": 13
        },
        {
          "text": "i was returning home from class at Ikoma when 9-11 happened",
          "score": 6
        },
        {
          "text": "Which one? This sounds like most",
          "score": 4
        },
        {
          "text": "Used to but that was a long time ago. Almost 10 years???",
          "score": 4
        },
        {
          "text": "Bro, it’s much better to remain single than to end up with a walking red flag. Besides at 40, most women in our immediate region and beyond would still be okay because you’ve got the Singapore (citizen) brand behind you. There are many foreign women of marriageable age in Singapore too and working here in MNCs. From now till 40 or even 45 you’re still good. There’s a saying 男人四十是条龙. A man at 40 is a dragon (in terms of maturity and career stability, etc.) I wish you all the best with your endeavours. Just know you’ve got my full support in securing a good life partner. P.S. My daughter was born when I was 40. My wife is not an SG citizen but she got her scholarship to study at NUS and I met her when she was finishing up her grad school thesis.",
          "score": 3
        },
        {
          "text": "Diverting the topic, but do you go to Ikoma for Japanese classes",
          "score": 3
        },
        {
          "text": "Thank you for your kind wishes bro",
          "score": 1
        },
        {
          "text": "Wow I saw him last year doing the same at clementin.",
          "score": 1
        },
        {
          "text": "日本語をまだやってるんですか。",
          "score": 1
        },
        {
          "text": "this guy got rejected for sure hahaah",
          "score": 0
        },
        {
          "text": "I don't know how you came up with this logic Vs the fact: I can marry twice Vs you can't even get a girl.",
          "score": -4
        },
        {
          "text": "Lol... ... Says the one who can't even get a girl. Lol.... I really fell off my chair laughing at you.",
          "score": -19
        },
        {
          "text": "No I'm not blind. But you can't read between lines. And judging from the response, that's why we have some many losers struggling with getting a gf.",
          "score": -54
        },
        {
          "text": "You can't read between the lines. That's why you will struggle to get a gf.",
          "score": -83
        },
        {
          "text": "Let me guess... You used a dating app.",
          "score": -167
        }
      ]
    },
    {
      "id": "t3_1qqsg5z",
      "subreddit": "SingaporeRaw",
      "title": "Mixing Immigration and TFR is dangerous",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qqsg5z/mixing_immigration_and_tfr_is_dangerous/",
      "score": 25,
      "num_comments": 37,
      "created_at": "2026-01-30T10:07:09",
      "selftext": "https://www.channelnewsasia.com/singapore/we-first-society-foreigner-immigration-integration-ips-gan-kim-yong-5883906\n\nWith regards to recent DPM Gan Kim Yong's comments somewhat muddling immigration and TFR together is dangerous.\n\nWhile both of them increase population, they give very different outcomes in 20-30 years time.\n\nThis means immigration today will likely become a tax burden for your children, while they both add population growth they make things worse for low TFR and not better.\n\nImage pulled from:https://www.singstat.gov.sg/find-data/search-by-theme/population/population-and-population-structure/visualising-data/population-dashboard",
      "comments": [
        {
          "text": "resident not citizen. If those immigrants become citizen will doom, look at age 30 - 70 group.Also alot 25- 50 have problem of employment, mean hardly support themselves when 60+",
          "score": 10
        },
        {
          "text": "nvm one as long as we keep having immigrants.the new immigrants feed the old ones. just like a certain scheme that starts with p",
          "score": 8
        },
        {
          "text": "20 to 30 years time doesn't concern them anymore and is not reflected in current gdp. it's definitely kicking the can down the road.",
          "score": 5
        },
        {
          "text": "Pappy locking in those fast cash short term gains. Good example for our future gen",
          "score": 5
        },
        {
          "text": "They have already given up on raising TFR a long time ago",
          "score": 4
        },
        {
          "text": "“I think this sense of competition is real. We have to recognise that. But it is also something we have to accept that we just have to continue to compete with the rest of the world,” said Mr Gan. No point listening to elites like GKY and LW. They don't believe in evolution. In evolution theory, when a creature failed to reproduce and pass on its genes or when an entire species goes extinct; it isout of the race! Any talks of competition isirrelevantto anything going extinct. Only the elites will want the-you-that-is-going-extinct to continue slogging away so that their profits and interests continue to be preserved. But who will inherit all of your wealth and savings? Hopefully, you aren't giving it to the same elites that treated you like a mere resource.",
          "score": 4
        },
        {
          "text": "Definitely not a long term solution to bring in unlimited immigrants. But PAP needs to hit KPI, so what are we gonna do?",
          "score": 4
        },
        {
          "text": "While i do not have the data, based on how many new citizens we had throughout the years and the current TFR, i believe they are no better than existing citizens at boosting the TFR.",
          "score": 4
        },
        {
          "text": "It's to cover up the inconvenient truth that reveals the failing of the government. The solution to OP's concerns is pretty straight forward. Grant more citizenships to PRs to maintain citizen population. Grant more PRs to maintain a sizable pool of residents to choose from to award citizenships to. Grant PRs to people with high-earning potential so that they save up so much that they are much less likely to become a tax burden 20-30 years later.",
          "score": 3
        },
        {
          "text": "Research in Western countries have shown that new citizens decrease their TFR after they settle down into their new host country.",
          "score": 3
        },
        {
          "text": "Unfortunately, i don't have the image that splits out the citizen population because they don't publish that. I feel the ratio won't be that far off, the trend will likely be similar as workers are more likely to convert and they unlikely will bring 2 children or more.",
          "score": 2
        },
        {
          "text": "that's how the world works, we are all feeding the p scheme, privatised profit publicised cost",
          "score": 2
        },
        {
          "text": "Doesn't the government already do those things? So OP's concerns are not very valid.",
          "score": 2
        },
        {
          "text": "immigrants also have babies; therefore increasing TFR. Your assumption is true for immigrants who come in to work and then die without having babies while at the same time only sinkies have babies",
          "score": 2
        },
        {
          "text": "You’re assuming new citizens won’t have any children and only you have “your” children. Then only this burden “your” children point is valid.",
          "score": 2
        },
        {
          "text": "I wonder what if they become citizens and don’t have any children. Does it mean we’ll forever be getting new citizens to beef up the working population? The PAP government like to claim that they’re very farsighted but so far we have not seen anything about what they think is the next cycle after bringing in new citizens. Their solution is for the short term beefing up citizens of working age. They haven’t really told us what’s next. What’s the sustainable new equilibrium?",
          "score": 1
        },
        {
          "text": "And they die in Singapore, rather than going back to their original country to retire. Which I would say is rare. The immigrants with children are the ones who stay here long-term, and want their children to benefit from SG's educational system. The ones without children are the ones who go home after working X years (and paying taxes) to retire at a lower cost of living.",
          "score": 1
        },
        {
          "text": "SG has been widely viewed as a stepping stone",
          "score": 1
        },
        {
          "text": "Given that fertility rate has bn falling, w/o or reducing immigration size, we’ll nt hv required talent size to support investments brought in frm overseas den der wld b reduced tax income received by gov & everyone wil suffer even more now & future. So eod costs hv2b lessened4folks2even think about havin kids💸💸💸💸💸",
          "score": 1
        },
        {
          "text": "Your children will be slaves for Singapore, song bo sinkies",
          "score": 1
        },
        {
          "text": "OP: \"Immigration usually to pull more working class.\" Got pull out of your ass arh.  Half of sgraw complaining good jobs going to foreigners and they don't think working class jobs are good. Unless you are like my delulu friend who said he is working class because he had to go to work every dayat his job at Meta.",
          "score": 1
        },
        {
          "text": "My working class here are just workers in general regardless of white/blue collar, just trying to show the point about the population ratios and the age bands that immigrants mostly enter as.",
          "score": 1
        },
        {
          "text": "biden's policies otw in.",
          "score": 1
        },
        {
          "text": "I doubt that whatever is said by OP isn't known to the morons at the helm. Instead of fixing the TFR and probably branding it as an impossible to solve issue, the overpaid millionaire pappy ministers simply opt for the short term gain/long term gain option and hide behind the overall growth figures to justify their paycheck and bonuses. Fundamentally it is business as usual here in corporate SG Pte Ltd - maintain profitability and ignore the social costs so that it can be kicked down the street for future generation to solve.",
          "score": 1
        },
        {
          "text": "jus import onlyyyyy youngsters ez mathsssssssssssssss",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qq5eie",
      "subreddit": "SingaporeRaw",
      "title": "From 3% to 25%: Jobs with the lowest and highest expected pay raises in Singapore in 2026",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qq5eie/from_3_to_25_jobs_with_the_lowest_and_highest/",
      "score": 15,
      "num_comments": 14,
      "created_at": "2026-01-29T18:49:53",
      "selftext": "For skilled professionals.",
      "comments": [
        {
          "text": "We all know what it takes to have 25% pay rise",
          "score": 37
        },
        {
          "text": "That one is 2500% increase",
          "score": 28
        },
        {
          "text": "800 a month to 200k+ a year is how many percent?",
          "score": 17
        },
        {
          "text": "from 3% (  1m to 1.03m) to 25% (100 bucks to 125) awesome",
          "score": 11
        },
        {
          "text": "fire 2 person let u do 3 person job ezpzzzzzzzzzz",
          "score": 11
        },
        {
          "text": "PLB can do it",
          "score": 11
        },
        {
          "text": "Michael Page and vulcan post all proganda is it? How can 25% pay raise be possible",
          "score": 10
        },
        {
          "text": "about 2400% to 230k",
          "score": 8
        },
        {
          "text": "a god fearing family man and husband who proclaims jesus as lord can do it so can you",
          "score": 7
        },
        {
          "text": "You didn't know meh? 2year experience can rise to 250k in 3 years",
          "score": 3
        },
        {
          "text": "I’m here at 2.25%",
          "score": 3
        },
        {
          "text": "\"Expected.\" Meaning made-up numbers again?",
          "score": 3
        },
        {
          "text": "Need strong oral skills?",
          "score": 2
        },
        {
          "text": "possible if you are the xiao san /s",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qq3zbg",
      "subreddit": "SingaporeRaw",
      "title": "Elderly man and woman taken to hospital after Mercedes-Range Rover parking dispute near Nex",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qq3zbg/elderly_man_and_woman_taken_to_hospital_after/",
      "score": 14,
      "num_comments": 8,
      "created_at": "2026-01-29T17:25:28",
      "selftext": "A 71-year-old man and a 63-year-old woman were taken to hospital following an alleged dispute over a parking lot in Serangoon Central on Jan 28.",
      "comments": [
        {
          "text": "So old still drive entry level merc and want to act gangster. Get a life.",
          "score": 6
        },
        {
          "text": "Sinkie own Sinkie, rich edition",
          "score": 2
        },
        {
          "text": "These people think dey gt money, big deal. ite also go hospital🤣🤣🤣🤣",
          "score": 2
        },
        {
          "text": "Now both can sleep well at night 😴",
          "score": 1
        },
        {
          "text": "No physical altercation right? Why need to go hospital?",
          "score": 1
        },
        {
          "text": "Lol.... Fight till go hospital over a lot?",
          "score": 1
        },
        {
          "text": "Utopia gone wrong",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qq96z7",
      "subreddit": "singaporefi",
      "title": "'I never thought I'd become a victim': How a healthcare worker lost about S$400,000 in an investment scam",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qq96z7/i_never_thought_id_become_a_victim_how_a/",
      "score": 83,
      "num_comments": 60,
      "created_at": "2026-01-29T21:55:40",
      "selftext": "",
      "comments": [
        {
          "text": "She literally slave her life for 30 years to give scammer all her savings. The scammer only worked less than a year. Death to all Scammers!",
          "score": 101
        },
        {
          "text": "Being added to an investment WhatsApp group is a red flag",
          "score": 42
        },
        {
          "text": "Although a lot of ppl condemn CPF, I still find it’s the safest option for older generations.",
          "score": 35
        },
        {
          "text": "It's safe for ALL generations since foolishness knows no age boundaries",
          "score": 33
        },
        {
          "text": "They do deserve the death penalty, especially those who run a scam centre. Wonder how many committed suicide after being scammed of their life savings.",
          "score": 30
        },
        {
          "text": "There are so many such investment chatgroups advertising on social media nowadays. Do due diligent checks. Reputable trading apps are the usual few, avoid little known trading apps. Be vigilant when others are over enthu in sharing insider tips and guiding you to invest bah.",
          "score": 29
        },
        {
          "text": "Found the scammer",
          "score": 21
        },
        {
          "text": "It should be something heavier than robbery offence",
          "score": 12
        },
        {
          "text": "Woah she asked her husband and her husband also didn’t see any red flags? Even handed cash to the scammers in person..",
          "score": 12
        },
        {
          "text": "Giving in cash to top up investment.... No matter who, do not trust!! At the minimal, it should be transacted in a registered financial instituition's office. Check the office and whatever goverment listing required to show legatimacy of the company/ institution.And I think those instituions will not accept cash this way. The money they must ensure it is clean too.",
          "score": 12
        },
        {
          "text": "The article already state she's the \"most financially savvy\" in the family. The line about the husband is therefore moot.",
          "score": 11
        },
        {
          "text": "Financial savvy does not necessarily mean being smart.\nBut props to her for coming out to share her experience.",
          "score": 8
        },
        {
          "text": "Scammers are the modern day robbers that break into your house and steal all of your money. One could say that the victims lack financial literacy, too easily frightened etc but then might as well as claim victims of robbers are physically weak and cannot defend themselves etc. It is the role of modern society and laws to form a collective good and protect those that cannot defend themselves (eg, your grandma who cannot defend against robbers)",
          "score": 7
        },
        {
          "text": "I got into one, I believe it is again advertised on FB.",
          "score": 5
        },
        {
          "text": "Well that is for her husband and her to learn the hard way. May already be too late",
          "score": 5
        },
        {
          "text": "Just report instantly",
          "score": 3
        },
        {
          "text": "There are many kinds of scams Fake friend scam, accuse of money laundering scam, love scam etc Each have a different way of manipulating the victim and exploiting their weaknesses. \nFor fake friend scam, it’s exploiting someone’s desire to help their friends in need.\nFor money laundering suspect scam, it’s exploiting people’s fear of getting into trouble with the law.\nLove scam is exploiting loneliness, which is a growing problem Not all scams are fallen for due to greed etc, it could be exploiting people’s insecurities and fears. Regardless, deceiving or manipulating people is an evil thing to do and we need to educate/stop them from happening as a society",
          "score": 2
        },
        {
          "text": "[ Removed by Reddit ]",
          "score": 1
        },
        {
          "text": "I feel no sympathy for their deaths. Taking advantage of people in a rut and/or less educated is everything wrong with the world. I include those billion dollar companies in the same category. All scammers! And I hope they all burn in hell!",
          "score": 1
        },
        {
          "text": "Yes I agree there are many types of scam. And if you notice, I am only talking about a very specific type of scam, in this thread context, the investment scam which can only occur by greed. And just to be absolutely clear, I do not condone scamming of any kind or forms. I hate scammers. At the same time, I bear no sympathy for investment scam victims because they allowed it to happen upon themselves due to greed and ignorance. In such specific scenarios, these victims should take accountability for their actions and truly reflect.",
          "score": -1
        },
        {
          "text": "You are entitled to your opinion. And I am not here to argue whose opinion is right. Seems like you are against capitalism. Funny thing is you are hateful because you aren't the beneficiary.",
          "score": -1
        },
        {
          "text": "Moomoo my beloved",
          "score": -2
        },
        {
          "text": "A robber is one who takes your property unwillingly. You did not give permission. In this scammer scenario, victims willingly gave them the money in hope of geeater gains. You see the difference? You cant be scammed if you did not allow them to. Whereas a robber can break into your home even if you did not allow them to.",
          "score": -5
        },
        {
          "text": "Ah yes no accountability.",
          "score": -22
        },
        {
          "text": "This means the scammer is good at what he/she does. Unlike crimes like kidnapping, extortion, refund scams, these scams are self inflicted. You cant be a victim of such particular financial scheme unless you fulfill the following conditions: 1) Greedy\n2) Lack of financial literacy\n3) Did not do due diligence\n4) Submit to FOMO Do I hate scammers? Yes. Would I wish it upon anyone? No. But to say death to all scammers is wild.",
          "score": -42
        }
      ]
    },
    {
      "id": "t3_1qqccis",
      "subreddit": "singaporefi",
      "title": "Pullbacks are when money is made",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qqccis/pullbacks_are_when_money_is_made/",
      "score": 28,
      "num_comments": 39,
      "created_at": "2026-01-29T23:55:05",
      "selftext": "Keep calm and carry on DCA\n\nThis whole drop probably triggered by Microsoft dropping 12%, then others follow suit because of stop losses, pulling the SP500 down. You have seen this movie before, you know what to do.",
      "comments": [
        {
          "text": "You comparing a single stock to an entire market bro",
          "score": 35
        },
        {
          "text": "This is what a Cape 40 market looks like.  Go up and down and index stays flat. No new money coming in, fund managers just keep rotating.",
          "score": 25
        },
        {
          "text": "Not always true. DCA-ed into SEA Ltd during 2021 and it never recovered…",
          "score": 23
        },
        {
          "text": "Because it is an individual company, a broad index will always return back to the top because government keep printing money.",
          "score": 18
        },
        {
          "text": "Let me know again how long it took for Japan to recover",
          "score": 17
        },
        {
          "text": "lol 10k still a baby",
          "score": 10
        },
        {
          "text": "As I said STILL A BABY. If you are excited by 20k gains, I think you still have a long way to go man. Stop embarrassing yourself",
          "score": 10
        },
        {
          "text": "“Triggered by Microsoft” lol. Look at crypto and gold.",
          "score": 8
        },
        {
          "text": "As I said still a baby",
          "score": 7
        },
        {
          "text": "Because retail is generally dumb. It is intentional. They are exit liquidity.",
          "score": 6
        },
        {
          "text": "Nah I’m not. I’m rich in real life",
          "score": 6
        },
        {
          "text": "Nice.  I piling up to refill my csp's.",
          "score": 3
        },
        {
          "text": "Vix already cooling below 18. False alarm.  Party continues.",
          "score": 2
        },
        {
          "text": "Ops I meant to reply to the sea ltd comment",
          "score": 1
        },
        {
          "text": "Bro…don’t shoot the wrong guy bro",
          "score": 0
        },
        {
          "text": "Fake drop la Party continues and greener than my house bush tomorrow",
          "score": -2
        },
        {
          "text": "30 plus years i think, but it still did recover",
          "score": -4
        },
        {
          "text": "blindly DCA without looking at valuations for individual stocks is just dumb...",
          "score": -4
        },
        {
          "text": "If your NW is a few mil, I’m x10 that just so you understand",
          "score": -6
        },
        {
          "text": "You must be a clown in real life. I’ll leave it as that",
          "score": -7
        },
        {
          "text": "Let’s make more money bro. There is always opportunity",
          "score": -8
        },
        {
          "text": "20k in gains today now :) Going up more",
          "score": -14
        },
        {
          "text": "Wanna compare wealth?",
          "score": -16
        },
        {
          "text": "Made another 10K trading AGQ today bro :) 😎",
          "score": -25
        },
        {
          "text": "Lol you must be new I made 10K today alone buying the dip in silver and selling",
          "score": -31
        }
      ]
    },
    {
      "id": "t3_1qq2xnv",
      "subreddit": "singaporefi",
      "title": "Best advice for investments",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qq2xnv/best_advice_for_investments/",
      "score": 6,
      "num_comments": 12,
      "created_at": "2026-01-29T16:20:26",
      "selftext": "I have about 10K available for investment each month. I’m new into the Singapore tax and investment system, I would appreciate any tips and what you would do in a similar situation.\n\nThe only but is that I have a relatively short timeframe here in SG about 1-2 years.\n\nHope you will help a fellow Asian out",
      "comments": [
        {
          "text": "Fullerton sgd cash fund is popular. many offer it. i am not personally invested in it so can't recommend.",
          "score": 4
        },
        {
          "text": "Singapore doesn't tax capital gains or most dividends, so that's nice. But there's 30% withholding tax from USA. What have you been investing in previously?",
          "score": 3
        },
        {
          "text": "I'm a Singaporean working in finance in the UK. What tax jurisdiction are you from/returning to? Do you have to pay taxes on your investments to your home country? Many countries have a system where if you leave the country, you dont have to pay tax to that government, but if you return within x years, you have to pay investment taxes for those x years that you weren't there. Does it make sense to try to stay on in Singapore a little longer to stop that from happening? I understand in the UK x = 5. Just because youre in singapore for 2 years, it doesnt mean your investment horizon is 2 years. You can set up an account with an international broker like Interactive Brokers and change you location as necessary. On taxes, assuming the above isnt an option, you can still invest in risk assets. Asssuming there are capital gain taxes in your country and cost basis isnt adjusted for when you return, just before you return to your home country, check if you have an investment gain, if so, sell the investment and buy back a similar product so that you realise the capital gains in Singapore and dont have to pay capital gains tax in those gains. If you made a loss, only sell it after you return to you home country to harvest those tax losses.",
          "score": 3
        },
        {
          "text": "Oh. But the gains are less than 1.5% p.a. for Singapore dollar money market funds. I guess if your intent is to treat SGD as a safe haven currency… that’s ok.",
          "score": 2
        },
        {
          "text": "Not sure how to help you because what really matters is whether your next country or home country is going to charge you capital gains tax. Singapore doesn't, but do you really want to buy stocks and sell in 1-2 years?",
          "score": 1
        },
        {
          "text": "That’s why I am more inclined to invest in a money marker fund or something that can give some return in that short amount of time.",
          "score": 1
        },
        {
          "text": "You may not be restricted to invest locally. Where will be your long term base country? It could be better if you are invest in a long term way even when you left Singapore.",
          "score": 1
        },
        {
          "text": "1-2 years too short for stock/etf. money market fund is one of the more popular recommendation for short term cash parking.",
          "score": 0
        },
        {
          "text": "OP is in SG for 2 years l. Doesnt mean their investment horizon is 2 years. They can continue with their investment after they leave SG.",
          "score": 0
        },
        {
          "text": "I will check it out. Thanks!",
          "score": 0
        },
        {
          "text": "Previously I had been investing into stocks, but since I have moved here I sold all my stocks domestically",
          "score": -1
        },
        {
          "text": "Do you have any particular fund you could recommend?",
          "score": -2
        }
      ]
    },
    {
      "id": "t3_1qq0vzr",
      "subreddit": "singaporefi",
      "title": "40F, 100k redeployment",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qq0vzr/40f_100k_redeployment/",
      "score": 6,
      "num_comments": 23,
      "created_at": "2026-01-29T14:21:54",
      "selftext": "Hi all,\n\nI’ve planned the following after reading up, but I just want to run it by people who know better than I do.\n\nvwra - 20%\n\niwda - 25%\n\neimi - 20%\n\nflqa - 10%\n\nmaybe 5% in bonds? (any suggestions?) and the rest cash for DCA.\n\nMy thinking is that I’m separately highly invested in US tech (100k mostly PLTR, NVDA), thus why I’m putting a bit more weightage on emerging markets this time round.\n\nMarkets are also quite volatile right now, I’m not sure if deploying all 100k right now is a good idea. I know they say time in market beats timing the market, but not so much if a big crash comes this year. And I know no one has a crystal ball, but I guess I’m just looking to bounce my thoughts off people and not in my own silo.",
      "comments": [
        {
          "text": "I.... Okay let's try this... Since you know NVDA and PLTR is alot of your holdings, having EIMI and tilting away from that is good awareness on your part. BUT you're like triple dipping into some markets which is not efficient. Such as... South Korea. VWRA, EIMI and FLQA have South Korea... Given that the Korean market is heavily dominated by a single conglomerate (Samsung), you are unintentionally taking a massive bet on one country and one company. Next, on the similar point, holding VWRA alongside IWDA and EIMI is messy. You are paying fees for VWRA to rebalance developed/emerging markets for you, but then manually unbalancing it by buying IWDA and EIMI separately. Choose between VWRA OR the combo of IWDA + EIMI. Personally, 5% allocation to bonds is generally considered \"insignificant.\" It is too small to provide meaningful downside protection (cushioning a crash) or yield, but it still adds a layer of complexity... might want to 10% or even 20%. You can cut if you want as well. Regarding fear of the market, you can try DCA over a period of 6 months - 8 months. However, ensure you have a strict schedule (e.g., \"deploy $X on the 1st of every month regardless of price\") to prevent \"cash\" from becoming \"market timing\". If it does crash in 6 - 8 months, great, youre automatically going to buy the dip regardless...",
          "score": 11
        },
        {
          "text": "In that case, you can probably tune IWDA + EIMI ratio, probably drop the rest of the tickers, including vwra. VWRA is around ~10% EM. You want to weight more towards EM abit more... Do you want to try 20% EM (EIMI) and 80% IWDA ? Make sure you check and rebalance this every 6 months or every year so that you can stay within your allocation.",
          "score": 3
        },
        {
          "text": "The way to do this is not to list down percentages by ETF. You should decide how much you want to allocate to each region of the world (or sector). Then you figure out what combination of ETFs will get you there in the least complicated way.",
          "score": 3
        },
        {
          "text": "Just throwing it out there why not SGX? ST Index, the banks, key SG industry leaders like national carrier, ST Eng.",
          "score": 2
        },
        {
          "text": "hmm.. very valid points. I definitely don’t want to be too heavy on Korea market. I actually wanted more emerging markets in my portfolio. I guess I wanted vwra in there because it’s like just hedging on the whole global market, like, safe bet kinda thing. But I put iwda and eimi to up my emerging markets allocation manually, in turn, bringing down my US weightage. But I guess that doesn’t make sense. I’m just using logic to think things through since I don’t have the financial knowledge. thus grateful for the help!",
          "score": 1
        },
        {
          "text": "eimi + iwda does seem to meet what I’m looking for. but at this rate, do you think in the end i might as well just go vwra all the way, chuck it and leave it. another redditor mentioned imid, which to me looks better than vwra if i go with 1 fund since it includes small caps. any thoughts on that?",
          "score": 1
        },
        {
          "text": "Eimi + iwda vs vwra is basically asking if you want to overweight in EMs or not. If you dont want to, or have no idea the allocation, VWRA. Then VWRA vs IMID. IMID have small caps. This means the rest of the holdings are \"diluted\". Yes you're more diversified but also you're inviting more volatility. Small Caps are inherently more volatile than medium caps and then large caps. So its up to you. People opt to not include small caps to reduce volatility. But people include it because its really the all-encompassing one. Its up to you.",
          "score": 1
        },
        {
          "text": "TECHNICALLY, FLQA have some of those, they hold DBS!!",
          "score": 1
        },
        {
          "text": "What is your goal for deploying this 100k?",
          "score": 1
        },
        {
          "text": "I liquidated one of the funds that I set up with a friend when she first started out. It was in the red for years. Yeah, one of those stories. 😅",
          "score": 1
        },
        {
          "text": "That wasn't the question tho",
          "score": 1
        },
        {
          "text": "long term growth. chuck it in for 10-15years and hope it grows enough to help supplement my retirement years. is that too naive?",
          "score": 1
        },
        {
          "text": "With your current plan, no. But I would just go all in on IMID for simplicity, plus EIMI if EM is really important. But the same cannot be said for your NVDA and PLTR allocation. You got lucky the last few years, you need an exit plan for when the luck runs out. And if you want to avoid drawdowns, having less NVDA and PLTR will help much more than having 7% of your money in cash.",
          "score": 1
        },
        {
          "text": "oo IMID looks good. gonna look into that more. yeah, I’m looking to rotate out of my heavy pltr, nvda, tsla portfolio. not sure if i should wait it out for a better exit timing since these stocks are down 10-27% from ath. or is that a noob mindset?",
          "score": 1
        },
        {
          "text": "Might want to diverse out your US Tech plans for ETFs to reduce risk exposure",
          "score": 1
        },
        {
          "text": "yeah, I’m very heavy on pltr, nvda, tsla. actually closer to 180k. they’re shares I bought a while back and never touched.",
          "score": 1
        },
        {
          "text": "Might want to relook the portfolio first",
          "score": 1
        },
        {
          "text": "Do let me know when you sell any of them.. I’m in the same position as you.",
          "score": 1
        },
        {
          "text": "oh.. I’ll be the last person you’d wanna follow 😆 \nbut i do feel pressure to cut them soon. just the dilemma if when, since pltr is down 27% from ath.",
          "score": 1
        },
        {
          "text": "Isn't vwra pretty much iwda + eimi?",
          "score": 0
        },
        {
          "text": "And the funny thing is, thats not the biggest problem (imo)...",
          "score": 0
        },
        {
          "text": "Tbh I didn't finish reading the post so this is the only thing I noticed on first glance",
          "score": 0
        },
        {
          "text": "sell both pltr n nvda to go cash heavy. 2026 is likely to be a correction year, would suggest going into stocks with less AI exposure or hold cash. if i were u i would hold cash",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qq7jwr",
      "subreddit": "singaporefi",
      "title": "Which PIMCO fund to buy on IBKR?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qq7jwr/which_pimco_fund_to_buy_on_ibkr/",
      "score": 3,
      "num_comments": 3,
      "created_at": "2026-01-29T20:43:39",
      "selftext": "Would appreciate some help selecting the right fund to buy on IBKR:\n\nor\n\n--\n\nThe investment objective is 'Bucket 2' if you will - 3-5yr horizon, SGD capital preservation with better returns than treasuries (Eg:IB01), to refill cash reserves when needed.\n\nWhich is the appropriate one? (Or if there's a better alternative)\n\n--\n\nAlso, on the IBKR pages for both funds, I notice there's no ask/bid price like we see on VWRA etc. So we just enter the SGD amount we want to buy and place a Market buy order?\n\nThank you so much!",
      "comments": [
        {
          "text": "I’d say the first one for your stated objectives where the income distribution doesn’t come into it at all. The first one has lower fees, and is more globally diversified whereas the second one is >80% US and US mortgage agency debt in particular. These are unit trusts so there’s no bidding and no stock exchange. The price for each day is calculated after that day. You put in how much you want to buy in dollars, and afterwards they tell you how many units you got and at what price. It takes a few days to process fully.",
          "score": 3
        },
        {
          "text": "IE000E5H5AN1 is an ETF, and I have no idea how to buy it. I remember it being mentioned before as an SGD-hedged version of AGGU, but nobody could figure out how to buy it then either.",
          "score": 2
        },
        {
          "text": "Thank you, that's very clear and helpful. Is there another instrument I should be considering for the same objective? (Eg: The iShares IE000E5H5AN1 seems to have a much lower expense ratio, but is not available on IBKR)",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qq8spx",
      "subreddit": "singaporefi",
      "title": "Rules to subscribing to HK IPO",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qq8spx/rules_to_subscribing_to_hk_ipo/",
      "score": 1,
      "num_comments": 2,
      "created_at": "2026-01-29T21:39:00",
      "selftext": "Hi everyone, i am looking to subscribe to a HK IPO using moomoo. But according to the moomoo app, MAS has set a min of 200 lots (20,000 shares) to be subscribed which will cost me $2mil dafuq?? Are there any brokers that i can use to circumvent this",
      "comments": [
        {
          "text": "You’re running into a MAS rule that applies tonon‑accreditedinvestors subscribing toforeignIPOs through SG‑licensed brokers. Are you asking on how to bypass the regulators?Become an Accredited Investor.",
          "score": 3
        },
        {
          "text": "By using an international broker app.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qq3u3i",
      "subreddit": "singaporefi",
      "title": "drs",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qq3u3i/drs/",
      "score": 0,
      "num_comments": 8,
      "created_at": "2026-01-29T17:16:05",
      "selftext": "Hi, I need some advice. I have been under the Debt Repayment Scheme (DRS) since 2022, and it was supposed to end in January 2027. However, the Official Assignee (OA) discharged me early because I was unable to pay the total amount of $750.\n\nI currently still owe about $10,790, and I now only have one lender left. I am feeling very stressed and unsure of what to do next, as I still need help managing this debt.\n\nShould I write in to the OA again to seek assistance, or should I approach CCS directly for help?\n\nThank you.",
      "comments": [
        {
          "text": "huh borrow 5k ??? but i thought is to reduce debt why need to borrow another 5k",
          "score": 3
        },
        {
          "text": "i also have ask around some credit consuling they say once i am out already is very hard for me to get back in it unless my debt is back to 15k but i need to wait for 5 years then i can reapply it again so now i dk i have been very stress with it idk will they still contact me a not the lender",
          "score": 2
        },
        {
          "text": "If that is the case, do find alternative sources of income to try supplement a portion of this $750 monthly sum.",
          "score": 2
        },
        {
          "text": "How come the total amount left is $750 ? Do write in to OA and approach to CCS for further assistance as well.",
          "score": 1
        },
        {
          "text": "the 750 is total expenses one per month that i have to pay",
          "score": 1
        },
        {
          "text": "Maybe you can liaise directly with this one lender left for an interest free, longer installment period with the monthly repayment amount within your means?",
          "score": 1
        },
        {
          "text": "Coz u need to hit 15k to qualify for CCS so might as well right?",
          "score": 0
        },
        {
          "text": "borrow another 5k then apply for CCS.",
          "score": -4
        }
      ]
    },
    {
      "id": "t3_1qq3w55",
      "subreddit": "singaporefi",
      "title": "Advice on starting business",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qq3w55/advice_on_starting_business/",
      "score": 0,
      "num_comments": 11,
      "created_at": "2026-01-29T17:19:51",
      "selftext": "Hi all - first time posting here, but have been lurking on threads like this for a while. Looking for a sanity check from anyone who’s been through this.\n\nMy spouse is currently on a DP. She previously ran a small overseas-based business and now wants to properly operate in Singapore with SG clients. Her DP LOC was approved initially but renewal failed due to local-hire requirements (can’t justify a local hire right now as it’s just her running the business).\n\nWe’re considering restructuring as follows:\n\n• Incorporate a Singapore Pte Ltd (already have a sole prop, but will convert that)\n\n• One spouse (already on EP) acts as resident director\n\n• Founder (DP holder) is shareholder/director\n\n• Inject meaningful capital (mix of paid-up capital + founder loan)\n\n• Apply for an EP for the founder at a market-aligned salary (~7–8k/month)\n\n• Company has <10 employees, so no MyCareersFuture ad\n\nHas anyone successfully done something similar (founder/spouse EP via own Pte Ltd after LOC didn’t scale)? Any gotchas with MOM, capital levels, or timing to watch out for?\n\nNot looking for legal advice — just lived experience. Thanks in advance!!",
      "comments": [
        {
          "text": "AFAIK EP holder cannot moonlight… it’s against MOM law.",
          "score": 4
        },
        {
          "text": "Note \"proper\" corp secy. There are far more garbage than proper ones out there. Make sure you ask them for an itemised quote from the start else once the garbage ones lock you in low initial fees, then they tack on ridiculous fees for other services.",
          "score": 2
        },
        {
          "text": "They permit some EP holders to become resident directors of local Singaporean companies, but you have to obtain consent from MOM. So that’s something I will have to get.",
          "score": 1
        },
        {
          "text": "Talk to acra or hire a proper corp secy..",
          "score": 1
        },
        {
          "text": "Yes agree - that’s the next step!",
          "score": 1
        },
        {
          "text": "Good tip - any recommendations for corp secretary in Singapore?",
          "score": 1
        },
        {
          "text": "Don’t quite understand, you can pay 7-8k salary yet you can’t hire a local? Anyway it should work, though not sure if you can be a director unless you declare to your company.",
          "score": 1
        },
        {
          "text": "Yes agree - I’d need to get my employer onside and have MOM approval. My wife is on a DP, so she’s not allowed to work in Singapore. The goal is to move from DP-LOC (which ties renewals to immediate local hiring, which isn’t possible right now) to an EP so she can lawfully operate her own solo consultancy in Singapore. Hiring locals is the plan once the business scales in revenue.",
          "score": 1
        },
        {
          "text": "If she can get paid 7-8k why can’t you hire a local for 1.6k? And she had her own sole prop",
          "score": 1
        },
        {
          "text": "Regarding the salary, there are two components into it. The first one is the minimum salary for your sector and age. These levels are published by MoM. The second component is the Compass assessment. The EP application must score 40 points. Depending on your application, the salary might be raised to the 65th or 90th percentile of the market. That could be translated to a few thousand dollars more per month. Regarding the paid up capital/loan, a general advice, that has been provided to me from agencies, is that it should cover at least the annual salary of the EP application. That's",
          "score": 1
        },
        {
          "text": "There is personalised EP if she is qualified. Company cannot apply for EP if there are not enough local employees iirc. DP can open a company herself, just that whether she is able to get pass. That's another story.",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qqt00z",
      "subreddit": "singaporefi",
      "title": "How long will it take to be an insurance agent?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qqt00z/how_long_will_it_take_to_be_an_insurance_agent/",
      "score": 0,
      "num_comments": 14,
      "created_at": "2026-01-30T10:31:04",
      "selftext": "Dear fellow Redditors, I am interested in finding out the entire process to be come an insurance agent, from the 1st step to getting coded, these are the questions that I have:\n\nHow to register for the course and exams?\n\nDo one needs to enrol with an insurance agency or company to be qualified for the course (if any) and the exams?\n\nHow long will the entire process takes?\n\nIs there a website or so that one can look at to know any other pre-requisite and what is to be expected?\n\nAny minimum required education level?\n\nPlease put any other tips and advice that you may have, I am just considering first or maybe gonna try it out to see how it goes.\n\nThank you.",
      "comments": [
        {
          "text": "Probably the worst place you could have ever chosen to ask this question.",
          "score": 15
        },
        {
          "text": "Don’t do it lol",
          "score": 5
        },
        {
          "text": "First step, just don’t.",
          "score": 4
        },
        {
          "text": "2nd step,get out",
          "score": 2
        },
        {
          "text": "New to this sub. Genuinely wanna find out how people view insurance agent?",
          "score": 1
        },
        {
          "text": "Salesman",
          "score": 1
        },
        {
          "text": "Enquired about it before when I was young and dumb. Generally if you go through an agency, they can provide you with the materials to prep for the exam and also pay for you to take it the first time. Most people pass within the first few tries. If you fail, subsequent retakes will come out of your own pocket. Pay structure and commission depends on the agency and the branch of the agency that you apply under.",
          "score": 1
        },
        {
          "text": "It takes around half a year to a year? But it's not a good idea.",
          "score": 1
        },
        {
          "text": "Nothing wrong with trying out. But you must understand that ultimately it's a sales role. Yes, it's a saturated market in Singapore, but insurance is still important, and there's always a need for it. How much you earn is how much you're willing to hustle (ETHICALLY). Good luck.",
          "score": 1
        },
        {
          "text": "Hello Op, agent here. Don't do it. Just not. However I will answer your questions. The insurance agency you are joining will be able to book for you. The market practice is the recruiting manager pays for your first test or you can claim your passing attempt. If you want to book by yourself, go Singapore college of insurance and book the exams directly, it is more expensive booking yourself. No need. Depending on how fast you study and take the exam. The fastest I seen someone was 5 days. He studied on monday, took the exam. Tuesday morning, Tuesday afternoon to evening study next exam. Or it might take you months. After getting RES5 + M9 + M9A, you can apply with the insurance company, they will start the background checks and then lodgement with MAS for your RNF number. If all clean, around 2 weeks. Currently govt diploma. Please dont join insurance based on a recruitment talk selling financial freedom. If you want a commission based job for making money firsts, please go property sales. After running out of friends and family to sell to, many many agents leave because their agency does not provide sufficient support.",
          "score": 1
        },
        {
          "text": "Hahaha I'll bite. My terminologies are all old ah. Find their current equivalent. To be a normal agent... 6 months will do it. Pass m5, m9, m9a, HI can liao. To be a good agent, full time take exams. Prolly 1 year. Take extra, For gi, Comm gi, bcp, pgi For unit trusts with a broker, m8, m8a For listed securities, m6 and m6a M6, m6a is where most will trip. But if you do get all the certs, you still gotta find a place that's willing to accept. Most tied agencies won't do brokers, so the m8s and m9s will be useless. Most agents u see online only have the 4 basic ones. Good luck",
          "score": 1
        },
        {
          "text": "They view us as Rolex and car funders.",
          "score": 0
        },
        {
          "text": "See which agency you want to join, they should be able to advise you Follow point one, best to go with agency From what I gathered (10 years ago), it should be around 3 to 4 months Any web search will give you the results If I recall, GCE “O” Levels for starters",
          "score": -1
        }
      ]
    },
    {
      "id": "t3_1qqc00r",
      "subreddit": "singaporefi",
      "title": "Hi everyone, has anyone here gone for a trading class by TraderDeeKay? Would love to hear your experience.",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qqc00r/hi_everyone_has_anyone_here_gone_for_a_trading/",
      "score": 0,
      "num_comments": 9,
      "created_at": "2026-01-29T23:42:28",
      "selftext": "Hi everyone, has anyone here gone for a trading class by TraderDeeKay? Would love to hear your experience.",
      "comments": [
        {
          "text": "Trading classes are basically a scam. They make their income by selling classes. If their strategies are so good, they would keep them secret because other people doing the same thing would erode their profits.",
          "score": 8
        },
        {
          "text": "TraderDeeKay pumps his ads only to the younger crowd.. Cos easier to fleece.. The older crowd generally sees through his bullshit..",
          "score": 2
        },
        {
          "text": "You'll be better off just watching YouTube videos. Paid trading courses are all scams",
          "score": 2
        },
        {
          "text": "not necessarily true. the variance of trading for a living eventually wears into your soul and you start to look for more stable sources of income such as teaching courses. but agree that 99% of trading courses are scams",
          "score": 1
        },
        {
          "text": "What are you hoping to get out of it?",
          "score": 1
        },
        {
          "text": "I have not attended any of their courses but have looked at some of their content. I think it's good for beginners but frankly, most things they try to teach can be learnt from reading.  There's no real alpha to be gained by attending their courses.",
          "score": 1
        },
        {
          "text": "Why pay money to learn how to gamble? If you want to learn investing, then there are free resources everywhere (countless on reddit and YouTube for example).",
          "score": 1
        },
        {
          "text": "I’m actually hoping to be able to learn some tried and tested trading strategies that work and gain more knowledge in trading",
          "score": 0
        },
        {
          "text": "I have to disagree with this though, because @tradewithstan is actually very legit. I didnt attend his classes (though my friends did) but instead watch his insta stories over the years and learnt trading from there. He posts his P&L often and is usually right when he calls the bottom (so far in 6 years of his channel i only seen him called the bottom wrongly twice, which is late last year).",
          "score": -2
        }
      ]
    }
  ]
}