{
  "schema_version": "raw_scrape_v1",
  "report_id": "2026-02-19",
  "scraped_at": "2026-02-19T12:35:34.432283",
  "subreddits": [
    "singapore",
    "askSingapore",
    "SingaporeRaw",
    "singaporefi"
  ],
  "total_posts": 36,
  "total_comments": 417,
  "posts": [
    {
      "id": "t3_1r7vott",
      "subreddit": "singapore",
      "title": "'You are actually being racist to us': Student calls out refusal to speak Malay or English in S'pore",
      "url": "https://old.reddit.com/r/singapore/comments/1r7vott/you_are_actually_being_racist_to_us_student_calls/",
      "score": 892,
      "num_comments": 330,
      "created_at": "2026-02-18T14:36:59",
      "selftext": "",
      "comments": [
        {
          "text": "I interact with foreigners almost daily. And common experience among me and my colleagues that PRCs are the biggest grp that can't speak English and some even refuse to learn it. \n\nBecause they can survive here without needing to learn it. Sticking to their own bubbles and not venturing outside. Some even work here for 10 years and their English worse than 3-4 years old child.\n\nEnglish language test needs to be mandatory for foreigners wanting to work here.\n\nEdit: I worked retail in my late teens and company decided to hire staff from PRC after some time. They were uni students/grads so they understood some English but not enough to work retail in orchard where there are many tourists, the prc staff once asked my why I don't learn mandarin :| . Local customers complained about it a few times.",
          "score": 1133
        },
        {
          "text": "PRCs are a pain in the ass in the construction industry.\n\nIndians workers come here, they learn to speak and understand English. May not be fluent but at least we can communicate with them.\n\nSame with Bangladeshi, Myanmar, Thais, etc. They all try their hardest to at least learn basic English.\n\nBut almost all PRC workers can't understand English. It's not that they're too dumb to learn English, they're very skilled workers in the first place. They simply just refused to learn and speak English.",
          "score": 719
        },
        {
          "text": "there needs to be a mandatory english language test for all prcs getting pr/work visas",
          "score": 575
        },
        {
          "text": "I am Chinese. And even as a majority in Singapore, I don’t feel comfortable that colleagues or mates in NS speak mandarin in groups when there are non-Chinese around.\n\nDo remind each other to “tune back to channel 5” as appropriate. Racial harmony is something that Singapore should be proud of and let’s not take it for granted.",
          "score": 561
        },
        {
          "text": "Even at new citizen tours and ceremonies there’s some refusing to speak English, and they get away with it, special arrangements are made for them.",
          "score": 269
        },
        {
          "text": "Most of these comments really missing the point. It is expected many Elderly Singaporeans cannot speak English. The problem is new immigrants and younger people who only speak Chinese.",
          "score": 234
        },
        {
          "text": "A lot of people are saying \"but the old people\", yeah of course if you're old then sure but what's the excuse for the younglings?",
          "score": 167
        },
        {
          "text": "I worked as a Dr in Singapore.\n\nI’ve had a patient who works as an accountant. Originally from Shanghai. Worked in Singapore for 26 years, obtained citizenship. Cannot answer what’s your name and IC number when asked in English to my Malay clinic staff. I need to come in and intervene….\n\nSia suay.",
          "score": 142
        },
        {
          "text": "A lot of what he says is not wrong. Definitely need people to be speaking a common language to get along well with each other.\n\nBut of course, the majority are going to say he's complaining and making a din out of nothing. Because empathy is sorely lacking for some reason.",
          "score": 80
        },
        {
          "text": "Agree that a basic English test should be done. Old people not knowing the language will die off and take their inability to speak the language with them. \n\nIf the government is now asking us to learn the language of AI so that the country can continue to progress, then why can’t we also demand this basic too? Especially since it was forced upon us to learn English and then carried on with “speak good English” campaign.",
          "score": 44
        },
        {
          "text": "Me and my friends we will use super broken English, I want this. I want that. This is what. This what. I want water. If they can't catch even this basic English. Like kindergarten English, we just walk away and go to another fnb. We reverse integrate for them. Best part is when the manager is behind them and gave us a blank look when we cancel order and walk away.",
          "score": 27
        },
        {
          "text": "I know of PRC converted to SG citizens who can't even speak proper English after being in SG for over a decade. And yes they survived by sticking to their PRC communities and using China social media apps.",
          "score": 26
        },
        {
          "text": "Work in service and I can say I'm sick of PRC customers. They just come to the counter and expect everyone to understand them. No effort to learn English and assimilate never mind. No effort to Google translate also. Haven't even factor in the entitlement/attitude problem.",
          "score": 25
        }
      ]
    },
    {
      "id": "t3_1r8mzu9",
      "subreddit": "singapore",
      "title": "A Singaporean might had fought for Israel during the Gaza conflict according to Al Jazeera",
      "url": "https://old.reddit.com/r/singapore/comments/1r8mzu9/a_singaporean_might_had_fought_for_israel_during/",
      "score": 188,
      "num_comments": 0,
      "created_at": "2026-02-19T10:24:34",
      "selftext": "",
      "comments": []
    },
    {
      "id": "t3_1r848s8",
      "subreddit": "singapore",
      "title": "Tampines Rovers beat Cong An Ha noi 3-1, advancing to the quarter finals!",
      "url": "https://old.reddit.com/r/singapore/comments/1r848s8/tampines_rovers_beat_cong_an_ha_noi_31_advancing/",
      "score": 133,
      "num_comments": 32,
      "created_at": "2026-02-18T22:20:34",
      "selftext": "",
      "comments": [
        {
          "text": "Tampines Wei",
          "score": 25
        },
        {
          "text": "Amazing turnaround from the last 2 games, let's go Tampines!",
          "score": 22
        },
        {
          "text": "It could have been a rout if that fourth Tampines goal was onside, lol.",
          "score": 20
        },
        {
          "text": "I wanted a headline that goes \"Stags whack The Public Security Team\"",
          "score": 17
        },
        {
          "text": "crazy crazy atmosphere today from both sides, but especially ont he tampines side. there were a few Vietnamese in the home stand as there were not enough seats for them",
          "score": 14
        },
        {
          "text": "Tampines didnt sit back and parked the MRT - they sat back and scored goals.\n\nGood team effort!",
          "score": 7
        },
        {
          "text": "&gt;_The Stags had to **hand 16-year-old American goalkeeper Kasey Rogers his senior debut**, after No. 1 custodian Syazwan Buhari was ruled out due to a head injury.\n\n&gt;_The Singapore American School student was barely troubled but kept his composure when needed._\n\nNgl, I didn't know that the goalkeeper is only 16 years old. He sure looked pretty unfazed!\n\nhttps://www.straitstimes.com/sport/football/tampines-rovers-book-acl2-q-final-berth-after-3-1-win-over-cong-an-ha-noi",
          "score": 7
        },
        {
          "text": "Anyone was at Jalan Besar stadium? The Rovers Fan crowd must have went crazy. Sucks i couldn't be there.",
          "score": 6
        },
        {
          "text": "Great showing from Tampines, hope we can go all the way",
          "score": 6
        },
        {
          "text": "Other clubs should be more careful about fielding ineligible players and cautious when they whack S league Clubs at home. LCS and now Tampins triggered the massive  buff  at home after meeting both conditions..",
          "score": 6
        },
        {
          "text": "Would have been one other thing if they had gone through barely with a loss to CAHN. \n\nBut despite being gifted the first leg tie, Tampines kept their side of the bargain and won their own home leg. \n\nIf only Trent can stop missing open goals...",
          "score": 6
        },
        {
          "text": "Amazing",
          "score": 4
        },
        {
          "text": "the big match against LCS gonna be spicier now",
          "score": 4
        },
        {
          "text": "Watched the match. A much better performance than the first leg. More pressing and better play.",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1r7yxjj",
      "subreddit": "singapore",
      "title": "Fire breaks out at Teban Gardens HDB block; about 150 people evacuated",
      "url": "https://old.reddit.com/r/singapore/comments/1r7yxjj/fire_breaks_out_at_teban_gardens_hdb_block_about/",
      "score": 100,
      "num_comments": 16,
      "created_at": "2026-02-18T17:56:44",
      "selftext": "",
      "comments": [
        {
          "text": "Cudos to the MP for rushing to the scene on a PH. \n\nSeems like in Singapore the MP is more than a representative in parliament. SMLJ big thing small thing all need MP to rush down to handle. Macam village chief. Then Singapore must be a federation of villages and parliament is the council of village elders 😂\n\nLuckily no one is injured.",
          "score": 64
        },
        {
          "text": "A lot of incidents this CNY it seems",
          "score": 46
        },
        {
          "text": "Year of the Fire Horse really strong...",
          "score": 10
        },
        {
          "text": "Year of Fire horse.\n\nGong xi fa cai.",
          "score": 2
        },
        {
          "text": "Fire horse is real",
          "score": 2
        },
        {
          "text": "What do we think of smoke alarms in flats? At least it's an alert to others?",
          "score": 2
        },
        {
          "text": "Electrical, yeah right.",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1r82u4m",
      "subreddit": "singapore",
      "title": "Rail task force’s proposals will help strengthen S’pore’s MRT network ‘over next decades’: Experts",
      "url": "https://old.reddit.com/r/singapore/comments/1r82u4m/rail_task_forces_proposals_will_help_strengthen/",
      "score": 74,
      "num_comments": 36,
      "created_at": "2026-02-18T21:21:49",
      "selftext": "",
      "comments": [
        {
          "text": "&gt;_While the experts said measures such as the upgrades to the power supply system are necessary to strengthen long-term rail reliability, **Sengkang resident Leslie Soh, 33, said the issue should have been accounted for during the design stage**, minimising the need for any large-scale planned disruptions._\n\nLocal non-expert resident probably gave the most blunt comment lol",
          "score": 151
        },
        {
          "text": "wow, who would have guessed that proper maintenance and renewal of parts are important to prevent rail breakdowns.",
          "score": 73
        },
        {
          "text": "Wow didn’t know you don’t need to be rail certified to work on train and only 16% of the engineers are certified.",
          "score": 62
        },
        {
          "text": "Lanjiao la",
          "score": 33
        },
        {
          "text": "well, overload the infra (NEL is a great example) and no plans or investments in alternatives when things are almost broke. We seriously need alternative from punggol coast to city area. Even a light rail or tram or whatever that can be done fast enough to north south or other lanes. If this goes through the eastern side of punggol, sengkang etc all the new estates will be better connected ad also alternative route to city.",
          "score": 19
        },
        {
          "text": "&gt;will help strengthen S’pore’s MRT network ‘over next decades’\n\nFamous last words. the problem is not technical. it's organizational. and the experts have no expertise on the organizational issues. problems will still crop up after the review.",
          "score": 6
        },
        {
          "text": "how about improving reliability NOW?",
          "score": 6
        },
        {
          "text": "Then why decades ago didnt propose anything?",
          "score": 3
        },
        {
          "text": "Who are the so called experts?",
          "score": 3
        },
        {
          "text": "Finally, we have our very own ToQger.",
          "score": 1
        },
        {
          "text": "Instead of experts, just put the minister's name",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r8k27z",
      "subreddit": "singapore",
      "title": "Commentary: Singapore films win international awards",
      "url": "https://old.reddit.com/r/singapore/comments/1r8k27z/commentary_singapore_films_win_international/",
      "score": 50,
      "num_comments": 17,
      "created_at": "2026-02-19T08:13:11",
      "selftext": "",
      "comments": [
        {
          "text": "I don’t have to click the article to know that Liang Popo vs Ah Beng isn’t in it",
          "score": 32
        },
        {
          "text": "Artsy films normally win awards. Artsy films have no mass appeal. Jack neo slop is trash tier. Singaporeans love jack neo slop.",
          "score": 29
        },
        {
          "text": "plb.leopard.crawl.mp4",
          "score": 12
        },
        {
          "text": "If you guys havent checked it out, please please do watch \"A Good Child\"!\n\n It is on Netflix now. It is surprisingly a good watch. Support quality local movies!",
          "score": 9
        },
        {
          "text": "“Public funding and institutional support play an important role. But they cannot be the sole foundation of an industry.” Unfortunately this is not reality… every country in the world with a good film industry basically has some sort of cash/tax rebate for the production companies… largest i’ve seen at 40%.",
          "score": 4
        },
        {
          "text": "Jack neo is horrible at his job and still making good money and been doing it for decades. You cant convince me otherwise",
          "score": 3
        },
        {
          "text": "A lot of our more artistically successful filmmakers have high achieving or privileged backgrounds. Naturally, this puts them at a disadvantage in creating stories that appeal and resonate with the average Singaporean. \n\nNot that I like his work, but that's why Jack Neo is so successful, and also why others who want to have a shot at commercial success locally tend to follow in his mold.",
          "score": 1
        },
        {
          "text": "Singaporeans: And so?",
          "score": 0
        },
        {
          "text": "To be 100% real, the local filmmaking scene likes to whine about supporting local talent but proceed to put out the most mid films ever.\n\nI ain't paying for that shit.",
          "score": -1
        }
      ]
    },
    {
      "id": "t3_1r84wxl",
      "subreddit": "singapore",
      "title": "Fire at Chinatown restaurant on CNY day 2, no injuries reported",
      "url": "https://old.reddit.com/r/singapore/comments/1r84wxl/fire_at_chinatown_restaurant_on_cny_day_2_no/",
      "score": 39,
      "num_comments": 3,
      "created_at": "2026-02-18T22:47:22",
      "selftext": "Responding to *Mothership's* queries, the Singapore Civil Defence Force (SCDF) said they were alerted to a fire at 52 Smith Street on Feb. 18 at 2:10am.\n\nThe address is for the Chinese restaurant Wan Nian Stone Pot Fish.\n\nAccording to SCDF, the restaurant's kitchen was on fire.\n\nFirefighters entered the smoke-filled unit and extinguished the fire with two water jets.\n\nNo one was inside the restaurant at the time of the fire, and there were no reported injuries.\n\nThe cause of the fire is currently under investigation.",
      "comments": [
        {
          "text": "So many fire incidents nowadays 😂",
          "score": 14
        },
        {
          "text": "[Video of incident from the adjacent block](https://www.reddit.com/r/singapore/s/qvaYB23T16)",
          "score": 5
        }
      ]
    },
    {
      "id": "t3_1r8m9na",
      "subreddit": "singapore",
      "title": "Little Professors Learning Centre issues: Parents make police reports over GIRO double payments",
      "url": "https://old.reddit.com/r/singapore/comments/1r8m9na/little_professors_learning_centre_issues_parents/",
      "score": 28,
      "num_comments": 8,
      "created_at": "2026-02-19T09:51:04",
      "selftext": "",
      "comments": [
        {
          "text": "wow, looks like GIRO can be abused and potentially not safe",
          "score": 16
        },
        {
          "text": "Who are the directors and main person in-charge?\n\nSaw that they were uncontactable after the news hit the headline.",
          "score": 16
        },
        {
          "text": "I feel for the Parents but consumer protection in SG is terrible, the parents will probably never get their money back.",
          "score": 6
        },
        {
          "text": "Saw someone comment got triple deduction and at various amount. So either fraud or loophole of giro?",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r8gr9u",
      "subreddit": "singapore",
      "title": "r/singapore random discussion and small questions thread for February 19, 2026",
      "url": "https://old.reddit.com/r/singapore/comments/1r8gr9u/rsingapore_random_discussion_and_small_questions/",
      "score": 7,
      "num_comments": 190,
      "created_at": "2026-02-19T06:00:25",
      "selftext": "*🌻☀️Good morning all have a great day and stay strong, stay safe and stay healthy! Jiayou!*\n\nTalk about your day. Anything goes, but subreddit rules still apply. Please be polite to each other!",
      "comments": [
        {
          "text": "This is annoying. Thurs already still got CNY surcharge. Hello? Everyone back to work already leh. National holiday period over.",
          "score": 6
        },
        {
          "text": "why do people love cutting off others when they talk? Shit is so overstimulating at times u just be trying to end the convo and walk away when it happens",
          "score": 4
        },
        {
          "text": "Found someone like me who prefer to remove shoes/slippers/heels and drive (socks is fine), can feel the pedals, acceleration and brake better. Anyone like me?",
          "score": 3
        },
        {
          "text": "Been trying to get this guys license plate for weeks. Real piece of work always leaving at 11pm+ and waking up the whole blocks with his fuck loud motorcycle that you can hear screaming down the streets. Finally got it when he came back in the morning. Unfortunately it is a JVD license plate and considering they already struggle with regulating local vehicles I guess I'll have to live with this for the foreseeable future😀",
          "score": 2
        },
        {
          "text": "Hi guys, I have a question regarding online payments for in app purchases using POSB/DBS.\n\nI’m playing a mobile game that involves many small in app purchases. I can afford them, but because there are multiple transactions, the bank sometimes flags them as suspicious and assumes they were made without my consent.\n\nI understand this is meant to protect customers, but it has become quite frustrating.\n\nI know I can contact bank support, but it takes almost \\~7 days for them to reply, and they only allow transactions without any problems for 1 day. The whole process takes too long to resolve.\n\nWhat I’m looking for is a more permanent solution to prevent these transactions from being declined repeatedly. Has anyone experienced the same issue and found a proper way to fix it?",
          "score": 1
        },
        {
          "text": "Today is the first time I hear the faint sounds of lion dance and people saying huat ah. It’s kind of unusually quiet? My neighbours used to host visits from their children and relatives but in the recent years, they’ve grown weaker and ironically, the visits have stopped too. 😔",
          "score": 1
        },
        {
          "text": "Yo guys, is it normal for elderlies to have poor sense of direction? Why I’m asking is because am suspecting that my mum has early onset of dementia. Tried many many times to get her to see a doctor but she refused/in denial. \n\nReasons why we think it could be dementia:\n- repeating the same thing over and over again 20-25 times\n- went to an unfamiliar hdb town, lost her way, panicked and cannot find way back home. Mum was walking round and round for whole day before calling my sis for help\n- was at friend house, went downstairs (a cluster of HDB blocks), cannot find way back up. \n- often in deep thoughts talking to herself\n- often forgetting that stove is on (fire risk+++)\n- forgetting or completely have no memory of where she placed certain items or certain important events that took place. For example, she cannot recall my birth date\n- irrelevant answers to questions. Eg what did you eat for lunch? Her answer would be ‘oh I took leave for the entire week’.\n\nConsidering getting a helper for her cos both me and my sis have our own families to care for leh",
          "score": 1
        },
        {
          "text": "Yuzu tarts gifted by Audi Singapore are delicious! 😋",
          "score": 1
        },
        {
          "text": "bright and sunny today (at least till noon).   \n\n\nweather app says it's raining... so which part of Singapore is it raining?   ",
          "score": 1
        },
        {
          "text": "I hope I hold on and don’t feel agitated while watching this RomCom “can this love be translated” cos I remembered myself feeling super excited for it. But I’m 5 episodes into this series - what do you mean the Male lead has a crush on the said producer who is supposed to be his sister in law (step brother’s fiancé(?)) but there is no backstory as to how they fell in love or what the interactions mostly are? One bus ride or smth and dude fell in love?\n\nAlso what do you mean as a full grown adult, you have a crush on someone for YEARS? Like are you not gonna do something about the incoherent and hopeless situation???!?!?!",
          "score": 1
        },
        {
          "text": "It's slows days at work like today that I sometimes go onto property sites to look at HDB flats.\n\nSometimes I see flats that I would really want to stay at. The thing I'm looking for is super cheap, run down looking, unrenovated fixer uppers in good central locations that I will turn into a DIY project for the next 10 years. \n\nBut I hate it how I still have another 6 more years before I can even purchase a home, I so want to walk up and just say, Hey, I am already paying rent that is more than the mortgage payment of the house without grants. Can I just pay you a monthly payment to own the house and buy it when I can? I don't mind paying literally 6 years worth of extra payment if i can get this house from you and when I can actually buy. \n\nA man can dream, I just dream of a place of my own.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r7vsi5",
      "subreddit": "singapore",
      "title": "Does Singapore have a plan to survive the rising sea levels caused by climate change?",
      "url": "https://old.reddit.com/r/singapore/comments/1r7vsi5/does_singapore_have_a_plan_to_survive_the_rising/",
      "score": 0,
      "num_comments": 34,
      "created_at": "2026-02-18T14:42:45",
      "selftext": "So there’s a worrying thing going on about how many island nations may be destroyed by the rising sea levels caused by climate change, that includes Singapore. I am worried because obviously I want my country to keep existing in 50 years, does anyone know if the Singapore government has a plan to save the country from being vored by the ocean?",
      "comments": [
        {
          "text": "PM tell us wanna build barrier island infront of East Coast you neh hear meh",
          "score": 64
        },
        {
          "text": "There are many plans. You can see for yourself, the MRT entrances are raised 1.3m above ground level to avoid floods.\n\nThere are also massive land reclamation projects to build new land faster that sea level rise, we have new underground stormwater tanks to absorb floods, the recent law + funds for mandatory coastal erosion defence, etc.\n\nThere is nothing we can do as a small country to stop climate change, but at least we are prepared to adapt to it.",
          "score": 23
        },
        {
          "text": "u/Evoxrus_XV : can google e.g. \\[[site:.gov.sg \"climate change\" resilience sea levels](https://www.google.com/search?q=site%3A.gov.sg+%22climate+change%22+resilience+sea+levels&amp;oq=site%3A.gov.sg+%22climate+change%22+resilience+sea+levels&amp;gs_lcrp=EgRlZGdlKgYIABBFGDkyBggAEEUYOTIGCAEQRRg60gEJMTM5NTFqMGoxqAIAsAIA&amp;sourceid=chrome&amp;ie=UTF-8)\\]\n\n...example of search result hits:\n\n* [Coastal Protection](https://www.nccs.gov.sg/singapores-climate-action/coastal-protection/) \\[National Climate Change Secretariat\\]\n* [Resilient Future](https://www.greenplan.gov.sg/key-focus-areas/resilient-future/) \\[SG Greenplan 2030\\]\n* [More Climate-Resilient Infrastructure](https://www.ura.gov.sg/Corporate/Planning/Long-Term-Plan-Review/Space-for-Our-Dreams-Exhibition/Sustain/Climate-Resilient-Infrastructure) \\[URA\\]\n* [Changing Tides: Building Community Resilience to Tackle Climate Change | Centre for Liveable Cities Knowledge Hub](https://knowledgehub.clc.gov.sg/publications-library/changing-tides-building-community-resilience-to-tackle-climate-change/)\n* [Climate Resilience Through Nature](https://www.ura.gov.sg/Corporate/Planning/Long-Term-Plan-Review/Space-for-Our-Dreams-Exhibition/Steward/Climate-Resilience-Through-Nature) \\[URA\\]\n* [Adapting to Sea Level Rise and Enhancing Flood Resilience | COP 30](https://www.cop-pavilion.gov.sg/adapting-to-sea-level-rise-and-enhancing-flood-resilience)\n* [IPCC’s Latest Findings Suggest Increased Warming, More Changes In Extreme Weather Events With Higher Temperatures And Global Sea Level Rise | Ministry of Sustainability and the Environment](https://www.mse.gov.sg/latest-news/press-release-ipcc-findings-more-changes-in-extreme-weather-events/)\n\n![gif](giphy|42wQXwITfQbDGKqUP7)",
          "score": 20
        },
        {
          "text": "We will build a wall. A big beautiful wall. And we will make the ocean pay for it.",
          "score": 20
        },
        {
          "text": "Search up the Long Island Project lol.",
          "score": 19
        },
        {
          "text": "It’s called the East Coast Plan. No shit. They’re gonna build bunds there.",
          "score": 16
        },
        {
          "text": "Yes, there is a big blue plan and you can also check out URA building plan. They do chart out 5, 10, 15 and even 50 years plan on Singapore development",
          "score": 12
        },
        {
          "text": "Interesting anecdote. A friend was rebuilding a landed house around East Coast and there are building considerations that require the private land to be raised because the road and public infra would be raised by around 1-1.5m in the future \n\n\nThat is how deep the preparations go",
          "score": 10
        },
        {
          "text": "yes, go youtube find. ",
          "score": 7
        },
        {
          "text": "reclaim land, buy land ",
          "score": 6
        },
        {
          "text": "Better question to ask is \"Do Singaporeans know how to google?\"\n\n",
          "score": 4
        },
        {
          "text": "long island",
          "score": 4
        },
        {
          "text": "This is a question for google lol",
          "score": 3
        },
        {
          "text": "You should be more concerned if 50 years later there will still be any local population left due to the birth rate, or lack thereof",
          "score": 2
        },
        {
          "text": "Yes. A few years ago the Government committed a large budget to attend to these concerns. Some people online gave flak for it, saying stuff along the lines of \"why don't focus on bread and butter issues?!\". Fair enough - but then again, if our island sinks to rising tides, we will only have soggy bread and butter issues left. ",
          "score": 2
        },
        {
          "text": "Long island will save us for the next millennium ",
          "score": 2
        },
        {
          "text": "gundam below marina bay sands, activate!",
          "score": 2
        },
        {
          "text": "google should tell you about it if you dont keep up with the very little amount of important news here. Of all govt in the world, it will be the sg govt that will be capable of doing such long term planning cuz they will be in power for that long term.",
          "score": 2
        },
        {
          "text": "This is a \"Serious Discussion\". Joke, irrelevant or off-topic comments will be removed and **offenders will face restrictions in accessing /r/singapore** such as temporary or permanent bans. Please report such posts and comments. OPs must also engage in a bona fide discussion, i.e. the post should not be one just to incite outrage.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/singapore) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "text": "Singapore is the only country, other than Netherlands , that has some plan. Maybe hongkong. Both Singapore hongkong has size advantage and effective governance. Places in India Indonesia Maldives Florida kukup (Malaysia) can be underwater. The only reason we are effective and can solve future problems is because of our stability(and we have already ‘solved’ current problems).",
          "score": 1
        },
        {
          "text": "Billionaires have started building bunkers while still encouraging us to churn out AI slop for laughs.",
          "score": 1
        },
        {
          "text": "Are u a new citizen ? You mean you weren't paying attention to the national day rally in 2019 when then pm lee spent so much time detailing our plan, with polders and stuff.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r82q9k",
      "subreddit": "askSingapore",
      "title": "But why is everyone on this sub so negative about CNY… 😭",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r82q9k/but_why_is_everyone_on_this_sub_so_negative_about/",
      "score": 420,
      "num_comments": 86,
      "created_at": "2026-02-18T21:17:01",
      "selftext": "It’s sad to see tradition dying …\n\nAlso is it just me or actually both sides of my family know better than to do meaningless comparisons between cousins, or ask unnecessary qns about marriage, career or childbirth etc\n\nMakes me think if there are really relatives still behaving like that out there?? ",
      "comments": [
        {
          "text": "Well to put it bluntly, the people who are having a great time in CNY, will not go on Reddit and say, hey I'm having a great time. Outrage and anger sells, saying everything's fine does not.",
          "score": 799
        },
        {
          "text": "Negativity Bias\n\nThose enjoying CNY are either too busy to be posting on reddit, or not gonna come here and rub it in the faces of those who are obviously not enjoying it.",
          "score": 262
        },
        {
          "text": "Adding my 2 cents in to echo what everyone has been saying - I'm enjoying CNY very much!\n\nBut yes, being that I'm enjoying myself, I'm not inclined to post anything on reddit. I had a fun time seeing all my cousins, catching up with everyone, and we're even having a friends gathering this weekend.\n\nReddit in general is a pretty negative place! Keep that in mind and don't worry too much!",
          "score": 75
        },
        {
          "text": "I enjoyed my CNY gathering with my extended family  yesterday. Will have a gathering with friends this weekend. We aren't online to complain because we are actually out.",
          "score": 60
        },
        {
          "text": "You know the weirdos holed up in the corner hunched over their phones the entire gathering? Yes they are here. ",
          "score": 55
        },
        {
          "text": "It's a biased sample. If you're busy doing CNY stuff, would you really be spending time on Reddit?",
          "score": 41
        },
        {
          "text": "I love CNY, especially since we have a huge extended family and lots of cousins. Even my little niece looks forward to seeing and playing with the \"jiejie\", \"korkor\", \"didi\" and \"meimei\" from my cousins. Most of my generation only have 1 or 2 kids, so it's even more important to us that they know one another and have a certain level of kinship. My cousins are my first friends and it's wonderful to see the next generation hanging out and enjoying one another's company. Sure, it's exhausting when 50 people are trying to talk at the same time, and not unsimilar to cat herding when we are taking our family photos, but I would not trade it for anything else.",
          "score": 33
        },
        {
          "text": "Those that are happy post in IG, those not happy come here...",
          "score": 29
        },
        {
          "text": "People like to vent on Reddit. These people are usually the ones with the worst experiences with cny. Those that are enjoying themselves are too busy to be venting on Reddit. Thus, you'll have very skewed opinions here.",
          "score": 25
        },
        {
          "text": "Reddit is an echo chamber for miserable people🤣 just like when elections are here and they circlejerk talking shit abt govt\n\nWhatever ppl say here just take it with a pinch of salt and laugh it off",
          "score": 24
        },
        {
          "text": "On a separate note , \n\nI just saw a chinese funeral wake gathering at a void deck while walking back home.. \n\nSo yeah not everyone is celebrating CNY on a positive note.\n\nhaishhh",
          "score": 23
        },
        {
          "text": "I'm glad that my relatives avoid asking personal questions and do not make comparisons with one another. I enjoy my CNY with them as I've been close to my cousins since young, so there's no \"distance\" felt even when we meet up once in a year now that we're grown up. If I have pesky relatives who make comparisons, I'd be sure to avoid them.",
          "score": 12
        },
        {
          "text": "First time? We complained about everything all the time.\n/s",
          "score": 12
        },
        {
          "text": "Well my father and mother have toxic relationships with their siblings so there is alot of comparisons and each bragging about their kids achievement to one up each other.\n\n\nThe vibes is just toxic and awful and I have boycotted CNY when I reach adulthood. \n\n\nI mean my parents siblings talk shit about my parents to me. Like they are trying imply that my parents are losers and couldn't provide as good for me as they have provided for their own kids. \n\n\nLike it's just so toxic. It's like a group of people who hate each other gathering every year.\n\n\nI will only gather with my own siblings and we have a meal together that's it. As we actually have a supportive and loving relationship with each other. ",
          "score": 10
        },
        {
          "text": "Most of my relatives are really pleasant to be around and we have a great time seeing each other during CNY. Idk about old traditions dying but I definitely notice new ones forming - we've been catering the same buffet spread for 2-3 years and one of the children said their highlight is coming to ahma house and eating eclair (it was never discussed as something we HAD to have, but cool to know)\n\nI have one relative that is kinda annoying, I guess everyone does. Maybe it's human nature to fixate on negativity, see if anybody feels miserable too, and those posts go viral?",
          "score": 9
        },
        {
          "text": "Great to be spending time hosting my aunts and treating them to good food, especially now that I can afford to.",
          "score": 8
        },
        {
          "text": "It was fun when I was young: mother's side of the family was huge, so all her siblings, spouses, and children (my cousins) would gather at my aunt's 4-room for a time of eating and merry making.\n\nThen, the question every year was \"Who's the new person?\" It's either my cousin's boyfriend/girlfriend, if not a new nephew/niece\n\nNow, the question is: \"Who's not here?\" Some of my cousins married Malaysians and head to their spouse's hometown for New Year. Some of my uncles/aunts/cousins have passed on.  Some of my uncles/aunts have health issues and aren't able to gather. Some of my cousins, for personal reasons, decide not to come.\n\nYea, it's definitely not as fun as it used to be. It's still a good excuse to catch up with cousins/uncles/aunts who do matter to me, and arrange the next fortmonthly kopi date 😂",
          "score": 6
        },
        {
          "text": "sg chinese tend to be less traditional than our peers elsewhere. Its mostly the boomers keeping the old traditions alive now, the next gen onward not gonna care so much about burning stuff etc, or even cny",
          "score": 4
        }
      ]
    },
    {
      "id": "t3_1r7uhwk",
      "subreddit": "askSingapore",
      "title": "Which beliefs or traditional habits in Singapore do you think will eventually die away?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r7uhwk/which_beliefs_or_traditional_habits_in_singapore/",
      "score": 406,
      "num_comments": 134,
      "created_at": "2026-02-18T13:29:48",
      "selftext": "My observation of CNY celebrations (my own family and relatives, and also through visiting other families) over the past few years has made me very curious about how certain local traditions have changed over time... Tech disruption and cost of living have definitely inevitably affected certain habits, but has anyone consciously stopped doing certain things because you decided that they are way too inconvenient or just dont make sense at all?\n\n1. Heard from my colleague that he doesn't bother giving red packets and just Grabpay everyone during visiting...not sure how the elders view it\n\n2. During one of my visits, I presented 2 mandarin oranges to a friend. He scratched his head and said \"aiya actually no need la...now I need to return you 2 oranges right?\" then he spent some time digging through his fridge to find 2 oranges to return to me. It didn't offend me, but it amused me and made me question myself something everyone has been doing for so long\n\n3. Colours and types of clothes during festive seasons. Many complain about the weather and hope for practicality but the elders insist on avoiding old clothes and certain colours. I've actually stopped buying new clothes for CNY for a very long time, but I still try to wear presentable clothes to avoid offending others when visiting\n\n4. Greatly reducing the amount of snacks and decorations bought for festive seasons, in the name of health and reducing environmental waste. My neighbour bought a brand new Xmas tree last year and just threw it out after Xmas ended. I felt like it was a huge waste (besides their improper disposal method)\n\nAre there any other traditional habits you have stopped doing? Non-Chinese friends, you can chip in too! :)\n\nEDIT: Wow thank you to everyone for sharing your thoughts! It's been really enlightening, especially reading about traditions that I'm not familiar with :) Not sure if any of us reading the comments will decide to change or retain any of the habits we've had for the past few years, but all the sharings have been really interesting and thought provoking! :)",
      "comments": [
        {
          "text": "What I see now is that the young no longer see the need to 拜年 \n\nNot in the sense where people arrange for overseas trips during this period of time but kids turning up in relative houses and immediately just find the sofa and sit, no greetings, no oranges\n\nAnd somehow the younger parents allow that\n\n Then the relatives also paiseh, so end up the older folks walk around the house with red packets and hand it out to the kids sitting on sofa/ couched over Nintendo/mobile phones\n\nI see alrdy also don't know what's the point",
          "score": 311
        },
        {
          "text": "Sounds about the same when it comes to Hari Raya too. I don’t do the tech payouts. But I do stopped buying new clothes. Don’t see the point of spending money to buy clothes that fits the occasion. I’d buy clothes that can be used for official situations, like hari Raya, going to the mosque, funerals etc. So colour would usually revolves around White or shades of green. More practical. \n\nThe old prolly not gonna accept but here’s the reality… both them and us might be living in the same world, but most of them might not understand the worldview today or rather, they cannot see the world through our lenses.",
          "score": 206
        },
        {
          "text": "simply put ... most singaporeans already exhausted with hustling and networking for work  and can't be bothered  to keep up with traditions with zero ROI",
          "score": 152
        },
        {
          "text": "One of my relatives no longer put money in red packet. She print out random old significant photo of me (in child care/primary) and present to me in the ang pao. \n\ngiven that me and the cousins already working, this is quite a shocking but welcomed change in the tradition. We kinda looking forward for next year.",
          "score": 145
        },
        {
          "text": "Burning paper offerings is a practice I'm not sure will die out but sure hope that it will. The mess it creates and the terrible air that results from it is somethiny I dread every year.",
          "score": 68
        },
        {
          "text": "Deepavali used to be a huge deal. Would spend the week before making kueh and snacks and would invite and/or attend multiple dinners. Basically, it would be like a 2 week affair. I would stress over outfits and jewelry and the general family politics. Need to think about what to say to this aunty and that uncle. Had fun with cousins but had to deal with toxic relatives as well. \n\nNow my family is estranged from the extended family and guys....it is absolute bliss. We celebrate Deepavali the way we want. Last year I made some spanish garlic prawns and fried calamari, bought doughnuts from Cafe Pralet and had a movie marathon with my family.....wore t-shirt and shorts and just chilled the whole day. \n\nThis year I do want to make pineapple tarts and some of my favourite kuehs in small quantities. It's is a nice bonding activity with my mum and I miss the taste of homemade kuehs. Not sure what we'll do activity wise.... maybe go out and do something fun as a family. ",
          "score": 60
        },
        {
          "text": "We only visit our grandparents and grand uncle/auntie during CNY and it's always my parents' generation who organises the reunion dinner. When they are gone, I don't think my cousins and I will bother with all these anymore.",
          "score": 59
        },
        {
          "text": "Always the need to consume. I don't mean food.",
          "score": 49
        },
        {
          "text": "Tbh visiting relatives itself might die in 2 gen.\n\nI only see my cousins once a year. The oldest cousin don’t even attend because of family politics. If no one steps up then I think next time we see each other will be at a wake.",
          "score": 42
        },
        {
          "text": "My side has never cared about the clothes bit. Like we just wear going-out clothes. Never saw the need to go buy those specific outfits that you’ll only wear once a year.\n\nWe don’t do the whole bai nian with oranges and all those greetings for angbao. The whole point of CNY is to get together as a family. Want to give angbao, you really care about hearing those greetings meh?\n\nMy dad gives me angbao, he also just tsk tsk then pass with one hand. I only care about how much is inside lol.",
          "score": 35
        },
        {
          "text": "Households visiting. I remembered when I was younger, I had to do several house visits because of my parents extended fam was fairly large. After Covid and recent years, these stopped as 1. The seniors had passed on 2. Had own hosting to do so no time. 3. Family sizes are getting smaller and less kampongish family.",
          "score": 22
        },
        {
          "text": "Anything related to a community-feel will die, unfortuantely. Generations have been built across HDBs, therefore they are aware of the kopitiams, shops, people, wet-market etc. You will not see this in the future, as younger people, as I do not see many interactions among young people where the live. Really through school, NS, work or hobbies. \n\nAlso maybe ong lai, on a less serious note :)",
          "score": 21
        },
        {
          "text": "Can we stop having to use new notes for ang pow?",
          "score": 14
        },
        {
          "text": "Not everyone will feel the same, but from my own lived reality, I think our generation and younger will visit less and less relatives over the years. From what I hear from friends, they tend to go to their grandparents' place and stay there for hours with their other relatives, and don't really do the household to household visit style. However when the grandparents pass, they might only visit a few households and call it a day, essentially visiting less relatives than before. \n\nFor me personally, I'm not close with my extended family; any house visiting we're doing now is just my parents visiting their siblings. I daresay when they pass I might just not visit anybody else since I already barely know them as it is.",
          "score": 11
        }
      ]
    },
    {
      "id": "t3_1r7xbhz",
      "subreddit": "askSingapore",
      "title": "Why does Grab still allow orders to get “stuck” after a restaurant closes?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r7xbhz/why_does_grab_still_allow_orders_to_get_stuck/",
      "score": 153,
      "num_comments": 21,
      "created_at": "2026-02-18T16:15:20",
      "selftext": "I had a pretty bad experience with Grab Food last night (CNY Day 1) that reminded me of those viral stories about food arriving hours after closing time.\n\nAlbeit my experience was a “mini” version of this: \n\nhttps://www.reddit.com/r/singapore/s/gxYaFeKGzY\n\nThe Timeline:\n\n\\- 12:30 AM: Ordered A&amp;W. ETA was 40 mins.\n\n\\- 12:56 AM: ETA pushed to 1:50 AM. No rider assigned.\n\n\\- 1:00 AM: Realized the restaurant was officially closed, but Grab wouldn’t let me cancel because it was “already being prepared.”\n\n\\- 2:46 AM: Food finally delivered.\n\nUnsurprisingly, the food was inedible. Cold fries, melted ice, and flat soda. We had to throw most of it away.\n\nI understand that CNY is a peak period with fewer riders, but the “cannot cancel” policy when an order is clearly stuck is borderline predatory. It also raises hygiene concerns; if the shop closed at 1 AM and I got the food at 2:45 AM, how long was it sitting out?\n\nHow should platforms like Grab and FP address this? Should there be an automatic “no rider” cancellation window?",
      "comments": [
        {
          "text": "Product manager: Edge case acknowledged, moving ahead with high priority tickets",
          "score": 146
        },
        {
          "text": "For public holiday like cny, new years, national day, etc. Don't order delivery, or any fnb where you can't see any lines.\n\nI ordered pizza hut self pickup. I went to pickup the food after an hour, which was the estimated timing given. I asked the guy how long more my order, he showed me the list and I wasn't even near. He told me it's at least 1.5hrs more. So I came back 1.5hrs later and waited another half hour for my order.\n\nWhile I was waiting, a bunch of delivery riders just come by, all same convo, \"bro how ah? OK I'll cancel.\" \n\nI talked to some of the riders waiting, they're like, same thing for a lot of other orders at other f&amp;b. And this happens every major public holiday. \n\nJust eat Maggi bros.",
          "score": 98
        },
        {
          "text": "Couldn't be worse than my Foodpanda experience.\n\nOrdered an island-delivery London Fat Duck with Foodpanda on a normal weekend at 4pm. I paid for priority delivery and expected the food to arrive at 5:30pm.\n\nDuring that time, I saw multiple riders being assigned and unassigned. I also called the restaurant and was told nobody wanted to pick my order, and the food was already ready to be picked up at 4:30pm. I couldn't cancel the order either because it was already prepared.\n\nHours later, at about 10:30pm, I received my order, food was obviously cold and my guest had already left. I couldn't contact Foodpanda support because all of it was either bot response or template replies. I asked to escalate to the manage, which they responded back that they couldn't because of SOP. \n\nEnded up, I paid $300 worth of cold food which I had to reheat and pray I didn't get sick from it and ate it alone.",
          "score": 67
        },
        {
          "text": "Grab and FP policy requires them to refund restaurants of food costs if order is cancelled. 35% of the value of the order.\n\nHere the issue is with Grab/FP being unable to secure a rider in time and/or the rider having batched orders resulting in delivery delay.\n\nThe natural response is for Grab/FP to incur the refund, however these companies are unable to lose money the way they could in the past and are under huge pressure to show growing profits, so they will almost certainly not adopt a policy that could result in a structural deterioration of profitability.",
          "score": 24
        },
        {
          "text": "During peak period just go out and buy yourself",
          "score": 17
        },
        {
          "text": "Sorry if I eat it and get food poisoning whose fault is it? It really feels like until someone dies no one gives a hoot.",
          "score": 14
        },
        {
          "text": "All these delivery platforms wanna make as much money as possible so they force restaurants to accept all orders, don't care if restaurant busy or not enough riders. Heck, they even have a KPI that tracks if restaurants follow their operating hours ie. restaurants will be penalised if they switch off their machines during operating hours.",
          "score": 12
        },
        {
          "text": "the way to escalate these days is make a social media or reddit post and wait for mothership to pick it up.... so hopefully mothership does the thing here",
          "score": 10
        },
        {
          "text": "I have raised this to someone I know working at grab before. They say they are aware of this problem but because it isn’t their team’s purview, don’t know if the other team is working on it. Now I just avoid ordering when it is near to restaurant closing time",
          "score": 3
        },
        {
          "text": "I have the option to cancel the order after a delay with 100% refund though (grab)",
          "score": 3
        },
        {
          "text": "Grab is such shit with this. \n\nAlthough I think it’s the restaurants fault for being lazy on updating their hours and not grab",
          "score": 2
        },
        {
          "text": "Check the restaurant's status on their website or app before ordering, especially during peak times. This can help avoid delays and ensure your order goes through smoothly.",
          "score": 1
        },
        {
          "text": "High paid devs aren’t working",
          "score": -5
        }
      ]
    },
    {
      "id": "t3_1r7wboq",
      "subreddit": "askSingapore",
      "title": "Do Singaporeans need to worry about Khalwat laws while in Malaysia?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r7wboq/do_singaporeans_need_to_worry_about_khalwat_laws/",
      "score": 148,
      "num_comments": 66,
      "created_at": "2026-02-18T15:14:26",
      "selftext": "Hi all, me and my girlfriend are both planning to stay overnight in JB sometime soon. We're both Singaporeans, but I'm Malay and not Muslim (legally am, though). She is not a Muslim. Are Khalwat laws something we have to worry about if we're staying in the same room overnight? Do the laws apply to non-Malaysians?",
      "comments": [
        {
          "text": "Read the hotel reviews online. I’ve read a review saying that there are people knocking on their door at night to spot check if they’re married. The man and wife are married but not Muslims and they felt offended.\n\nIf the hotel allows people to perform checks, you may want to reconsider staying at that hotel.",
          "score": 159
        },
        {
          "text": "Lady not Muslim I think doesn't apply?\n\nBut I think the law applies to foreigners also",
          "score": 100
        },
        {
          "text": "Yes but as long as you stay in reputable airbnb or hotel, most likely no one would care.\n\nThere are some no-contact airbnb. Try to look out for that.\n\nThe theory is that lower end hotels have staff that like to bao toh.\n\n[https://mothership.sg/2025/10/johor-religious-department-catches-singaporeans-condo/](https://mothership.sg/2025/10/johor-religious-department-catches-singaporeans-condo/)",
          "score": 87
        },
        {
          "text": "JB unlikely.. they're a lot more lenient considering Singaporean visitors.\n\nHOWEVER, you being Malay might still draw attention even at high end hotels, especially since your partner is not Malay also.\n\nThey're less likely to bother non Malay visitors",
          "score": 73
        },
        {
          "text": "Shariah applies to all Muslims regardless of nationality. But khalwat is hit and miss and usually is if people baotoh you. Stay in 4/5 star hotels, not cheap ones. Cheap ones higher chance of assholes calling Jabatan Agama. Book in the name of your non-Muslim partner instead of yours. FYI at sign in they will ask for passport so you let her handle all sign in etc. Try to be as inconspicuous as possible. But also normally they don't kacau foreigners lah. Technically kena the shariah but in practice its not so clear cut.\n\nBut Ramadan be prepared for police questioning you if you look Malay. You can't legally eat outside as a Malay looking person. \n\nYou can also say you are not Muslim, just your name only haven't changed. They cannot check with MUIS.\n\nGood luck.\n\nSource: Im a Singaporean non-Muslim with Muslim relatives and I lived in Malaysia over a decade",
          "score": 71
        },
        {
          "text": "Not really no. It generally only applies to malaysians. Doubt they could do anything to you. \n\nAlso, dont go to rm80 motels lah. Usually people get caught with their pants down bcs the staff reported you to the authorities. Why would they report you? Because they dont earn enough and would need ways to make more side income, which they get from reporting. Allegedly lol. \n\nBefore i married my husband we were living together for years, went to all sorts of hotels, never kena anything also.",
          "score": 58
        },
        {
          "text": "Yes be prepared to answer questions if both of you look Malay. Esp with Ramadan coming. \n\nSource: my Malay colleague who was held and questioned while on holiday in JB with his wife.",
          "score": 20
        },
        {
          "text": "Besides the hotels, it also depends on the state you're going to. ",
          "score": 14
        },
        {
          "text": "Yes they can and it happens.\n\nDon’t skimp. Stay at international 4+ star hotel chains.",
          "score": 13
        },
        {
          "text": "I am Singaporean malay but of Christian faith. Never had a problem eating during the fasting month in Malaysia nor staying in hotel. But my dad reminds me that I need to emphasize my citizenship if I was ever questioned in Malaysia. To say that I am Singaporean Malay and that religion is NOT a requirement to be a Singaporean malay as per our local laws. Worse comes to worse, call the Singapore High Commission.\n\nAccording to Mendaki, you are considered malay if you are of Malay / Indonesian Extract, including: Acehnese, Ambonese, Banjarese, Batak, Boyanese, Bugis, Butonese, Dayak, Dusun, Iban, Indonesian, Javanese, Kadazan, Kelabit, Makasarese, Melanau, Minangkabau, Murut, Sumatran and Sundanese.\n\nAccording to the Singapore Constitution Article 19B, section 6: \"Person belonging to the Malay community”, means any person, whether of the Malay race or otherwise, who considers himself to be a member of the Malay community and who is generally accepted as a member of the Malay community by that community.",
          "score": 12
        },
        {
          "text": "Depends how much they want to make trouble but if you’re in a decent hotel normally it’s fine. Technically it’s not an issue for foreigners, but if someone’s luck is the wrong side up ??????",
          "score": 11
        },
        {
          "text": "You should ask this question on r/malaysia. My sense from that subreddit is that couples are only affected by khalwat if one of them is a Malaysian Malay. Otherwise, foreign Muslims generally get a pass, especially in states like Selangor.",
          "score": 10
        },
        {
          "text": "As long as your race is Malay you are considered a Muslim in Malaysia. \nYou can try to act like someone from another race but once they see your passport with your Malay name and once they see your NRIC stating race Malay, youre good to be sleeping in the lockup cell",
          "score": 10
        },
        {
          "text": "Anita Sarawak was in a hotel room with one of Commodore's singer many years ago. But that was in KL. They were 'caught'. I doubt anything has changed. \nAnd being fasting month, very sure they will be over zealous. Better to avoid, you might end up being paraded at the back of a lorry around town.",
          "score": 6
        }
      ]
    },
    {
      "id": "t3_1r8ihea",
      "subreddit": "askSingapore",
      "title": "Is it just me or buses are getting from bad to worse?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r8ihea/is_it_just_me_or_buses_are_getting_from_bad_to/",
      "score": 116,
      "num_comments": 49,
      "created_at": "2026-02-19T07:07:09",
      "selftext": "First was the bus timing api going to shit.\n\nNow the bus frequency during peak hours going to shit.\n\nThen the usual double decker becoming single and screwing all the people who are going to wait double for buses, but can barely board anyway. \n\nI stay in cck grc so if jeffrey can't even manage his own area well, how can he even be expected to manage the rest of Singapore?\n\n\n",
      "comments": [
        {
          "text": "The double decker to single decker is really annoying. Especially peak hour.",
          "score": 101
        },
        {
          "text": "The quality of the drivers as well...over the years(mostly after COVID) I find it more and more unbearable to take buses for longer journeys, be it choppy acceleration/braking or downright unsafe driving. \n\nI don't know much about the public transport industry (is it because of the new buses/shortage of drivers etc), but this observation is shared amongst my friends too.",
          "score": 62
        },
        {
          "text": "Don’t disagree with you.\n\nBut don’t get the Singaporean concept of minister(acting) giving their own ward priority. Is it suppose to be that way? They are minister(acting) for transport, not minister(acting) for cck(grc) transport.",
          "score": 58
        },
        {
          "text": "The biggest joke is when you see 3 of the same bus arriving the the bus stop at the same damn time.",
          "score": 32
        },
        {
          "text": "I realized the bus timing shown at the bus interchange is not accurate because either they skipped the time or delayed a few mins...does anyone realize this also?",
          "score": 19
        },
        {
          "text": "The amenities and facilities are not catching up with the population growth",
          "score": 16
        },
        {
          "text": "For me I rather take the 8-10mins to walk from home to the mrt at my place than take the short bus ride to the same mrt. Easier and no need to be subject to the bus driver's slowness nor the people boarding to delay me.",
          "score": 13
        },
        {
          "text": "I think it depends, some bus services are great. But there’s those high demand busses that have issues, from Cck I think 983 and 188 is always over packed but they also improved the frequency during peak hours.",
          "score": 11
        },
        {
          "text": "In order to create more reliable bus systems, you require dedicated bus lanes where other users of the road cannot enter. Primarily so that you can design a fully autonomous bus system where fewer bus captains can remotely drive buses when they do experience rare use cases that there may not be enough data to train the models on. For example extreme weather conditions or spectacular accidents or something of the like..\n\nThis will of course remove road space from the best and brightest that require 2 cars (if not more) despite the claim that the public system is enough for everyone.",
          "score": 10
        },
        {
          "text": "Overpopulation are root cause.",
          "score": 10
        },
        {
          "text": "Are bus drivers still going extra slow in traffic and extra fast when its clear. I don't think they pay heed to punctuality by bus stop.",
          "score": 6
        },
        {
          "text": "Buses slow because of the jam from so many cars.......seems like anybody with a decent job can afford to buy a car now...maybe not brand new, but COE cars....so to have better public transport, reduce the number of cars...private cars or PH cars are the same. They jam up the roads just as much",
          "score": 5
        },
        {
          "text": "As commented in another post. Some journeys not practical. Keep missing the last mile. Don’t expect door to door but less transitions or direct services would be a great life saver.",
          "score": 5
        },
        {
          "text": "Yeah its cooked (even non peak hours), we always use the bus to send and pick up my kid to/from primary school. Timings is always inconsistent on what can be seen on bus apps. Same bus that we are riding since P1: what has been 15min intervals is now 30min.",
          "score": 5
        },
        {
          "text": "you are right",
          "score": 4
        },
        {
          "text": "It is actually!! The bus app itself is a problem. One moment its 20mins, then 2 mins later it immediately jumps to 8 mins. Then i would rush to reach my bus stop, to see that it says 16 mins. I practically rushed for nothing.\n\nAnother thing is reckless drivers, always rushing for red lights just to jam break when they realize they cannot make it.\n\nIs it just my bad luck experiencing this or people been through this too?",
          "score": 4
        },
        {
          "text": "yeah they forcing everyone to go trains, but the trains are packed!!! for some of us who want a nice bus ride, they punish us with terrible timings.\n\nwith power and wealth comes a mindset shift - its the stupid commoners fault for not being able to study hard enough and get a car. \n\ndamn it.",
          "score": 3
        },
        {
          "text": "Yes you are right.",
          "score": 2
        },
        {
          "text": "[https://www.straitstimes.com/singapore/transport/rail-task-forces-proposals-will-help-strengthen-spores-mrt-network-over-next-decades-experts](https://www.straitstimes.com/singapore/transport/rail-task-forces-proposals-will-help-strengthen-spores-mrt-network-over-next-decades-experts)",
          "score": 2
        },
        {
          "text": "There should be a bus that runs to all the MRT stations for when the train closes late at night for all the late night workers (me). 🥺",
          "score": 2
        },
        {
          "text": "Try writing in with photo evidence. My experience is that the bus operator will reply saying the bus is 3/4 full. Haha",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1r8119z",
      "subreddit": "askSingapore",
      "title": "10/20 years from now do you think you'll still celebrate CNY?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r8119z/1020_years_from_now_do_you_think_youll_still/",
      "score": 62,
      "num_comments": 20,
      "created_at": "2026-02-18T19:56:30",
      "selftext": "Just got back from \"visiting\" which was more like everyone on their handphones and no one talking. Only have 1 cousin that seems to be interested to talk (everyone here is in their 20/30s btw lol)\n\n",
      "comments": [
        {
          "text": "Yes, I still want the PH. The only time we get 2straight days off in a row.",
          "score": 68
        },
        {
          "text": "Should be, at least catch up with the cousins",
          "score": 53
        },
        {
          "text": "lol treat it as a networking event .... even if you get one good hit its still a win IMHO ...",
          "score": 36
        },
        {
          "text": "Not in Singapore, no. My in-laws are Vietnamese and in 10 years I envision my celebrating Tết instead of LNY. Assuming I can retire there.",
          "score": 15
        },
        {
          "text": "Of course. If you don’t preserve your culture you are not Chinese.",
          "score": 7
        },
        {
          "text": "Didn't for 3 years. Hope stays this way.\n\nJust another holiday.",
          "score": 0
        },
        {
          "text": "In 10 years time people will use avatars to gather at CNY events. Talk a bit, send CNY greetings then after people send the electronic ang pows, all go back to gaming.",
          "score": -18
        },
        {
          "text": "Hopefully none, and let’s boycott &amp; eradicate the CNY premium for food/haircut while we are at it. As if I get extra salary during CNY.",
          "score": -36
        }
      ]
    },
    {
      "id": "t3_1r80v87",
      "subreddit": "askSingapore",
      "title": "What is one place in Singapore that you haven't been to before?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r80v87/what_is_one_place_in_singapore_that_you_havent/",
      "score": 61,
      "num_comments": 145,
      "created_at": "2026-02-18T19:47:42",
      "selftext": "Since Singapore is so small, what is one place you know off but haven't gone to since the day you were born. \n\nIt can be anything like really, be it places or attractions \n\nJust comment down below and stand a chance to win a free thank you response from me 🥺🥺🥺",
      "comments": [
        {
          "text": "Both the casinos",
          "score": 148
        },
        {
          "text": "Changi prison",
          "score": 131
        },
        {
          "text": "The furthest end of Tuas for me",
          "score": 101
        },
        {
          "text": "1. The top of Marina Bay Sands.   \n2. The casino in Marina Bay Sands.  \n3. Any hotel rooms within Marina Bay Sands.\n\nAlso, Chinese Gardens. ",
          "score": 41
        },
        {
          "text": "Coney Island",
          "score": 37
        },
        {
          "text": "Changi Prison... fingers crossed",
          "score": 36
        },
        {
          "text": "Ubin lol. And like all of the islands except 1.",
          "score": 27
        },
        {
          "text": "Singapore Flyer",
          "score": 25
        },
        {
          "text": "Lamp post 1. Can drive there but defeats the purpose. Maybe in my next life. ",
          "score": 23
        },
        {
          "text": "tekong (I'm female)",
          "score": 19
        },
        {
          "text": "Teban gardens... I don't even know he to get der",
          "score": 14
        },
        {
          "text": "Ridout Rd",
          "score": 12
        },
        {
          "text": "32 years old here and  i have never been to the old Jurong Bird Park, Night safari and Haw Par Villa.",
          "score": 12
        },
        {
          "text": "Interesting question , I’ve been to some of the places that are deemed as off limits for Singaporeans (and I’m not even a Singaporean).. \n\nI’ve been to the Jurong rock caverns, Jurong island, bukom island, Changi naval base, walked underground mrt tracks, so on so forth.",
          "score": 11
        },
        {
          "text": "Crocodile farm. ",
          "score": 7
        },
        {
          "text": "jurong island",
          "score": 6
        },
        {
          "text": "Bukit batok town park/little guilin",
          "score": 5
        },
        {
          "text": "Tengah. I have no clue where exactly in the west it’s located.",
          "score": 5
        },
        {
          "text": "Universal Studios Singapore",
          "score": 4
        }
      ]
    },
    {
      "id": "t3_1r8nahn",
      "subreddit": "askSingapore",
      "title": "Who washes the mountain of plates during CNY gatherings?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r8nahn/who_washes_the_mountain_of_plates_during_cny/",
      "score": 44,
      "num_comments": 87,
      "created_at": "2026-02-19T10:37:55",
      "selftext": "Not sure if anyone else senses the tension when it’s time to clean up. Generally who does the washing?\n\nThe host? The visitors? The youngest in the family?",
      "comments": [
        {
          "text": "Me. Aka the youngest in the family\n\n😐\n\nNo difference from any other day.\n\nI also wash dishes on a regular.",
          "score": 129
        },
        {
          "text": "Unless you have a medical condition, everyone (host / guests) should be fighting to wash the plates. Anything less than this is poor upbringing and unacceptable",
          "score": 72
        },
        {
          "text": "I throw away everything and just buy new crockeries and utensils every year.\n\nBut on a serious note, generally if there is no helper than everyone (host+guests) split up to do it. While some help with washing, others do drying and some wipe the tables and clean up the area.",
          "score": 51
        },
        {
          "text": "my dad who is the eldest son does it! because all his sisters + my grandmother + my mum cooked and helped to prepare the meal 😅",
          "score": 38
        },
        {
          "text": "disposable plates :)",
          "score": 30
        },
        {
          "text": "A little different for me, we are back in parents’ hometown for CNY so family of at least 20 pax eat together for eve, day 1 &amp; day 2. \n\nDad’s siblings &amp; their partners will cook, and they ask the kids (us &amp; cousins) to wash. BUT, they only ask the girls to do it. The girls refuse starting last year after multiple years of giving in. So it has been the adults washing. \n\nThis year we used paper plates for individual but still got to wash main bowls &amp; cooking pots. They started calling the guys. Guys for lunch, girls for dinner. Win-win in my opinion",
          "score": 21
        },
        {
          "text": "Mr Bosch dishwasher washes all the plates?",
          "score": 17
        },
        {
          "text": "I don't host often but when I do, I don't mind doing the dishes. Cos I can hide in the kitchen, close the door and enjoy some peace and quiet. ",
          "score": 16
        },
        {
          "text": "The dishwasher",
          "score": 12
        },
        {
          "text": "In my family we fight to wash the dishes",
          "score": 7
        },
        {
          "text": "the women of the family. \n\nmy extended family is very biased in terms of what women and men do in a house. women, doesnt matter young or old, have to be in the kitchen cooking, washing and cleaning. men can fuck off to living room to watch tv, chat and chill.\n\nquite apparent even when i was a little girl, i got nagged by relatives for not helping out with wiping the dishes unlike my female cousin. cause i just wanted to watch tv and play games with my male cousin. made my parents paiseh and i got shooed into the kitchen. very wtf. \n\naccording to my mum it was even worse when she was a little kid cos imagine being 10, and theres about 60+ guests and u have to still get water from the well to wash the mountain of plates. and since she was youngest she did it all on her own. just 2hr of dish washing. and \n\napparently back then, even though women cooked the food, the men and kids ate first and the leftovers were for the women! i think if this was still in place i would be in so much rage cause i love eating too much lol.",
          "score": 7
        },
        {
          "text": "Maid",
          "score": 7
        },
        {
          "text": "I wash. Rest  from the chit chat",
          "score": 6
        },
        {
          "text": " For family gatherings, those that don't help out during the food preparation will do the post food clearing (washing/cleaning).",
          "score": 6
        },
        {
          "text": "Me, when I want to avoid any kind of social interaction, I offer to wash plates",
          "score": 5
        }
      ]
    },
    {
      "id": "t3_1r8lr5s",
      "subreddit": "askSingapore",
      "title": "Missing CNY and feeling guilty",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r8lr5s/missing_cny_and_feeling_guilty/",
      "score": 31,
      "num_comments": 45,
      "created_at": "2026-02-19T09:27:48",
      "selftext": "I come from a traditional Chinese family where all 3 days of CNY (eve, 1st and 2nd day) are filled. It used to be up until the 3rd day but in recent years has reduced to just the 2nd. \n\nAs an introverted kind that gets overstimulated and tired easily, CNY has always been nerve wracking for me since I was a kid with 3-4 days straight of socialising. This hasn’t changed in the past 30 years. But I try my best to show up and be present. \n\nIn the past couple of years, as I’ve aged (I’m now 32), I’ve opted to stay home usually on the 2nd day — but only when I’m really unwell mood wise (I have depressive and anxiety episodes). \n\nStill, my siblings never fail to make me feel guilty about it. I’m the youngest of 3 so being lectured and having to listen to my “elders” is par for the course and they never fail to let me know just how wrong I am for not fulfilling my familial obligations.\n\nI’m so tired of feeling guilty about not enjoying what others do just because I was wired differently. I feel like I’m already trying my best to show up and be festive. I don’t put on a black face or be sullen. I chit chat, I help with the lohei and food. I know it’s nothing big but I didn’t ask to be made this way whereby being around too many people just drains my energy. I feel immense guilt all the time and honestly wish I can be like others who 避年 (skip cny by going overseas). But I know I’ll just feel guilty about it. \n\nAnyone else have similar experiences? I know disliking CNY is quite common, but would love to hear same feelings about being guilted or lectured.",
      "comments": [
        {
          "text": "I’m 33M, youngest of 3 but my guilt comes from parents. \n\nIn my mid 20s till now I found myself a “bro” to hang out with on CNY, then tell my parents I got bai nian with friends (technically not wrong), or just that I had prior plans made. \n\nWith that bro, we just go hang out at a nice cafe, anywhere we can shuddup and read or do something quietly (unironically) alone. Unwind and relax. \n\nOutside of CNY, the bro saved me from a few cousins wedding as we just book flights to nearby SEA countries. Bro also hates CNY so everyone wins. \n\nEDIT: GUYS we’re both straight I swear 😂　My wife used to call this bro my mistress 👀",
          "score": 82
        },
        {
          "text": "I used to feel that way. Then realise loving myself is more important than visiting the “houses”.  \n\nI still see my relatives as we are all gathered on day 1 and day 2 onwards we are literally just visiting “houses”. Like Why?  See their Reno meh. 😒",
          "score": 22
        },
        {
          "text": "Huge introvert here too. I cope by telling myself they just want to catch up with me, afterall it's a once a year event. \n\nIn previous years I will attempt to escape cny because I cannot stand social interaction too.\n\nBoth sides are getting old, so it's kind of depressing to see everyone aging and losing that energy. So for the past 2 or  3 years, I force myself to attend just so I can see how's everyone doing.",
          "score": 10
        },
        {
          "text": "Eve and 1st day not enough for immediate family?",
          "score": 7
        },
        {
          "text": "Have you tried to set boundaries with your siblings? Like before CNY season send them a message along the lines of”my menta health is ok, but to take care of it I can only dedicate one day for socialising, hoping to get your support, do let me know what I can do to make the most out of the time dedicated”",
          "score": 5
        },
        {
          "text": "Could you maybe tell them that you've made your own plans for day 2 and day 3, rather than you \"don't feel like going\"? Maybe they might take this more positively instead of thinking that you just aren't participative. During the first day where you have to keep socialising, could it be helpful to schedule some quiet time for yourself? Say you go and take a walk for 30 mins or so. Those short but quiet moments could really help you reset and manage your social battery rather than drain it to 0 at the end of the day. \n\nI think you are already trying your best and you have fulfilled your familial obligations to your best ability. Your siblings just sound like they want to lecture you for the sake of it. I have no good advice for managing the guilt, but if you are doing your best and they still think that it is not enough, then it is on them. ",
          "score": 4
        },
        {
          "text": "Just do it. Ignore all the noises",
          "score": 2
        },
        {
          "text": "I know the feeling. I used to join family dinner while everybody chatting, im sitting there using phone alone. Like... why am I even here though??? Not like my presence makes a difference. Ever since, I stopped visiting regardless how much im forced to go. Now I have moved out its even better. Nobody can force me to go except my wife. Lol.",
          "score": 2
        },
        {
          "text": "Go for staycation n do what makes your happy. \n\nIf your family members can’t accept you for who you are, who is who?",
          "score": 1
        },
        {
          "text": "You still go out on Day 1 right? That is good enough - some don’t even do that.",
          "score": 1
        },
        {
          "text": "[removed]",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r7tomq",
      "subreddit": "askSingapore",
      "title": "Do anyone feel that the quality of channel 8 drama now is worser than those like 5 to 10 years ago?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r7tomq/do_anyone_feel_that_the_quality_of_channel_8/",
      "score": 30,
      "num_comments": 59,
      "created_at": "2026-02-18T12:47:53",
      "selftext": "Dramas like ying zuo yang cha, world at your feet, wei Zhi dao eetcetc still hits me hard when I looked forward to catching each episode every week\n\nNow the Chinese dramas not quite interesting and I would rather watch Netflix or smth. Is anyone feeling the same",
      "comments": [
        {
          "text": "Stopped watching channel 8 more than 10 years ago lol",
          "score": 103
        },
        {
          "text": "Recycled family-friendly drama scripts, mediocre new gen actors, lack of budget -&gt; very good recipe for shitty dramas",
          "score": 63
        },
        {
          "text": "Even cny countdown show are deteriorating",
          "score": 35
        },
        {
          "text": "It is if worser can exist in english language",
          "score": 12
        },
        {
          "text": "I only catch reruns of 90s drama on MeWatch",
          "score": 10
        },
        {
          "text": "Stopped being good in 2000",
          "score": 9
        },
        {
          "text": "Actually in the last a year or so they have finally transited out of the typical modern Singapore family drama(sprinkle in some govt message on how great its policy is) to more quirky theme like the recent travel back in time to earn money. I know the drama quality can’t compete with the bigger market but it’s slightly better",
          "score": 9
        },
        {
          "text": "lol why is this even a question?",
          "score": 8
        },
        {
          "text": "\"worser\" hahahah",
          "score": 8
        },
        {
          "text": "also audiences changed so production aims safer and broader instead of memorable characters. Streaming raised expectations a lot",
          "score": 7
        },
        {
          "text": "I haven't watched dramas since around Little Nyonya era but for the majority of shows, they weren't better. It's just the nostalgia talking. Go back and watch some shows and you realise a lot of them were pretty cringe with bad acting. ",
          "score": 7
        },
        {
          "text": "The last good show i watched was Game Plan 千方百计 i think lol, 10-15 years ago and its by Wawa productions, got me hooked for the next episodes when it was aired.\n\nNowadays its so cringey with the actors and their bad voice acting and constipated facial expression.. not to mentioned the over use of the Perfect HDB flat setting &amp; happy family agenda",
          "score": 6
        },
        {
          "text": "Yea nowadays either the storyline is bad (rushed timeline, too predictable ) or the acting is meh",
          "score": 5
        },
        {
          "text": "Still remember the awesomeness of The Unbeatables, opened up my eyes to subtitle reading at age 7 😂 made anime watching so much easier",
          "score": 5
        },
        {
          "text": "It didn't get worse. It has always been like this. We just got more options now. ",
          "score": 5
        },
        {
          "text": "its always been crap so i’ve not noticed if it got crappier",
          "score": 4
        },
        {
          "text": "The last good show was 三个愿望. There hasn't been anything notable since then.",
          "score": 4
        },
        {
          "text": "What are you taking about? They have successfully maintain that quality for the past 20 years.",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1r8424v",
      "subreddit": "SingaporeRaw",
      "title": "caught saf soldier in bunk on ome.tv",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r8424v/caught_saf_soldier_in_bunk_on_ometv/",
      "score": 222,
      "num_comments": 43,
      "created_at": "2026-02-18T22:12:59",
      "selftext": "usually, idgaf about these kinds of small little things but this man swore at me...",
      "comments": [
        {
          "text": "sinkie pwn sinkie",
          "score": 164
        },
        {
          "text": "☠️☠️☠️☠️",
          "score": 110
        },
        {
          "text": "He should know going online to such platform, we should always assume they have access to your coordinates when you go live. Giving intel to enemy.",
          "score": 94
        },
        {
          "text": "Knn people doing duty on CNY, swear at you on internet then u wanna sabo people ? Get a fucking life. Thats why NSF are treated like fuck. Shit pay + need to defend little cunts like you.",
          "score": 69
        },
        {
          "text": "Good. Kena caught. Tomorrow 0800 go meet your CSM sign 16x weekend extra duty",
          "score": 63
        },
        {
          "text": "aiyo why you want to sabo fellow singaporean?",
          "score": 36
        },
        {
          "text": "Nt in uniform while on live tv😫",
          "score": 28
        },
        {
          "text": "What is he doing on Ome tv in the first place.\n\nShowing off?",
          "score": 27
        },
        {
          "text": "Straight to DB. Sinkie pwn sinkie.",
          "score": 24
        },
        {
          "text": "OP is a girl and never serve ns before",
          "score": 19
        },
        {
          "text": "whats ome.tv",
          "score": 17
        },
        {
          "text": "Bruv just leave him alone, on duty during public holiday and it's not like he maliciously jeopardized the country's national security or smth. Why do sinkies have this habit of pummeling further into the ground fellow sinkies who're already at low points? 🤦‍♂️",
          "score": 14
        },
        {
          "text": "Time for SAF Generals to step down",
          "score": 6
        },
        {
          "text": "And what is the offence here?",
          "score": 5
        }
      ]
    },
    {
      "id": "t3_1r7tyzg",
      "subreddit": "SingaporeRaw",
      "title": "Singapore has been using CNY/LNY interchangeably for more than 100 years. Stop policing us on what term we wish to use!",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r7tyzg/singapore_has_been_using_cnylny_interchangeably/",
      "score": 180,
      "num_comments": 103,
      "created_at": "2026-02-18T13:02:17",
      "selftext": "You want to use CNY? Sure!\n\nYou want to use LNY? Please go ahead!\n\nDon't bring your \"culture police\" to Singapore! This is Singapore, we use what we like!\n\nFor those of you who say MOM officially states CNY, so that is the gov's position. No it is not. Istana uses LNY. Many gov press releases use CNY/LNY interchangeably. So it is not set in stone. No one cares. We all know it's the same thing.\n\nedit to add: some of you are framing this as a liberal/woke thing. hahah ffs I'm the least woke person ever.  \nI'm calling out the foreigners who want to impose their views on Singaporeans using one term over the other.  \nAs I've said, in Singapore, we are free to use CNY or LNY. ",
      "comments": [
        {
          "text": "Lame thing to pick a fight over. We should stop importing these made-up culture wars from America.\n\nSome people celebrate CNY, some people celebrate LNY. There is nothing wrong with either term. ",
          "score": 78
        },
        {
          "text": "Actually, why is this even an issue?",
          "score": 37
        },
        {
          "text": "Wow... You dug up all that? Good efforts. \n\nYes, LNY or CNY, for decades nobody gives a hoot about what we use. \nUntil only recently when PRC is pushing this Chinese centric agenda on Singapore that they insist Singapore align to Chinese interests including dictating a common festival to be exclusively Chinese.\n\nPhuck the CCP trolls. We aren't your 坡县",
          "score": 35
        },
        {
          "text": "Ok so lets compromise by putting chinese infront of lunar. So its Happy Chinese lunar new year.",
          "score": 10
        },
        {
          "text": "People can celebrate whatever they want.\n\nPeople are welcome to celebrate Chinese New Year.\n\nWhat people **cannot** do is insist others call it *lunar* new year so that they can celebrate it to feel inclusive.\n\nForcing others to align with your own beliefs is not inclusive.",
          "score": 9
        },
        {
          "text": "Now do Diwali and Deepavali",
          "score": 5
        },
        {
          "text": "Can we just get over with this unemployed drama? \n\nWhen the NTU pres sent the email with the greeting of \"Lunar New Year\", NTU students didn't gaf, not even the China students studying there. The one that made the post, is someone who doesn't even stay HERE, and was making posts from overseas. Yk why? coz students dun focus on drama like this coz they want to get a gud gpa and get a job, and the one that complain try to stir shit in sg coz they have nothing to look forward in their life other than being terminally online and unemployed.\n\nEvery year same story, we fall for their tactics and end up having useless heated discourse over ts",
          "score": 5
        },
        {
          "text": "This kind of thing nobody cares until our privileged lot brought their woke crap to stir since they have nothing better to do.",
          "score": 4
        },
        {
          "text": "This makes it sound like there’s only one lunar calendar and one lunar new year, when there are several.",
          "score": 3
        },
        {
          "text": "Typical glass heart tiongs…",
          "score": 3
        },
        {
          "text": "the wolf warriors will say we are all chinese\n\napparently being born in jurong is the same as being born in hunan to them\n\nbut being born in hunan means cannot go to shanghai there due to hukou\n\ncommunist propaganda needs improvements like everything else",
          "score": 3
        },
        {
          "text": "As usual the Fking PRCs making an issue every MFking thing. \n\nOnly 1 thing to say to them, Go back to Fking Chee Na if you dun like it. No one anywhere in the world has any responsibility to make you feel better about yourselves.",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1r7ubhf",
      "subreddit": "SingaporeRaw",
      "title": "PSA: Muslims going to msia during ramadan fasting period",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r7ubhf/psa_muslims_going_to_msia_during_ramadan_fasting/",
      "score": 135,
      "num_comments": 57,
      "created_at": "2026-02-18T13:20:11",
      "selftext": "Malaysia muslim laws applies to ALL muslims. To them, all malays are muslims. They don't care if you sinkie malay, to them, you are a muslim.\n\nIf this period you go jb and got caught by police eating/drinking when you are supposed to be fasting, prepare to be arrested. The only exception is if you can show proof you are not a muslim.",
      "comments": [
        {
          "text": "How come they never insist on everyone calling it Malay or Melayu ramadan?",
          "score": 54
        },
        {
          "text": "Yes the same is true for the consumption of alcoholic beverages.\n\nJust don't eat in a public place if you really want to eat and drink. the end.",
          "score": 47
        },
        {
          "text": "Ill bring a bible?",
          "score": 28
        },
        {
          "text": "Apa lanjiao bro",
          "score": 19
        },
        {
          "text": "What is the point of this, PSA? Stir shit? ",
          "score": 18
        },
        {
          "text": "Not really, i visited last year with a malay girlfriend. Hotel and bnb did not really care we stayed together.",
          "score": 6
        },
        {
          "text": "What about Indian or Chinese muslims?  Genuine question, those exist too.",
          "score": 5
        },
        {
          "text": "It's not you. It's them.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r80asn",
      "subreddit": "SingaporeRaw",
      "title": "India university to leave AI summit after presenting Chinese robot as its own, sources say | Reuters",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r80asn/india_university_to_leave_ai_summit_after/",
      "score": 127,
      "num_comments": 46,
      "created_at": "2026-02-18T19:16:34",
      "selftext": "",
      "comments": [
        {
          "text": "our pap nepobaby govt better wake up their CECA ideas.\n\nother non paywall media:  \n[https://sg.news.yahoo.com/india-tells-university-leave-ai-075331813.html](https://sg.news.yahoo.com/india-tells-university-leave-ai-075331813.html)",
          "score": 64
        },
        {
          "text": "AI stands for...Actually ___",
          "score": 48
        },
        {
          "text": "😆 🤣 😂 😆",
          "score": 35
        },
        {
          "text": "And people wonder why ceca irk people worldwide, from Singapore to Canada. Completely nothing to do with race but everything to do with fake degrees fake credentials fake integrity and fake TALENTS",
          "score": 31
        },
        {
          "text": "Count on me India",
          "score": 27
        },
        {
          "text": "It's ok, come to SG! The government values you very much!!!",
          "score": 25
        },
        {
          "text": "Singapore welcomes you.",
          "score": 22
        },
        {
          "text": "The perfect new citizens !",
          "score": 10
        },
        {
          "text": "Ngl india fatigue is real man. But ok let’s call it racism because the race and citizens are both called Indians.",
          "score": 10
        },
        {
          "text": "Vell vell vell..",
          "score": 7
        },
        {
          "text": "![gif](giphy|ByMyUQv0icMA8)",
          "score": 6
        },
        {
          "text": "We gonna import doctors from them…",
          "score": 5
        },
        {
          "text": "https://preview.redd.it/f8q2hvy3s8kg1.jpeg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=f4fdb1ba54204db70c672eafeefc12cd72eaa7ed",
          "score": 5
        },
        {
          "text": "sg building “AI” with ceca🤣🤣🤣🤣",
          "score": 5
        },
        {
          "text": "As said, China may have been a pit, but India is a Black hole.",
          "score": 5
        },
        {
          "text": "Typical of galgotias university to do that sort of thing. The prestigious Uptron ACL would never resort to such antics",
          "score": 5
        },
        {
          "text": "lmao now china knows how it feels ",
          "score": 4
        },
        {
          "text": " Now you understand why, even after decades of importing these leeches by the truckload, Singapore still has zero IT innovation, and our cyber security is in the pits.",
          "score": 4
        }
      ]
    },
    {
      "id": "t3_1r7uyt8",
      "subreddit": "SingaporeRaw",
      "title": "Ban smoking at coffeeshops",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r7uyt8/ban_smoking_at_coffeeshops/",
      "score": 119,
      "num_comments": 31,
      "created_at": "2026-02-18T13:55:56",
      "selftext": "Do you think it's about time to ban it totally?",
      "comments": [
        {
          "text": "Imo the most problematic ones are those who smoke and walk. Leaving a trail of smoke for the unsuspecting ones to inhale secondhand. Those are the most disgusting bunch that need to be charged and fined heavily.",
          "score": 145
        },
        {
          "text": "I think smoking in HDB flats is a more pressing issue than smoking in coffee shops. \n\nIn a coffee shop, exposure is temporary, but in a residential block, smoke may permeate the space  24/7, so it’s a direct health hazard for especially for families with kids, elderly or vulnerable individuals",
          "score": 41
        },
        {
          "text": "It is actually already banned. There will be no more new smoking area permits at coffeeshops being issued. Existing coffeeshops alrdy with the permit can continue their smoking corner until their next renewal. ",
          "score": 31
        },
        {
          "text": "NEA don’t even enforce the no smoking rules..",
          "score": 12
        },
        {
          "text": "Smoking section and non smoking section in coffee shops are pointless. They are right beside each other and the smoke just wafts over. \n\nMany other situations where we are subjected to secondhand smoke not by choice. \n\nBanning smoking altogether is the best but it will never happen.",
          "score": 10
        },
        {
          "text": "Seems like there's no way out of this mess. I'm not a smoker btw. Tbh, i feel that home is a personal space so stopping people from smoking at home seems over-reaching. Coffeeshops and public spaces are communal though and there should be an outright ban.\n\nMaybe only at designated smoking points in public perhaps and their home perhaps?",
          "score": 9
        },
        {
          "text": "And the worst part is some coffeeshop set tray return area beside smoking table. Like wtf.",
          "score": 8
        },
        {
          "text": "Can we just outlaw smoking and treat it in the same light as vapes?\n\nSmoking isn't a right but smokers love to act as if they'll die if cannot smoke",
          "score": 3
        },
        {
          "text": "I'm a smoker myself. I definitely agree with this. I wouldn't want non-smokers to breathe in the smoke while eating.",
          "score": 2
        },
        {
          "text": "I agree with what others have said, it should be banned at coffee shops and on the streets. The smoking areas demarcated at coffee shops are pointless because the smoke still wafts over to non-smoking areas. Smokers only think of their own “need” to smoke and do not spare a thought for the non-smokers. Non-smokers are subjected to secondhand smoke without any choice or say, especially if they’re having their meals at the coffeeshop and aren’t able to walk away. In fact, non-smokers are the ones who have to inconvenience themselves and walk away if they can’t stand the smell of smoke. The recent increase in tax on tobacco products isn’t nearly enough to discourage smoking. In fact, the government should have imposed higher tax.\n\nSome smokers even lack morals and values, encouraging non-smokers around them to smoke. If non-smokers say no, they get called “lame” or “humji”. Some smokers even encourage people in their circle to smoke behind parents / partners backs. \n\nI do not have compassion for smokers having to pay more for tobacco products or having limited areas to smoke (they’re still smoking at no smoking areas anyway). Smoking does not bring any benefits and only harms non-smokers. Government should be doing more to protect the non-smokers.",
          "score": 2
        },
        {
          "text": "[ Removed by Reddit ]",
          "score": 1
        },
        {
          "text": "pcn and jogging paths in parks also not spared... knn rly",
          "score": 1
        },
        {
          "text": "Yes. And on the streets",
          "score": -3
        }
      ]
    },
    {
      "id": "t3_1r8jd2h",
      "subreddit": "SingaporeRaw",
      "title": "India university faces backlash for claiming Chinese product as own at India AI summit",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r8jd2h/india_university_faces_backlash_for_claiming/",
      "score": 84,
      "num_comments": 43,
      "created_at": "2026-02-19T07:43:28",
      "selftext": "China copy and paste, India just steals",
      "comments": [
        {
          "text": "Don’t be surprised by ceca, they even cheat in their exams so what do u expect. Only pap is gullible enough to believe their bs.",
          "score": 77
        },
        {
          "text": "Now flipping prata saying they never claimed the robot as their own development \n\nFlip ah flip. We all know this behaviour very well",
          "score": 29
        },
        {
          "text": "There is copy and paste.\n\nThere is also cut and paste.\n\nBoth are legit :)",
          "score": 25
        },
        {
          "text": "*Neha Singh, the professor seen in the video, later told reporters her remarks had been misunderstood. \"It might be that I could not convey well what I wanted to say, or you could not understand well what I wanted to say,\" she said.*\n\n\nI think what is worse is that \n\nkenna caught still want \n\nto argue.\n\n——————\n\nWhatever happened to make a mistake\n\nthen apologise for the error or lapses in \n\njudgement ?",
          "score": 19
        },
        {
          "text": "Jaiho",
          "score": 19
        },
        {
          "text": "Pooja, what is this behaviour?",
          "score": 11
        },
        {
          "text": "Count on me, India\n\nBrought the saga to mind right away, when the Uhi doubled down",
          "score": 8
        },
        {
          "text": "![gif](giphy|Xbnhc9XogFMrFekAcI|downsized)",
          "score": 6
        },
        {
          "text": "sad that there was another Indian IIT robotics startup there with their own robot but because of this, they didn't get the attention they deserve..\nhttps://x.com/xTerraRobotics\nthey even make their own motors. https://xterrarobotics.com/actuators/",
          "score": 6
        },
        {
          "text": "Pap pls take note",
          "score": 4
        },
        {
          "text": "Not surprising. It’s the land of fakes.",
          "score": 4
        },
        {
          "text": "How is this relevant to Singapore...",
          "score": 3
        },
        {
          "text": "They can't even host an international badminton tournament properly with bird shits falling on the courts and even farking monkeys invading the seats,  \ndon't talk about about an AI summit LOL:\n\n[https://youtu.be/1mdK-1hkxU8](https://youtu.be/1mdK-1hkxU8) \\- 'How Come India Open 2026 Became a Total Disaster?'",
          "score": 3
        },
        {
          "text": " \"It might be that I could not convey well what I wanted to say, or you could not understand well what I wanted to say,\" she said.\n\nknn, this Neha Singh is the Head of Department of Communications at that uni, really trollolol",
          "score": 3
        },
        {
          "text": "waooooooo damn maluuuuuuuuuuu",
          "score": 3
        },
        {
          "text": "![gif](giphy|qKV8U3Gl3bWVi)",
          "score": 3
        },
        {
          "text": "Wouldn’t this be easily discoverable? Kind of dumb",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1r7yx4a",
      "subreddit": "SingaporeRaw",
      "title": "Have anyone of you fought with your partner right before CNY before?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r7yx4a/have_anyone_of_you_fought_with_your_partner_right/",
      "score": 79,
      "num_comments": 28,
      "created_at": "2026-02-18T17:56:02",
      "selftext": "And things turned awkward like visiting, not wanting to visit etc. What did yall do? Please don’t be too mean I’m already kinda hurt. ",
      "comments": [
        {
          "text": "Amateur. You fight before Valentine's Day.",
          "score": 136
        },
        {
          "text": "Break up. No need to bring to visiting.",
          "score": 46
        },
        {
          "text": "Y’all need to get your shit together and deal w it. No need for theatrics or too much emotion, deal with it like adults and with some empathy. If can settle, settle. If really cannot settle, bye bye.",
          "score": 45
        },
        {
          "text": "fought because dwan to visit, after awhile break up cos values not aligned (obviously didn’t see a future with you if not why dwan to visit during cny)",
          "score": 28
        },
        {
          "text": "Just fight in front of relatives. I like family drama.",
          "score": 18
        },
        {
          "text": "Married few years. Almost every year quarrel over cny. Husband hates the event and visiting. Losing my shit - either get over it or go separate ways.",
          "score": 17
        },
        {
          "text": "“shes just a friend” but deleted their convo on insta",
          "score": 8
        },
        {
          "text": "Nothing like angry sex to resolve the differences",
          "score": 7
        },
        {
          "text": "Probably can ask Melvin if he has any advice for you.",
          "score": 6
        },
        {
          "text": "Yep, usually in my head I'll tell myself ok control, don't jinx the festive season. Next thing explode and everything goes to shit and everyone just naturally and superstitiously think the whole year is gonna be shit cause of me being an asshole for something she started.\n\nBut the year goes on mediocrely. Earning enough to enjoy small things in life and worry about some 1st world problem, but not toto-winning kind that changes your life. Then then some other occasion comes around, and maybe we'll start quarreling again.\n\nJust don't quarrel until the whole world knows and police come that kind. I've seen some, they don't end well.",
          "score": 5
        },
        {
          "text": "Happened before to me. Twice, each during different CNY eve, after reunion dinner. Things got ugly, but we settled down to not talking until after CNY instead of escalating to going our separate ways. It was bad. \n\nWe had a talk after the first CNY quarrel, and had another after the 2nd quarrel. Subsequently, we kinda learned each other's temperament and roll with it. \n\nThe best thing to do now is to just keep quiet and don't seek to understand why the other party is being 'ridiculous'. Talk about it after both parties have calmed down, and not in front of others.",
          "score": 4
        },
        {
          "text": "I personally think that if my partner and I had a fight right before CNY, we should not go visiting at least until we solve the fight. So maybe 2nd or 3rd day of CNY.\n\nReason being that if one goes alone, they will confirm feel sad and the family will feel something wrong. If everyone starts talking about it, you or your partner may spiral into some trail of negative thoughts. If you still end up going together people will also sense things are wrong and it may even lead to a blowup in the event of some careless remarks by you or your partner.\n\nSo why even think about visiting when both your moods are so bad. Just stay home or go out on a date to resolve your issues first. Go a few days later will not die one.",
          "score": 4
        },
        {
          "text": "Norm is aft cny as 1 gets d rudest shock after meetin relatives &amp; inlaws who come from a different background &amp; asks al sorts of sensitive qns😱😱😱",
          "score": 2
        },
        {
          "text": "Yes. He refused to change. Just got to live with it, or, to move on.",
          "score": 2
        },
        {
          "text": "Fought over what matters?\n\n",
          "score": 2
        },
        {
          "text": "Not sure if this is worse, or having a fight at reunion dinner/CNY D1 itself",
          "score": 1
        },
        {
          "text": "Right before CNY Eve - bf didn't turn up for reunion dinner. \nAfter marriage, CNY 1st few days also have..everyone get used to it can liao.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r7xiuq",
      "subreddit": "SingaporeRaw",
      "title": "I foresee mass exodus from China. Should we rethink our visa free policy and immigration policy?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r7xiuq/i_foresee_mass_exodus_from_china_should_we/",
      "score": 68,
      "num_comments": 135,
      "created_at": "2026-02-18T16:28:16",
      "selftext": "China economy is very bad. Foreign investments have left. CCP increasingly crazy. Many jobless there.\n\nWe are offering visa free but should we ask for more like return ticket and proof of funds? \n\nChinese immigrants also have big issues assimilating into Singaporean workplaces and our society and values.\n\nWe need to recruit more immigrants from developed democracies that speak English who can fit in well not third rate migrants with third rate education and skills and totally different value systems and way of life from us",
      "comments": [
        {
          "text": "I think you been watching too much Pro-Taiwan news. Their economy is undergoing a slow down but not the type of Armageddon that the west has been preaching. Would suggest you actually go visit China if you want to separate fact and agenda driven news.   \n  \nAlso not to burst your bubble but if you actually ask most PRCs actually don't feel Singapore is worth their money staying beyond work. Lifestyle wise, Shanghai and Zhejiang area is actually far more cost-effective for them. A lot of what China has to offer is actually slowly become better than what we have here (Level of service and even for those LGBTQ+ folks, China is alot more progressive than us). ",
          "score": 64
        },
        {
          "text": "You foresee? Clearly you've been sleeping. \n\nThe mass exodus of UHNI from China has been happening for years and Singapore is one of their top 5 destinations. \n\nWhy do you think we have such draconian ABSD for foreigners? Why do you think we have hyperinflation here and people begging gov for more CDC vouchers to stay afloat?\n\nThis has been happening at least since 2018. By the time you see this, the trend has already past. \n\nYou didn't foresee, you post-see.",
          "score": 57
        },
        {
          "text": "Agree with you but it's very difficult.. All depends on our government, right? ",
          "score": 39
        },
        {
          "text": "If China economy has issues most of the world will be impacted. Their people leaving will be the smallest of our issues.",
          "score": 13
        },
        {
          "text": "You think too much already, too much youtube propaganda?\n\nWhen was the last time you been to China? Citizens there are generally happier now than they were 10 years ago and enjoy very affordable food and living expenses.",
          "score": 13
        },
        {
          "text": "Been hearing about chinese economic collapse for the past 15 years\n\n![gif](giphy|11uYyAmGgTWwGQ)",
          "score": 12
        },
        {
          "text": "China economy is slowing down but it is not doomsday. In fact far from it.",
          "score": 12
        },
        {
          "text": "i see. So you are the Xi Jing Ping and CCP is all evil kind of person.\nJust so you know singapore is a red dot that is dependent to trades, we are in no position to take side.",
          "score": 10
        },
        {
          "text": "Ok lah. SG has open leg policy mah. The more the merrier. We need to hit the 10 million population target. \n\n65% approved.",
          "score": 8
        },
        {
          "text": "The famous Traitors action party is now salivating",
          "score": 6
        },
        {
          "text": "if they bring money here, they will be welcomed by the G.",
          "score": 5
        },
        {
          "text": "Their population dropped by 3.89 million last year - half a Singapore vanished, the exodus will not last and will reverse soon.",
          "score": 5
        },
        {
          "text": "Ts must been living in a cave past 10 years",
          "score": 4
        },
        {
          "text": "There are only about 4.1 million singaporean citizens and Permanent residents but As of 2022, there are 1.13 million malaysian migrants in singapore compared to only 400,000 china migrants in singapore. That 1.13 million malaysian migrants is year 2022 figure and now is 2026 so now the malaysian migrants in singapore is confirm higher than 1.13 million. The real danger is at the rate the malaysians are increasing in singapore, will there come a day whereby the total numbers of malaysia-born people in singapore outnumber the total numbers of singapore-born people in singapore?\n\nI think it will be terrible if that day really come whereby the total numbers of malaysia-born people in singapore outnumber the total numbers of singapore-born people in singapore\n\nThe OP is a racist chinese-hater indian from his past postings",
          "score": 4
        },
        {
          "text": "There has been already a lot of prc here: 1. to avoid western sanctions/ tariff; 2. to avoid domestic over competition. These individuals or companies are mostly from private sectors. That's why FDI china topped for the first time in 2025. I believe you can also sense that from F&amp;B front.\nAs I said in other posts, this might be good to gov and /or job markets in terms of economy, but it might not be sustainable as their business model is not. Most chinese brands don't last long before they are taken over by others. It's game of capital. \nOur gov on the other hand, must be happy to get this quick money but long run, I hope complacency will not blind them. Particularly there's real risk when prc makes up mind to take down TW.",
          "score": 3
        },
        {
          "text": "Already part of 65.57%\n\nJust plan your own exit strategy",
          "score": 3
        },
        {
          "text": "Our country don't really have an issue with illegal immigrants. Sure there are some but not an issue unlike countries with large borders.\n\nImmigration policy maybe. Visa free not necessary.",
          "score": 2
        },
        {
          "text": "Where did your assessment of China being a third rate education and skills come from my bro?",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1r80ne1",
      "subreddit": "SingaporeRaw",
      "title": "What do you think they did after dinner?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r80ne1/what_do_you_think_they_did_after_dinner/",
      "score": 48,
      "num_comments": 32,
      "created_at": "2026-02-18T19:35:51",
      "selftext": "",
      "comments": [
        {
          "text": "Siam diu open bottle",
          "score": 58
        },
        {
          "text": "They banged OP's mother",
          "score": 45
        },
        {
          "text": "Go for prata supper",
          "score": 23
        },
        {
          "text": "Went to orchard towers and crushed some pussy. They could just walk there from the Istana.",
          "score": 11
        },
        {
          "text": "Ate a child",
          "score": 6
        },
        {
          "text": "Eat pizza and pasta for desert",
          "score": 5
        },
        {
          "text": "Take turns on ghislaine",
          "score": 4
        },
        {
          "text": "Favour trading, money laundering and other \"legalised\" corruption.  \n\n\nSg a bit far from little st james so I don't think any of them went to the island.  \n\n\nForeign ministry definitely patted themselves on the back to be part of the pedo-elite conversation tho",
          "score": 4
        },
        {
          "text": "they go zouk ofc",
          "score": 3
        },
        {
          "text": "They watched the movie \"Eyes Wide Shut\"",
          "score": 3
        },
        {
          "text": "Of course Epstein invited them over for massage, and what evidence do you have that any of them did not go?",
          "score": 2
        },
        {
          "text": "They had jerky from eipstein’s private stash.",
          "score": 2
        },
        {
          "text": "pizza party!",
          "score": 2
        },
        {
          "text": "'juice' control the world",
          "score": 2
        },
        {
          "text": "Dessert",
          "score": 1
        },
        {
          "text": "Have relations with ur mother",
          "score": 1
        },
        {
          "text": "They had dessert",
          "score": 1
        },
        {
          "text": "go hotel toilet pang sai because hotel toilet got put perfume smell, nice hand towels and music.",
          "score": 1
        },
        {
          "text": "All go practise Chinese calligraphy \n\n",
          "score": 1
        },
        {
          "text": "🧃",
          "score": 1
        },
        {
          "text": "This was before the allegations right?",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r80fjx",
      "subreddit": "SingaporeRaw",
      "title": "Birds at Botanic Gardens",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r80fjx/birds_at_botanic_gardens/",
      "score": 36,
      "num_comments": 12,
      "created_at": "2026-02-18T19:23:53",
      "selftext": "",
      "comments": [
        {
          "text": "Ain’t a scientist, but I’m pretty sure some of them aren’t birds",
          "score": 13
        },
        {
          "text": "I too found a \"bird\" there that one time.\n\nHere it is\n\nhttps://preview.redd.it/8krzch6xz8kg1.jpeg?width=1280&amp;format=pjpg&amp;auto=webp&amp;s=5f7bdea49c80dab11b5433417e2bdc55831f2d01",
          "score": 6
        },
        {
          "text": "https://preview.redd.it/qufwwzo0y8kg1.jpeg?width=700&amp;format=pjpg&amp;auto=webp&amp;s=864851db78aecc8443fb2d51e8838c37bdf00fc4",
          "score": 5
        },
        {
          "text": "What classifies as a birb:\n\n1. wing\n\n2. smol\n\n3. cute\n\n4. scream",
          "score": 3
        },
        {
          "text": "Laaannn",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r88l9r",
      "subreddit": "singaporefi",
      "title": "CPF-IS: Endowus or POEMS?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r88l9r/cpfis_endowus_or_poems/",
      "score": 19,
      "num_comments": 12,
      "created_at": "2026-02-19T01:01:39",
      "selftext": "Appreciate some thoughts between using Endowus or POEMS for CPF-IS.\n\n**POEMS**: zero platform fee, but requires a pre-funded account for CPF-IS trades. Cash gets held as collateral while the CPF monies are being invested, then refunded after settlement. Takes longer to settle trades (T+5 working days) as opposed to Endowus.\n\n**Endowus**: carries the fund, no collateral requirement since CPF funds are drawn directly from CPF Board. But the I'm paying \\~0.35% all-in, which is like 7x the fund's own expense ratio just in platform fees.\n\nMy concern with POEMS is that I don't keep a large cash buffer by choice. I'd rather have my cash deployed instead of sitting as collateral for a CPFIS order, because that’s cash I can't use to buy opportunistically in IBKR. Other than that, the collateral window is only a few days but having a longer settlement period during market downturns actually matters to me. There’s also the matter of the minimum investment size which causes odd lots in POEMS, but that’s another topic.\n\nAm I missing anything that carry Amundi funds for CPFIS? And for those of you on Endowus for CPFIS, do you just accept the 0.30% as the price of convenience, or have you found a way around it?",
      "comments": [
        {
          "text": "I am confused. Do you really need a pre funded account for POEMS? I have been using POEMS for CPFIS trades but I never once had to pre fund any cash. I simply linked my POEMS account to my CPF OA and could proceed with the trade.",
          "score": 14
        },
        {
          "text": "I use POEMs for Amundi Prime USA - didn’t need to pre-fund the account - am on cash plus",
          "score": 5
        },
        {
          "text": "I use Endowus for the convenience.",
          "score": 4
        },
        {
          "text": "POEMS. You just need to prefund if you're using a Cash Plus account.",
          "score": 2
        },
        {
          "text": "I use both Endowus and POEMs. Endowus referrals seem easier to get perhaps due to better marketing and it reduces the fees. POEMs fees are low but referrals reward U.S. market discount coupons which is useless to me since I don’t use them as brokers.",
          "score": 1
        },
        {
          "text": "I’m using Endowus just for the convenience and their UI is great",
          "score": 1
        },
        {
          "text": "POEMS especially for long term investments like CPFIS",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r87h5n",
      "subreddit": "singaporefi",
      "title": "Syfe gold tier vs IBKR",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r87h5n/syfe_gold_tier_vs_ibkr/",
      "score": 13,
      "num_comments": 10,
      "created_at": "2026-02-19T00:22:42",
      "selftext": "Has anyone found the added perks of Syfe Gold tier (and above) useful? Is their “dedicated wealth adviser” actually legit? The Black tier adviser does not advise on holdings in Syfe Brokerage, and basically markets just the Managed Portfolios (expectedly so). \n\nAdditional pull factor for IBKR is the access to Europe-listed stocks. ",
      "comments": [
        {
          "text": "What are you even using Syfe for?\n\nThat is the main question.\n\nFrom my view there is no managed portfolio product that they have that isn't replicable (at least to a high degree) with low cost ETFs.\n\nThe exception would be their S-REIT product.\n\nYou can buy the ETF tracking the same index, but their auto-reinvestment simplify things a lot and depending on your total amount invested, their management fees could be lower than the ETF.",
          "score": 8
        },
        {
          "text": "Common sense tells you it’s not legit. You’ll get the same type of advice about how much to allocate to each of their managed portfolios based on your needs and risk tolerance. Just that you will have one person you can contact when you want. These are relatively junior employees following an SOP, they aren’t going to be giving you stock tips. \n\nSyfe brokerage is getting you on the FX fees (~0.5% the last time someone reported). The managed portfolios give a decent ~0.1% spread because they can bulk consolidate orders for the day, but for the brokerage you are pulling the trigger ro convert your small amount.\n\nIBKR gives essentially spot rate plus $2, or 0.03% spread for auto-conversion. If you have 250k you shouldn’t even be lured by “2 free trades” when the Syfe FX is how they earn.",
          "score": 7
        }
      ]
    },
    {
      "id": "t3_1r7tm10",
      "subreddit": "singaporefi",
      "title": "VWRA vs ISAC",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r7tm10/vwra_vs_isac/",
      "score": 9,
      "num_comments": 15,
      "created_at": "2026-02-18T12:44:10",
      "selftext": "Anyone knows aside from the TER (ISAC is cheaper) and number of holdings (VWRA has more), what’s the main difference between VWRA and ISAC? Why does everyone on this sub recommend VWRA but I don’t see anyone writing about ISAC (tracks ACWI)? Is there a downside of ISAC I am missing? ",
      "comments": [
        {
          "text": "are you sure the TER% of ISAC is lower? I googled and it showed 0.20% compared to VWRA's 0.19%\n\n",
          "score": 8
        },
        {
          "text": "I recommend ACWD.",
          "score": 7
        },
        {
          "text": "liquidity. \n\n  \nVWRA's liquidity or the difference between the bid ask spread will be small,but. ACWD or other smaller funds might not be as liquid therefore the cost of entry or exit might be worse, unless you use VWAP entry options from IBKR ",
          "score": 6
        },
        {
          "text": "At one point ISAC had TER of 0.2% compared to VWRA at 0.21%. VWRA have since bring down theie TER to 0.19%.",
          "score": 2
        },
        {
          "text": "to be honest, it doesn't really matter in the big picture no matter which you choose. Both are fine. I bought ISAC first before moving on to VWRA after my notional size in ISAC grew to a certain threshold. ",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r846ft",
      "subreddit": "singaporefi",
      "title": "Is this term insurance coverage excessive for my profile?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r846ft/is_this_term_insurance_coverage_excessive_for_my/",
      "score": 6,
      "num_comments": 9,
      "created_at": "2026-02-18T22:17:55",
      "selftext": "Hi all,\nI’m a 25M, just started working. My annual income is about $60k before cpf (excluding bonuses). I currently have no dependants, but plan to have in the future.\n\nI already have hospitalisation and personal accident plans in place.\n\nI’m considering a Singlife term insurance plan till age 75 with the following coverage:\n\n$600k death benefit\n$600k total &amp; permanent disability (TPD)\n$200k critical illness (CI)\n$100k early critical illness (ECI)\nAnnual premium is around $1.3k.\n\n\nQ: Is this coverage considered too much? Since I currently have no dependants(yet) does it make more sense for me to scale down my coverage now and increase it later when my income and net worth are higher? Appreciate any advise. Thank you.",
      "comments": [
        {
          "text": "I think it’s not too much. If it is possible to change the coverage , target the highest income bracket 80 percentile and the x 5 \n\nI think you may need higher in fact.",
          "score": 5
        },
        {
          "text": "Max out term insurance from singlife for $300",
          "score": 3
        },
        {
          "text": "Coverage is okay lah, TPD + death insurance is more than 9x annual income, and CI insurance is around 3.5x annual income. Most importantly, your ECI looks pretty good (although a bit high, but your ECI is multi-pay or?)\n\nCan always just keep first. The reason why it’s a bit high atm is because your term insurance is up to 75 (most just keep to 65, because by then you should have enough monies to pay for medical bills).",
          "score": 2
        },
        {
          "text": "Coverage is fine. No need to scale down.",
          "score": 2
        },
        {
          "text": "SAF TPD term + other CI term is better?\n\nI don’t know the market rate well for this kind of coverage… But isn’t 1.3k annual premium for this type of coverage, for your age, quite a high price? -&gt; for someone else to confirm, or for you to do a deeper research.",
          "score": 0
        },
        {
          "text": "I think it’s okay…..but I won’t buy too much into critical illness.",
          "score": 0
        },
        {
          "text": "Hi IFA here. The coverage is not too much, in fact I think you might need abit more. Play with the numbers around, singlife usually have large sum discounts. Also have you explored mindef insurance?",
          "score": -1
        }
      ]
    },
    {
      "id": "t3_1r82us9",
      "subreddit": "singaporefi",
      "title": "Income tax calculations for rental and srs for non-residents",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r82us9/income_tax_calculations_for_rental_and_srs_for/",
      "score": 0,
      "num_comments": 8,
      "created_at": "2026-02-18T21:22:34",
      "selftext": "Hitting FIRE in 3-4 years (depending on timing of recession), and planning to spend at least the first two years overseas. If I'm renting out my house, the income will be taxed at non-resident rate ya? Any way to escape this?\n\nSecondly, if I'm permanently going overseas (eg nursing home in msia), will my srs be taxed at non-resident rate when I withdraw? If so it'd be tax inefficient to put money into SRS now.\n\nEdit: would love to pick the brains of anyone that's moved overseas and had to deal with this",
      "comments": [
        {
          "text": "You will be taxed twice.  First as increased property tax and second as income tax.\n\nSo yeah, it sucks.\n\nNot aware of any legitimate way to dodge these.",
          "score": 3
        },
        {
          "text": "For SRS it is probably better to withdraw in full and pay resident tax on that, if and when you are so unlucky to need a nursing home overseas before  the 10 year withdrawal period is up. Most people don’t need a nursing home in their early 70s. \n\nFor the first 2 years, if you are travelling the world but intending to come back, if you’re a Singapore citizen or PR, you don’t need to use the 183 days residence rule. \n\n&gt; You are a tax resident for a particular Year of Assessment if you are a:\n\n&gt; Singapore Citizen or Singapore Permanent Resident (SPR) who normally resides in Singapore except for temporary absences\n\nhttps://www.iras.gov.sg/taxes/individual-income-tax/basics-of-individual-income-tax/tax-residency-and-tax-rates/working-out-my-tax-residency",
          "score": 3
        },
        {
          "text": "Let your parents stay in your house for free and they rent out their place as a resident.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r8k95q",
      "subreddit": "singaporefi",
      "title": "First timers SBF chances",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r8k95q/first_timers_sbf_chances/",
      "score": 0,
      "num_comments": 7,
      "created_at": "2026-02-19T08:21:25",
      "selftext": "My bf and I recently applied for SBF Feb 2026 in Yishun. Wanted to only get the Chencharu Hills project with 10 units leftover for 4 room flats.\n\nWe have additional ballot chance since we are first timers applying SBF, so total of 2 ballot chances.\n\nAnyone has experience similar to us, applied as 1st timer for SBF flats and actually got your queue number for your desired flat (with less than 10units left)\n\nJust wanted to know what are our chances.",
      "comments": [
        {
          "text": "50/50\n\nEither you win it or you don’t.",
          "score": 17
        },
        {
          "text": "It depends on how many people are applying for that area, which depends on how popular the area you are balloting for. \n\nIt also depends on whether the units if they are reserved for which racial group. \n\nStatistically, I would say you have a low to no chance consider the current public housing situation.",
          "score": 2
        },
        {
          "text": "Applied for SBF first timer also in a popular area in 201x, but applied 3Rm instead of 4Rm since statistically, its easier to get 3Rm than 4Rm.\n\nManaged to get queue no. 18. I knew another acquaintance got queue 1x ahead of us too. We both got the estate we wanted. I would like to think if I applied 4Rm  I would not have gotten a queue",
          "score": 2
        },
        {
          "text": "The last I saw the first timer application for yishun sbf is 2x+. Do you have other priority schemes like married with children?",
          "score": 1
        },
        {
          "text": "This project should be decent to high chance as demand is low.",
          "score": 1
        },
        {
          "text": "I also applied SBF with my partner this February, but in a different region (Bukit Merah). Hopefully we both get our queue numbers 🙏🏻🤞🏻",
          "score": 1
        }
      ]
    }
  ]
}