{
  "schema_version": "raw_scrape_v1",
  "report_id": "2026-02-28",
  "scraped_at": "2026-02-28T15:27:29.540813",
  "subreddits": [
    "singapore",
    "askSingapore",
    "SingaporeRaw",
    "singaporefi"
  ],
  "total_posts": 39,
  "total_comments": 481,
  "posts": [
    {
      "id": "t3_1rg4291",
      "subreddit": "singapore",
      "title": "S'pore to take in 25,000-30,000 new citizens annually over next 5 years to boost population: Gan Kim Yong",
      "url": "https://old.reddit.com/r/singapore/comments/1rg4291/spore_to_take_in_2500030000_new_citizens_annually/",
      "score": 498,
      "num_comments": 283,
      "created_at": "2026-02-27T19:20:07",
      "selftext": "",
      "comments": [
        {
          "text": "They can make such accurate predictions about population increase and yet not have enough housing, transport or other infrastructure to handle the increased population.",
          "score": 822
        },
        {
          "text": "If you say you're going to be 'selective' over who to bring in, why can't we have an immigration test to ensure that we only bring in those who want to be here and those who are willing to integrate? Implement an English test at the very least.",
          "score": 486
        },
        {
          "text": "Man.. the recent headlines from PAP really shows what happens if you give them a strong mandate",
          "score": 472
        },
        {
          "text": "If we're gonna do this, can we implement a freaking english test for them at least ffs?!",
          "score": 313
        },
        {
          "text": "So, completely anecdotal of course, but this just happened today so it's fresh in the mind: \n\nPicking kids up from preschool. Another parent (new immigrant from West Taiwan) was picking up her kid at the same time.\n\nSaid kid was eating some crackers brought by the parent and left a **yuuuge** mess on the floor. The parent looked ready to leave so I *innocently* asked, \"You're going to clean up before leaving right?\"\n\nThe parent immediately turned aggressive and said, \"Why should I? The teachers will do it.\"\n\n\"That's really not the teachers job. They are preschool educators who look after and educate your kid. I think you can clean up your own kids mess.\"\n\n\"Why should I have to do it? I paid for them so they should do it.\"\n\n**THE FUCKING GALL**\n\nMind you, the poor older preschool teacher was present throughout this exchange. She's really the sweetest, and only recently came back to the school after being on hospitalisation leave for a couple of months due to health issues. All to be treated like a servant just because some parent paid a few hundred dollars a month for preschool.\n\nBefore anyone shouts xenophobia, I'm fully aware and moderately supportive of immigration in Singapore's context. I think it's necessary.\n\nBut I also think so much of the anger comes about because increasingly these are the type of immigrants we seem to be importing - entitled, main character types. If these are the types of immigrants we're importing, then this is not really the kind of society I want for me or my kids.\n\n**Edit to add**: there are a few replies speaking about how the behaviour is related to a country of origin. I want to state that this is not really my point. This mindset is present in all countries. My grandfather was a 1st generation immigrant from China. He worked **incredibly hard** as a coolie to bring up 13 kids here in Singapore. I guarantee you he had no sense of entitlement whatsoever. \n\nAnother commenter probably put it more succinctly than I could: I see this as a symptom of the economic malaise we find ourselves in. The economic success of Singapore means that we increasingly attract elitist type personalities (overreaching generalisation here, but I think definitely a greater proportion of such types). And it's a vicious cycle if we continue on the same path.",
          "score": 199
        },
        {
          "text": "Haha the G has given up on boosting birth rates, because it's so much easier and cheaper to boost/maintain population this way, they can continue to hoard the reserves and spend less 😉",
          "score": 147
        },
        {
          "text": "That’s 150,000 more people, we don’t even have enough housing to accommodate for all of them wtf",
          "score": 107
        },
        {
          "text": "This news + NS is not transcational BS. Song bo!",
          "score": 106
        },
        {
          "text": "Recently got my citizenship rejected after a year of waiting\n\nBeen here (and a PR) since I was 8, studied in local primary school, secondary school, local diploma, working for the past 5 years, married a Singaporean and even bought our own HDB\n\nI am so naturalised to the point that I have a Singlish accent and most people get shocked when they find out I’m not local because they feel I look and sound like one. I grew up here, my childhood is here, this is my home.\n\nAnd yet? Rejected. 2nd time. After a year of waiting. Just because I am not one of the main “3 races”. But I look around me, other people getting their citizenship easily even though they don’t even know what is “rabak” or “lor leh lah”, they still have their own country’s accent and mindset, yet they abuse the citizenship system so they can benefit financially while people like me who truly sees Singapore as my home, gets rejected.\n\nDo you guys think I should try to meet the MP and appeal now that this news is out?",
          "score": 103
        },
        {
          "text": "The new citizens will eventually retire 30-40 years from now, the low TFR will hit harder on your children as their future tax dollars will now have to support an additional 125,000-150,000 people.\n\nAdditionally they will buy up housing leading to further inflation on an already low supply.",
          "score": 82
        },
        {
          "text": "In the past 5 years, Singapore has taken in 21-22k per year. They are mostly from Malaysia but significant numbers come from China and India too.\n\nIf we increase to 30k per annum, maybe it'll be 15k Malaysians, 6k from China and 4k from India",
          "score": 50
        },
        {
          "text": "Fucking bullshit",
          "score": 28
        },
        {
          "text": "All these people going flood the whole system we build.. suck it dry and nothing left",
          "score": 17
        }
      ]
    },
    {
      "id": "t3_1rgrpv3",
      "subreddit": "singapore",
      "title": "PSP’s Stephanie Tan argues that Singapore must tackle work-life pressures, housing costs, caregiving burdens, and fertility support if we are serious about achieving Indranee's \"marriage and parenthood reset\"",
      "url": "https://old.reddit.com/r/singapore/comments/1rgrpv3/psps_stephanie_tan_argues_that_singapore_must/",
      "score": 436,
      "num_comments": 59,
      "created_at": "2026-02-28T11:20:30",
      "selftext": "",
      "comments": [
        {
          "text": "I'm childfree, and looking at the endless grind of exams/tuition/enrichment that parents and children have to endure, I just can't see that as enjoyable. At all.",
          "score": 160
        },
        {
          "text": "PSP seems to be positioning Stephanie Tan as the party’s future.",
          "score": 103
        },
        {
          "text": "Its unfortunate that the government doesnt see TFR as an urgent and existential issue. Not enough people? Just import. Just keep importing generation after generation. Problem solved! Meanwhile just pay lip service and do the bare minimum for parental benefits to show that they \"care\".",
          "score": 77
        },
        {
          "text": "Very very well said. Thank you stephanie. This is why we need someone who is an actual parent and 'on the ground' to be in that work group (study group? Task group? Idek anymore). While we absolutely do not judge indranee for being single &amp; childless, she simply cannot truly understand our struggles. \n\nEven the ministers who *do* have kids, with their level of pay and lifestyle, may not fully understand us.",
          "score": 39
        },
        {
          "text": "I mean, the major crux of the current issue is existentialism and value proposition as a \"singaporean\", a proper Existential Crisis on a national level\n\nwhat even **is** a Singaporean anymore, when the government LITERALLY, by their own admission, said that we singaporean locals are replaceable, expandable (related: Gan Kim Yong saying that every year they will accept 30,000 PR) without limit of time period, im other words - ad nauseum\n\nthey can always just find people to replace you, so what is a singaporean local's place in this world, in this universe if the government sees their own people as disposable?\n\nWhat do they think the locals will feel seeing that they are valueless in their own land except expandable soldiers (related: Chan Chun Sing's comment on NS being a commitment and duty)\n\nAdmittedly, could it be a misinterpretation? Always - just like how apparently I am always wrong regardless of who I support, regardless of it agreeing with whichever side",
          "score": 37
        },
        {
          "text": "'I got married when i was 26 and had my first child when i was almost 28' . Already more relatable than someone who just prioritized her career and money all the way",
          "score": 28
        },
        {
          "text": "Why would someone have a kid, especially here, to subject a soul from non-existence into this thresher, this rat race, the never ending carrot and stick routine, the unrelenting hustle or die mentality. The insanity someone in their right mind to make that decision, to subject someone they love to this life, who would want that for their offspring?",
          "score": 26
        },
        {
          "text": "I don't actually think we're serious about the whole marriage and parenthood reset thing. Same with the whole \"reform the education system\" shtick. It's just... parliamentary b!tching.",
          "score": 10
        },
        {
          "text": "As someone with a kid, her message resonated with me simply because I have walked the same path. The shift in your life once you become a mother is huge and people in the workforce just don’t understand. They judge you for taking leave because your child is sick at school even if you are working at home in between your job of trying to keep the kid alive. I can’t even defend my colleagues for judging because it is true that with the mental load on new mothers, your work performance will suffer. I was literally running to the nursing room 2 times a day and I lunched in for an entire 9 months while doing so. Now that they are older, I can’t OT as much as I did because my second job of being a mother is starting. I need to rush home to take care of my kid for the previous few hours I see them. \n\nEnrichment became my only time for a breather so I can find myself again for that one hour on the weekends. Honestly enrichment classes nowadays are super fun for the younger kids. They all go in screaming of course due to the separation but they come out happy with toys and stickers. The point is, there is too much sacrifices to make in Singapore where you are worked to the bone and work doesn’t stop just because you are not physically in office. I don’t blame anyone for being child free in this kind of environment because it really comes with a lot of sacrifices.",
          "score": 10
        },
        {
          "text": "It's great that PSP has some concrete suggestions on how to boost TFR. They form a good starting point to discuss what can be done.\n\n\nThe monthly allowance sounds good, but these incentives are a b*tch to calibrate. You heat stories from other countries about people who have more children so that they can benefit from the incentives, while effectively neglecting the children. But for parents who really want the best for their child, how much is enough? It's not going to be anywhere near enough to replace one parent's income. And how do you scale for full-time parents caring for multiple children? I think it's doable though, and I won't mind if something like this gets pushed through. My wife is SAHM to 3 kids, so we would certainly welcome some extra financial assistance.\n\n\nI do wish Singapore had more part-time work options for professionals i.e. something that pays better than McDonald's. I think that would be ideal for parents who want to be more present for their kids, for retirees looking to slow down etc. It would unlock quite a bit of productive workforce, IMO.",
          "score": 9
        },
        {
          "text": "Children is a luxury for rich ppl who have time and money. Poor ppl just suck thumb and work our ass off so our bosses can buy their children newest iPhone",
          "score": 7
        },
        {
          "text": "There are a few things that prevent higher TFR:\n\n1) Too many hours wasted travelling and working\n\n2) No security or being constantly afraid of losing your job\n\n3) Lack of accommodation for proper family\n\nIf these things can't be reduced than people will not bother having kids",
          "score": 5
        },
        {
          "text": "Yea waaay too many companies demanding all-in commitments from employees. I tried to work part time while working on major personal (with future commercial goals) projects on the offhours but always get screwed over by the working culture.\n\nIt's no way to grow our own capabilities if we keep this up.",
          "score": 4
        }
      ]
    },
    {
      "id": "t3_1rg388l",
      "subreddit": "singapore",
      "title": "Don't conflate duty with transaction: Chan Chun Sing on increasing allowances for national servicemen",
      "url": "https://old.reddit.com/r/singapore/comments/1rg388l/dont_conflate_duty_with_transaction_chan_chun/",
      "score": 309,
      "num_comments": 257,
      "created_at": "2026-02-27T18:33:40",
      "selftext": "",
      "comments": [
        {
          "text": "We could say the same thing to him\n\n![gif](giphy|WRgsiNC2GCn21l4gtV)",
          "score": 778
        },
        {
          "text": "Ok cool, so when are ministers giving up their salary? Since it is a duty not a transaction?",
          "score": 458
        },
        {
          "text": "Just because NS is a duty doesn't mean it has to be a sacrifice.",
          "score": 433
        },
        {
          "text": "So serving Singapore as a minister is duty or transaction?",
          "score": 342
        },
        {
          "text": "Is this the new “NSF cannot be measured by dollars and cents” remark? All they are asking for is a liveable stipend in a high-cost country like SG.",
          "score": 307
        },
        {
          "text": "As an NSman I will tell you it is neither a transactional or dutiful relationship. It’s a FORCED relationship",
          "score": 275
        },
        {
          "text": "What the fuck are we doing here man. This country refuse to give us a salary and yet demands and forces you into a mandatory servitude. It's no wonder nobody wants to live or have a child here. \n\nWhy would any sane person look at their male child and say lmao reach 18 get fucked by the government?",
          "score": 211
        },
        {
          "text": "I've said this before and will say it again. Just peg NSF allowance to the median expected salary of a fresh diploma holder with no work experience!\n\nOur boys put their lives on hold for 2 years for this duty. Most of them would be at the age of 18 - 20 after JC or poly.\n\nRemunerating them fairly would send the meaningful message that their value and the opportunity cost to them is acknowledged.",
          "score": 192
        },
        {
          "text": "Wa I thought the title was already bad enough \n\nCb read the whole story make my blood boil even more\n\nThis fucker think men should do it out of loyalty to Singapore  but dont even think how then have society treated us men in singapore",
          "score": 173
        },
        {
          "text": "Did Mothership write wrongly again?  \nshouldnt it be Don't conflate duty with transaction: Chan Chun Sing on Ministerial pay?\n\nSure pay the ministers more, whilst the hands protecting the nation physically be treated as such.",
          "score": 124
        },
        {
          "text": "This government is getting more and more intellectually dishonest.\n\nNot conflating the issues means paying a fair salary for the time AND giving fair recognition for the duty and national service l.\n\nSaying servicemen should subsidise on salary because it's national service is precisely conflating the two issues.",
          "score": 118
        },
        {
          "text": "Pay peanuts, get monkeys. NSFs should never do more than the bare minimum",
          "score": 114
        },
        {
          "text": "minister is also and should also be a duty",
          "score": 95
        },
        {
          "text": "Then don’t raise ministerial salaries",
          "score": 86
        },
        {
          "text": "Your predecessor suggested otherwise by tying socioeconomic benefits to NS?\n\n\n&gt;In 2006, then-Defence Minister Teo Chee Hean said in a ministerial statement on NS defaulters that the Constitution was amended in 1979 so that those who refused to serve could not escape their NS obligation by simply renouncing their citizenship. \n&gt; \n&gt;He added: **\"Only those who have emigrated at a young age and have not enjoyed substantial socio-economic benefits are allowed to renounce their citizenship without serving national service.\"**\n\nhttps://www.straitstimes.com/singapore/courts-crime/senior-counsels-son-gets-4-months-jail-for-ns-evasion",
          "score": 64
        }
      ]
    },
    {
      "id": "t3_1rg1awh",
      "subreddit": "singapore",
      "title": "Mindef to review Medical Classification System to ensure meaningful deployment of servicemen",
      "url": "https://old.reddit.com/r/singapore/comments/1rg1awh/mindef_to_review_medical_classification_system_to/",
      "score": 300,
      "num_comments": 129,
      "created_at": "2026-02-27T16:37:46",
      "selftext": "",
      "comments": [
        {
          "text": "![gif](giphy|3sAW43kLFbCVl2Pgpx|downsized)",
          "score": 326
        },
        {
          "text": "Autism too widespread alr, no more PES E/excuse firearms liao /s",
          "score": 193
        },
        {
          "text": "They desperately need more PES A and B",
          "score": 181
        },
        {
          "text": "At this rate we'll be throwing amputees and people with severe asthma into intense physical training before we conscript healthy women lmao",
          "score": 161
        },
        {
          "text": "They alr cfm gonna do lol. Got surveys and interview sessions for pre enlistees \n\nhearsay its not gonna be a radical change. At most just some low B/high C might not be blanket excused for everything only. The current Es and As prob wont notice much diff",
          "score": 140
        },
        {
          "text": "&gt;An average of 21,300 NSFs enlisted annually across the SAF and Home Team between 2021 and 2025. This was a drop from the annual average of 23,400 enlistees in the preceding five years, Mr Chan said in a parliamentary reply on Feb 12.\n\nSiao leh, massive drop somemore spread between SAF, SCDF and SPF. How can even maintain. No wonder my reservist duration is so shit. Doesn't help that there are still those regulars who think that increasing stuff at the expense of NSFs is good for their promotion.",
          "score": 102
        },
        {
          "text": "TFR too low, not enough nsfs to kio the saikang\n\nSooner or later first gen PRs and women will have to serve if the trend continues like this",
          "score": 84
        },
        {
          "text": "Jinggg might need to watch out if they recall him",
          "score": 69
        },
        {
          "text": "PES E should now mean rated E for everything.",
          "score": 56
        },
        {
          "text": "Let's see how many downvotes I am going to get for saying, oh. Enlist the girls too!",
          "score": 52
        },
        {
          "text": "Repeat after me, the whites like to remind us;\n\n\"NS is a privilege\"\n\n\n\"NS privilege should only belong to Singaporeans\"\n\n\n\"NS cannot be measured in dollars and cents\"\n\n\"NS is a duty, no amount of monetary compensation is enough\"\n\nAnd not to forget: NS for sinkies, jobs for ...",
          "score": 45
        },
        {
          "text": "Issok Amos yee is on his way to enlist",
          "score": 36
        },
        {
          "text": "PES E to become FPV drone operators",
          "score": 24
        },
        {
          "text": "Cannot chao keng liao",
          "score": 23
        },
        {
          "text": "I hope they have better solutions moving forward. \nAnyone who has served as an RP for base defence (or even returning for reservist) in recent years will know bad we are in terms of manpower. They started to supplement with auxiliary police for some functions.",
          "score": 11
        }
      ]
    },
    {
      "id": "t3_1rg1ied",
      "subreddit": "singapore",
      "title": "WP’s He Ting Ru proposes a cooling-off period when switching between partisan and non-partisan roles",
      "url": "https://old.reddit.com/r/singapore/comments/1rg1ied/wps_he_ting_ru_proposes_a_coolingoff_period_when/",
      "score": 278,
      "num_comments": 45,
      "created_at": "2026-02-27T16:51:05",
      "selftext": "",
      "comments": [
        {
          "text": "Makes perfect sense but Indranee replies is disappointing as usual. Has this girl ever replied anything constructive to any good suggestions? She is always immediately dismissive and of course she knows if there's a cooling measure period it more or less breaks the NMP and PA grassroot schemes for themselves. ",
          "score": 288
        },
        {
          "text": "That's fucking stupid.\n\nWith her logic I can remain partisan and pinky promise to carry out my duties in a non-partisan manner and that's okay.\n\nThat's not how humans work.",
          "score": 75
        },
        {
          "text": "EXCHANGE OVER COOLING-OFF PERIODS\nFriday's debate also saw an exchange between Ms Indranee and Workers’ Party MP He Ting Ru (WP-Sengkang), who proposed introducing “cooling-off periods” to more clearly separate partisan and non-partisan roles – including for public servants entering politics and political officeholders leaving their posts.\n\nWithout such safeguards, Ms He suggested, Singaporeans might question whether individuals were \"auditioning for another role or a different office each time they rise to speak\", potentially creating perceived conflicts of interest.\n\nResponding to Ms He's hypothetical scenario – resigning from the WP and becoming a Nominated Member of Parliament (NMP) the following day – Ms Indranee said what matters is upfront disclosure of one's roles and responsibilities.\n\n“You've declared to the world that you are no longer partisan, you have taken on a responsibility to be non-partisan, and so long as you carry out that duty properly, there is nothing wrong with that,” she said.\n\nThe same principle applies in reverse, she added. Anyone moving from a non-partisan role into partisan politics should first step down and publicly declare their intentions.\n\nThat way, it's transparent, it's fair, and this is what we have done in our system and it has served us well,” Ms Indranee said.\n\nMs He followed up by citing corporate governance rules that impose a three-year cooling-off period before former executives can be considered independent directors, suggesting a similar framework could apply to parliament.\n\nMs Indranee said the comparison was not apt, noting that the code Ms He referenced governs company directors, whereas parliament operates under its own framework where the appropriate conduct of members is the central consideration.",
          "score": 45
        },
        {
          "text": "Is she saying if I plan to prata tomorrow, as long as I declare my intent today, it's okay to do so?",
          "score": 38
        },
        {
          "text": "Indranee reminds me of the Solo Leveling demons who gets shut down by the system if they try to say something that deviates from the system’s directives. Same shit going on here with the PAP MPs.",
          "score": 20
        },
        {
          "text": "I see miss indranee face I cannot",
          "score": 15
        },
        {
          "text": "How about non partisan President?",
          "score": 8
        },
        {
          "text": "I agree with He Ting Ru - especially for the presidential elections. I don’t want the “independent in name only” type candidates.\n\nActually I’ll push it even further. Anyone who was a member for any political party at any point would not be eligible to run for the presidency.",
          "score": 6
        },
        {
          "text": "Only a couple of NMPs in question also cannot approve this suggested change ",
          "score": 5
        }
      ]
    },
    {
      "id": "t3_1rg5pxb",
      "subreddit": "singapore",
      "title": "Singaporean doctor in Melbourne now faces 910 charges for allegedly filming colleagues in toilets",
      "url": "https://old.reddit.com/r/singapore/comments/1rg5pxb/singaporean_doctor_in_melbourne_now_faces_910/",
      "score": 265,
      "num_comments": 87,
      "created_at": "2026-02-27T20:46:24",
      "selftext": "",
      "comments": [
        {
          "text": "Dats alot sia",
          "score": 123
        },
        {
          "text": "Full name is Cho Yi Ryan.\n\n[The court heard that, while Cho was born in **Malaysia**, he was now an **Australian citizen**.](https://www.dailymail.co.uk/news/article-14939565/Ryan-Cho-accused-secretly-filming-hospital-staff.html)\n\n[The court heard Cho, who is of **Malaysian descent, moved to Australia in 2017** and was working as a doctor and resident surgeon at the Austin Hospital at the time of his arrest.](https://www.theage.com.au/national/victoria/junior-doctor-faces-fresh-toilet-spying-charges-as-probe-widens-to-other-major-hospitals-20250725-p5mht7.html)\n\nMalaysian Chinese treating the Singapore government like fools again, getting citizenships handed out like toilet paper. Most of them do not even like the country, constantly shitting on Singapore while happily using the status as a springboard. In the end, they just end up tarnishing the country's reputation.",
          "score": 102
        },
        {
          "text": "Australian news outlets has stated that it was confirmed in his court hearing that he was an Australian citizen. This guy went from Malaysian &gt; Singaporean &gt; Australian. It is not clear why Singaporean news outlets are contradicting Australia's.",
          "score": 75
        },
        {
          "text": "910 charges?!",
          "score": 50
        },
        {
          "text": "A porn side subscription would give higher resolution, smiling participants n better angles lol",
          "score": 35
        },
        {
          "text": "Successfully beating Man City with 115 charges",
          "score": 28
        },
        {
          "text": "“ Cho had moved from Singapore to Australia in 2018 to pursue a Bachelor of Medical Science and Doctor of Medicine at Monash University “ means he was 20 when he moved to Aus !! If that’s the case thus it mean that he did not serve NS ??? If that’s the case then it’s really unfair like serve NS for what Sia then free riders like him can just escape",
          "score": 18
        },
        {
          "text": "Lmao. Watch porn not enough, wanna record. Now whole australia and sg know. Can stay home zo bo lan rest of your life.",
          "score": 16
        },
        {
          "text": "What a dumbass. You have a great life for yourself. Worked hard to get a good profession. Im sure the parents worked hard to support him. Melbourne is such a lovely place to live and work too, I'm sure he was making a good salary as well. If you wanted to satisfy your kinks, I am sure you could have found willing escorts / online arrangements to do it. \n\nTo throw it all away on sheer stupidity like this is madness. Your looking at prison time and an end to your career and life as you knew. \n\n",
          "score": 11
        }
      ]
    },
    {
      "id": "t3_1rg0z32",
      "subreddit": "singapore",
      "title": "Couple found dead in Punggol HDB flat, police investigating",
      "url": "https://old.reddit.com/r/singapore/comments/1rg0z32/couple_found_dead_in_punggol_hdb_flat_police/",
      "score": 254,
      "num_comments": 28,
      "created_at": "2026-02-27T16:17:01",
      "selftext": "",
      "comments": [
        {
          "text": "wah got blood, maybe not simple",
          "score": 143
        },
        {
          "text": "Rest in peace to the couple, and condolences to the godson who had to witness it.",
          "score": 106
        },
        {
          "text": "It's always sad when hearing that people knew victims as \"friendly\" or anything positive. It made their deaths undeserving",
          "score": 92
        },
        {
          "text": "oh man. rest in peace. i hope the police find out what really happened.",
          "score": 33
        },
        {
          "text": "Woah.. we really don’t know what happens in people’s homes…RIP to the couple 😢",
          "score": 21
        },
        {
          "text": "R.I.P",
          "score": 18
        },
        {
          "text": "RIP to the elderly couple. \n\nAs someone who is working in the community care sector for seniors, this is just of one of many cases whereby senior(s) end up dying at home without anyone knowing. There are many more similar cases which are unreported, especially those seniors with limited mobility or multiple medical conditions that are single, have no children, or those that have been abandoned by their children. One fall or a medical situation happening in their place is all it takes for their lives to be taken away.",
          "score": -98
        }
      ]
    },
    {
      "id": "t3_1rgna18",
      "subreddit": "singapore",
      "title": "Shock, frustration as riders, eateries and users rue Deliveroo’s Singapore exit",
      "url": "https://old.reddit.com/r/singapore/comments/1rgna18/shock_frustration_as_riders_eateries_and_users/",
      "score": 234,
      "num_comments": 58,
      "created_at": "2026-02-28T07:59:27",
      "selftext": "&gt;Mr Mike said he plans to secure a job as a night security officer. But in the meantime, as it would be a “scramble” to find a new job in a week, he will deliver food for Grab and foodpanda, where he already has accounts.\n\nAt just 36, he’s facing a tough road ahead ,  either taking on low‑pay night shifts guarding a condominium, or working overnight in a quiet, isolated industrial area like Tuas.\n",
      "comments": [
        {
          "text": "I was pretty bummed about this. My experiences with Deliveroo in marine parade at least was that it was far, far superior to Food Panda and Grab in terms of timeliness, reliability, and refunds. Trying to get a refund or credit in Grab etc was a total pain in the butt, and I regularly had items missing. Deliveroo always refunded no questions asked.\n\nGonna have to be my own delivery rider now! ",
          "score": 134
        },
        {
          "text": "It was only a matter of time i guess. Singapore can't support that many players and once the govt gave the go ahead for grab to dominate the market as the nation's superapp, foodpanda and deliveroo had to burn much more cash to compete.",
          "score": 126
        },
        {
          "text": "It’s too bad. Deliveroo is more reliable than Grab and their disputes are easier to handle. Grab really tries hard to not deal with your disputes.",
          "score": 91
        },
        {
          "text": "Don’t forget to permanently delete your account",
          "score": 43
        },
        {
          "text": "For the subscription refund, I contacted Deliveroo and they cancelled my subscription and will provide the refund. Even though subscription is cancelled, I can still use the free delivery until 4 March. \n\n\nHowever, the pain is the vouchers that I bought from ShopBack where I bought a few hundreds due to their increased cashback the day before the deliveroo announcement was made. ShopBack will not provide any refund and say to use all the vouchers before 4 March. However, I noticed that a number of restaurant and grocery merchants (such as Sheng Shiong) have left the platform and when I make an order, it takes a while to find a rider, I don't think I'll be able to finish using my few hundreds vouchers by then. Does any one have any suggestion on what to do? Should I just do a dispute with my credit card or email deliveroo's liquidator Kroll?",
          "score": 36
        },
        {
          "text": "When Deliveroo got acquired by Doordash I knew they would exit. Deliveroo has the BEST customer service and support. That cost money \n\nGrab absolutely does not give a crap about you.  Their support is one pet cat walking on the keyboard.\n\nSo Grab, with lower cost looks way more profitable Deliveroo. \n\nDeliveroo is unfortunately the victim of acquisition economics.",
          "score": 27
        },
        {
          "text": "foodpanda and grab is shit",
          "score": 9
        },
        {
          "text": "Does the people who manage their payment gateway not know that Deliveroo is closing soon? Like 2 days ago the app tried to charge me 12.90 to renew my subscription",
          "score": 6
        },
        {
          "text": "I think i read another news reporting not many bothered as the orders are low anyway &gt;",
          "score": 6
        },
        {
          "text": "When Grab intro self driving cabs like in US n china, the unemployment rate will jump up",
          "score": 5
        }
      ]
    },
    {
      "id": "t3_1rgs526",
      "subreddit": "singapore",
      "title": "Basic childcare, infant care &amp; student care should be free for all S'poreans: Shawn Loh",
      "url": "https://old.reddit.com/r/singapore/comments/1rgs526/basic_childcare_infant_care_student_care_should/",
      "score": 134,
      "num_comments": 73,
      "created_at": "2026-02-28T11:41:22",
      "selftext": "",
      "comments": [
        {
          "text": "Childcare leave per child please",
          "score": 104
        },
        {
          "text": "- Honestly they should make school fees for Singaporeans free up to include secondary school to school. (Government schools of course). \n\n\n- And they should include basic universal healthcare for all Singaporean children up to age 10 or something. \nI know a lot of parents pay a lot of medical fees because children always gets sick or there’s hand and foot disease or whatever.",
          "score": 27
        },
        {
          "text": "Honestly….primary school should end at 2-3:30pm like these international schools then wrap around care till 5pm\n\nSo many parents have to resort to helpers or expensive after school care…this is why people dont go for more than 1 kid or even start. \n\nMake the entire journey from conception to delivery free",
          "score": 25
        },
        {
          "text": "It’s a nice sentiment in light of the 15b surplus.\n\nBut currently government-linked (or whatever’s the word) childcare operators are about $400/month after the subsidies.\n\nCan the government afford to absorb this and will this be appreciated? Sure. Is it going to be a massive factor for decisions to have kids? Probably not. And there are families who will still choose to go to private ones at 2k and above/mth because of perceptions and the competitive landscape.",
          "score": 24
        },
        {
          "text": "Increase paid leave and child care leave - paid leave so singles can go paktor, child care leave per child so parents don’t have to fret.\n\nReduce COE or prioritize COE allocation to families with &gt; 2 kids.\n\nRadical suggestion: Right to Disconnect from work law like Australia - perhaps a priority for parents of children 0-12. \n\nEven more radical suggestion: Flexi work 40-hour week shifts: 7am-4pm, 8am-5pm etc all the way til 10am-7pm. Lets parents pick and choose how to sort out dropoffs and pickups for their kids. \n\nMost radical ever: Crash the housing market. Houses are meant to be lived in, not an investment or for flipping. Do it you cowards and pop that bubble. Make our resale HDBs cheap. Maybe we finally can afford a home to start a family. \n\nReduce cost of living by like idk rent ceilings. Stop making everything more expensive!!",
          "score": 21
        },
        {
          "text": "Agree. Can’t wait for them to come back with some lame excuse to say it should cost. \n\nOption 1: quality will drop it’s it free! \nOption 2: raiding reserve! Who pay!?\nOption 3: need to increase tax! \nOption 4: duty as parents!",
          "score": 14
        },
        {
          "text": "Period",
          "score": 12
        },
        {
          "text": "With these 3 things free, locals also dont want to have children lmao. There are far bigger factors at play.",
          "score": 5
        },
        {
          "text": "Will he be part of Indranee's workgroup?",
          "score": 4
        },
        {
          "text": "Yes this. And double the non-SGrean fees. Increase tax rate for non-SGrean.",
          "score": 4
        },
        {
          "text": "Since both parents have to work now and pay for childcare, which is caused by rising cost of living which is caused by the SG gov chasing of GDP, this is only right.",
          "score": 3
        },
        {
          "text": "I think people with 3 kid or more actually need car.\n\nParent with 3 kid and above shld get heavy subsidised COE.\n\nThis might encourage more people to have more kid lmao.",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1rg3yz3",
      "subreddit": "singapore",
      "title": "S’pore to tighten demerit points system, lower alcohol limits, amid worsening road traffic situation",
      "url": "https://old.reddit.com/r/singapore/comments/1rg3yz3/spore_to_tighten_demerit_points_system_lower/",
      "score": 115,
      "num_comments": 57,
      "created_at": "2026-02-27T19:15:11",
      "selftext": "",
      "comments": [
        {
          "text": "You don’t enforce, what’s the use",
          "score": 129
        },
        {
          "text": "The \"vision zero\" they are touting wasn't made possible by increasing penalties only. It needs a rework on our land transport policies, which I doubt they have the political will to do it.",
          "score": 52
        },
        {
          "text": "As a driver, good. Singaporean drivers suck ass. \n\nReminder that in Nov 2024 MHA announced going lax on first time offenders ([Link](https://www.reddit.com/r/singapore/comments/1gom30b/removing_mandatory_sentences_for_firsttime) to reddit comments) and everyone I knew was shocked given that it came hot on the heels of rising RTA fatalities. 2025 was an even worse year ([link to SPF](https://www.police.gov.sg/Media-Hub/Police-Life/2026/02/Traffic-Accidents-Rose-in-2025)).",
          "score": 26
        },
        {
          "text": "how many just convert license without taking TP test locally? curious if theres a trend there",
          "score": 24
        },
        {
          "text": "Could be a license issue",
          "score": 21
        },
        {
          "text": "Perhaps having more live police presence is the answer. Everything else is after the fact\n\n",
          "score": 14
        },
        {
          "text": "Also fine people based on their net worth",
          "score": 12
        },
        {
          "text": "So tightening the rules for traffic accidents as well?",
          "score": 7
        },
        {
          "text": "&gt;She added that the authorities are also concerned over violations involving foreign-registered vehicles, and will be announcing details on several measures to strengthen deterrence and enforcement.\n\nHonestly, that's the most interesting part of the article. Are they finally going to do something about those errant Malaysian cars with the extremely dark tinted windows and low-visibility license plates? Not to mention those 2-stroke Malaysian bikes vrooming through HDB carparks and riding like daredevils, among all their other shenanigans?",
          "score": 7
        },
        {
          "text": "What’s the punishment for reckless driving that kills soneone?",
          "score": 5
        },
        {
          "text": "Speaking of which, whatever happened to the one who caused the death in Chinatown again?",
          "score": 5
        },
        {
          "text": "Everday you see heavy and commercial vehicles speeding on the expressway...where the hell is the enforcement.",
          "score": 4
        },
        {
          "text": "&gt;She also said penalties should be higher in cases where a driver puts another person in danger on purpose, and that this will be studied with a view to introducing a new offence to tackle such behaviour, with a higher maximum penalty.\n\nPlease make it at least at permanent ban from driving if they caused fatalities due to their reckless driving. We do not want such irresponsible drivers on the road. That's part of how you will achieve your \"zero road fatalities\".",
          "score": 3
        },
        {
          "text": "Pls just stop with the fines. Fines don't work. \n\nDemerit points are much more effective as well as stronger enforcement. \n",
          "score": 3
        },
        {
          "text": "Have they ever considered their roads got worse? The condition of our roads are not v different from Malaysia",
          "score": 3
        },
        {
          "text": "Good move.",
          "score": 2
        },
        {
          "text": "I don’t see any effort made. I see cars running red lights, change lanes abruptly, decide to change lanes while turning during heavy traffic, change lanes with no blind spot checks, intentionally holding up traffic, brake checks, using yellow boxes to change lanes… \n\nOnce saw a phv swerve in and out of both lanes of the road, then decided to turn left from the right turn only lane.",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1rg1zml",
      "subreddit": "askSingapore",
      "title": "How common are workplace relationships in SG?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rg1zml/how_common_are_workplace_relationships_in_sg/",
      "score": 190,
      "num_comments": 68,
      "created_at": "2026-02-27T17:19:32",
      "selftext": "Is it common?? I used to think it wasn't. I'm not talking about cheating cases, talking about two singles going out with each other. And if you were single, would you sleep with a colleague? ",
      "comments": [
        {
          "text": "Before dating app, it’s pretty common. I know married couples are very professional and respectable in the department. It depends on maturity",
          "score": 209
        },
        {
          "text": "Actually more common than people might think. Once you stay working, it's hard toeet new people. And then you have people that you see everyday at work. Naturally there would be people who get romantically involved. What's more common is that once together, one of them would quit, unless the corp is really that large and they never meet each other.",
          "score": 128
        },
        {
          "text": "My wife was my assistant manager.\n\nBut we got declare to company and she was removed from my team",
          "score": 112
        },
        {
          "text": "Don't shit where you eat.",
          "score": 87
        },
        {
          "text": "Haha my partner and I met when we were working in the same firm. Via mutual colleagues. I would never have met anybody because I’m not those who will go out during weekends or have any social activities. If you mean sleeping as in a hook up, no, I don’t do casual, and much less my workplace where it has the potential to ruin my career if things blow up.",
          "score": 85
        },
        {
          "text": "Friends with benefits and cheating is more common to be honest.",
          "score": 69
        },
        {
          "text": "Had 2 people (girl and guy) in the office who were in long term relationships with their respective partners, and the guy colleague was preparing to propose to his girlfriend of 7 years already. This 2 people even went on double dates together, so they’ve met one another’s partners. \n\nThe department went on a 2 day work bonding trip, and after the trip they both broke up with their respective partners and got together. Now already visiting relatives during CNY although only together for like 1 month. \n\nDidn’t help that other work colleagues were also egging them on to get together and boss even put their work desks next to each other…",
          "score": 63
        },
        {
          "text": "Workplace relationships? Not uncommon. Know quite a few folks who got together after working in close proximity (starts in secret, then open after the stop working together). \n\nWorkplace cheating? Also not uncommon, know of a famous one from a real estate company that was in the news recently.",
          "score": 60
        },
        {
          "text": "I have one, but its pretty one sided.\nIts where my boss f**s me everyday with overwork, and i do it",
          "score": 51
        },
        {
          "text": " Depends on the environment. I worked in a fairly young department and it spawned 3-4 couples over the years.\n\nHR just ensured the couples didn’t work in the same team and not a manager-subordinate rs. \n\nIt was cute when couple formed, definitely not a taboo.",
          "score": 39
        },
        {
          "text": "Why is this NSFW?",
          "score": 21
        },
        {
          "text": "I would imagine cheating cases are more prevalent than singles matching up.",
          "score": 20
        },
        {
          "text": "in banking, very common. many of my colleagues are married, i’m dating my colleague too",
          "score": 10
        },
        {
          "text": "Same company is common, I met my wife that way.\n\nSame company + same team are rarer and risky for obvious reasons.",
          "score": 8
        }
      ]
    },
    {
      "id": "t3_1rg4luz",
      "subreddit": "askSingapore",
      "title": "Have you all ever wondered how do white horses do NS?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rg4luz/have_you_all_ever_wondered_how_do_white_horses_do/",
      "score": 124,
      "num_comments": 66,
      "created_at": "2026-02-27T19:50:05",
      "selftext": "We all know that there are white horses in the NS. Do you think they get any special treatment? If they have what kind of special treatment do they get.",
      "comments": [
        {
          "text": "I know one white horse served NS as a soil scientist",
          "score": 224
        },
        {
          "text": "There was a white horse in my enhanced BMT platoon many years back. He did not receive any special treatment, and we did not too. I was actually hoping we would have it easier, but our company was known to be hardcore and the training was in fact very tough to say the least. The white horse went through the exact same training as the rest of us - he was fit and actually did very well.\n\nNeedless to say, the commanders knew that he was a white horse.",
          "score": 187
        },
        {
          "text": " Had minister son LT. we knew he was coming before he got posted here. We knew who his daddy was. I’m not directly under him but no drama, seem like a very upstanding guy haven’t heard any bad things about him too. Got sent to GIC / Temasek after army.",
          "score": 126
        },
        {
          "text": "Had a white horse LT way back when in mono. Feller had a good life and got to go back at 4 plus daily. \n\nTried to punish me for insubordination (long story outfield when he led men into a swamp vs me telling the guys to test another route). Met me in his office to levy the charge and I told him to shove it up his behind. \n\nGot transferred to support coy a month after. Thank you sir, I loved my time as a mortar man.",
          "score": 105
        },
        {
          "text": "white horse was my PC when i was in Guards. was the son of an MP/ex-CGO. put it simply, no special treatment, just served his time well and was a humble guy all round",
          "score": 97
        },
        {
          "text": "There was a white horse in my office. He did lots of bad stuff. Some even illegal. All investigation stopped when he became the prime suspect. The people in charge just sent out a warning message to the entire company, then forget that anything ever happened. Case closed. No action taken.",
          "score": 87
        },
        {
          "text": "The white horses that I know were fierce in training but also kept a very low profile",
          "score": 84
        },
        {
          "text": "A funny thing happened to me in BMT. I got mistaken as a white horse. The encik believed it. I don't know how it happened but I never got shouted at for the rest of my BMT, and never kena arrow to do things. But I never really exploited the mistake.",
          "score": 51
        },
        {
          "text": "The term white horse is quite meaningless now. In the past, not long after independence, the label was there because kidnappings and other violent crimes/political threats were common so special care/attention was given to the sons of the wealthy and elite.\n\nAfter that, white horse became more of an FYI/less official label. I doubt an easier time was requested or anything, but if you’re the OC, what would you do? He kb training too shiong, he gets injured or worse…you hong gan already.\n\nNow SG too many sons of elites and wealthy already for it to mean anything.",
          "score": 42
        },
        {
          "text": "Either go into the scholarship route or defer to do Med school. ",
          "score": 41
        },
        {
          "text": "Was in same BMT coy as some general's son. White horse enough for our coy to be known as the most lepak one in Tekong (for our batch). He became an officer. Same NS and ORNS unit as him also till MR. I don't know what his OCS life was like, but I can confirm at least from unit onwards he didn't get any special treatment or what not.",
          "score": 25
        },
        {
          "text": "White horse platoon. When it came to declare if you have stake in a company i think 3 came forward. There was a minister in another platoon but same company. 3 guys who stayed at sentosa cove kind of rich and some others in sixth avenue.\n\nI kid you not we were never punished for anything.",
          "score": 16
        },
        {
          "text": "2 in my unit. One was son of a major Shell director, and son of Singapore’s sixth richest man (at that time). Both downgraded to Pes E for no apparent reason, and spent 2 years doing stupid admin work.",
          "score": 14
        },
        {
          "text": "Had a white horse in our bmt, kept very low profile and only until nearing the end of bmt he admitted his father is high ranking in army. His buddy during bmt was his best friend, it was chosen by him so they enlisted together and in same coy. Barely passed ippt and still went ocs. But otherwise he was quite a friendly guy.\n\nThinking back 20 yrs ago i was a 19yo gong kia didnt know about networking and relationships. Could have made a good friend in life hahah",
          "score": 13
        },
        {
          "text": "Had one, became a PS. Thats it",
          "score": 10
        },
        {
          "text": "know quite a few white horse personally… but i see like same eh.. no diff kana fk same as the rest of",
          "score": 4
        },
        {
          "text": "During my time (long ago) one of the Moe min's son was in my bmt. Not blatant special treatment but his section was never the first arrowed to do anything.",
          "score": 4
        }
      ]
    },
    {
      "id": "t3_1rgajnj",
      "subreddit": "askSingapore",
      "title": "Singaporeans who left, what was the process like?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rgajnj/singaporeans_who_left_what_was_the_process_like/",
      "score": 71,
      "num_comments": 40,
      "created_at": "2026-02-27T23:59:19",
      "selftext": "Was there anything that was left in the air after leaving that you should have taken care of earlier? What countries were you considering before settling on your current country?",
      "comments": [
        {
          "text": "I think if you provide more context or background, it would be helpful. I just packed 2 suitcases and went off to college in NYC. ",
          "score": 75
        },
        {
          "text": "Step 1: Travel\n\nStep 2: Enjoy the country you went to\n\nStep 3: Go back a couple more times\n\nStep 4: Constantly research about moving\n\nStep 5: Start process of moving\n\nStep 6: Move!\n\nThe first country I moved to was South Korea and that was because I got a university scholarship. Spent 7 years there, moved back because of family stuff and the work culture there was kinda shit. \n\nI’m about to move to Thailand in 2 days. \n\nAfter Korea I didn’t know where I’ll move to, but I knew I wanted to leave Singapore. During the 4 years I was back, I travelled extensively - South Africa, Australia, New Zealand, Germany, Netherlands, Italy, Switzerland, Czech, Austria, Thailand, Vietnam, Philippines, Indonesia. \n\nAnd through that list, I found myself going back to Thailand more often, hitting the northern and north eastern parts. Then I started learning the language and planned the move. \n\nUnless you have no family left in Singapore, nothing much to take care of except your phone plan. \n\nAll the best!!",
          "score": 46
        },
        {
          "text": "\nWork in sg 3-5 years relevant experience in field.\n1. Get a job offer in that country.\n2. Get work visa.\n3. Go to work a few(2-3) years, gain work experience in that country.\n4. Apply for permanent resistance.\n5. Pay taxes on time.\n6. Can stay as long as you have a job.\n7. Renew permanent residency every 3-5 years(depends on the country)\n\nGrass is not greener on the other side, it’s what you make of it yourself.\n\nOnly advice is to network very well and accept that you will be in constant discomfort. It will never be comfortable, ever.",
          "score": 44
        },
        {
          "text": "I wanna get out of sg and move to aus or soemwhere else in the future and not coming back here",
          "score": 15
        },
        {
          "text": "I’m 17, and after ITE, poly, and NS, I’m probably gonna move to the UK or Australia if I get the chance. Don’t get me wrong, I respect Singapore, but it just doesn’t feel like the place I’m meant to be. Feels right to want to try life somewhere else.",
          "score": 10
        },
        {
          "text": "Thanks for the post. Serious thought about migration too especially when looking at how Singapore is becoming. To foreigners or some foreign countries, Singapore is a model country. For me, my family fortune keep getting worse since independence.",
          "score": 9
        },
        {
          "text": "I’m just curious - For those who moved out, what made you leave SG?",
          "score": 6
        },
        {
          "text": "I wish I have the means to migrate. But meanwhile watching this thread so I can escape from this sad sad place that’s barely even a “country”.",
          "score": 6
        },
        {
          "text": "Currently studying overseas, I think I have a chance to stay for work, but sometimes do miss the warmth of Singapore, most western countries are in cold climate for half the year atleast",
          "score": 5
        },
        {
          "text": "Left a couple of years ago for grad school in the US, found a job here after graduating and am living and working here on my H1B-1. It's been decent here on the west coast, not sure if I will stay in the long run but definitely a change from SG.   ",
          "score": 5
        },
        {
          "text": "Urm... I left for university in 2011 to the U.S. and have been here ever since. But still a singaporean citizen.",
          "score": 5
        },
        {
          "text": "Didn't really left but out of the country a lot.\n\nReally miss a lot of the convenience and comfort available in SG.\n\nMay not be unique stuff but is for sure cheaper and more accessible.",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1rgd1hh",
      "subreddit": "askSingapore",
      "title": "helping my mum get out of her extremely abusive marriage",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rgd1hh/helping_my_mum_get_out_of_her_extremely_abusive/",
      "score": 38,
      "num_comments": 35,
      "created_at": "2026-02-28T01:27:35",
      "selftext": "hi everyone, my mum is in a pretty dire situation and i'll explain most of what i can in this post. not looking for personal opinion against us, just actionable advice or solace. \n\nmy mum is looking to get a divorce and get at least 50% of the assets (basically just proceeds from the hdb flat) if possible. however the problem is that she probably doesn't have enough funds to get a contested divorce (assuming a 30k budget). we are aware of pro-bono services, so will be looking into that but also posting here to get some more suggestions that we might otherwise not know about.\n\none caveat is that we are all singapore PR. i know very well how this sub feels about PRs, but i'll preface this by saying we're malaysian and my parents came here in their early 20s looking for a better life. my mum has always been a housewife and thus not working. she has been the one to raise me (only child) and take care of everything in the house. we do not have family here who are willing to do so in place of my mum and so there was no way for my mum to have a job. my dad does not cook, clean, wash dishes, do laundry, or do anything. he contributes monetarily and my mum contributes effort in raising a kid along with all household chores. \n\nthe flat that they have is under SERS and we haven't moved into the new flat yet, making this yet another caveat. my dad has ceased paying the mortgage and has so far accrued penalty fees of about $12k. he has been giving money to his mainland chinese mistress and is very brazen about it. i'm also aware that infidelity will not be considered a factor in family court, it's purely about how much you've contributed to the marriage. however he's neglecting his duties as a family man in order to give money to a mistress. we do not have a loan for the incoming flat and the outstanding mortgage + penalties are already more than the profit we would've gotten from the enbloc. we have no property or asset in malaysia and our whole lives are in singapore, so there's nowhere to \"go back\" to. \n\nas for me, i'm working part time and transitioning into full time very soon. i'll be getting my own bto with my husband but will contribute as much as i can for my mum. however i will not be able to afford the lawyer fees with my starting salary. \n\ni just have two questions: \n\n1. is there such a thing where my mum engages a lawyer for a contested divorce, and will only have to pay the lawyer fees at the end of the proceeding? \n\n2. will i be able to get a home loan in malaysia under my mum and my name, while having a bto under mop in sg? note that the malaysian property will only be under my mum's name and my name will not be included in it. \n\nthanks in advance for reading my super long post. ",
      "comments": [
        {
          "text": "Lawyer here. But not your lawyer and don't take this as legal advice blah-blah disclaimer.\n\n1. Yes\n2. No, only owners be accessed on loan criteria.",
          "score": 43
        },
        {
          "text": "Hi OP, not a lawyer but you may try visiting a nearby Family Service Center (there are many islandwide) to seek help and advice. \n\nThere are also several places where you can apply for a one-time free legal clinic session to clarify legal questions you may have. They are not lawyers who will represent your mother in court, but they can at least address queries you might have about the divorce process. Check out Community Justice Center, I think they have daily walk-in appointments on a first come first serve basis. You can also check out Pro Bono SG for a list of other free legal clinics. During the legal clinic appointment, you may also enquire a bit more about the process to hire a low/pro bono lawyer. \n\nIt would help your mum greatly if you could help her to start documenting any forms of abuse (physical, emotional, financial, etc…) and keeping that documentation safe out of your father’s reach. You can Google search on how and what kind of evidence you can document for this process. This would help in the divorce proceedings. \n\nSince divorce is a long and arduous journey, please also lookout for your mum’s and your mental health, there are NGOs out there that offer low/pro bono counseling services should you both need it. All the best, OP!",
          "score": 10
        },
        {
          "text": "I have go through the divorce with my mum against my asshole father. Long and tiring journey, progress take around 1 year. My father still live in the same house with us at that period of time and he keep making trouble and look for quarreling. So alot of fights. \nJust endure and hold it, the storm will be over. Now living happy life with my mother.",
          "score": 8
        },
        {
          "text": "Not a lawyer but if you help your mum buy a property in Malaysia prior to the divorce, won’t it be included by the judge in the set of assets (since it is technically a matrimonial asset ie acquired during the marriage) that will be divided under a divorce?",
          "score": 7
        },
        {
          "text": "Sorry I am missing context.. is there a reason you/your Mum need to own property in Malaysia? If she just wants a place to stay apart from your father, renting in Malaysia is very affordable.",
          "score": 2
        },
        {
          "text": "You can approach your neighborhood family service center (FSC) which is experienced in such matters and could make referrals. Free or minimal costs. They would also be able to advise on safety plan and measures such as PPO for protection in the meantime.\n\nWalk in or phone appt",
          "score": 1
        },
        {
          "text": "If Div goes through... both parents become single/div PR in SG and thus not able to own any HDB in single names. \n\nThis worst case scenario is very challenging.",
          "score": 1
        },
        {
          "text": "Local community center can also be of help giving you guidance on how to approach this. Perhaps the sensible thing is to have your mom moving with you once you get your flat.",
          "score": 1
        },
        {
          "text": "You might want to consider approaching Legal Aid Bureau (LAB). There’s still lawyer fees but it’s subsidised and means tested to determined how much your mum needs to pay. Do note that there’s some sort of criteria they use to assess eligibility for LAB support. Suggest to get a referral from nearby FSC to LAB or approach LAB yourself. Hope this helps",
          "score": 1
        },
        {
          "text": "Just my two cents since i also had to help my mum with her divorce.\n\nYou’ll need to at least pay some retainer for the divorce case, usually $1K+. The selling of the house is separate case even tho it’s mentioned in the divorce order. So unless it’s done by the same law firm, you’ll have to pay the rest once the divorce is finalised.\n\nThere are some law firms that offer a free 30 mins consultation, you might want to go to those to get some idea on next steps + see if the lawyer is suitable. Also use Chatgpt to help you understand your next steps and what the lawyers tell you.\n\nMy experience is that there are lawyers who’ll act all high and mighty, and only want to do the minimum. They’ll advise you to go for uncontested divorce, accept whatever the other party says or offers as part of the divorce. So definitely avoid any lawyer and their secretary who seems to have communication issues i.e. uses vague words or refuse to answer your questions when you try to clarify.",
          "score": 1
        },
        {
          "text": "1. yes\n2. think deeper does she have other relatives to look up on her while you in SG? Eventually she will get old and sick and her safety. Is your husband SC? Are you guys planning to have a kids? If yes, the easy way is to get 3 Gen flat",
          "score": 1
        },
        {
          "text": "Abusive? Call police and get a divorce and lawyer.",
          "score": -2
        }
      ]
    },
    {
      "id": "t3_1rg1j52",
      "subreddit": "askSingapore",
      "title": "Is Singapore sustainable enough for the future?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rg1j52/is_singapore_sustainable_enough_for_the_future/",
      "score": 27,
      "num_comments": 44,
      "created_at": "2026-02-27T16:52:25",
      "selftext": "Over the years, Singapore to me did indeed turn into a metropolis. The current doubt is how far or more can Singapore grow to sustain. Unlike Malaysia and several neighbouring countries, we do not have the spacious land to expand. What we are working on now seems to be either building underground or building higher. What will the future be like just through the amount of land we have in Singapore? It feels like Malaysia will soon outgrow Singapore in terms of development in several places in the next 20-30 years. And this is only talking about space, we still have problems like birth rate declining below 1 since 2023. The solution for that in my perspective is accepting in more and more PRs. \n\nNote: This is just my personal view on the future of Singapore. There must be a crucial plan to keep the trust Singaporeans have in Singapore.",
      "comments": [
        {
          "text": "The correct question is - are you sustainable enough in Singapore?",
          "score": 25
        },
        {
          "text": "As long as our neighbors keep having bad government, we will be ok .\n\nThe day their government does good will be out downfall",
          "score": 22
        },
        {
          "text": "In my opinion, soon Singapore will start to decline or maybe it has already started declining.\n\nSingapore has no land , no natural resources, the only resource it has are its people. With low TFR, Singapore will continue to rely on imports/immigration to maintain its competitive edge.\n\nSooner or later, the countries surrounding us will get their shit together and start to outgrow Singapore. That is assuming the governments of the surrounding countries get better of course.\n\nAlready we can see businesses relocating their HQs to malaysia/indonesia. Our current government consists of mainly yes men and weak political leaders and Singapore's infrastructure is already struggling to cope with the increased population. There is no innovation being done or niche industry that Singapore has that will make it relevant in the years to come. \n\nSingapore is not going to collapse, it will just become less relevant as time goes on.",
          "score": 19
        },
        {
          "text": "doesnt matter global worming will reset everything anywayyyyy",
          "score": 7
        },
        {
          "text": "There will likely be a war once china reaches a certain size and avenues of growth are blocked by the west. Refer to how Germans were blocked by england before war world 1 n 2. Now we are seeing the start of the.blockages by usa.\nWhat happen during this war will determine sg. But looking at how poor nearby countries of usa are. I wun be surprise that If china wins this war. Sg will be severely limited in the future.",
          "score": 6
        },
        {
          "text": "Not sustainable. Indefensible. 6 million people on 720 square km. Imported water. Imported food.",
          "score": 3
        },
        {
          "text": "Honestly, land is still very much sustainable for us in the long-run. With a persistently low birth rate, it does mean that our population will likely moderate to a max of 7 mil for this century (even assuming we take in large numbers via immigration).\n\nOur land isn't remaining static either. Singapore's size has expanded by more than 25% due to land reclamation and will expand by a similar amound in the future too. Not to mention that we are getting more efficient with building underground and taller buildings.\n\nAs a knowledge-based economy, we are also well positioned to take advantage of the next economic drivers of digitalisation, R&amp;D, climate change tech etc. This also means that the birth rate problem is less bad for us since we are less reliant on mass labour for growth like other developing countries. Though it is likely our growth will stagnate at some point, as with any highly advanced economy. But will remain way more prosperous than nearly everyone else.\n\nThe more worrying thing is that our neighbours will get good governance and exceed us in sheer economic heft. This doesn't directly hit our economic standards but it would mean that we may have less geopolitical say and get pushed around by bigger powers like Indonesia.\n\nAs a place to live though, I'd say Singapore is pretty unmatched compared to any country out there. It will be rather improbable for most countries to ever match our per capita wealth or development. Annoying thing is our weather is really hot and going to get a few degrees warmer with global warming.",
          "score": 3
        },
        {
          "text": "We having headache with birth rate while our friend up north still having \"temple land issue\"\n\nThey not gonna outgrow us anytime soon lmao",
          "score": 2
        },
        {
          "text": "Every generation has its challenges lah. Not long ago, we had a workforce trained for a manufacturing economy that needed to pivot towards services or risk losing relevance. And the generation before, serious existential threat when we couldn't even find our place on the world stage, with the pioneer generation having to figure out basic physiological challenges like housing, rampant unemployment, and internal security.\n\nI think Singapore's long term risk is not fiscal/financial collapse, but relative decline in relevance. Slower growth, tighter competition from other hubs, and more pressure to justify our premium positioning, all play their part to force us to be at the top of our game.\n\nThat said, I am optimistic about our future lah. When US-China competition hardens, companies and governments need places to route capital, contracts, arbitration, HQ functions, data/compute, and supply-chain coordination without “choosing a side.” Singapore’s strategy explicitly leans into balance rather than alignment.\n\nWe are also compounding hard infrastructure advantages. PSA terminals hit 44.5m TEUs in 2025, a record, which signals the port is not stagnating. Changi handled 70m passengers in 2025 and is progressing with Terminal 5 planning toward the mid-2030s, i.e., we are still building “hub capacity” rather than harvesting the past.\n\nFinance remains a good moat too. MAS reported Singapore retained its position as the 3rd largest global FX centre with a rising share of global FX volumes.\n\nAll in all, it's our time to perform lah. Cannot surrender even before the fight right? I do think we stand a pretty good chance to remain relevant, but we also need to display a certain level of optimism about the future :)",
          "score": 2
        },
        {
          "text": "[removed]",
          "score": 1
        },
        {
          "text": "[ Removed by Reddit ]",
          "score": 1
        },
        {
          "text": "No it isn’t. Country only serves the rich",
          "score": 1
        },
        {
          "text": "It is only a matter of when that our neighbouring countries overtake us. It won’t happen in the near future though because their government officials are inefficient and corrupt, I don’t think that will change anytime soon.",
          "score": 1
        },
        {
          "text": "Artificial island incoming, land is not an issue. Sustainable in what context? Maintaining the current glory? Possible but with the help of foreigners. Many young gen will need to live off parents inheritance, similar to how China is.",
          "score": 1
        },
        {
          "text": "No. What are you going to do about it?",
          "score": 1
        },
        {
          "text": "No I don’t think so. It’s so expensive",
          "score": 1
        },
        {
          "text": "not one of the comments talked about the hunger of singaporeans as vital to us surviving. Are singaporeans hungry enough to hustle and win the competition? Best airport, best port, best financial services? Is there fire in our belly to keep learning and keep improving? Or do we just want to do enough to retire early. If everyone pulled their weight, we will survive and thrive. I think this is key.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rgp0jr",
      "subreddit": "askSingapore",
      "title": "Quiet coffee places on a weekend with natural lighting",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rgp0jr/quiet_coffee_places_on_a_weekend_with_natural/",
      "score": 16,
      "num_comments": 18,
      "created_at": "2026-02-28T09:15:16",
      "selftext": "Looking for a cafe to chill on a weekend that’s ’above ground’ not basement, with natural light, that’s quiet with little crowds.\n\nRecs pls! ",
      "comments": [
        {
          "text": "Jing Si at Yishun Pond! Lovely place to have a pot of tea and read.",
          "score": 10
        },
        {
          "text": "Apartment Coffee on Selegie Rd (does have a queue but moves fairly fast and great coffee), Space Coffee on Geyland Rd",
          "score": 4
        },
        {
          "text": "Suzuki cafe and roastery at chin bee avenue",
          "score": 2
        },
        {
          "text": "for smaller specialty places with sunlight and a mellow atmosphere, Apartment Coffee and Zerah Coffee Roasters are nice picks that aren’t always packed",
          "score": 2
        },
        {
          "text": "Ummm PLQ THAT AREA got a smol  , I love the espresso  super dark and bitter",
          "score": 2
        },
        {
          "text": "74x Bedok Reservoir has a few cafe.",
          "score": 1
        },
        {
          "text": "Arabica at Chip Bee HV, no crowd unlike the other Arabicas, plenty of sunlight, also has outdoor seating",
          "score": 1
        },
        {
          "text": "Grey Area Coffee Roasters in Spottiswoode area!",
          "score": 1
        },
        {
          "text": "Drip &amp; Drool is my go to if I need quiet! Natural light, zines and books to browse, and rly good coffee (They have a no-kids policy too!)",
          "score": 1
        },
        {
          "text": "dawn, \n\nthey only serve coffee and some bread thingies.\n\nits on the darker side but very quiet as most customers use that place to read books",
          "score": 1
        },
        {
          "text": "[removed]",
          "score": 1
        },
        {
          "text": "Book Cafe at Mohd Sultan Rd.",
          "score": 1
        },
        {
          "text": "fluid at opal crescent!",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rg9wjd",
      "subreddit": "askSingapore",
      "title": "Where do you typically go on a date and what activities are fun and highly recommended?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rg9wjd/where_do_you_typically_go_on_a_date_and_what/",
      "score": 16,
      "num_comments": 10,
      "created_at": "2026-02-27T23:35:54",
      "selftext": "I’m meeting a girl in Singapore who I met while we were both traveling solo in Thailand. We spent the last part of her Thailand trip exploring together, and it’s been almost four weeks since we last saw each other. We’ve been keeping in touch the whole time. And she invited me to join her in Singapore for a few days. Where should we go? I’m thinking of taking her somewhere nice for a date. ",
      "comments": [
        {
          "text": "Can try going Hopscotch for dinner at gillman barracks and go for a slow walk in the southern ridges or labrador nature reserve after. \n\nAnother suggestion is k-bowl for bowling darts, and other fun arcade games. This is in Somerset 313\n\nAlso highly recommend our singapore aquarium . Its stunning.",
          "score": 30
        },
        {
          "text": "gardens by the bay is a good option. it’s air conditioned, you can walk around there and also MBS and also walk to Millennia walk for some food. \n\nAlternatively cow play cow moo also quite fun if she’s into arcade games",
          "score": 8
        },
        {
          "text": "I like cat cafes and board games and switch games",
          "score": 6
        },
        {
          "text": "Bicycle ride from Marina Barrage to Changi airport. Also can do Tandem biking so you can listen and talk yo each other easily",
          "score": 3
        },
        {
          "text": "Ff this ☝️",
          "score": 1
        },
        {
          "text": "H81, strip poker",
          "score": 0
        },
        {
          "text": "Just bring her to your room",
          "score": -22
        }
      ]
    },
    {
      "id": "t3_1rgurv5",
      "subreddit": "askSingapore",
      "title": "How do I help an injured baby Mynah bird?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rgurv5/how_do_i_help_an_injured_baby_mynah_bird/",
      "score": 13,
      "num_comments": 1,
      "created_at": "2026-02-28T13:58:58",
      "selftext": "There is a baby mynah bird injured at Lasalle College of the Arts right now, and it's unable to walk, suspecting both of its legs are broken from flying into the windows. Its parents are around the baby, so I am unsure if I should call ACRES. What should I do to help?\n\nUpdate: after abit more research i think the baby is still a fledging baby! I’ll leave it alone for the time being, and hopefully nobody takes it away from its parents.\n\n2nd update: A pair of girls went to take the baby while trying to find a box for it, but I was unable to find them... another kind man was also trying to watch over it, but he couldn't find them either. Hopefully they'll return the bird asap. Must be super tough for the baby's parents.",
      "comments": [
        {
          "text": "Yes pls call acres or NParks",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1rgn6zv",
      "subreddit": "askSingapore",
      "title": "Pen spirit: who has played this when schooling in Singapore and what were your experiences?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rgn6zv/pen_spirit_who_has_played_this_when_schooling_in/",
      "score": 12,
      "num_comments": 15,
      "created_at": "2026-02-28T07:55:46",
      "selftext": "Asking because I read on a forum where a parent was asking if it was age-appropriate for his or her P2 kid to play pen spirit in school. \n\nI recall my sister playing with her friends pen-spirit in upper primary school. Looking back none of my friends nor I play this when in school. Wondering what are some of the experiences of those who have? ",
      "comments": [
        {
          "text": "Believer or not, you don't want to mess with the supernatural.\n\nIt's also pretty funny how these things teach you how to start but never teach you how to end it.",
          "score": 27
        },
        {
          "text": "Dun. There are rituals to invite and close the session and dun do it alone. So 4 of us play ouiji and it was informative. We felt the presence and the force on the coin. We knew it was real when we half expected one guy to burst out luffing but all looked shocked at each other.\n\nFren who owned the board treated it like chatgpt tat we know now and did it alone at home a few times. Started looking haggard and confessed and that the last one he did, he din close properly aka get the spirit to leave and the presence stayed. Breathing noises near him when he slept,.footsteps, random things dropping. His parent had to invite medium to clear the presence.",
          "score": 19
        },
        {
          "text": "Kids brains are still developing so you don't want to introduce any elements which could mess with their psyche. Even if spirits are not really there the human mind can easily manifest them through the power of overthinking and imagination because we have a primal thing inside us called the amygdala",
          "score": 11
        },
        {
          "text": "Mama I want ouija board\n\nWe have ouija board at home don’t waste money\n\nOuija board at home :\n",
          "score": 9
        },
        {
          "text": "It was fun. I was one of those who moved the pen.",
          "score": 7
        },
        {
          "text": "Never appropriate to play even for adults",
          "score": 6
        },
        {
          "text": "Ghosts aren't real",
          "score": 4
        },
        {
          "text": "It's still around? I remember hearing about this from my childhood decades ago",
          "score": 2
        },
        {
          "text": "Yes, in secondary school. \n\nJust fun only lor. Everyone I played with now living good lives . Nothing bad happened.",
          "score": 2
        },
        {
          "text": "Try spirit of the coin? Its fun too! My friends and me play it during secondary school. Nothing happened. Just for fun!",
          "score": 1
        },
        {
          "text": "How did they know how to play it? Who taught them the setup and rules?\n\nPlayed w primary school friends before at their place. It’s like drawing a house and candies around it. After session have to invite it back to go home.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rgsz1i",
      "subreddit": "askSingapore",
      "title": "Why are there guys doing sign language in Zouk?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rgsz1i/why_are_there_guys_doing_sign_language_in_zouk/",
      "score": 12,
      "num_comments": 23,
      "created_at": "2026-02-28T12:22:28",
      "selftext": "Who are the guys standing on platforms and stage doing sign language in Zouk? They also seem to have earplugs? Ear piece? I couldn’t tell. Are these paid performers by Zouk and is this Zouk’s way of being more inclusive. ",
      "comments": [
        {
          "text": "80s gang sign. Be careful.\n\nProminent gangs are Bee Gees, ABBA, Carpenter",
          "score": 84
        },
        {
          "text": "Omg. Hahahaha. MAMBO JUMBO NIGHT!\n\nOP got me there very good.\n\nZouk has a crowd that speaks sign languages. So the duty of the dancers there, is to sign out the song so that the rest is able to understand what the song is about.\n\nThis role is important and had been ongoing for many years. In fact, I think we are one of the few places left to be so inclusive.\n\nDo upvote me so that this important info is available for everyone!\n\nMambo jumbo night eveyone again!",
          "score": 33
        },
        {
          "text": "Domain expansion",
          "score": 23
        },
        {
          "text": "They're throwing gang signs. It just takes a long time because there's too many gangs.",
          "score": 18
        },
        {
          "text": "Lold at this.",
          "score": 17
        },
        {
          "text": "Lololol. Damn I'm old.",
          "score": 14
        },
        {
          "text": "[This Is Mambo Jambo, the strange party phenomenon that Singaporeans adore](https://mixmag.asia/feature/mambo-jambo-strange-party-phenomenon-singaporeans-adore)",
          "score": 12
        },
        {
          "text": "My mute friends enjoying going there. Likely for the ambience.",
          "score": 10
        },
        {
          "text": "Google mambo Zouk",
          "score": 6
        },
        {
          "text": "Haven't had a good laugh for a while",
          "score": 5
        },
        {
          "text": "Once upon a time there was an old man who does taichi on the platform",
          "score": 2
        },
        {
          "text": "national mating ritual dance",
          "score": 2
        },
        {
          "text": "I never understood it or where they learned on from. They’d do it all night too like there wasn’t anything else to do.",
          "score": 2
        },
        {
          "text": "Practice fireball jutsu",
          "score": 1
        },
        {
          "text": "I’m too old for this discussion.",
          "score": 1
        },
        {
          "text": "I heard a rumour ... That you gave love a bad name",
          "score": 1
        },
        {
          "text": "I feel it is a great idea to see those regulars who used to be crazy to come together to do that so many like like us n sit back and enjoy watching their adrenaline on the dance floors or bar tops\n\nCan use culture pass for entry perhaps ?",
          "score": 1
        },
        {
          "text": "Oh you young sweet summer child.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rg3c4z",
      "subreddit": "SingaporeRaw",
      "title": "Minster pay duty or transaction? 🤔",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rg3c4z/minster_pay_duty_or_transaction/",
      "score": 163,
      "num_comments": 104,
      "created_at": "2026-02-27T18:39:49",
      "selftext": "",
      "comments": [
        {
          "text": "its never about duty when you are at the top. ",
          "score": 124
        },
        {
          "text": "\"No amount of monetary compensation can be equated with the contributions of our NSmen” = NO allowance increase. Cb PAP logic. Slave for 2 years to protect foreigners for a pat on the back.",
          "score": 112
        },
        {
          "text": "I'm liking Kenneth Tiong more and more.",
          "score": 98
        },
        {
          "text": "Can't be measured in dollars and cents..aka your service is worthless",
          "score": 64
        },
        {
          "text": "But minister pay increase not duty ok? So Its transactional.",
          "score": 59
        },
        {
          "text": "Well, primary school and housing ballots are also non-transactional in nature. Priority should be given to those with at least 1 NS men in the family. \n\n\nScholarships, research grants should also prioritise those with at least 1 nsmen in family.\n\n\n\n",
          "score": 51
        },
        {
          "text": "Exchange salaries with them! 👍",
          "score": 44
        },
        {
          "text": "Taiwan used to pay shit $ to its conscripts, now it's double that of NS sinkies.",
          "score": 44
        },
        {
          "text": "I am really ok with Singapore taking in new citizens to increase our population, but I really don't like the way they answers some of the questions, like..  NS cannot be measured in dollars and cents, NS is not transactional relationship, and they can have people from different part of the world come here, give them a pink IC but never need to serve, and they also have policies like, 1st gen no need serve etc..  and also the part about many serve beyond 2 years?  What is this?  of course everyone serve beyond 2 years because after NS, we still need to serve reservist until age 40...  So, is he saying there are those who don't need to do reservist?  Mind you..  Our kids need to serve reservist when people go for vacation during their school break..\n\nDon't increase allowance never mind, forced conscription is a necessary evil because we're a small country..  But be fair..  make it mandatory for all New citizens to serve, and don't give out citizenship to those older then 25 years old or any NS age requirement cutoff.. Remove 1st gen exemption etc..  remove those investor, skill BS exemption,. and don't come and say.. Oh.. Because they contribute by investing or bring in skills..  because that to me is Transactional..  ie,. you give me money, I give you freedom..  You got skill, I give you freedom..   And if they still want to take in new citizen without the need to serve, then please stop all the cock and bull talk..  Just go straight to the point..  tell the people..  Rules is rules..  You're born here, you serve..  or blame your parent why give birth to you here..  No argument..  Like it or not, you serve.  Don't want serve can..  AWOL serve time in prison..  or go for sex change operation become a women..  or break some limps or even the brain to get PES F.",
          "score": 33
        },
        {
          "text": "Another evidence that pap measures EVERYTHING like literally EVERYTHING by dollars and cents… this is who your man/sons are serving NS for…",
          "score": 29
        },
        {
          "text": "I was about to post this as well, it just pisses me off. For context, WP Kenneth Tiong asked for year 2 NSF to be paid the minimum wage when they're fully trained and function like the regular. Which makes sense. But this CCS, comes out with a stupid reason saying NS is not a transaction relationship. Saying NSF \"volunteer\" (hello? if they don't volunteer, you'll bring them to DB right?) and contribute to protect Singapore. Hello?? Does he uses his brains before he speak? How is it that our ministers get salary review and are the highest paid ministers? I recall some saying its their duty as well? Why don't our minister \"volunteer\" too??? They can get to be paid more but our men are not even paid the minimum salary!!! My dad, my brothers and I all served NS, we used to think that we are damn proud to serve NS and do our duty. But it pisses me off when its not a duty for them to be our leaders, and get paid so much yet NSF are not even paid the minimum salary! What BS is this??? And what's make it worse is now they're getting 30K new citizens in who we need to treat them like kings so they can adapt to Singapore?! Oh godz, can you tell me why I dont feel patriotic anymore? Thank you PAP!",
          "score": 26
        },
        {
          "text": "Oh boy. At this rate the young males may have to serve NS for free already.\n\nI wonder if there's a term for that...",
          "score": 26
        },
        {
          "text": "The 2 year sacrifice is duty. The unwillingness to properly recompense that sacrificed 2 years is exploitation. Don’t get it twisted.",
          "score": 22
        },
        {
          "text": "Something something cannot be measured in dollars and cents",
          "score": 15
        },
        {
          "text": "Let's see who is the first to flee if singapore ever gets into trouble",
          "score": 9
        },
        {
          "text": "ministerial is also a duty, not a tool to make money",
          "score": 9
        },
        {
          "text": "They really still think they are more equal than others. Clowns",
          "score": 9
        },
        {
          "text": "65% of Singaporeans support slavery (for men only)",
          "score": 8
        },
        {
          "text": "Brave man for calling them out.",
          "score": 6
        }
      ]
    },
    {
      "id": "t3_1rgrv5n",
      "subreddit": "SingaporeRaw",
      "title": "You just go limp, when you see her face. Whatever 'hard-ship' you have down there, will be gone in an instant",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rgrv5n/you_just_go_limp_when_you_see_her_face_whatever/",
      "score": 127,
      "num_comments": 59,
      "created_at": "2026-02-28T11:27:39",
      "selftext": "Netizens were sceptical when Minister in the Prime Minister's Office Indranee Rajah proposed a \"marriage and parenthood reset\" in Parliament on Feb 26, pointing out the struggles young families face in Singapore.\n\nResponding to concerns about the cost of raising a child in Singapore, Ms Indranee announced that a new work group will be formed to review issues surrounding marriage and parenthood.\n\n\"What we need is a marriage and parenthood reset,\" Ms Indranee said, calling for a reshaping of how marriage and parenthood are supported and perceived in society.\n\nSingapore's preliminary resident total fertility rate (TFR) has fallen to a new low, declining from 0.97 in 2024 to 0.87 in 2025。\n\nMany pointed to the challenges of raising multiple children in Singapore, particularly the high costs involved.\n\n\"With the current cost of living, people want to adopt pet also scared. What more want to have their own children,\" one commenter mused.\n\nHowever, a netizen described the situation as the \"childless leading the blind\", while others urged Ms Indranee to \"lead by example\". In an episode of CNA's The Assembly aired in October 2025, Ms Indranee revealed that she was single and did not have kids.\n\nOn Reddit, several users took issue with the \"task force\" formed to address the issue, claiming the move was \"out of touch with the common citizen.\"\n\n\"It's hard to have a mindset shift when your baseline reality is just trying to survive the 9-to-6 grind without having a mental breakdown in a mall toilet,\" another argued.",
      "comments": [
        {
          "text": "She’s the worst person to chair it. Our gov is not serious about this at all.",
          "score": 80
        },
        {
          "text": "For someone without one, she sure talks lots of cocks.",
          "score": 49
        },
        {
          "text": "She is the type that causes men to be single. File throwing spinster with temper issues. And  secondly divorce and women charter laws do not favour men. \nThirdly women are now more entitled than previous generation ( except of cos elite like her) .  the last reason people don't want to produce economic slaves that are going to be put at a disadvantage by outside slaves arriving in loads to become cheaper better and faster.\n\nAnd this is not about native local tfr. It's about how many foreigners are refusing to convert. \n\nAnd lastly whatever work group u set up to  review isn't going to work. The findings would  be something that the average citizen already knew for a decade now. Stop wasting taxpayer money on stupid research and survey companies. The money spent on renaming marina bay as marina bay years ago is a prime example of yr govt Incompetence. Don't be delusional. Singapore economy still running because of safe environment and other factors like the first mover advantage in the region. Not because of people  like her who sit on a problem and talks cocks for decades with no solution.\n\n\n u take in these new citizens, wait and see what happens. They will support u a while and later they will vote against u for bringing in more of their kind to compete with them. Look at the new citizens who came here 20-30 years ago. They are retrenched and had to downgrade their jobs ; their children are now doing delivery and other odd jobs that do not align with their qualifications like diploma and degree.\n\nThe current new arrivals aren't dumb to buy into yr offer. They are more knowledgeable now than 20 years ago due to social media and internet;  and they know what awaits them. There are hundreds of thousands of PRs refusing to convert.  The delusional bubble  that indranee and her colleagues are in is plain laughable.",
          "score": 44
        },
        {
          "text": "Shows you how little the government cares about  TFR when they appoint a file throwing spinster \n\nIt's meant to fail so PAP can import new votes",
          "score": 40
        },
        {
          "text": "A hot tempered, petty and narrow minded person is definitely not suitable to handle marriage and parenthood issues. Even worse, if they are andartu.",
          "score": 22
        },
        {
          "text": "Beats me why she was chosen?\n\nMaybe she is the \"best\" from the worst???",
          "score": 17
        },
        {
          "text": "Same thing when they hired a non doctor to lead the covid taskforce",
          "score": 12
        },
        {
          "text": "As soon as task force is established.. every year same story. \"We care about families\" then u read story a person who just give birth, caught wind of her retrenchment after maternity.\n\nOr when mentioning about family planning to employer. They suddenly kana bad performance and put on PIP. Like how. People already struggling month by month.\n\n*Processing img 7v8l27srx5mg1...*",
          "score": 9
        },
        {
          "text": "&gt; while others urged Ms Indranee to \"lead by example\".\n\nWhat! You want a woman in her 60s who is in menopause to produce babies? How can sinkies be so cruel!? Just deduct her pay or replace her.",
          "score": 8
        },
        {
          "text": "Indranee p4p top 5 most chopped faces in the PAP behind Denise Phua and Jo Teo",
          "score": 6
        },
        {
          "text": "The best way would be to fully subsidise childcare, milk powder and ensure couple can support child with single person income.",
          "score": 6
        },
        {
          "text": "The govt is not taking this seriously as back of their mind they have already intended to import more CECAs and Ah Tiongs to become new citizens in order to diminish our Singaporean identity &amp; culture as well as making sure PAP keep ruling Singapore forever. We’re cooked.",
          "score": 5
        },
        {
          "text": "He's out of line, but he's right",
          "score": 3
        },
        {
          "text": "Knew of many gen y and z married no kids or not married. Kids of those married are the poodle,, corgi, chihuahua and the cats . Overseas holidauys few times annually while their parents' home double up as pets hotel. It's all lifestyle lah! Some married got the flat still.stay with their parents rent out the room/house don't even need to work.\n\nPS - TRF 0.87 excuse for new citizens? - Chicken 1st and egg later or vice versa dilemma. Blame the gahment blame the boomers blame the system blame the cow din come home except oneself. Haha.",
          "score": 3
        },
        {
          "text": "Should have appointed sxl for this issue if the govt is serious about it",
          "score": 3
        },
        {
          "text": "Earth to Planet Indranee…Earth to Planet Indranee…",
          "score": 3
        },
        {
          "text": "Just look at how she fixed PS, do we seriously think that a woman as such has the interests of Singaporeans at heart????",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1rg0elt",
      "subreddit": "SingaporeRaw",
      "title": "30k new citizens every year, they get to apply HDB as BTO first timer and now you know why you keep applying but cant get right? Then you no house of your own, you have no kids, you have no kids, they day population slow, so bring more new citizens",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rg0elt/30k_new_citizens_every_year_they_get_to_apply_hdb/",
      "score": 126,
      "num_comments": 41,
      "created_at": "2026-02-27T15:42:40",
      "selftext": "You start family later as there is perpetual backlog in HDB being built. \n\nWhich leads to having less kids as you are older and less healthy.\n\nThen they say Singapore TFR low, so have to increase number of new citizens.\n\nRinse and repeat",
      "comments": [
        {
          "text": "China doesn’t even need to send a single soldier over to invade us. It’s like Auto tier 2 city. Huat ah!",
          "score": 57
        },
        {
          "text": "Not only housing problems, but also employment problems.\n\nNo money to bto\nNo money, partner will not feel secure to settle down",
          "score": 40
        },
        {
          "text": "You 👏 get 👏 the 👏 system 👏 you 👏 voted 👏 for👏",
          "score": 26
        },
        {
          "text": "this is why gahmen should release the names and birth country of every couple that successfully balloted for a BTO spot after every BTO exercise. Then can tell is it new citizens get or sinkies get. /s",
          "score": 21
        },
        {
          "text": "Are we going to do anything about it? Are we going to vote for change? Are we going to better educate ourselves and make informed decisions? if the solution to all these policies is just to rant here then its a waste of everyones time.\n\nWhat we can and should do is hold these MPs accountable, write in to express frustrations, raise awareness amongst the sheeps in your social circle on what is actually happening, if you cant do all that then save urself the time and suck it up",
          "score": 21
        },
        {
          "text": "![gif](giphy|1zl3hRcsSgrvw7atnG)\n\nSingapore to having more people!",
          "score": 15
        },
        {
          "text": "Punggol, you voted for this old fart instead of WP.\n\nReposting what r/nextlevelunlocked said in that overmoderated police state of a country default subreddit run by an overparanoid bunch of mods:\n\n&gt; They can make such accurate predictions about population increase and yet not have enough housing, transport or other infrastructure to handle the increased population.",
          "score": 12
        },
        {
          "text": "Yes, that's right. Your need to apply systems thinking. Cause and effect... find the root cause of problem. Dont just use bandaid solutions.",
          "score": 10
        },
        {
          "text": "and dont need to serve NS too! so why am I protecting them?",
          "score": 9
        },
        {
          "text": "Ultimately this is unsustainable because the population of elderly will keep growing. Working age adults retire faster than children.\n\nIt's a population Ponzi scheme to prop up the property bubble Ponzi scheme.\n\nFantastic news for the economy because on the other side of a asset bubble collapse we will have none left, so nothing to fix.",
          "score": 7
        },
        {
          "text": "vote against them next GE!",
          "score": 4
        },
        {
          "text": "has it at least been answered somewhere that at least new citizens dont get precedence in BTO balloting, and possibly deprioritised below guys that at least served NS? Cannot be we are at the same priority level right?",
          "score": 4
        },
        {
          "text": "For those who voted for the status quo, you are the one to blame.",
          "score": 3
        },
        {
          "text": "There are only about 4.1 million singaporean citizens and Permanent residents but As of 2022, there are 1.13 million malaysian migrants in singapore compared to only 400,000 china migrants in singapore. That 1.13 million malaysian migrants is year 2022 figure and now is 2026 so now the malaysian migrants in singapore is confirm higher than 1.13 million. The real danger is at the rate the malaysians are increasing in singapore, will there come a day whereby the total numbers of malaysia-born people in singapore outnumber the total numbers of singapore-born people in singapore? ",
          "score": 2
        },
        {
          "text": "Punggol is instrumental for bringing in 150000 more new citizens and 200000 more PRs. \n\nBTO demand ↑\nresale prices ↑\ncongestion ↑\nschool competition ↑\nHealthcare explosion, Compete in mid-skill jobs, Professional crowding, Promotion competition, Identity tension (National identity), National service asymmetry (New 30s/40s citizens enjoy the same societal benefits (housing grants, education subsidies) as born-and-bred citizens without having to serve NS while we, Sinkies, go reservist)",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1rgpllh",
      "subreddit": "SingaporeRaw",
      "title": "Got annoyed with HDB resale website… so I built this",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rgpllh/got_annoyed_with_hdb_resale_website_so_i_built/",
      "score": 66,
      "num_comments": 9,
      "created_at": "2026-02-28T09:42:04",
      "selftext": "current hdb site to check resale flat prices is quite painful, many clicks needed and everything resets on a new search, also no way to compare across blocks and streets, see trends etc\n\nwanted to see if i can improve the user experience, since hdb prices already v high\n\njust for fun- [hdbstats.com](http://hdbstats.com) , lmk your thoughts\n\nhave a good weekend everyone",
      "comments": [
        {
          "text": "Nice app quite handy, have small bugs but so much better than hdb’s. \n\nWhat programs you used for the visuals?",
          "score": 4
        },
        {
          "text": "This requires more upvotes! Tried it out a little and it looks great with a lot more info.",
          "score": 4
        },
        {
          "text": "Nice UI. You are a talented person! ",
          "score": 2
        },
        {
          "text": "What API u use for real time data scraping?",
          "score": 2
        },
        {
          "text": "Genuinely very cool!",
          "score": 1
        },
        {
          "text": "Very cool",
          "score": 1
        },
        {
          "text": "Very useful! I think it's quite easy and straightforward to use, so good job on the user experience.\n\nA suggestion would be to have a bit more whitespace to better separate the sections and give the eye some breathing room.\n\nBy the way, I'm a graphic designer and happy to design a logo for you if you're interested. No charge, just doing this for fun like you.",
          "score": 1
        },
        {
          "text": "It won't take long for the access to be revoked.",
          "score": 1
        },
        {
          "text": "HDB website is a nightmare to use. This is way better. My feedback is it add lease start date.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rglrqr",
      "subreddit": "SingaporeRaw",
      "title": "35mg to 15mg. Basically 2 stardard pours of wine to less than 1. Or less than 1 shot of whiskey.",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rglrqr/35mg_to_15mg_basically_2_stardard_pours_of_wine/",
      "score": 54,
      "num_comments": 39,
      "created_at": "2026-02-28T06:57:51",
      "selftext": "",
      "comments": [
        {
          "text": "It doesn't affect me as I don't drink.\n\nBut.....this is what they come up with after don't know how long ? We pay millions for this?",
          "score": 68
        },
        {
          "text": "Talk cock lah. Make the punishment for dangerous driving a lot heavier then say.\n\nThey literally reduced mandatory minimum sentencing for a lot of driving offenses just two years ago",
          "score": 59
        },
        {
          "text": "End of the day, all NATO if they don’t step up enforcement \n\nOnly during Christmas period then one big wayang show",
          "score": 42
        },
        {
          "text": "TP should setup in Dempsey or ANY Hotel restaurant popular with celebrating anniversary couples after this comes into effect. \n\nWill be interesting to watch.",
          "score": 42
        },
        {
          "text": "Keep them off the road? There are already cases where people drive without license. \n\nKeep them in the prison lah, and make sure to keep them there for a lung time. The penalty for road traffic accidents is a joke. Did the government benchmark the penalty against jurisdictions in Japan, Taiwan and South Korea too?",
          "score": 22
        },
        {
          "text": "??? increase the jail term. drink and drive 15 to 20 years jail sentence. you will see a drastic drop in offenders.\n\ni dont understand why the gvt isnt moving in this direction.",
          "score": 21
        },
        {
          "text": "Setup 2 policeman box  with breath analyzer at outside Dempsey every night, then whack those clowns walking to their car and start engine. \nConfirm more revenue than GST year 1-5",
          "score": 9
        },
        {
          "text": "I don’t know how all these translate to the drinks I drink so I just leave the car at home regardless how much or how little I plan to drink.",
          "score": 8
        },
        {
          "text": "You can talk death sentence for drink drivers all day, but end of the day no enforcement = offenders walk scot‑free.",
          "score": 5
        },
        {
          "text": "The easy and ineffective solution.",
          "score": 4
        },
        {
          "text": "Causing death when drunk driving should be counted as murder.\n\n&gt;300(d) if the person committing the act knows that it is so imminently dangerous that it must in all probability cause death, or such bodily injury as is likely to cause death, and commits such act without any excuse for incurring the risk of causing death, or such injury as aforesaid.",
          "score": 4
        },
        {
          "text": "What's the point of lowering the limit, when the cost of getting caught for many is a fine - case in point the 85yo lady who made an illegal turn, fractured someone's rib yet rode away in her wheelchair still being able to drive",
          "score": 4
        },
        {
          "text": "Wayang only. Unless they step up enforcement, everything is just wayang only. See how many pmd's still hitting pedestrians.. after they made laws tougher... \n\nLack of enforcement is the issue",
          "score": 2
        },
        {
          "text": "Everyone knows that this new law makes no fucking sense right? \n\nHow the fuck did this even get past the cutting board? Millions of dollars spent for this shit?",
          "score": 1
        },
        {
          "text": "it should be just ZERO...",
          "score": 1
        },
        {
          "text": "Police only good for catching riders who did not buckle chin strap .  \nHigh speed running red light, drunk driving, speeding etc.. they are not paid enough to do catch them...  \nthey are more paid to have someone sucking their ding dong in the car",
          "score": 1
        },
        {
          "text": "LoL the hairstyle. Last warning.",
          "score": 1
        },
        {
          "text": "Pig face",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1rgoo8i",
      "subreddit": "SingaporeRaw",
      "title": "85-year-old woman who made illegal right turn against flow of traffic fined $4,000",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rgoo8i/85yearold_woman_who_made_illegal_right_turn/",
      "score": 52,
      "num_comments": 20,
      "created_at": "2026-02-28T08:59:58",
      "selftext": "\"In mitigation, Chia’s lawyer, Ms Lee May Ling from ***Allen &amp; Gledhill***, highlighted that Chia had stayed at the accident scene until she was taken to the hospital, and fully cooperated with the authorities.\"\n\nLooks like being filthy rich to engage expensive lawyers helps??????",
      "comments": [
        {
          "text": "Tbh, at that age, I think it’s safer for everyone if her driving license was removed.",
          "score": 61
        },
        {
          "text": "Now can be in wheelchair but that time still can happily drive with able legs. Mai geh geh la, ahma.",
          "score": 42
        },
        {
          "text": "Her family should take away the car keys and get her a grab account instead.\n\n She is a danger to the public.",
          "score": 23
        },
        {
          "text": "We really should take away driving licenses for people above 75.",
          "score": 21
        },
        {
          "text": "Spare change for her. Maybe even COE is spare change for her. We mollycoddle our rich, elderly and female when they do wrong. Especially the rich elderly females. ",
          "score": 11
        },
        {
          "text": "&gt;***“We have also borne in mind that the accused is elderly. Hence, we do not object to a fine being imposed.”***\n\nAt 65 years of age, most would have issues with eyesight and reflexes. As such, a driver's license should not be issued to them.\n\nThis is not to penalise, but to protect them from harm and damage to themselves and others, as this case has exhibited.\n\nIt's better to be safe than sorry\n\n",
          "score": 7
        },
        {
          "text": "No wonder wanna lower penalties for certain driving offences\n\nIt's all about the money money money",
          "score": 5
        },
        {
          "text": "I don’t feel safe.",
          "score": 4
        },
        {
          "text": "MOT should relook into age limit for driving. These old folks in can’t keep a straight lane",
          "score": 2
        },
        {
          "text": "Can I help pay $4k to ban elderly like her from driving ever again?",
          "score": 2
        },
        {
          "text": "...isnt that a literal legal obligation + just being a good fucking person?\n\nNot doing that means hit and run, how the fuck is that a valid excuse???",
          "score": 2
        },
        {
          "text": "In Singapore? Her demographic should face very high standard physical driving tests each year.",
          "score": 1
        },
        {
          "text": "That's the great granddaughter of Chia Ann Siang ",
          "score": 1
        },
        {
          "text": "They get tested yearly after the cap",
          "score": 1
        },
        {
          "text": "Maybe should renew license every 5 years for those above 65. Can have COE ii",
          "score": 1
        },
        {
          "text": "Drank wine with her lawyer before. Can confirm legal fees will be premium :-)",
          "score": 1
        },
        {
          "text": "Knn she cannot even wheel herself she wanna operate car?",
          "score": 1
        },
        {
          "text": "Top 3 dangerous drivers in Singapore:\n\nNo.3 - Ceca lady \n\nNo.2 - Old lady regardless or race, language or religion\n\nNo.1 - Lady",
          "score": 1
        },
        {
          "text": "Highly agree why MOT dont cap the ceiling age of driving licence to 60? Less monitoring and stem out any issues. It is clear your monitoring is not going to work. Ministeries hello need to wake up, your ground pp dont have bandwidth. Stop paper policies that is dumb when it comes to implementation and execution.",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1rg38g8",
      "subreddit": "SingaporeRaw",
      "title": "Singapore third highest military spender in the world",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rg38g8/singapore_third_highest_military_spender_in_the/",
      "score": 50,
      "num_comments": 49,
      "created_at": "2026-02-27T18:33:58",
      "selftext": "Singapore third in the world for military spending per capita, behind only Israel and the US, both of which are in active warfare.\n\nBut we were just told that the nation can’t afford to pay NSF a livable wage, and refuses to compensate NSmen for the loss of economic opportunities. All this while ministerial pay is being reviewed to be adjusted upwards from millions and MPs earn 16k a month for a  part time job.\n\nThoughts?",
      "comments": [
        {
          "text": "Military Equipment and NSFs salary\n\nChoose one",
          "score": 59
        },
        {
          "text": "amidst all the calls for higher gst and taxes, i’ve always thought that our country and government hardly questions our military spending.\n\ncountries with comparable or higher defense spending per capital as singapore are literally directly involved in a war or military conflict of some sort.\n\nand our spending per capita is definitely not larger because of small scale, finland borders russia who still holds ceded territory from USSR era, has a smaller population and larger land area/border to defend, and still spends less than half per capita than singapore. taiwan is technically still in a state of civil war, and spends almost a quarter of singapore per capita\n\nwhat i posit is that our politics and “meritocracy” structure is inextricably tied to our military. Look at the number military parachutes into high level leadership positions in government, politics, and GLCs. The entire clique that runs the country comes from the military, has connections and power bases within the military, and i would not be surprised if they have vested interests in the military",
          "score": 25
        },
        {
          "text": "if it's only $2.6k per person, isn't the overall spending only amounting to peanuts since Singapore's population is so small.",
          "score": 17
        },
        {
          "text": "We need to spend on US kit to curry favour. It’s not all bad, we mostly likely have investments in the arms manufacturers and defence contractors. That figure probably includes all money going to employ all our regulars and all the workers in the defence security industry (ST and the lot) so it also serves a purpose of providing employment. \n\nWe can’t put a monetary compensation on service, else ppl offer to pay their way out of conscription. \n\nMinisterial pay while high is probably a rounding error when compared to our entire budget. Doesn’t mean we not getting value for money, especially last time where pap didn’t even have MPs in attendance for a quorum",
          "score": 5
        },
        {
          "text": "Now compare military strength amongst countries lmao.",
          "score": 5
        },
        {
          "text": "Wow haha spend so much just to cosplay !",
          "score": 5
        },
        {
          "text": "Not numba 1? How will we annex the rest of the planet into sg like dis 🤬",
          "score": 2
        },
        {
          "text": "Defense Minister salary",
          "score": 2
        },
        {
          "text": "Then we are the highest military spending country that has not been in a conflict for decades.",
          "score": 2
        },
        {
          "text": "Ehh, discount the generals and their golden parachutes, then we talk. ",
          "score": 1
        },
        {
          "text": "Israeli spending 5k worth of American tax dollars…. 🥲",
          "score": 1
        },
        {
          "text": "[ Removed by Reddit ]",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rgtcb4",
      "subreddit": "SingaporeRaw",
      "title": "Reddit wars: What’s driving Singapore’s largest online communities.",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rgtcb4/reddit_wars_whats_driving_singapores_largest/",
      "score": 44,
      "num_comments": 51,
      "created_at": "2026-02-28T12:41:41",
      "selftext": "r/SingaporeRaw mentioned 😊",
      "comments": [
        {
          "text": "&gt;In response to queries from ST, r/singapore’s moderators, who declined to be named, say the reasons for removing posts include spam and common questions, which are automatically directed to a daily thread or to r/asksingapore.\n\nThat's bullshit and we know that they remove posts that criticise ceca lmao",
          "score": 79
        },
        {
          "text": "R/singaporeraw living rent free in straits times head",
          "score": 42
        },
        {
          "text": "r/Singapore total post count going down and r/SingaporeRaw total post count going up. r/asksingapore also doing a purge.\n\nhttps://preview.redd.it/ujfi7mnr16mg1.png?width=960&amp;format=png&amp;auto=webp&amp;s=834be9209ed59b34a841579fa597e77ed7ef41f3\n\nRemind me how is Singapore's ranking on the Press Freedom Index going up again? [https://rsf.org/en/country/singapore](https://rsf.org/en/country/singapore)",
          "score": 29
        },
        {
          "text": "Why r/Singapore mods lying? Wtf",
          "score": 26
        },
        {
          "text": "Remember, toilet cleaners lead a more meaningful life than /r/singapore ‘s unpaid janitors.",
          "score": 22
        },
        {
          "text": "I felt good seeing the r/singapore downtrend and RAW going up.",
          "score": 19
        },
        {
          "text": "haha anyhow ban lead heavy decline\n\nalso sgrabak no more, also no smrtrabak? famous for public transport breakdown and bingo, then also have asksg, alternate of asksingapore, which asksingapore like ban and remove post\n\n[asksg](https://www.reddit.com/r/asksg/) , singaporejobs is least well known and growing quite alot",
          "score": 7
        },
        {
          "text": "![gif](giphy|kf9dfB18XB6JGM8J7s)\n\n",
          "score": 6
        },
        {
          "text": "![gif](giphy|2z6x8UzzCdBBu|downsized)",
          "score": 4
        },
        {
          "text": "&gt;Users without any history of engagement with r/singapore through their comments have their posts automatically removed before others can see it.\n\nBecause of the word \"ceca\" 🤣",
          "score": 4
        }
      ]
    },
    {
      "id": "t3_1rg16b8",
      "subreddit": "SingaporeRaw",
      "title": "Channel 8 news talking about chances of winning toto (A), quadruplets (B) and strike by lightning (C)",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rg16b8/channel_8_news_talking_about_chances_of_winning/",
      "score": 30,
      "num_comments": 17,
      "created_at": "2026-02-27T16:29:39",
      "selftext": "Easiest to hardest is B, C, A.  \nAccording to the professor, ordinary $1 has a 1 / 14,000,000 chance of winning 1st group.  \nSystem 7, 1 / 2,000,000, cost $7  \nSystem 8, 1 / 500,000, cost $28\n\nBuying $1x7 ordinary has the same odds as buying System 7 and so on (perhaps just saving paper and ink).",
      "comments": [
        {
          "text": "Is 50-50",
          "score": 29
        },
        {
          "text": "Got buy got chance! Don’t buy no chance!\n有买有希望！没买没希望！",
          "score": 8
        },
        {
          "text": "Wah system 8 actually quite good chance",
          "score": 4
        },
        {
          "text": "I spent $88 for this draw. Mix of system 8,7 and ordinary quick picks.\n\nGoing to the pub for some celebratory pints now.",
          "score": 4
        },
        {
          "text": "Ppl r betting money that they can lose, for a hope to be a millionaire. Doesn’t matter the odds",
          "score": 1
        },
        {
          "text": "Without watching, i think it's C, B then A.. in order of highest probability",
          "score": 1
        },
        {
          "text": "Then why every week people tio toto\n\nBut not every week someone get strike by lightning",
          "score": 0
        },
        {
          "text": "Those keep asking me to reply post will not win.",
          "score": -2
        },
        {
          "text": "can eli5 plzzzzzzzzzzzzzzz me no maths",
          "score": -7
        }
      ]
    },
    {
      "id": "t3_1rgp5tp",
      "subreddit": "SingaporeRaw",
      "title": "On and on and on and on...",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rgp5tp/on_and_on_and_on_and_on/",
      "score": 29,
      "num_comments": 21,
      "created_at": "2026-02-28T09:21:59",
      "selftext": "",
      "comments": [
        {
          "text": "This pic may reference Hongkies, but it is more aptly suited for Sinkies\n\nhttps://preview.redd.it/y1rlbg2ed5mg1.png?width=640&amp;format=png&amp;auto=webp&amp;s=496dd3c494b2e249b9238ca357f003057e6e940c\n\n",
          "score": 7
        },
        {
          "text": "because they fear confrontation and thought insulting them by aura would change their reality lol. when the actual day comes all of their anger and insults all become scared thinking they gonna hunt me down make me lose my job and whatever thoughts lol. we had the chance last year and we lost it only ourselves to blame lol ",
          "score": 6
        },
        {
          "text": "Circles of life",
          "score": 6
        },
        {
          "text": "The woman on the right is doing a Roman Salute, lmao.\n\n\n*Happy Austrian Painter noises*",
          "score": 4
        },
        {
          "text": "What about those in Aljunied Hougang Sengkang?",
          "score": 2
        },
        {
          "text": "Sinkie are all humji kia who talk big only",
          "score": 1
        },
        {
          "text": "Vicious cycle? Cabinet only have spoons to stir ... no knives, forks, ladles and chopsticks to come up with better solutions",
          "score": 1
        },
        {
          "text": "https://preview.redd.it/t5hjgwt056mg1.jpeg?width=846&amp;format=pjpg&amp;auto=webp&amp;s=543aabc8ce262b4c97450bf5a1bcd00af32460ad",
          "score": 1
        },
        {
          "text": "Truth",
          "score": 1
        },
        {
          "text": "I don't get sg slang bruh",
          "score": 1
        },
        {
          "text": "Sinkies during LKY eras had the balls. Now, all no balls. ",
          "score": -5
        }
      ]
    },
    {
      "id": "t3_1rg3yvh",
      "subreddit": "singaporefi",
      "title": "AMA: I am Dhruv Arora, Founder &amp; CEO of Syfe",
      "url": "https://old.reddit.com/r/singaporefi/comments/1rg3yvh/ama_i_am_dhruv_arora_founder_ceo_of_syfe/",
      "score": 189,
      "num_comments": 59,
      "created_at": "2026-02-27T19:15:03",
      "selftext": "Hi r/singaporefi \n\nI’m Dhruv Arora, Founder and CEO of Syfe.\n\nI’ve been a long-time follower of this subreddit, and I’ve always appreciated the level of discussion amongst this community - we’ve built many of our features informed by feedback from investors like you. \n\nI’d like to invite you to ask me anything on **Tuesday, March 3rd** and **Wednesday, March 4th 2026** (many thanks to the Moderators!). \n\nI’ll be dropping in periodically throughout both days to answer as many questions as possible. Please post yours at any time, and I’ll get back to you as I jump back in. \n\nAsk me about our roadmap, product features, why we’ve made specific product calls, markets, my founder journey - whatever is on your mind for a good and open conversation. \n\nProof:[ https://imgur.com/a/1xLlAEK](https://imgur.com/a/1xLlAEK)\n\nhttps://preview.redd.it/a8hmmosas0mg1.jpg?width=5978&amp;format=pjpg&amp;auto=webp&amp;s=d680f6914a77f1e2900cb291ad019e07d9d78172\n\nI started Syfe in 2019 after my time in the banking world because I felt that wealth building was far too complex and inaccessible for a lot of people. At the time, access was limited, advice was unavailable, and affordability was barely an afterthought. We pioneered fractional REITs, passive income portfolios, and eventually evolved into a full brokerage, most recently expanding into Options Trading. \n\nSix years in, Syfe has grown into an end-to-end platform for cash, brokerage, and a diverse range of managed portfolios. These are professionally managed using different methodologies.  \n  \nWe are a proudly homegrown Singapore company, and while we are expanding our footprint across APAC, our roots remain firmly planted here. Today, we hold well over US$10 billion in AUM across the region, and 1 in 12 Singaporean adults trust Syfe with their wealth.  \n\nIt’s not just a business I’m building in Singapore, I’m building a family here too - my wife and I recently welcomed our second daughter. If anyone has survival tips for two under two, I’m all ears.\n\nLooking forward to the discussion!\n\nBest,  \nDhruv\n\n",
      "comments": [
        {
          "text": "Why should I pick Syfe over Endowus?",
          "score": 180
        },
        {
          "text": "If Syfe ever closes down, how is our money protected and how will we get our money back?\n\nIs the money in Syfe trade SIDC insured?",
          "score": 71
        },
        {
          "text": "I have a different question than the ones the others have left. If you are in good faith trying to provide value to your clients, please answer the following questions. Also if he dodges the following questions you know that he isn't answering this AMA in good faith.\n\n  \nI am here to ask about active managed funds that are still low costs like Avantis/ Dimensional. If I want to do active managed portfolios, why shouldn't I move forward with Avantis which are low cost Irish domiciled funds? Or Dimensional which are similar but have the legacy? \n\nShouldn't the customers be more inclined to not take on high fees 0.65 +0.20 for a total of 0.85% TER and invest into low costs funds instead, or even just take funds UCITS that invest in those core strategies like Avantis ETFs and Dimensional ETFs?\n\nI ask this because your company just today as time of writing just launched a new fund:  Equity Alpha, expertly designed to beat the market.  It seems like to me syfe is trying to cash in on the commissions earned on these funds rather than actually trying to provide real value to your customers.\n\nWhy does Syfe charge a fee to access active managed funds?\n\nAre you aware that your competitors like poems have also dimensional funds but do not incur a management fee to access them? albeit its 500K SGD entry.\n\n[https://www.poems.com.sg/fund-finder/dimensional-world-equity-sgd-acc-ie00bf20l762-528016/](https://www.poems.com.sg/fund-finder/dimensional-world-equity-sgd-acc-ie00bf20l762-528016/)\n\nWhat value add to the customer does the wealth manager add? \n\nWhat incentives or bonuses do your wealth manager have for their KPI? Sales targets or quotas?\n\nAre they glorified sales people or are they trying to encourage good financial practices like tax savings, estate management. \n\nFrom Syfe itself for the different tiers.\n\n|0.65%|0.55%|0.45%|0.35%|0.25%|\n|:-|:-|:-|:-|:-|\n\n\n  \n\n\n  \n",
          "score": 60
        },
        {
          "text": "General investing questions:\n1. Is it fair to say that investing in low cost index funds (let’s say VOO or VT) beats a large majority of active fund management?\n2. If this is true, why should a retail investor ever pay fee for active management? \n3. For retail investors, do you believe in active stock picking?",
          "score": 40
        },
        {
          "text": "Why did you venture to into brokerage since its already so competitive? What competitive edge does Syfe have over the robot advisory?",
          "score": 32
        },
        {
          "text": "1) Any plans to support CPF investment scheme (CPFIS)?\n\n2) Any plans to have free trades per month for Singapore market investing?",
          "score": 24
        },
        {
          "text": "No questions but I would like to thank you and syfe for making investment so accessible to the public.",
          "score": 13
        },
        {
          "text": "Hello Dhruv, glad to have you here. 3 general questions: \n\n1. What is one investment lesson/advice in your journey you learned early on and still applying today?\n2. Where do you see Syfe 10 years from now?\n3. If you have to give your kid $25k today, nothing more, how would you invest for them until she turns 21? \n\nThank you and have a great day!",
          "score": 11
        },
        {
          "text": "Can there be more frequent trade on ucits rather than 1 per week?",
          "score": 10
        },
        {
          "text": "how do you explain Syfe's catastrophic heavy weightage into China for its core portfolios just before it crashed a few years ago, before cutting exposure to China and missing out on the subsequent rebound from end-2024?\n\n\nwhy should anyone trust Syfe's weightage instead of just going with VWRA?",
          "score": 10
        },
        {
          "text": "when did your beard turn a bit white?",
          "score": 10
        },
        {
          "text": "As Singaporeans, do we have to pay withholding tax and estate taxes on the US-domiciled non-UCITS parts of our portfolio?\n\nIf so, then why not offer more UCITS ETFs instead of their US-based counterparts? eg EQQQ.",
          "score": 9
        },
        {
          "text": "whats your founding journey like in the earlier years? Any notable hurdles which you and your team had to cross?",
          "score": 8
        },
        {
          "text": "when u said Syfe is expanding across APAC, does this mean operations &amp; services will be offered in neighbouring countries like Malaysia or Vietnam?",
          "score": 6
        },
        {
          "text": "If someone is starting late and doesn’t come from a privileged financial background, what’s the single smartest habit to build in their 20s?",
          "score": 4
        },
        {
          "text": "Hi Dhruv,\n\nI use your product in HK and I notice occasionally there's promo surges in the time deposit rates, although this is much more infrequent now.\n\nMy question is do you expect more promos this year for this specific product especially given chocolate finance is now in HK too?\n\nCheers",
          "score": 2
        },
        {
          "text": "What challenges have you run into when trying to expand across APAC? How do you decide which markets to try to expand to?",
          "score": 2
        },
        {
          "text": "What does your personal investment portfolio percentages look like?",
          "score": 2
        },
        {
          "text": "What competitive edge does Syfe have over others?",
          "score": 2
        },
        {
          "text": "When are we going to have joint accounts?",
          "score": 2
        },
        {
          "text": "Dear all, I have allowed Dhruv to post here. \n\nSome of you might be their clients, or considered them. You might also have some questions regarding various aspects of their business and hopefully Dhruv will be able to enlighten you. \n\nThis will take place over a period so do give him some bandwidth to address your queries. \n\n",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rg0v2e",
      "subreddit": "singaporefi",
      "title": "Best Jobs in SG 2026",
      "url": "https://old.reddit.com/r/singaporefi/comments/1rg0v2e/best_jobs_in_sg_2026/",
      "score": 172,
      "num_comments": 107,
      "created_at": "2026-02-27T16:10:09",
      "selftext": "I came across this post while scrolling on Instagram. Just curious, what are your thoughts on the 1st place?",
      "comments": [
        {
          "text": "I am having more thoughts on second place",
          "score": 137
        },
        {
          "text": "I'm a financial advisor and I highly recommend y'all not to join. Most of the new joiners have alr quit and regret spending time studying for the papers",
          "score": 67
        },
        {
          "text": "Wow.... Big wow. Does this include unnatural side income like the recent plb cases.",
          "score": 59
        },
        {
          "text": "FA is the top? Most bizarre list I’ve ever seen",
          "score": 58
        },
        {
          "text": "Going to sell ILPs now!!!!11!!",
          "score": 33
        },
        {
          "text": "HR mgr was voted most useless job during Covid .   now it's the best? Wow..  jus wow..",
          "score": 30
        },
        {
          "text": "Why is piano teacher so high?",
          "score": 13
        },
        {
          "text": "VP strategy??",
          "score": 12
        },
        {
          "text": "Isn’t IT analyst just a help desk support?? How the fk is this in the list. FA is a joke",
          "score": 10
        },
        {
          "text": "\"postings volume\" \"postings growth\" - nuff said",
          "score": 8
        },
        {
          "text": "Piano teacher?\n\nZhun bo?",
          "score": 6
        },
        {
          "text": "Not OF content producer?",
          "score": 5
        }
      ]
    },
    {
      "id": "t3_1rg9834",
      "subreddit": "singaporefi",
      "title": "Did badly for A-levels. Not Singaporean. Need fastest path to income. What would you do?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1rg9834/did_badly_for_alevels_not_singaporean_need/",
      "score": 40,
      "num_comments": 62,
      "created_at": "2026-02-27T23:09:46",
      "selftext": "Did badly for A-levels. Grew up in Singapore. Not Singaporean. Need fastest path to income. What would you do?\n\nI just got my results back:  \nE – Economics, Chemistry  \nC – GP, Physics, Math\n\nGP had improved to a C from a U when i was in JC.\n\nI’m not Singaporean (no PR) (Taiwanese), grew up in Singapore.\n\nSo local uni options are pretty limited and expensive for me.\n\nFinished my Taiwanese NS and decided to retake Singapore A levels.\n\nFamily situation isn’t great, and I need to think about income, not just “prestige” or retaking for 1–2 years with no guarantee.\n\n15K usd in savings and stonks.\n\nI have a portfolio of DIY drones.\n\nHK is open for me if i follow them but personally not too keen.\n\n**Taiwan:**  \nCheaper tuition. Needs letter to entry due to A levels not being recognized for Taiwanese. Not a problem.  \nBut it’s fully in Chinese. I can read/speak, but I’ve never studied technical subjects fully in Chinese before. That transition worries me.\n\n**Singapore:**  \nEnglish education (which I’m used to).  \nBut I’m an international student, so tuition is expensive and entry is competitive. Not sure what realistic options I even have with these grades. The job market is not easy feat for a foreigner like me.\n\n**Hong Kong:**  \nEnglish-medium options exist.  \nBut I’m unsure about long-term prospects and whether a HK degree limits mobility. Also concerned about future geopolitical issues - especially Taiwan–China tensions and whether that affects my ability to move/work freely In The other side of the bipolar world later, especially back in taiwan.\n\nim open to:\n\n* Studying overseas (Taiwan/maybe HK/elsewhere)\n* Working immediately\n* Vocational/technical paths\n* Business routes\n* Anything realistic that leads to income fast\n\nIf you were in my position at 20 , what would you actually do?\n\nPlease be brutally practical.",
      "comments": [
        {
          "text": "Since you seem to be technically inclined and have a passion for drones, consider getting into a local polytechnic.  \n\nThe job prospect for poly diploma holders is actually better than degree holders from a private university.  And you will probably find a job that is aligned to your interest.  \n\nIf you really want a degree, you can always do it later (engineering degree is 2y for poly grads compared to 4y).\n\nBut I am not sure about cost for non-Singaporeans.  You have to check on this.\n\nGood luck, hope everything works out well for you.\n\nP/s:  Do not be disheartened by your A-level results.  I have a sister, brother-in-law and niece who took the polytechnic/university path and they are all doing extremely well.  A-level is actually not the most efficient path if you don't like academic subjects.",
          "score": 66
        },
        {
          "text": "My 2c ,\n\nSafety first. \n\n15k but can your parents pump in more or 15k is the limit ?\n\nJobs are hard even for locals with local degrees.\n\nSo back to Taiwan , get a job , any job. McDonald or 7-11.\n\nThen breathe in/out , calm down and plan again. At least you have income , no matter how small it is.\n\nYou are renting now ? How long more can you stay at current price ?\n\nMore incoming so rental will go up.\n\nSo by staying here without jobs or potential jobs , you are literally wasting money.",
          "score": 45
        },
        {
          "text": "Go to an international school and take the IGCSE A-levels which are easier, if you have the money.\n\nConsider studying in Malaysia as international schools are much cheaper in Malaysia and they are culturally similar to Singapore if you live in some place like Penang, KL or Johor. Many foreign students from China and Taiwan actually attend these schools in KL and Johor. You will need to contact one of those education agencies in Malaysia who will arrange all the paperwork and accommodations for you, if you decide to go down this route.\n\nWhat do your parents think? How much financial support can you get from them?\n\nIf you have no PR, then your options for employment in Singapore are extremely limited as someone with only an A-level certificate.\n\nThe last option is to enroll in a polytechnic in Singapore. As an international students, you need to sign a bond to get the tuition grant. Try something like nursing or healthcare so that you won't have to worry about employment after graduation. There are even nursing diploma scholarships open to international students. So you may even get an allowance. \n\nThe pay after graduation won't be high but at least it gives you the financial base to survive. It is also easier to get PR or emigrate with nursing qualifications.",
          "score": 25
        },
        {
          "text": "Why not try for private university options like SIM-UOL? \nThe minimum acceptance qualifications are just 3 H2 passes(D,E,E) or 2 H2m/2 H1.\n\nYou can either study part-time or work part time while studying full time.",
          "score": 12
        },
        {
          "text": "Taiwanese pay is... Notoriously bad. They were facing a COL crisis before our post-covid inflation. \n\nSo I think your best option is to follow your family (I assume?) to hkg and see the options from there. Explore hkg tertiary options because they can be relevant given the recognition in greater cn too. It's better than being in sg alone and without a safety net. \n\nI'd pick hkg for the short term at least. Once you're more secure, you will have time and mental space to plan better. SG is out tbh. COL is mad AND you're not even pr.\n\nI get that SG is your emotional home having grown up here, but it's not useful to stick yo your comfort zone atm. You're young, you can do this.",
          "score": 11
        },
        {
          "text": "Wow. Other than the non-Singaporean part, you are me from 20 years ago. I went the accounting path. Got a low level accounts assistant job, did my ACCA converted it to ISCA, worked up the ranks. Didn’t like the pay, jumped ship and opened an accounting firm.",
          "score": 5
        },
        {
          "text": "Go where you have residency HK or TW and do a year of work.  The world is changing so quickly honestly I wouldn’t sweat too much over a degree at this point.  Work experience counts for a lot now even Uni grads fight for internships to prove that.  Find a way to support yourself financially and take time to rethink Uni or do part time courses.  It’s your tenacity to survive that counts.  It’s difficult but it’s more realistic way of finding your path.",
          "score": 3
        },
        {
          "text": "I want to wish u all the best. I was in the same boat as u a few decades ago - taiwanese who grew up here (not PR, parent made us migrate here due to volatile situation in taiwan in the 90s), lousy A level results. Have u considered private uni options like SIM? My family sit was bad too - was from single parent fam.",
          "score": 3
        },
        {
          "text": "You need to think more carefully about which country you have the right to stay in. \n\nAs much as Singapore feels like home, you can’t stay here without a student visa if you can no longer be on dependents pass feom parents working in SG.\n\nI think you can get student visa through poly, but will your parents pay your international poly fees? \n\nYou may need to remain in Taiwan just because you have no “status” in Singapore, and you may be too old to qualify as a dependent of your parents.",
          "score": 3
        },
        {
          "text": "Heard sg auxiliary police hires Taiwanese due to their NS. Maybe can consider that?",
          "score": 2
        },
        {
          "text": "Suggestion, redo ur a level first as private candidates; engage private tutors with econs or chemistry as well",
          "score": 2
        },
        {
          "text": "Do sales",
          "score": 1
        },
        {
          "text": "Whatever you decide to do as your full time employment, maybe you can sign up with an agency for translation work, to add to your income or teach English or Chinese online. Good luck.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rgbmmb",
      "subreddit": "singaporefi",
      "title": "How many bank accounts do yall have?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1rgbmmb/how_many_bank_accounts_do_yall_have/",
      "score": 19,
      "num_comments": 41,
      "created_at": "2026-02-28T00:38:52",
      "selftext": "Thinking of having more bank accounts to help me save and so that all of my money isn’t in 1 place. \n\nOnly have\n\n1. DBS multiplier - for saving\n\n2. DBS kids account - for spending\n\nHow many bank accs did you have, what acc are they, and what are they used for? Like emergency funds, travel etc?",
      "comments": [
        {
          "text": "1. DBS\n2. OCBC\n3. UOB\n4. GxS\n5. Maribank\n6. Trust Bank\n7. CIMB\n8. Standard Chartered\n\nSome I hold the minimum account balance required to not get hit with penalty.\n\nSome I leave empty because there is no penalty.\n\nMost are to allow easy payment of credit card bills.\n\nMost of my money is invested so I don't hold much cash.",
          "score": 16
        },
        {
          "text": "Its not about the number of accounts you have, its about the amount of cash you have in the accounts......😎",
          "score": 15
        },
        {
          "text": "Wtf for? Why complicate life?",
          "score": 9
        },
        {
          "text": "45. And then?",
          "score": 4
        },
        {
          "text": "3.\n\nOne for spending, one for saving liquid cash, other one forced by company to open for salary crediting.",
          "score": 2
        },
        {
          "text": "1. DBS saving - where my cards are at  \n2. OCBC - 1x debit card, family use, links to everyone's Fairprice apps (covers groceries + kopitiam meals)  \n3. GXS - purely for Grab discounts  \n4. Maribank - purely for Shopee discounts",
          "score": 2
        },
        {
          "text": "4 accounts\n1. DBS Multiplier- For Saving. Salary credited here and using PayLah every month to get 1.8% interest. \n2. DBS My Account - Very little money ($100) . Linked to ATM/Paynow/Debit card. \n3.  Trust Account - Very little money. Earn Linkpoints. Used to use it for overseas spend. \n4. MariBank Account - Linked to Mari Credit Card. Track everyday spending and overseas spending. Fix a certain amount in the account to not overspend and use to pay off credit bill every month.",
          "score": 2
        },
        {
          "text": "2. Created the 2nd account ~2 years ago because of interest rates (before nerfs) and because there was a period of time when DBS (and maybe other banks?) had some outages preventing me from making payments. Having youtrip also helped during that phase.",
          "score": 2
        },
        {
          "text": "1. DBS multiplier - main account + links to paylah\n2. Trust bank - in case DBS is down + links to paynow",
          "score": 1
        },
        {
          "text": "- POSB savings (since young, spending account linked to PayLah)\n- DBS Multiplier (salary credit, use to pay cc bills etc)\n- DBS Joint account with spouse (but not a lot of cash, hardly touch this account, treat as emergency use only)\n- MariBank (top up cash occasionally for shopee shopping and better FX rates for overseas online stores 😅)",
          "score": 1
        },
        {
          "text": "one only",
          "score": 1
        },
        {
          "text": "2 la \n\n\n1 save 1 spend\n\n\nthats all. Haha (salary credits to spending account then I transfer x amount to saving account lol.)",
          "score": 1
        },
        {
          "text": "If you have a lot of money, you can have many accounts. I like all my money in 1 place for savings, emergency etc. And a separate account for spending, credit cards payment etc.",
          "score": 1
        },
        {
          "text": "lol… am surprise people answer your question. Good one.",
          "score": 1
        },
        {
          "text": "Dbs multiplier\nUOB one\nSCB e saver",
          "score": 1
        },
        {
          "text": "3",
          "score": 1
        },
        {
          "text": "Its not how many but how much u have? As many premier private or what not to get the max benefits, lounges, limos, bday cakes.",
          "score": 1
        },
        {
          "text": "You sound very young. People have multiple accounts not to split up different pots of money, but because\n\n1) Opened different high yield savings accounts at different times chasing yields, then instead of closing, just left a small sum and moved the money to the new one.\n\n2) DBS multi-currency account is the cheapest way to transfer USD between brokerages without paying wire transfer fee. Or you might have other non-SGD bank accounts for various reasons like overseas uni, foreign property investment etc. \n\n3) When you get a mortgage or refinance a mortgage, you need to open a bank account at the same bank to facilitate mortgage payment. \n\n4) Sometimes you get a credit card, you are encouraged to open a savings account with the same bank. Maybe there’s an opening promo gift.\n\nI’m sure there are other reasons that I missed out, but as you grow older, you might leave a trail of mostly dormant accounts behind you.",
          "score": 1
        },
        {
          "text": "Only 4\nDBS\nOCBC\nUOB\nTrust",
          "score": 1
        },
        {
          "text": "1 bank account, which contains around 1.5x of my monthly income. The rest are in investments.",
          "score": 1
        },
        {
          "text": "3.\n\n2x DBS my account. 1 for daily spending. 1 for salary, CDP crediting, etc.\n\n1 UOB TX account. Part of my EF is here.\n\nGonna hold on to the UOB for as long as I can.\n\nAll no fees because I hate fall below fees.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rgr9sl",
      "subreddit": "singaporefi",
      "title": "How does having kids impact your FI journey?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1rgr9sl/how_does_having_kids_impact_your_fi_journey/",
      "score": 14,
      "num_comments": 56,
      "created_at": "2026-02-28T10:59:42",
      "selftext": "Since the topic around social media is on TFR lately, I’m wondering if anyone on their FI journey got their plans derailed - I’m aware of firepathlion revising his FI number once after having a child.\n\n  \n\nMy personal experience thus far is that children are not that expensive..? I mean I agree your lifestyle has to change but I’m median income and can comfortably afford a helper as long as I drink, smoke and gamble less. In fact some nights I don’t even drink because of how tired I am after work and baby.\n\n  \n\nI save about $300 a month. Take home $3,600. Wife takes home lesser but is expected to revise her salary soon.\n\n ",
      "comments": [
        {
          "text": "They made me achieve FI by getting my act together and focused on work, increasing income and achieving FI. They are great motivators.",
          "score": 41
        },
        {
          "text": "as they grow older than expenses start adding up lor. but also depends on what kind of lifestyle you want, what kind of skills you want them to have. piano/music, swimming, etc etc all add up if say u can't teach them yourself",
          "score": 21
        },
        {
          "text": "I think it’s not about able to cover the expenses per se… but delaying the goal to reach financial independence for the couple. And also aiming not to rely on a single cent from the kids (and perhaps even to give them a head start). \n\nThe joy and fulfilment I get from having kids is priceless… def not something I can put a price tag to. No regrets at all for me. They give me some meaning to living my life, rediscover tiny joys and strive to be a better person (so I can be a good role model).\n\nGoals wise I’m still on track for coastfi by the time they hit Pri sch so I can choose to downscale and spend more time with them. And oh I’m also not high income, still below bto ceiling, but prudent decisions (sending AOP $400 monthly instead of premium childcare $4000 monthly, no car, investing early) + luck in getting bto allowed me to hit frs alr and also fully pay off bto. I also quite enjoy my current job which also gives me some meaning so idk I doubt I’d have full fired even without the kids though.",
          "score": 14
        },
        {
          "text": "Unless you're a high earner, it more or less kills FIRE. \n\nIt's a drag on your savings/investment rate as you have more current expenses. Milk powder, food, childcare, tuition, etc. \n\nIt also adds to your FI number at least 20 years because you have one more mouth to feed and one more person to cater for like education. In simple maths, for one kid, you'll need to have 50% more because you now need to cover expenses for 3 instead of 2. \n\nAdd these up and if you could have originally fire by say 50, you'll now probably only reach it by maybe 60+. Not RE if you ask me.",
          "score": 10
        },
        {
          "text": "You already had the kid before that “woke you up” and made you realize the importance of being financially responsible, right?\n\nFrankly I think it’s dangerous for young people to get entranced by the concept of retiring early, and then they choose to not have kids or even not date to chase that goal. After retiring, they might have a problem finding meaning in life without career and family.",
          "score": 5
        },
        {
          "text": "I only want to fire because of my children. I want to have the time to spend with them.\n\nIf I never had children, I would probably keep staying in the rat race, chase for the bigger house, nicer car, luxurious vacation, just to fill the emptiness in my life.",
          "score": 4
        },
        {
          "text": "Achieving FI is secondary. Life is not just for enjoying pure pleasure at every moment. Kids bring meaning to life. They delay FI, but without them, FI for me is meaningless ",
          "score": 4
        },
        {
          "text": "A lot of sacrifice in terms of spending on excess stuff like luxury or travel.. so u need to refine your “enough”..\n\nAlso the govt baby bonus and cda top ups do make a lot of diff in early years of childcare expense.",
          "score": 2
        },
        {
          "text": "You have to pay for their food and utilities they consume. And if they want to go to university overseas it is going to cost you or even some of the local uni courses like medicine cost a lot like 32,000 per year with subsidies. \n\nOn average it is financially better to use the money that you would have spent on kids, and top up your own CPF SA.",
          "score": 2
        },
        {
          "text": "When my first few kids arrived, I thought I will never pay taxes again because my pay was so little and will never finish consuming the parenthood tax rebate. Then life happened fast and I have to start looking for ways to avoid paying taxes like SRS and SA top ups.\n\nThe point is if you wait till the income is comfortable, you may be waiting too long. I will also testify that having children really gave me focus and persistence, which led to the higher income.\n\nTo be clear, children can be infinitely expensive. I had two kids in Pats Sch House at one point and they didn't turn out smarter than my other kids, whom I sent to cheaper childcare. If you are not careful, your aspirations for them can hurt you badly financially.\n\nBut it doesn't really have to be. The basic needs of children can be very minimal. The most important ingredient is time and love from the parents.",
          "score": 2
        },
        {
          "text": "I'm approaching my late 30s with no kids yet. Did my sums previously - every future kid I have will probably delay my FIRE by about 5 years.\n\nI'm targeting to reach FI when I'm 50, assuming no kids. So having two children will mean FI-ing at around 60 in my case. ",
          "score": 1
        },
        {
          "text": "2 kids, support system minimal so had to pay for infant care, then childcare and helper to cope. Even got splurged on a car so they get to playground hop. \n\n2 ways to see it. \n1. Expenses due/related to children is definitely significant\n2. However, having children also made us understand/prioritise on what is really important. Is it really important to have a fancy bag? Does holidaying in europe bring more joy than somewhere regional?\n\nSo i find that overall, we were more deliberate on  discretionary spending on ourselves. Hard to say if our total expenses is much much higher than if we stayed childless.",
          "score": 1
        },
        {
          "text": "I think having a kid doesn’t affect the FI journey much in the earlier years. It’s the later years when high school/uni kicks in when the expenses drive up. Most of my moms heavier expenses came when me and my sister went to uni and I foresee thats what I’ll need to prepare beforehand to ensure I’m on track on my FI journey.\n\nI also agree with some of the comments that having a kid makes you get your act together and being more motivated to give them a good life.",
          "score": 1
        },
        {
          "text": "Ard 300k a kid, do the math up to tertiary education",
          "score": 1
        },
        {
          "text": "Don't you live with your in-laws? Not sure how you guys are splitting things but for a couple without parental support, you're looking at: \n\n- diapers\n- formula\n- baby gear\n- cleaning products\n- vaccination\n- infant care\n\nThen it moves on to:\n\n- childcare\n- food\n- check-ups\n- enrichment classes\n\nSo of course it impacts your FI journey.",
          "score": 1
        },
        {
          "text": "from a FI perspective, kids are like a very expensive hobby. nothing wrong with them if you think they're worth it for you, but your FI number will have to go up to account for this expense. ",
          "score": 1
        },
        {
          "text": "Children are not expensive, lifestyles are .",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rgtkg1",
      "subreddit": "singaporefi",
      "title": "I Developed A High Yield Savings Account Optimiser",
      "url": "https://old.reddit.com/r/singaporefi/comments/1rgtkg1/i_developed_a_high_yield_savings_account_optimiser/",
      "score": 10,
      "num_comments": 23,
      "created_at": "2026-02-28T12:53:39",
      "selftext": "Hi all, I developed this 2nd app (with help of AI) to help determine what is the best high yield savings account based on the different hurdles you have to cross, based on easy to hard.\n\nDepending on each bank's requirement, you can input GIRO transactions, Home Loan, Insurance, and Investments to see how these Harder hurdles exponentially increase your interest.\n\nIt ranks every major Singaporean HYSA by Effective Interest Rate, not just the advertised \"up to\" rates.\n\nMonthly Interests allows you to see exactly how many dollars will hit your account next month.\n\nYou can check and see which criteria you’ve met and what you’re missing to hit that next tier.\n\nFor example,\n\nMaybank SaveUp: It calculates based on your \"Product Count\" across 5 categories, with tiered interest for the first $50k and the next $25k.\n\nDBS Multiplier: This is fully dynamic. It tracks your total transaction volume across categories and automatically bumps your balance cap from $50k to $100k if you hit two or more categories.\n\nTrust Bank (Flex Plan): The app automatically identifies all 8 possible scoops, like the ADB Increase or TrustInvest and picks the top 3 highest-yielding ones for you. It checks if you’re an NTUC Member for that extra card spend bonus.\n\nSC Bonus$aver: Updated for the 7.05% . It tracks the $3,000 salary and $1,000 spend thresholds precisely.\"\n\nBelow the table, the Yield Projection chart shows you the power of optimization. It visualizes your balance growth over 12 months, comparing your current best bank against the base rate. It’s the difference between 'parking' your money and 'growing' it.\"\n\nFinally, there is an AI advisor tab which you can ask complex questions like \"Which bank is best if I don't have a salary?\" or \"How do I maximize Trust Bank with $100k?\" and get data-driven answers based on your current profile.\n\nhttps://preview.redd.it/2w81zcl526mg1.jpg?width=3778&amp;format=pjpg&amp;auto=webp&amp;s=1758e68280997c363d892a72d22a1d33757e1863\n\nhttps://preview.redd.it/y2vd2qj526mg1.jpg?width=2331&amp;format=pjpg&amp;auto=webp&amp;s=b7fdb0e1718990956bb3e89b1f17392de74d4a8e\n\nhttps://preview.redd.it/vzf71el526mg1.jpg?width=2353&amp;format=pjpg&amp;auto=webp&amp;s=cdd05692caecad23f3ef4bdccb572bb92165b6f4\n\nWelcome any feedback, errors are mine alone. \n\nThank you.\n\nSG Faiya\n\n\n\n\n\n",
      "comments": [
        {
          "text": "Link?",
          "score": 7
        },
        {
          "text": "As a mod, I can tell you that Reddit is removing your links to the .app url. ",
          "score": 4
        },
        {
          "text": "This is really cool. Well done’",
          "score": 3
        },
        {
          "text": "I have tried to put the link in google sheet here to see if reddit does remove the app link automatically (thanks u/DuePomegranate for informing me): [https://docs.google.com/spreadsheets/d/1Q\\_-\\_EbYii0ddgLZKNjokmEBk0A2jbY8QQCPMVtApkqs/edit?usp=sharing](https://docs.google.com/spreadsheets/d/1Q_-_EbYii0ddgLZKNjokmEBk0A2jbY8QQCPMVtApkqs/edit?usp=sharing)",
          "score": 2
        },
        {
          "text": "Thanks for this tool. Looks like the best way to park idle cash for FIREd people is actually not on the tool, if based on the projected numbers, but to go into MMF instead?\n\n\nFWIW I configured a profile of idle cash only and no other commitments.",
          "score": 2
        },
        {
          "text": "Can you explain how it keeps the rate structure and requirements from each bank up to date? Is the AI scraping the info from the bank websites constantly, and managing to interpret it the way a human can, and apply it to the calculations?",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rgoory",
      "subreddit": "singaporefi",
      "title": "Weekly Celebratory Thread!",
      "url": "https://old.reddit.com/r/singaporefi/comments/1rgoory/weekly_celebratory_thread/",
      "score": 3,
      "num_comments": 3,
      "created_at": "2026-02-28T09:00:34",
      "selftext": "This thread is for those looking to share hitting their milestones!\n\nCongratulations on being one step closer to FI!",
      "comments": [
        {
          "text": "SLV recovered slightly from the dip and I can finally eat other beside white bread for lunch!",
          "score": 3
        },
        {
          "text": "just got my bonus!",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1rg69rg",
      "subreddit": "singaporefi",
      "title": "Help with credit card",
      "url": "https://old.reddit.com/r/singaporefi/comments/1rg69rg/help_with_credit_card/",
      "score": 0,
      "num_comments": 15,
      "created_at": "2026-02-27T21:11:30",
      "selftext": "I just got my first CC(arrived today), the UOB absolute cashback amex. I initially did not know it was amex and my parents asked to cancel as amex was bad. How do I go about doing that? and will I get charged anything by UOB for cancelling it first day? Also what cards would you guys recommend for first timer? I dont know if I can hit $500 a month consistently. Thanks!",
      "comments": [
        {
          "text": "Usually ppl say amex is bad because it's not as widely accepted as mastercard or visa. But in 5 years of using it, I would say it's fine la 95% of places do accept, and their customer service is top notch due to live chat compared to UOB, Citibank, DBS, SCB. OCBC customer service comes close to Amex.",
          "score": 15
        },
        {
          "text": "You can definitely just get the call centre to cancel it for you with no additional charge. For starters, UOB One credit card is complementary with their savings account so you get higher interest rates if you spend $500 monthly on that card.\n\nOn the Amex part - I actually quite like Amex. If you get the Amex card directly from them, you will see. Their customer service is a lot better and they have stronger consumer protection. \n\nDisputed transactions are hard with local banks where they insist you take the first hit until they’re able to claim back your funds. But Amex is typically willing to cover you in such situations.",
          "score": 2
        },
        {
          "text": "Just keep it for a few months. Use it for public transport or something (SimplyGo accepts AMEX). It may affect your credit score if you sign up and immediately cancel.\n\nI would recommend Mari Credit Card for a first timer. It's quite idiot proof to use, even abroad. No fees for paying in foreign currency, and you even get 1.5% cashback.",
          "score": 1
        },
        {
          "text": "Why is Amex bad?",
          "score": 1
        },
        {
          "text": "Any reason you chose that card? You should find something that you can stack on benefits with. Like UOB one / dbs card for savings account interest rate. For miles UOB ppv that gives 4mpd.",
          "score": 1
        },
        {
          "text": "if there was a sign up bonus, usually they won't let you cancel right away without a clawback, anyway if you're not paying for annual fee, just keep it for a year than cancel it.",
          "score": 1
        },
        {
          "text": "I have the same UOB absolute cashback amex and it’s pretty good. Only issue is they don’t support Apple Pay, so I have to carry. But the cashback is good, I even canceled my dbs visa cc after getting used to this amex.\n\nIt’s true though that a few places still cannot accept amex. Need to use paynow or debit in such cases.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rg538c",
      "subreddit": "singaporefi",
      "title": "Recs for home planning app",
      "url": "https://old.reddit.com/r/singaporefi/comments/1rg538c/recs_for_home_planning_app/",
      "score": 0,
      "num_comments": 2,
      "created_at": "2026-02-27T20:14:41",
      "selftext": "Noticed that a lot of posts here ask about home ownership \n\nWhy don't you all use CPF's home planner tool to plan?",
      "comments": [
        {
          "text": "What is a home planning app",
          "score": 4
        }
      ]
    }
  ]
}