{
  "schema_version": "raw_scrape_v1",
  "report_id": "2026-02-14",
  "scraped_at": "2026-02-14T11:06:57.358360",
  "subreddits": [
    "singapore",
    "askSingapore",
    "SingaporeRaw",
    "singaporefi"
  ],
  "total_posts": 40,
  "total_comments": 471,
  "posts": [
    {
      "id": "t3_1r3knl2",
      "subreddit": "singapore",
      "title": "Singapore to regulate blind boxes due to gambling risks",
      "url": "https://old.reddit.com/r/singapore/comments/1r3knl2/singapore_to_regulate_blind_boxes_due_to_gambling/",
      "score": 855,
      "num_comments": 175,
      "created_at": "2026-02-13T17:19:37",
      "selftext": "",
      "comments": [
        {
          "text": "Blind boxes are a genius of evil marketing schemes.\n\nCustomers literally have no idea what they're buying, only a rough idea of what to expect to get and the odds of getting them.\n\nIf you want a full set, it is virtually certain that you have to buy more than necessary.\n\nGenius, devious, and yes, a form of gambling.",
          "score": 688
        },
        {
          "text": "Virtual games are becoming blind boxes anyway. It's all pay to win. \n\nMapleSEA has gachapon which is a form of blind box. \n\nCSGO has loot boxes which is also a form of blind box.\n\nThe thrill is the same as gambling.",
          "score": 232
        },
        {
          "text": "Been in favour of regulating blind boxes for a long time, so am cautiously optimistic of this development. Props to WP for asking and the govt for responding.",
          "score": 116
        },
        {
          "text": "People fail to see blind boxes as gambling on probability of getting the items",
          "score": 85
        },
        {
          "text": "Please do this to all the streamers opening packs also, blatant gambling, especially those with some sort of raffle or some gaming elements!",
          "score": 72
        },
        {
          "text": "about time, the dopamine hits are crazy.\n\nwhat's crazier is parents introducing their kids to these blind boxing. encouraging them to purchase and open and filming it and putting it up on social media. where tons of other kids are also watching.. some even promise blind box as a reward for getting good grades.\n\nnuts.",
          "score": 41
        },
        {
          "text": "Why do I get the feeling there’ll be some shady companies that’ll go “Okay, we’re not selling blind boxes, you’re buying a $20 paper bag that comes with a FREE blind box.”",
          "score": 32
        },
        {
          "text": "Let Singapore pool be popmart only official distributor.",
          "score": 28
        },
        {
          "text": "lol in old days these were the tikam tikam and gatchapon where u pay a small fee to win a small prize. Times changes but I do agree on the blind box legislation. Nowadays retailers everything also blindbox just to up their sales",
          "score": 28
        },
        {
          "text": "When is McDonald Monopoly coming back?",
          "score": 10
        },
        {
          "text": "Well, what about Pokémon cards? Blind packs?",
          "score": 10
        },
        {
          "text": "W tbh.\n\n\nThese companies turn preying on human impulse and addiction to a damn science. Regulation as a guardrail is definitely called for.\n\n\nShould also extend to social media algorithms and all the snakeoil in the fitness industry (\"come wobble on this stupid ass machine for 10 mins a day and burn those kilos off!\")",
          "score": 9
        },
        {
          "text": "Pokemon cards how",
          "score": 8
        },
        {
          "text": "And what about Pokemon cards?",
          "score": 7
        }
      ]
    },
    {
      "id": "t3_1r3g026",
      "subreddit": "singapore",
      "title": "Bus on fire near pie clementi road exit 13/02/26",
      "url": "https://old.reddit.com/r/singapore/comments/1r3g026/bus_on_fire_near_pie_clementi_road_exit_130226/",
      "score": 668,
      "num_comments": 81,
      "created_at": "2026-02-13T12:48:37",
      "selftext": "",
      "comments": [
        {
          "text": "Wtf!?\n\nHope everyone is ok. I can barely make out the sbs transit on the side of the bus",
          "score": 184
        },
        {
          "text": "The bus regos is SBS6840D while Off service to depot",
          "score": 179
        },
        {
          "text": "Friday the 13th huh.hope no one was injured",
          "score": 168
        },
        {
          "text": "That is a massive fire. I hope everyone have evacuated and are alright. The Bus is completely destroyed.",
          "score": 82
        },
        {
          "text": "And lots of gawkers endangering other motorists for slowing down just to gawk. No brains at all.",
          "score": 69
        },
        {
          "text": "I just went past (on a cab). It’s all burnt out now, nothing but the skeletal structure of the bus left. Scary stuff man.\n\nEdit: looks like it’s not an EV vehicle \n\nSome [pics/ videos](https://imgur.com/a/HXVHA4P)",
          "score": 44
        },
        {
          "text": "the whole bus got burnt to a skeleton already. i think it was an off service bus to depot so no passengers affected",
          "score": 41
        },
        {
          "text": "Wah fk. Hopefully everyone has been evacuated alr",
          "score": 36
        },
        {
          "text": "year of the fire horse no joke",
          "score": 26
        },
        {
          "text": " No wonder the side going clementi got massive jam on PIE while the bukit panjang side is clear… hoping everyone is okay",
          "score": 14
        },
        {
          "text": "Passed the bus jn, only left the frame of the bus",
          "score": 12
        },
        {
          "text": "Luckily it was an off-service bus, and the driver is okay. Not an EV.",
          "score": 11
        },
        {
          "text": "Throwback 2025, pix taken on 28 December 2025 outside Hougang Central Int.\nhttps://commons.wikimedia.org/wiki/File:(SGP-Singapore)_SBS_Transit_SBS6840D_74_2025-12-28.jpg",
          "score": 10
        },
        {
          "text": "![gif](giphy|ukGm72ZLZvYfS)",
          "score": 9
        }
      ]
    },
    {
      "id": "t3_1r3j6hx",
      "subreddit": "singapore",
      "title": "Urban exploration, in colour",
      "url": "https://old.reddit.com/r/singapore/comments/1r3j6hx/urban_exploration_in_colour/",
      "score": 496,
      "num_comments": 11,
      "created_at": "2026-02-13T15:46:45",
      "selftext": "Hi Singapore! I hesitate to call myself a photographer, but it’s a hobby I’ve been spending an increasing amount of time on over the past couple of years. \n\nWhat I enjoy most about photography is that it has elevated my habit of random urban exploration, allowing me to see beauty in unexpected places. So if you see a 30-something ang moh in some random backstreet, pointing a camera at something innocuous, that might be me.\n\nI hope you enjoy this selection of things that I’ve found on my walks.",
      "comments": [
        {
          "text": "Nah you are a photographer, it’s just a title anyways, the difference is whether you can make a nice looking picture or not. \n\nGood use of colours, framing and exposure.",
          "score": 16
        },
        {
          "text": "so nice!",
          "score": 10
        },
        {
          "text": "Is the second-last photo a shot of the abomination that is the back-lot extension of the heritage shop house row opposite Katong i12",
          "score": 5
        },
        {
          "text": "![gif](giphy|01jqccZXtnBNIUCCPD)",
          "score": 4
        },
        {
          "text": "Wow such amazing pictures you have there!",
          "score": 4
        },
        {
          "text": "Really nice\nYou got me thinking about a new perspective. Thanks for sharing",
          "score": 3
        },
        {
          "text": "This is so beautiful. I’ve been getting into watercolor and your photos make me want to try and paint them, esp number 10\n\nAlso your composition and coloring remind me of Wes Anderson film styles",
          "score": 3
        },
        {
          "text": "Framing and composition is top notch! Keep going!",
          "score": 2
        },
        {
          "text": "Great photos, most photographers are hobbyist, not professional, so no stress in calling yourself one. Although if you prefer, you can also say that \"you enjoy photography\" too! \n\nI recommend you uploading your photos on Instagram/website for just a personal cataloguing/journaling on your progress as a photographer! Would love to see your journey",
          "score": 1
        },
        {
          "text": "There is a Singapore photography subreddit too if you decide to lurk or post your stuff there. \n\nAs a complete amateur, FWIW I prefer slightly more zoomed out photographs that provide a little more context with what you showed being more of the details. That being said, I do think that they're nice pictures!",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r3oxmj",
      "subreddit": "singapore",
      "title": "What is this monkey doing? Took this video while at the Singapore zoo. There was plenty of water around.",
      "url": "https://old.reddit.com/r/singapore/comments/1r3oxmj/what_is_this_monkey_doing_took_this_video_while/",
      "score": 362,
      "num_comments": 67,
      "created_at": "2026-02-13T21:18:34",
      "selftext": "",
      "comments": [
        {
          "text": "His crush sat there just now",
          "score": 490
        },
        {
          "text": "could that have been a concentrated spot of mineral salts?",
          "score": 417
        },
        {
          "text": "Could be licking the rock/stone for minerals",
          "score": 112
        },
        {
          "text": "Lickin on some minerals",
          "score": 39
        },
        {
          "text": "Me tmr night 😚👅",
          "score": 38
        },
        {
          "text": "Animals lick rocks for the salt and mineral content.",
          "score": 22
        },
        {
          "text": "![gif](giphy|BeI9Hnj7ZfIXEkmIew)",
          "score": 22
        },
        {
          "text": "Bro is getting BBQed under the Sun",
          "score": 18
        },
        {
          "text": "Getting ready for Valentine's Day",
          "score": 14
        },
        {
          "text": "Least simp Redditor found \\s",
          "score": 8
        },
        {
          "text": "As seen from the popularity of Reddit, monkeys get bored and do random things.",
          "score": 7
        },
        {
          "text": "He is just monkeying around(ba dum tss)",
          "score": 5
        },
        {
          "text": "Just monkeying around.",
          "score": 5
        },
        {
          "text": "It could be licking the window, but that monkey ain’t MAGA.",
          "score": 4
        }
      ]
    },
    {
      "id": "t3_1r3i6i5",
      "subreddit": "singapore",
      "title": "Yo Singapore drivers, chill out lah~~ 5 accidents in 5km^2. Just CNY yo!",
      "url": "https://old.reddit.com/r/singapore/comments/1r3i6i5/yo_singapore_drivers_chill_out_lah_5_accidents_in/",
      "score": 315,
      "num_comments": 60,
      "created_at": "2026-02-13T14:46:28",
      "selftext": "",
      "comments": [
        {
          "text": "It’s Friday the 13th today",
          "score": 153
        },
        {
          "text": "just many drivers who think they own the roads. Just saw a video of a mazda 3 lane splitting. stupidity at its highest.",
          "score": 69
        },
        {
          "text": "Something needs to be done about the standards of driving in Singapore -it’s horrendous. Leads to these constant accidents and jams.",
          "score": 57
        },
        {
          "text": "Everyone wants to flush out their bad luck before CNY",
          "score": 42
        },
        {
          "text": "Instead of save their own time they waste everyone else time. \n\nAlso saw a BMW almost hitting an old guy at the zebra crossing in Chinatown. Driver was glued to his phone. May you have bad luck 10 years.",
          "score": 24
        },
        {
          "text": "The PIE one I hope no one is hurt and if so, nabei Sia, sabo everyone. I from Bugis drive back to Jurong need 1 hour",
          "score": 20
        },
        {
          "text": "This is why I will say this. Singaporean drivers are just stupid and impatient.",
          "score": 6
        },
        {
          "text": "Dk why but CNY ppl always so kan chiong",
          "score": 5
        },
        {
          "text": "You'd think that for a country with the most expensive cars, people will drive carefully. But noooo people here still drive like their cars damn cheap.",
          "score": 5
        },
        {
          "text": "Singaporeans are mostly bad, entitled, inconsiderate drivers. \n\n\nAnd there are those bikes on first lanes that ride faster than cars, obviously above speed limits but strangely never get caught or fined. Swerving in and out between cars, sooner or later they will get hurt, dumb as hell. Genes",
          "score": 5
        },
        {
          "text": "There’s a crash outside AMK interchange too",
          "score": 3
        },
        {
          "text": "Singapore drivers are shit.",
          "score": 3
        },
        {
          "text": "Genuine question: do you guys think sg drivers are the worst in SEA? Because I’m beginning to believe that’s true",
          "score": 3
        },
        {
          "text": "I remember when i used to grab to work at west area for internship.. KJE for some reason always alot of accident 😬",
          "score": 2
        },
        {
          "text": "PIE is relatively bendy with many blind spots yet people will still be going 100 around a blind corner. ",
          "score": 2
        },
        {
          "text": "Drivers are Singapore are not considerate nor courteous . Impatience compounds the problem.",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1r3o7yy",
      "subreddit": "singapore",
      "title": "NTU to counsel students after CNY lo hei event on campus draws flak over food waste",
      "url": "https://old.reddit.com/r/singapore/comments/1r3o7yy/ntu_to_counsel_students_after_cny_lo_hei_event_on/",
      "score": 261,
      "num_comments": 104,
      "created_at": "2026-02-13T20:45:52",
      "selftext": "",
      "comments": [
        {
          "text": "The activity: Cantonese\n\nThe food: Mandarin \n\nThe chants: Hokkien \n\nWelcome to Singapore",
          "score": 459
        },
        {
          "text": "How about the 1000s of lo heis outside NTU",
          "score": 201
        },
        {
          "text": "Traditionally lo hei did not mean tossing the food at the ceiling and you don't have to go that high. A gentle toss will do. It was just a symbolic gesture. You're not even supposed to drop food all over the table. It's weird how a simple tradition for fishermen celebrating the new year with their catch has become a vulgar display.",
          "score": 163
        },
        {
          "text": "Lame",
          "score": 103
        },
        {
          "text": "Most people are decent but there are always that few attention deprived asses.",
          "score": 94
        },
        {
          "text": "Feels like the comments have a bit of a divide\n\nTo be honest, there’s a time for wild fun and I don’t think food throwing is one of them. This looks like an orientation event and I’m doubtful that the students took the time to make sure to clean everything. At least not the ones who were the rowdiest and I’m sure there were a small handful of people who don’t enjoy being covered by food.\n\nGetting dirty because it’s inherent(some outdoor sports, wet games etc) is different than when you purposely go out of your way to dirty someone who might not take it the same way plus I’m sure the school or most event spaces would not approve of a food fight. So maybe don’t start one and act blur when people call you out\n\nEdit: Also to point out, the floor isn’t even full covered… You can see the parts of the exposed court have shit already on it and people are also throwing at the people on stage",
          "score": 63
        },
        {
          "text": "The food waste when getting a x metre long giant yusheng is also very bad. The girth of the dragon/snake with the tossers only standing on two sides of the table means that there is a lot of waste. Let's have a ban on giant yusheng.",
          "score": 48
        },
        {
          "text": "We did this in my BMT CNY celebration some years back, it was way worse than this. Somehow the commanders allowed it, and of course we cleaned up the cookhouse after. Good times.",
          "score": 21
        },
        {
          "text": "As a Chinese person, lo hei in the last decade was basically observed to be a diguised excuse for a food fight.\n\nEspecially wasted when you have salmon in some of these things and they're just flung at people, on the floor instead of being eaten.",
          "score": 9
        }
      ]
    },
    {
      "id": "t3_1r3qww5",
      "subreddit": "singapore",
      "title": "S'porean teen, 13, hit by MPV on the way to math exam, family appealing for witnesses",
      "url": "https://old.reddit.com/r/singapore/comments/1r3qww5/sporean_teen_13_hit_by_mpv_on_the_way_to_math/",
      "score": 238,
      "num_comments": 27,
      "created_at": "2026-02-13T22:41:18",
      "selftext": "*No one helped the teen so she went to her school's general office to seek assistance for her injuries.*\n\n[*https://mothership.sg/2026/02/teen-pasir-ris-accident/*](https://mothership.sg/2026/02/teen-pasir-ris-accident/)",
      "comments": [
        {
          "text": "disgusting that people did not bother to stop to help an injured girl. shame on them and the driver!",
          "score": 177
        },
        {
          "text": "speed cam pls do ur job. so mani cameras ard, surely can catch sumthin😡",
          "score": 143
        },
        {
          "text": "Damn kid not being considerate to Distracted Homicidal Drivers 😤",
          "score": 42
        },
        {
          "text": "The article got me confused on what is a mpv. Turns out it's basically a car. \n\n\nI thought this girl got ran over by a PMD 🤦‍♂️.",
          "score": 38
        },
        {
          "text": "Some drivers forget there are junction cameras. It’s a matter of time b4 police catches up with them. Unless ofc they also drive deregistered car.",
          "score": 30
        },
        {
          "text": "..went to the school general office...",
          "score": 25
        },
        {
          "text": "Trash people who refuse to help",
          "score": 25
        },
        {
          "text": "Hope the driver gets his/her karma",
          "score": 13
        },
        {
          "text": "What happens when you glance at titles lol. I read that as Singapore teen hit by MVP on way to exam and my first thought was \"damn, people must really hate her!!!\".\n\nPoor kid, plus stressed for exams too, probably going to have to retake just because of one idiot driver.",
          "score": 8
        },
        {
          "text": "Shame the driver. Jail too",
          "score": 2
        },
        {
          "text": "“Her teachers called her parents to inform them of the accident, and the principal suggested they call an ambulance, but the family declined. “\n\nUnrelated but shouldn’t the school cover cost for their students?",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1r3jjy9",
      "subreddit": "singapore",
      "title": "Property flyers distributed to HDB homes must not be left visible from Apr 1",
      "url": "https://old.reddit.com/r/singapore/comments/1r3jjy9/property_flyers_distributed_to_hdb_homes_must_not/",
      "score": 211,
      "num_comments": 78,
      "created_at": "2026-02-13T16:09:25",
      "selftext": "",
      "comments": [
        {
          "text": "is there an equivalent to a DNC registry for these type of flyers? Seriously a waste of paper and contributes to so much trash.",
          "score": 163
        },
        {
          "text": "They are gonna flood my mailbox instead\n\nOh wait… they are already doing it.",
          "score": 108
        },
        {
          "text": "Property agents must not be left audible to unintended recipients",
          "score": 46
        },
        {
          "text": "This is better than nothing. Always concerned with the pileups at the gate when we go for long vacation. It's like announcing to the whole world we not at home",
          "score": 38
        },
        {
          "text": "Wait. You guys don't randomly call some of the agents' number and ask for 30 packets of chicken rice or whatever else that your imagination can conjure up for a minute of amusement?\n\nJust saying",
          "score": 38
        },
        {
          "text": "The moment our flat reached 5 years, the whole place was flooded with these things and they were flying everywhere.. the cleaners were just sweeping them away in piles",
          "score": 31
        },
        {
          "text": "I get so many of these and i literally just bought this house 3 months ago ",
          "score": 29
        },
        {
          "text": "Lmfao who's gonna be arsed to enforce this, seriously? Some of these hare brained half fuck stop gap measures are baffling, really.",
          "score": 23
        },
        {
          "text": "Seriously how effective is this. It pisses me off to no end, the last person I will call is you to sell my house. So desperate to do this, don't instill confidence at all. And killing how many trees, flooding how many mailboxes and creating rubbish for people to clear. Give up the trade if u gotta do this please",
          "score": 13
        },
        {
          "text": "Use their info and sign up for scams 🤡 jk",
          "score": 11
        },
        {
          "text": "They are just going to throw it under the door...",
          "score": 10
        },
        {
          "text": "That's great news but how about those \"recycling\" flyers that are really just corporate garang guni benefiting from your items and you dont even get a single cent and they are so choosy with what they want",
          "score": 7
        },
        {
          "text": "Use their email or mobile number for newsletters.",
          "score": 6
        },
        {
          "text": "so now they are going to slide them under the door. is it so difficult to ban the flyers?",
          "score": 4
        },
        {
          "text": "To save everyone’s time, here is where you are going to file your complaint to SIEA\n\n📞 Phone: +65-6702 1602\n📧 General enquiries/feedback/complaints: feedback@siea.org.sg\n📍 Address: 47 Beach Road, #07-01, Kheng Chiu Building, Singapore 189683",
          "score": 4
        }
      ]
    },
    {
      "id": "t3_1r3ili7",
      "subreddit": "singapore",
      "title": "GIC Leads $30 Billion Series G in Anthropic",
      "url": "https://old.reddit.com/r/singapore/comments/1r3ili7/gic_leads_30_billion_series_g_in_anthropic/",
      "score": 145,
      "num_comments": 117,
      "created_at": "2026-02-13T15:10:45",
      "selftext": "",
      "comments": [
        {
          "text": "3 years later, headlines will say \"GIC negative returns on AI\". Ppl gonna start asking \"How come GIC invested in AI hype at the peak?\". Then everyone involved will keep quiet and wait for HC to post a FB post addressing concerns from her high throne.",
          "score": 145
        },
        {
          "text": "I’m not unhappy about this. Anthropic is one that might survive the AI bubble popping.",
          "score": 116
        },
        {
          "text": "so… SG claude vouchers incoming?",
          "score": 85
        },
        {
          "text": "G series for GG trying to get your funds back after this AI bubble pops. GIC really like doing charity being the bag holder for the earlier series retail investors.",
          "score": 57
        },
        {
          "text": "$380 billion dollar valuation lol. Clearly GIC has learnt nothing from WeWork.",
          "score": 56
        },
        {
          "text": "Good. Anthropic’s coding models are really really good",
          "score": 55
        },
        {
          "text": "Now you know why they announce 6 months free AI platforms during Budget \n\n/s",
          "score": 25
        },
        {
          "text": "Anthropic’s valuation has already doubled since their Series F where GIC first invested back in sept 2025. quite a decent investment",
          "score": 18
        },
        {
          "text": "lai, tonight all in anthropic",
          "score": 14
        },
        {
          "text": "So that’s where the ciggy tax is going to?",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1r3k0xi",
      "subreddit": "singapore",
      "title": "Jail for driver who was speeding when he hit 76-year-old woman, killing her",
      "url": "https://old.reddit.com/r/singapore/comments/1r3k0xi/jail_for_driver_who_was_speeding_when_he_hit/",
      "score": 141,
      "num_comments": 35,
      "created_at": "2026-02-13T16:38:57",
      "selftext": "",
      "comments": [
        {
          "text": "&gt;He said his client had reacted as quickly as he could, disputing that there was a \"high degree\" of carelessness.\n\nbullshit, why else was he speeding if he wasn't careless?\n\n&gt;He asked the court to depart from the sentencing framework laid down in the case of Selvakumar Ranjan, for fatal accident cases.\n\n&gt;Mr Tay said the Selvakumar framework, which was always intended to be provisional, is no longer appropriate and should not continue to be applied, as it has been overtaken by developments in the High Court.\n\n&gt;Mr Tay said the application of the Selvakumar framework has led to a clustering of sentences around the lower end of the sentencing range.\n\nI take my hat off to the DPP. Fighting the good fight.",
          "score": 89
        },
        {
          "text": "Ang's lawyer, Mr Don Tan, said a death has been caused in this case, which will weigh on his client's mind for the rest of his life.\n\nRest of his life so what. the poor woman DIED to be on your mind ah? Cb",
          "score": 84
        },
        {
          "text": "17 months for a life, very cheap. \n\n/s",
          "score": 48
        },
        {
          "text": "How is this different from the Aussie that split the body in 3s?\n\nThe Aussie got 11 years and this guy only a few months?",
          "score": 43
        },
        {
          "text": "Dang, over 80kph in a two lane road. That's expressway speed in a residential area.\n\nReally zero excuse for the driver, he deserved more than his punishment imo.",
          "score": 13
        },
        {
          "text": "Ah yes, when the driver is Singaporean, they immediately state so. Let's see whether they will hide what nationality is the driver that caused the Chinatown accident.",
          "score": 10
        },
        {
          "text": "You really can practically get off scot free with murder in Singapore if you use a car",
          "score": 7
        },
        {
          "text": "Huh 17 months only? Seems very light for a life",
          "score": 6
        },
        {
          "text": "This guy was going 80 on a \"residential\" road because the road was designed outright to allow people to feel their cars could safely drive this road at speeds far above 50. That's why he didn't get hit with reckless charge. You can verify this by checking out 132 Bukit Batok West Ave 6 in Gmaps. This death was ultimately enabled by the road design.\n\nWe need to get rid of the practice of infesting residential estates (especially ones well-served by public transit/cycling paths) with 2-lane 2-way roads, and make 1-lane 2-way streets designed to force low speeds the residential norm again. Unfortunately, gahmen is doing the opposite, so we're going to start seeing these headlines for new estates too.",
          "score": 5
        },
        {
          "text": "Must be BMW!",
          "score": 2
        },
        {
          "text": "&gt; However, Mr Tay said he did not have the facts to say whether Mdm Ng was within 50m of a pedestrian crossing.\n\nThey know he only started braking 0.2 seconds before collision but dpn't know where is the nearest crossing? Anyway that guy had it coming.",
          "score": 1
        },
        {
          "text": "If a person was running v fast &amp; knocks a 76 year old woman over killing her in d process, what charge wld dat b?🤔",
          "score": -2
        }
      ]
    },
    {
      "id": "t3_1r3kvlj",
      "subreddit": "askSingapore",
      "title": "Singles &amp; DINKs in SG, what is your best comeback to intrusive questions from pesky relatives during CNY?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r3kvlj/singles_dinks_in_sg_what_is_your_best_comeback_to/",
      "score": 241,
      "num_comments": 227,
      "created_at": "2026-02-13T17:34:09",
      "selftext": "CNY is coming soon, cue the usual questions of \"When are you getting married?\", \"When are you having kids?\" and snarky accusations of being picky or selfish. Give me your best comeback to survive the interrogation! 😈",
      "comments": [
        {
          "text": "For the question on kids, here's a tried and tested response: \"We've tried to have kids. We try all the time. We try every day. We try different positions.\" Then you make it as explicit and as awkward as possible.\n\nTo be fair, I only tried this with a somewhat cool relative, but it still did the job. Other times I just ask \"But why?\", and see them try to come up with an answer.",
          "score": 486
        },
        {
          "text": "我是gay",
          "score": 379
        },
        {
          "text": "Marry already but forgot to invite you.",
          "score": 238
        },
        {
          "text": "‘still finding, maybe my boyfriend not born yet’ shuts them up real quick. 👌🏻",
          "score": 117
        },
        {
          "text": "My cousin taught me this. When the elders ask when having kids, just say you are trying hard, they can take a look if they don’t believe. Usually shut them up. 😅",
          "score": 92
        },
        {
          "text": "My family is rather religious so my favourite tongue in cheek answer is that God has not willed it yet 🤭. Always a light hearted but easy way to deflect. I understand not everyone enjoys getting quizzed but I don't make it a point to be an asshole too",
          "score": 85
        },
        {
          "text": "This kind of question is a chain reaction.\n\nGot gf/bf or not -&gt; when are you getting married -&gt; when are you gonna have kid -&gt; second child\n\nMy strategy is to answer \"unsure\" every year and the relatives can't move past the 1st question.",
          "score": 84
        },
        {
          "text": "I just Smile. 😊 \n\nBecause I’m still getting Ang Bao.\n\nWhy antagonise my cash cow 🐮",
          "score": 51
        },
        {
          "text": "Parent: if we gone who will take care of you?\n\nMe: take me along then😆",
          "score": 37
        },
        {
          "text": "smile and laugh, let the awkward silence that comes afterward made them change subject.",
          "score": 30
        }
      ]
    },
    {
      "id": "t3_1r3etdt",
      "subreddit": "askSingapore",
      "title": "Is there a fair way for hawker stalls to handle huge orders in a queue?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r3etdt/is_there_a_fair_way_for_hawker_stalls_to_handle/",
      "score": 170,
      "num_comments": 99,
      "created_at": "2026-02-13T11:49:07",
      "selftext": "Genuine qn.\n\nI was queueing at a hawker stall recently during lunch peak, and the person in front ordered \\~20 packets. \n\nEnded up jamming the entire queue for a good 15–20 minutes while everyone behind just stood there. Some BTH and just left the queue.\n\nWhat to your mind is the best practice/way for hawkers to handle such orders?",
      "comments": [
        {
          "text": "This happened to me once, queuing for duck rice and someone ordered 20 packets in front of me, hawker informed him they can do 20 packets but every 4 packets they prepare they will serve another customer in line first then continue to pack another 4 till they reach 20, and let the guy decide if he wants to wait or not. \n\nI thought it was pretty fair as the bulk customer can see the progress of their large order but at the same time you keep the line moving. \n\nOf course for those who are not within 5 people of the large order there’s no difference but at that point kind of bopian anyway.",
          "score": 525
        },
        {
          "text": "Preorder. I know some hawkers who want people with large orders to call beforehand so they can make and pack the food in anticipation of it.",
          "score": 151
        },
        {
          "text": "Fair for who? Those bulk orders are more important to the hawker than disgruntled randos behind.\n\nEdit: Why the ‘added responsibility’ on hawkers leh? You go McDonalds, you want to mass order McFlurry until it’s oos or the machine breaks down, you also can ah. \n\nPeople food cheap doesn’t mean they have some added social obligation.",
          "score": 138
        },
        {
          "text": "I’m a hawker and I officially open my store at 10.30am so that I can pack my large orders beforehand but there’s always people who come at 10am and ask me if i can serve them first and say things like ‘just 1 packet’. \n\nThey get angry when I say no and have to wait till store open.\n\nWhat they don’t realise is that if i serve them first, then everyone after them going to say the same thing and I can never finish packing my large order.",
          "score": 84
        },
        {
          "text": "Eh bulk orders is like lottery for hawkers. While it’s inconvenient for the others in the queue to wait, you cannot stop hawkers from handling bulk orders if it comes ins",
          "score": 53
        },
        {
          "text": "Last time when I go tabao lunch for my office (10-15pax order ), we make it a point to go at just before peak period (~1140) and order from stalls that got lesser queue. \n\nThis way the food gets prepped faster and we don’t hold up the line, and the hawker gets a good boost in sales from the big-ish order",
          "score": 47
        },
        {
          "text": "fair for who? the hawker still makes the same revenue so why will he change it? just because you are behind the bulk orderer means it’s unfair? first come first served is the fairest method. you queue later than others that’s on you. want to eat then queue, don’t want to queue then eat something else.",
          "score": 32
        },
        {
          "text": "What’s fair to us might not be fair for the hawkers. In a dying trade, I’d rather see my favourite hawkers get business to survive even if it means I have to wait longer or if I have to pivot and eat something else for that day.",
          "score": 28
        },
        {
          "text": "Set up a red/yellow/green queue status system to indicate busyness. \n\nFrustrating as it is, I cannot stop hawkers from taking bulk orders. Such orders bring longevity to my favorite stalls. The only thing I can hope for is to know in advance when I am in for a long wait so I can plan accordingly. ",
          "score": 28
        },
        {
          "text": "What some hawkers do is they have 2 persons prepping the items \n\nFor large orders they still keep 1 person for the rest of the queue. I thought it’s quite a good idea. \n\n\nFor OP, if u don’t like, vote with ur feet lo. Theres other stalls available.",
          "score": 17
        },
        {
          "text": "It’s just LPPL for you. If you can’t afford to wait you can simply go somewhere else. It’s not as if the hawker is the only food option there. \n\nThis sounds harsh, but that’s the reality of the situation. Any method to curtail the mass order would not be fair to the hawker. Ultimately you’re just seeking your own convenience.\n\nSimilarly, nothing stops you from side-eyeing or making grumbling noises or tsk tsk-ing impatiently behind the mass orderer.",
          "score": 15
        },
        {
          "text": "You can either wait it out or go another store. The hawker can choose to implement packet per pax or not but no obligation to do so. ",
          "score": 8
        },
        {
          "text": "The best practice is to suck thumb and wait if you really wanna eat that stall",
          "score": 8
        },
        {
          "text": "Go earlier or eat other stall lo",
          "score": 8
        }
      ]
    },
    {
      "id": "t3_1r3eiia",
      "subreddit": "askSingapore",
      "title": "Things to do alone in Singapore",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r3eiia/things_to_do_alone_in_singapore/",
      "score": 86,
      "num_comments": 67,
      "created_at": "2026-02-13T11:34:15",
      "selftext": "Hello Singapore, I've been here for a while now and then few friends I have repeatedly cancelled on me. Feeling a bit down and alone. What are some fun solo and budget-friendly activities I can do here by myself tonight after work? Ideally not something like eat/drink somewhere alone, if there is something I can do that's more distracting that would be fun! ",
      "comments": [
        {
          "text": "I listen to podcasts while taking a long walk in the quiet park areas.",
          "score": 87
        },
        {
          "text": "Watch a movie. Can eat all the popcorn without needing to pass it here and there. Nobody would blink twice at you being alone in a movie theatre, or even notice you at all. ",
          "score": 62
        },
        {
          "text": "Here’s a few I do in my alone time:\n\nExplore each nature trail and find some place to eat along the way\n\nComplete a Lego passport, you can get them for free and each store can give you stamps but only the certified ones give you location specific ones and they have limited time ones during events like cny now it’s the horse stamp and the one at Bugis is unique too\n\nGo to a library and pick a random book\n\nGo see pasar malams/bazaars, there’s a bunch more now cus of cny",
          "score": 30
        },
        {
          "text": "If you asking this, then I guess you are not much a gamer? Haha. \n\nIf I am the kind of active person that I try to be, Mount Faber at night is possibly a nice walk? \n\nIf you cycle, you can cycle down the stretch of Marina Barrage all the way to the airport area. \n\nI think Chinatown should be bustling with the Lunar New Year energy right now as well.",
          "score": 15
        },
        {
          "text": "i sometimes visit museums by myself. i can go through all the paintings at my own pace without having to worry about whether i'm too fast or slow for my friend. i sometimes borrow books and read them in libraries (the one at vivo has a nice view i heard).\n\ni used to be into film photography and would go take pictures alone. but now that it's expensive i don't do it anymore. perhaps you could try it on your phone or a digital camera if you own one?",
          "score": 14
        },
        {
          "text": "the libraries are a nice place to hang out and read. \n\nJoin apps like meetup or reclub, maybe go join a pickleball game!\n\nThere are random night markets (Pasar malams) so maybe good to go walk around and see see. \n\nTaking the singapore sightseeing buses to just appreciate the sights around Singapore?\n\nTake classes, fitness or cooking classes.\n\nMaybe bowling or playing pool somewhere?\n\nMuseums perhaps?\n\n",
          "score": 13
        },
        {
          "text": "consider a makeit class (foc) offered by the library where they teach how to sew/laser cut/ 3d printing\n\nbut only downside is they are only avail at jurong, woodlands, punggol and tamp library on fri to sun only",
          "score": 10
        },
        {
          "text": "Go climbing. I usually go solo and just zen while climbing.",
          "score": 9
        },
        {
          "text": "Options:\n1) join a gym with a community (like BFT)\n2) volunteer - soup kitchen, grassroots\n3) Toastmasters - self directed learning and community \n\nMost of these are alone but yet in a group",
          "score": 8
        },
        {
          "text": "Go east coast and rollerblade along the stretch, make friends with fellow solo-bladers along the way. Fun and free.",
          "score": 6
        },
        {
          "text": "Hi OP! \n\nYou may look for the community group nearest to you via this link [https://friendzone.sg](https://friendzone.sg)",
          "score": 4
        },
        {
          "text": "Go to constant wind at the end of east coast park. Take up a 2 day stand up paddle or wing foiling course. You get to go into the sea to really enjoy the day, super fun, very few Singaporeans know about it yet the people who do it usually have a blast of a time.",
          "score": 3
        },
        {
          "text": "Join one of those social apps where u can meet up with different groups of people to play sports. The app Reclub is one of them, u can join pickleball games etc.",
          "score": 3
        },
        {
          "text": "I listen to F1 podcasts and analysis on youtube while trying out new cafes and food spots.",
          "score": 3
        },
        {
          "text": "Go to Facebook and to the Events tab. There are plenty of things you can do where other people will join, and you can meet new people.   \n  \nA quick look I spotted this, which while it's not tonight, it's early tomorrow morning and I recommend it if you like nature.\n\nMorning Walk @ Rifle Range Nature Park  \n7:30 - 9:30 \n\nIf you don't want to do it in a group you can also just go for a hike yourself. Rifle Range to Windsor Park is a great walk.",
          "score": 3
        },
        {
          "text": "I suggest picking up a language or dance class or martial arts. It’s a lot of fun and you make friends a bit more easily compared to other exercise classes. Plus you guys will end up meeting regularly for the classes which helps organically build up some friendships",
          "score": 2
        },
        {
          "text": "Watch movie, go cycling",
          "score": 2
        },
        {
          "text": "Do the same activities that you kena fly kite by your \"friends\" without them\n\nUwU",
          "score": 2
        },
        {
          "text": "Singapore parks not bad actually you can just go to one of the parks with a lake or pond or river and just relax and do what you wanna",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1r3w47h",
      "subreddit": "askSingapore",
      "title": "Lost all motivation in life. Anyone feels the same and how do you overcome it?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r3w47h/lost_all_motivation_in_life_anyone_feels_the_same/",
      "score": 73,
      "num_comments": 44,
      "created_at": "2026-02-14T01:56:09",
      "selftext": "Graduated and started work not too long ago but already feeling unmotivated. Fortunate that my job pays above avg and relatively chill + hybrid, so I don't think it is burnout. Yet, I keep trying to avoid doing anything productive, always leaving tasks to last minute and not doing any self learning. I only want to watch videos and game, but even then I can't even finish a movie without getting bored/distracted anymore. Yet I dread the next day, so I end up doomscrolling/short form videos until late at night. I think it's affecting my health and progressively get more tired everyday despite not actually doing much work.\n\nI felt this wasn't an issue in my first 2-3 years of uni and internships, where I diligently did my stuff and even worked on side projects for my portfolio. Call me crazy but NS was genuinely the most motivated I've ever been, despite being lazy I never tried to avoid or delay doing work. It only happened in my final \\~1.5 years. Perhaps because the internships I did in that time was quite tiring and I found out I wasn't truly passionate about the work anymore, so everyday I just zoned out completely and heck care about work or studies. I stopped asking questions or being curious about learning new things.\n\nRight now I only look forward to overseas trips but that's only once every few months. Don't know how to motivate myself to become more productive at work, or even to exercise and take proper care of myself.",
      "comments": [
        {
          "text": "im in the same boat as you. blessed with a job that allows wfh and pays decent but spent 70% of the time napping or playing games.",
          "score": 33
        },
        {
          "text": "I’d say go touch some grass and break your routine. It sounds like you’re living a very routined life between home and office, and assuming that you’re doing corporate work it’s easy to feel that things are static, especially if you’re not particularly in love with the job. For me I find that hanging out with people/keeping myself busy with other things does not help, because they only temporarily distract you from that unhealthy state. Let your head go empty and just walk in the park or something. Also meditation could help, given that you actually manage to enter the state. But most important of all stop playing with that phone because your mind’s not with you when you have a screen.",
          "score": 16
        },
        {
          "text": "been there. not only i procrastinated on my work, i didnt even finish my games or kdrama anymore. i just left them hanging, forever incomplete. this was 2yrs 10mths ago (tracked by my neighbors in animal crossing, which i just visited in my island earlier).\n\n\nyoure not lazy, it's depression. best bet is to find a therapist to dig out when it all strated.",
          "score": 10
        },
        {
          "text": "Are you lonely? Sounds like in NS and uni u were in supportive environments. But yr new workplace isnt",
          "score": 6
        },
        {
          "text": "Sounds like what I went through. Nothing wrong with having some personal time but what really helped me was switching up my daily routine and stepping out my comfort zone. Don’t be afraid to reach out to your old uni friends and catch up with them over lunch or dinner. You’re still young so go enjoy that and make new exciting memories. Go solo clubbing and set a goal to make a new friend that u can go out with. Meet their friend group then all of a sudden u got a bunch of new friends. Don’t over think it and just have fun! Life is short, u don’t want to regret wasting ur younger years. Hope that helps 🙃",
          "score": 4
        },
        {
          "text": "I don’t think you are lazy. It sounds like low grade depression. I am going through the same as it has been 10 years of ups and downs until I finally sought help",
          "score": 4
        },
        {
          "text": "I was u some time ago, then i accidentally found a purpose in life. You need to have a purpose in life so u won’t feel dreaded living. It could be a Hobby, fitness, traveling or something else.  I hope one day you will find it.",
          "score": 3
        },
        {
          "text": "I feel like i will be in the same spot in 3 months when i ~~grad~~ become jobless\n\nLast semester now and im just procrastinating everything",
          "score": 2
        },
        {
          "text": "Take a day off and go to a new quiet place, sit down, and write a list of things that you want to do and achieve in your life in the next 3, 5, and 10 years. Draw and design your own path that you like and want. Next, prioritize the list and channel resources and effort into achieving it. Now you have created your own guide list and what you want in your life. This will be your motivating list; always go back to this list if you feel lost. I hope this helps.",
          "score": 2
        },
        {
          "text": "Same here. But for me I’ve accepted it lol it’s just whether or not I want to do something about my life if I feel unhappy with it. But it’s tough cos i have disabled family member, so in a sense i can’t feel motivated in life at all cos i have this belief that my entire life has been given away in order to give them priority. Cant really go out to live my own life sine i have to take care of them too even when my parents pass. Who would wanna marry or be partners with me when i have a plus one etc. It sucks but we all have our own sh*t I guess",
          "score": 2
        },
        {
          "text": "did you happen to have moved house recently?",
          "score": 1
        },
        {
          "text": "disliked my job and the soul sucking nature so I committed to my plan and did a masters\n\npivoted to a different field and just started.",
          "score": 1
        },
        {
          "text": "Do you have hobbies? Everyone needs a goal. Take up something and perfect your craft",
          "score": 1
        },
        {
          "text": "Life is outside of work. Your job pays u well enough for you to enjoy outside. Accept the concept of give &amp; take. If you're looking challenging work life, try  other SMEs. Instantly slap you awake.",
          "score": 1
        },
        {
          "text": "I set goals - income earned is only a means to something - what do you actualy want to achieve with that? it can be anything really, no goal is too lousy",
          "score": 1
        },
        {
          "text": "Try eliminating the doom scrolling. I realise that is making me feel worse. I don’t mean like wow I envy the influencers but more like I didn’t feel rested. I  did start out thinking that it was relaxation and rest. I dont typically doomscrolling. I scroll my friends feed but Instagram stopped showing my friends. \n\nIf you want some noise at night play a podcast from a radio station. (I don’t like the others. They are too chirpy for nighttime.)",
          "score": 1
        },
        {
          "text": "\nI think i can say i’ve been there - i used to finish work at 12 everyday working from home, with way above median pay. I’m at another job now that makes me work till 6 minimum, travel a lot, and put in a lot more effort. I am however way fitter now, both mentally and physically, and my focus hasn’t been this sharp in years.\n\nWhat worked for me was that i leaned into a paid (by a company) personality assessment that i completed some time back and figured out what makes me tick - it ran over 50 pages. \n\nI scored ridiculously high on Intellectual which suggests that i need novel and challenging problems that often require intense work. I also have a high “Dominance” score which further points to me needing a major (worthy?) task to accomplish, with high autonomy to achieve a high impact goal. I however have an incredibly low Compliance score, which means that i hate structure for the sake of structure - such as ending work at 12pm everyday.\n\nAll in all it painted a picture of me that i do best only when given a “dragon to slay”, but will turn into a couch potato when i have to turn my brain off and just let others dictate my schedule and targets. Looking at my life that way really helped to turn my energy levels and enthusiasm for life around. \n\nI’m some months into this new job, and I feel like a years-long fog over my brain has just been lifted even though i’m working &gt;3 times the hours",
          "score": 1
        },
        {
          "text": "deep down inside you know that your life has little meaning. A comfortable life is not a meaningful life, so earning a lot of money will not make you feel better.\n\nYou need to find your own meaning.\n\nAsk yourself this question: What will you give up your life for?\n\nUsually the answer is something that is larger than yourself, or is someone else.\n\nThe answer to this question is the thing that will give you meaning.",
          "score": 1
        },
        {
          "text": "I know how to overcome it ..... Adversity .\nRight now life is good that's why you very lackadaisical.\nOnce you jobless or get fired then you will wake up .\n\nWhy I know ? Because I been there",
          "score": 1
        },
        {
          "text": "I tht i'm the only one feeling that way. Glad to know I am not alone.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r475o8",
      "subreddit": "askSingapore",
      "title": "Is it just me or is Singapore at peak construction mode right now?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r475o8/is_it_just_me_or_is_singapore_at_peak/",
      "score": 61,
      "num_comments": 45,
      "created_at": "2026-02-14T09:20:08",
      "selftext": "\nI’ve been travelling around SG a lot this year and it feels like *everywhere* I go there’s some major project happening.\n\nJurong East MRT area is a full-on worksite, Yishun/Lentor side also non-stop, BTOs popping up next to almost every MRT station, Novena (but okay, that one always under construction 😂). Now even East Coast Park got stuff going on, plus the thing beside Esplanade.\n\n If I were a tourist visiting now I’d be like, “wah, Singapore building the whole country again ah?”\n\nAre we actually at some kind of peak construction phase or is this just normal SG upgrading cycle and I’m only noticing it now?\n",
      "comments": [
        {
          "text": "Like Novena has been under constant construction for over a decade. Amk mrt for at least 3 years now. There’s been a construction site or roadworks within 300m of me since 2018. \n\nSingapore is one giant construction site. If they have nothing else to do they will break and replace the same bit of soil 100 times.",
          "score": 76
        },
        {
          "text": "My place here has been in constant construction mode for over 2 years, 2 FUCKING YEARS. HIP, neighbourhood upgrade, surface carpark upgrade, community garden upgrade, installation of additional polcam. The place is a fucking mess. Dust, noise, dirt, rubbish, strangers everywhere.",
          "score": 38
        },
        {
          "text": "wait till 2050 maybe when the last MRT lines are finally laid out.\n\nbut, well…\nthese are the improvements that we need, so i cant really complain about it",
          "score": 37
        },
        {
          "text": "Not sure abt peak but certain pockets of sg has always been construction sites for few yrs. The novena area around ttsh comes to mind. Been visiting ttsh since 2017 and feels like nothing's progressing.\n\nMy friend who is a pm in a construction coy told me that constant construction indicates that sg economy still very strong and is a good thing. He added that if construction ever stop or start disappearing, it meant something's wrong.",
          "score": 17
        },
        {
          "text": "Post Covid ramp up.",
          "score": 15
        },
        {
          "text": "Don't understand why they keep digging the same hole and covering it up, over and over again at my place.",
          "score": 10
        },
        {
          "text": "Tail end of COVID back log I guess.",
          "score": 10
        },
        {
          "text": "GDP goes brrrr",
          "score": 4
        },
        {
          "text": "Construction is backbone of economy so it's always there even when there's little to be done, to stimulate the economy and job hiring",
          "score": 4
        },
        {
          "text": "Not me but my parent's place. They're doing some underground water pipe upgrades for 7 years now. I pity the people who stay on the 2nd and 3rd floor because their views have been completely blocked by the construction barrier. I wonder if they still remember what the sun looks like.",
          "score": 1
        },
        {
          "text": "Money is being pumped into construction. All kinds of projects \n\n\nhttps://www.businesstimes.com.sg/property/singapore-construction-demand-stay-firm-s47-billion-s53-billion-2026-chee-hong-tat\n\n\ncan't get a moments respite at home or the office. Hammering and heavy vehicle noises from BTO and public works even on Saturdays and going past 6pm on weekdays at home\n\n\nNonstop public works noises from the sites next to the office \n\n\nEven the place we go for lunch which is about 4 bus stops from the office has construction going on. Concrete dust smell in the air \n\n\nFeels like that scene from the LOTR movies where the whole of Isengard is hammering away nonstop 😅😆",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r3ntc9",
      "subreddit": "askSingapore",
      "title": "What kind of ppl do insurance agents target at mrt stations?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r3ntc9/what_kind_of_ppl_do_insurance_agents_target_at/",
      "score": 43,
      "num_comments": 59,
      "created_at": "2026-02-13T20:25:30",
      "selftext": "This is no way of complaining about them but I’m just curious as to what kind of individuals do they look out for. Like what how do they tell who has a very high probability of giving them their time and possibly converting into a paying client? \n\nBecause I get stopped alllllllllllll the freaking time and they will “escort” me to the gantry even when I gesture I’m not interested. This has been happening to me since my adolescence days and it doesn’t matter if I’m in shorts and slippers or in formals, their eyes always lit up when they see me, like is it the think I too young and don’t have insurance??? Cuz ppl always say my face still look like I’m in uni",
      "comments": [
        {
          "text": "Tbh I feel they target gullible people. Cause at end of day their aim is to sell ILP biggest comms. And their trainer like to say no one wakes up to buy insurances. \n\nPeople that look confident never get targeted.",
          "score": 135
        },
        {
          "text": "Put on your fierce resting bitch face, and they will never approach you. ",
          "score": 49
        },
        {
          "text": "Don't make eye contact, don't break stride. Don't acknowledge their presence AT ALL. You don't owe them anything.",
          "score": 32
        },
        {
          "text": "Nowadays many people unemployed.\n\nJust say you unemployed unlike them.",
          "score": 30
        },
        {
          "text": "You probably have the nice person or people pleaser face. When I notice them, I move so that there is someone else between me and them. Only works when it's crowded though. ",
          "score": 22
        },
        {
          "text": "As a former FA, we were honestly taught to approach anyone and everyone HAHAH Told to see how many rejections we could get rather than how many people we could talk to/get number/etc.\n\nAnyways, best to just not make any eye contact with them. Stare at your phone or stare straight ahead. Usually, this already would scare off most FAs. \n\nIf this doesn't work, and they approach you, just ignore them. Don't shake your head/hand, speak, or whatever. Pretend they don't exist. They'll get the hint real quickly and move on to their next target.\n\nIf you feel bad doing that, you can hit them with my favourite trick. Smile, look at them in the eye, \"I'm an FA too.\" So far has worked for me 10/10 times. Doesn't matter that I'm no longer an FA HAHAHAHHA",
          "score": 19
        },
        {
          "text": "they ask everyone. this is the cold call portion of their training to thicken their skin.",
          "score": 16
        },
        {
          "text": "You don’t even need to talk. Just shake your head and look ahead and walk without stopping, regardless of what they do thereafter.",
          "score": 13
        },
        {
          "text": "I'm the opposite. I want them to approach me so that I can say \"fuck ILP\" right in their face but they don't want to approach me!!! Arghhh",
          "score": 11
        },
        {
          "text": "Don't be scared of them, every time I walk past them I purposely say loudly \"AIYO so many skemmers\" then they give the cb face like I'm wrong like that😂",
          "score": 10
        },
        {
          "text": "I dun wanna say this but u may look naive or easy to makan. Maybe u look youngish.. could be a compliment.\nDont make eye contact or go out of your way to avoid, if u can, of course.",
          "score": 7
        },
        {
          "text": "Underwriter here. The agents that doing roadshow are usually new agents without warm leads. Those MDRT agents won’t be standing doing roadshow because their existing clients will intro other clients. So those new recruited agents will need to approach public. People that willingly listen to the agents are usually elderly or people that cannot buy insurance etc with pre existing illnesses or people that want free gifts.",
          "score": 7
        },
        {
          "text": "tbh if they keep bothering even tho u have gestured that you’re not interested, js walk away. or when you’re a distance away and alr see them just plan ur path to avoid and no eye contact🤣🤣 i find wired earpods useful hahaha",
          "score": 6
        },
        {
          "text": "Wear headphones",
          "score": 6
        },
        {
          "text": "Just train to say you are still schooling, not working yet. Or print a badge to say, sorry not interested. 😅",
          "score": 3
        },
        {
          "text": "Once u make eye contact, its game over",
          "score": 3
        },
        {
          "text": "I personally think, it's young people who look like they just entered workforce , got some spare cash ... Higher chance they haven't bought a policy .\n They see old guys like me they know ah this one covered",
          "score": 3
        },
        {
          "text": "Wear a creepy half smile that would unsettle even the Bishan Gay himself. Downside is someone you know seeing you like this.",
          "score": 3
        },
        {
          "text": "Maybe your walking speed very slow and look blur blur type.",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1r3symp",
      "subreddit": "askSingapore",
      "title": "What is it like to be an istana guard?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r3symp/what_is_it_like_to_be_an_istana_guard/",
      "score": 44,
      "num_comments": 16,
      "created_at": "2026-02-13T23:59:35",
      "selftext": "Is it difficult and hot to stand perfectly straight and still in the no 1 uniform for 2 hours? is the no1 uncomfortable? How do you not get bored? What can you do during rest time? do you have to do it 24/7? are there any past guards in this sub? i’m so curious thx",
      "comments": [
        {
          "text": "I can’t tell you much about their duty, but during my time they basically had a shift system, every 2 hours they will swap with another guard. There’s a guardhouse inside the Istana premises that allow them to rest and eat inside. There were entertainment sources available like console games if I remember correctly .. but this was many years since I ORDed so things might have changed.\n\nThey don’t have to do 24/7, if you go at night you shouldn’t see any Istana guards. \n\nOverall it’s one of the best postings you can get for an MP back then, because your entire NS life was just standing for 2 hours then going back to play PS4. OH and they didn’t had to eat cookhouse ration, takeaway from places like Qiji was actually provided for them.",
          "score": 140
        },
        {
          "text": "Lol wait till u go mindef stand at gate then you know. If I not wrong istana is 2 days on 2 days off something like this. According to my friends they sometime do internal swap that they on duty one week off the next whole week. U can move your leg actually like raise and stomp. I hear is stand 2 hrs rest than 2 hrs.\n\nU go mindef stand a lot of one star come in and out. Minister also. U keep salute with your rifle and you cannot be off guard.  Not all some officer can be petty that you never salute them they will go complain. In there any complain most of time is 7 extra.\n\nSome of the duty is straight stand 4hrs. You can move but need to be on alert who looking at you. Some enchik have nothing to do will ambush from out of no where. Than say why you not alert there a intruder why you never spot me earlier. Go sign extra \n\nYou  cannot be caught dabao food and walk in mindef main building. You cannot be caught drinking water and walk around. They call it disgrace to mp image 7 extra. \n\nYou have to do this by walking underground area where there lesser people.\n\nYou should go ask people from mp. Mindef is the worst and tbh istana guard not the best like those raiders but still not bad",
          "score": 52
        },
        {
          "text": "Heard from an MP WO that it used to be a lot more shagged. He once had some caterpillar drop on him then crawl into his uniform and he had to kek his whole upper body to crush it so it would stop crawling and getting him itchy. Seems like a dream posting if you're someone that can escape into your own head for two hours.",
          "score": 49
        },
        {
          "text": "Aiya istana guard can move la. Fidget also. Depends on how lax your platoon commander is. I won't say it's 1 of the better posting in MP.",
          "score": 8
        },
        {
          "text": "There’s a small post/hut on Swiss Club Road where one guy stands guard. Anyone know who lives there to warrant a police officer on guard?",
          "score": 2
        },
        {
          "text": "[removed]",
          "score": 1
        },
        {
          "text": "Got friend who was Istana guard. They get to eat the food cooked by the Istana staff, but choose to eat little, or things that won't induce bowel movements. Sometimes they get to laugh at the guy who ate laksa while on guard duty.",
          "score": 1
        },
        {
          "text": "Human torture. For what? Is it necessary? Do it yourself then instead of asking another to do it for u",
          "score": -22
        }
      ]
    },
    {
      "id": "t3_1r3mzud",
      "subreddit": "askSingapore",
      "title": "Tattoos / Career as CNB Officer?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r3mzud/tattoos_career_as_cnb_officer/",
      "score": 41,
      "num_comments": 27,
      "created_at": "2026-02-13T19:42:39",
      "selftext": "Would like to kindly ask around here if anyone within / outside the career knows if one with tattoo (bicep area, unable to hide with short sleeve), has a chance to join the SPF CNB?\n\nTLDR: Does CNB allow people with Visible tattoo to join? (Non offensive tattoo)\n\nThank you!!",
      "comments": [
        {
          "text": "Actually it makes sense for cnb to have tattoos so that can go undercover like andy lau",
          "score": 139
        },
        {
          "text": "Yes, the more beng u are, the more cnb welcomes u to be their officer. As well as ssb",
          "score": 50
        },
        {
          "text": "Having tattoos is a bonus for CNB",
          "score": 47
        },
        {
          "text": "Wa... you are cut out to be CNB Officer.  \n3 years ... then 3 years... then 3 years..  \nHow long do I have to wait...  \nYes, you have to meet at the Roof top.",
          "score": 34
        },
        {
          "text": "Tattoos piercings and long hair.",
          "score": 33
        },
        {
          "text": "I met a CNB officer with some visible tattoos (albeit small one) on the bicep before. He was a former tattoo artist before joining CNB",
          "score": 31
        },
        {
          "text": "Give it a shot if you’re truly passionate about the job. Just turn up and go for it. You’re contributing to society.",
          "score": 21
        },
        {
          "text": "Last time yes, now as long as not too much and can cover, not really an issue.\nI do know of a few that did their tattoos AFTER joining though.\n\nAnyway as long as you got no criminal records, fit the PES criteria etc etc, no harm applying.",
          "score": 9
        },
        {
          "text": "SPF and CNB are separate agencies. CNB got chance. They like ah beng looking people to be undercover. Source: I know someone who works there. Good luck!",
          "score": 8
        },
        {
          "text": "If CNB fails join SSB. You can really blend in that way. ",
          "score": 5
        },
        {
          "text": "Yes.",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1r3m6bc",
      "subreddit": "askSingapore",
      "title": "Is it legal to smoke at HDB staircase?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r3m6bc/is_it_legal_to_smoke_at_hdb_staircase/",
      "score": 37,
      "num_comments": 46,
      "created_at": "2026-02-13T18:54:29",
      "selftext": "my neighbor likes to smoke at the HDB staircase which is right beside my room, the smoke just keeps floating into my room and I really hate the smell of cigarettes \n\nto clarify, yes I am humji and don't dare to confront, but is there an authority or something that I can raise a report on? they are there smoking everyday around 11am, like a ritual...",
      "comments": [
        {
          "text": "Hohoho, time for me to shine.\n\n\nYou have the following hurdles to go through \n\n\n1. Report the fella\n2. Ping pong from TC to NEA\n3. Wait for NEA instant bullshit reply along the lines of we will step up enforcement in your area. \n5. They say your reports unclear, ask for clearer video of them in the act. \n6. Continue reporting and wonder when u will actually see the enforcement officers. \n7. Get some case manager to call u to confirm that they indeed have enforcement step up and they patrol your area daily. But yet you won't see any of them. It's like they are shrodingers cat, once you try to observe they go poof. \n8. End up giving up because nothing truly changes. They might even ask you to approach the person to ask them not to smoke. Even when you say you know who it is an am willing to be a witness in court to prosecute them, they will siam your offer. \n\n\nOR\n\n\n1. Social media post that goes viral. \n2. Suddenly problem solved in less than a month with people knocking on your door to assure you something will be done. \n3. Problem actually solved.\n\n\nObligatory the above is a gong jiao wei response /s",
          "score": 80
        },
        {
          "text": "HDB staircases are all designated non-smoking areas\n\n[https://www.mse.gov.sg/latest-news/written-reply-to-pq-on-smokingcabins-or-rooms-at-hdb-void-decks/](https://www.mse.gov.sg/latest-news/written-reply-to-pq-on-smokingcabins-or-rooms-at-hdb-void-decks/)",
          "score": 54
        },
        {
          "text": "Send in a request via the OneService app.  Would you be able to take any videos and photos of it?",
          "score": 16
        },
        {
          "text": "Not legal, but I tell you, nothing useful will be done about it. TC will send someone to \"talk\" to your neighbor, will talk and talk. But nothing will happen. I had a neighbor whoes **teenage kids** smoke at my side staircase. Also nothing happen to them.",
          "score": 16
        },
        {
          "text": "It’s illegal but is it enforceable?",
          "score": 15
        },
        {
          "text": "My neighbour also likes to stand outside his door to smoke after 6pm-9pm weekdays and whole day on weekends. The smoke just flows into our living room. It’s worse when wind direction is blowing our way during winter. We close the door all the time, making the house very stuffy. Our family prefers to open main door for air flow. Confronted him once during Covid time, and he stopped for a while. But his antics were back after Covid. He could close his door and smoke in his living room but he wants to stand outside his door to smoke. I have breathing difficulties. My doctor says it’s due to second hand smoke. 🤷‍♂️",
          "score": 9
        },
        {
          "text": "It is illegal to smoke at hdb staircase. I just reported to NEA about my neighbours smoking at hdb staircase last 2 days ago. They called me today to get more information. I told them everything. Because when they smoke, they throw their cigg butt on the floor. Cannot hor! Please write in to NEA soonest. Do it via one service app.",
          "score": 7
        },
        {
          "text": "Spray pesticide towards his direction whenever he start smoking",
          "score": 6
        },
        {
          "text": "is he smoking outside of office hours? if yes.....goodluck noone will come\nsource: trust me bro, ive reported my case many times..only response is they will take a look at it",
          "score": 5
        },
        {
          "text": "Short answer: no\n\nLong answer: noooooooooo\n\nIn all seriousness, anywhere with a shelter overhead that is not your own private residential property is considered a non-smoking area.",
          "score": 4
        },
        {
          "text": "take evidences before you report, else, they cannot enforce.\n\nyou can then report to One Service and also NEA.\n\nbut first, let the smoker know nicely that you are allergic to the smoke. if they still smoke again, straightaway report with the proofs. best to have clear photos of their faces and smoking activity + video.",
          "score": 4
        },
        {
          "text": "If you want to report them but humji then pretend you're on a call with your video camera pointing at them.",
          "score": 3
        },
        {
          "text": "illegal. can report via one service. NEA will send officers down to enforce if you report enough",
          "score": 3
        },
        {
          "text": "No not legal. Fastest way is to write to your mp, they will alert NEA. for my case nea officers came down to do spot check and give the fella warning.",
          "score": 1
        },
        {
          "text": "Not legal at any HDB public space but nobody enforce.",
          "score": 1
        },
        {
          "text": "You can try raising but it’s not going to help. Posters might be put up. You’ll probably get a template reply. AHs will continue to smoke because they’re addicts. Some of them dgaf and continue to smoke under the poster, under the CCTV.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r3t8qn",
      "subreddit": "askSingapore",
      "title": "How to tell coworkers I’m resigning?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r3t8qn/how_to_tell_coworkers_im_resigning/",
      "score": 38,
      "num_comments": 42,
      "created_at": "2026-02-14T00:09:30",
      "selftext": "Might be quitting a job I’ve started recently. Coworkers are okay mostly but mangers and general environment abit toxic and stressful with no one taking accountability. Not sure what to tell my immediate team on why I’m leaving, generally we are friendly so it might catch them unexpectedly. \n\nWe have a couple of projects lined up too, so I’m worried they will think i betray the team or wasted the time they spent training me. What if they hate me after this and don’t talk to me after I leave? \n\nThing is I’ve had a few toxic encounters with managers that my immediate team likely doesn’t know about. I don’t think I’ll share it with them also cos idk if it will backfire, since my managers don’t treat them that way, and only treat me differently. So if I share coworkers may think I’m the sensitive person or troublemaker lolol.\n\nWhat do I do? Quit or not, what to say when quitting? Feeling guilty for quitting ",
      "comments": [
        {
          "text": "never tell people that you are resigning until the day you press the golden button to terminate your employment... dont need to worry that they will think you are a betrayer or waste time training you... heed my advise, I went through that 2 years back...",
          "score": 109
        },
        {
          "text": "“I am quitting.” - don’t overthink it lol",
          "score": 40
        },
        {
          "text": "Only inform when u have submit the letter.\nElse later tongues wag (even unintentionally), grape vines problem etc ... And somehow company bye you before you bye them",
          "score": 19
        },
        {
          "text": "ORD LO. The guys will understand. Actually all Singaporeans will understand",
          "score": 9
        },
        {
          "text": "you need not tell them. work is just work, they are not your friends. you will find friends elsewhere",
          "score": 9
        },
        {
          "text": "no one care bro. just quit. dont need to say a thing",
          "score": 8
        },
        {
          "text": "Been working for 9 years and trust me. Those “friends” would probably do the same and resign without telling you. \n\nHence keep it to yourself until you officially gotten the offer and resigned.\n\nReal friends don’t judge. If you are overthinking about being judged, there is probably a good reason why.",
          "score": 8
        },
        {
          "text": "Overthinking for sure. Nobody cares who leaves so you don't need to feel guilty. The seat you left behind will be filled by another new employee quickly and you will be forgotten faster than you can find your next new job.\n\nSpeaking of that, good luck in your next job search!",
          "score": 7
        },
        {
          "text": "Don't tell your colleagues anything. Eventually they'll know. Just submit your resignation letter.\n\n\nYour colleagues won't keep in contact with you even with the \"keep in touch\" farewell. They'll move on and so will you. ",
          "score": 4
        },
        {
          "text": "1. Old boss wants me back.\n2. Going back to my country to start business (Foreigner).\n3. Just straightforward say you don't suit this place.",
          "score": 4
        },
        {
          "text": "Don't tell them. Best case scenario is no one even finds out until your last day. Then they see you packing your stuff and have that shocked pikachu face. Imgennacam. ",
          "score": 3
        },
        {
          "text": "You submit resignation to company and let them process it. The rest will follow suit.",
          "score": 2
        },
        {
          "text": "i didn’t tell my colleagues anything (two and three ex companies ago, i just quietly bring back my stuff a little at a time only last few days and last day then my excolleagues realised im leaving lmaooooo (they shooked). although i would still do a proper handover list where the next person will know what are the things to follow up and if they have any questions for whichever area who they can approach so they wont be like a headless fly. because i know how is it like to be like a headless fly",
          "score": 2
        },
        {
          "text": "99% of the time, coworkers are not your friends, and you'll lose touch with them once you leave anyway. For those that you're closer to, you can give them a heads up AFTER you submit the resignation letter to your manager. For those that you're not so close to, let them learn through the rumour mill / on your last day say bye also can.",
          "score": 2
        },
        {
          "text": "Just tell your other team members. I’m sure you won’t be the only one who experienced the toxicity of the managers. \n\nLeave quickly for your own mental health",
          "score": 1
        },
        {
          "text": "I take a little inspiration from the mentality of Jordi Chin from Watch Dogs (minus the socialpath/homicide aspects). You are a hired gun on contract.",
          "score": 1
        },
        {
          "text": "Not heard the word “toxic” yet so the job must be good",
          "score": 1
        },
        {
          "text": "Don't think too much. Just wooosh away...🪂",
          "score": 1
        },
        {
          "text": "You owe nobody explanation. Your position well be taken away immediately after you leave",
          "score": 1
        },
        {
          "text": "If they dont talk to you, so what? It only proves that you made the right choice leaving the toxic hellhole. \n\nI’d worry about what the next steps in career are instead if I were you.",
          "score": 1
        },
        {
          "text": "Imagine you are a listed company. Do you leak news before the official press release?",
          "score": 1
        },
        {
          "text": "Do they hang out with you outside of work? ",
          "score": 1
        },
        {
          "text": "do it after you throw letter. normally they should be happy for you",
          "score": 1
        },
        {
          "text": "Quit but don’t say anything negative.\n\nI work in HR and have seen alot of upper management invalid their employees feeling/difficulties and the narrative get changed to xxxx employee doesn’t have resiliency, people management skills etc etc\n\nIn short, victim blaming cause they don’t understand people are individuals.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r3kav2",
      "subreddit": "SingaporeRaw",
      "title": "Bery gud 👍",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r3kav2/bery_gud/",
      "score": 268,
      "num_comments": 56,
      "created_at": "2026-02-13T16:56:53",
      "selftext": "",
      "comments": [
        {
          "text": "If it really helps to cut down on smoking that is going to be a good thing for many people.",
          "score": 89
        },
        {
          "text": "Haha the yalam who like to smoke at that staircase area gonna be much poorer",
          "score": 28
        },
        {
          "text": "Speaking from something I've seen... those who are smokers but also have mental problems + leech off other family members... are going to pressure/abuse/lie to their family more to get the money to fund their habit instead of taking it as motivation to cut down. Not going to be good for some groups of people.",
          "score": 24
        },
        {
          "text": "It’s supposed to cover the cost of what harm smoking does to society right? Right?",
          "score": 16
        },
        {
          "text": "To be fair the government needs all the money they can get.\nOtherwise how they going to increase their salary and justify it?\n\n/S",
          "score": 6
        },
        {
          "text": "It is more of a tax move than a smoke control move.\n\n\nIt is some more a flat tax on the rich and the poor in the same way --- smoking habit doesn't differ among class.\n\n\nThe least evil form of tax is always --- tax rental and tax the landlords, real estate supply is the least elastic.\n\n\nIf we want to control smoking, have more strict no smoking enforcement and rise the smoking age. Reduce the amount consumed directly. Taxing smoking will have side effect of squeezing people to spend less on other things and/or cause family to strain, which isn't exactly good.",
          "score": 4
        },
        {
          "text": "this will only encourage people to grow their own tobacco at home.",
          "score": 3
        },
        {
          "text": "Can't afford don't smoke lor idk why the non smokers rubbing this tax in. Lol you all see government can do this kinda shit randomly you all not scared suddenly tax something else meh ? I am not a  smoker but I think alot of us are not understanding the entire situation here. You keep rubbing it in for what you don't see yourselves as powerless meh ? Next time property tax suddenly they feel like increasing you will make this post or not. \nDamn stupid leh Singaporeans.",
          "score": -1
        }
      ]
    },
    {
      "id": "t3_1r3mcbz",
      "subreddit": "SingaporeRaw",
      "title": "The cycle never ends....",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r3mcbz/the_cycle_never_ends/",
      "score": 161,
      "num_comments": 30,
      "created_at": "2026-02-13T19:04:29",
      "selftext": "",
      "comments": [
        {
          "text": "Thats why stinkies will forever be abused by the system",
          "score": 35
        },
        {
          "text": "Actually how sure are yall that the complains are also from the 65%? Maybe its purely from us 35% echoing to each other. The 65% could be silent and ok w this",
          "score": 33
        },
        {
          "text": "When the majority is afraid of change",
          "score": 16
        },
        {
          "text": "“The definition of insanity is doing the same thing over and over again, but expecting different results.\" - Albert Einstein",
          "score": 16
        },
        {
          "text": "Take CDC and handouts, diam diam, happily go buy Chagee and shit.  \nNo more CDC, come back and post ancient memes and KPKB. \n\nThis is the true cycle that doesn't end. Actually, it parallels the meme. Carry on. ",
          "score": 9
        },
        {
          "text": "https://preview.redd.it/uzni7i2ygajg1.jpeg?width=846&amp;format=pjpg&amp;auto=webp&amp;s=7d39b98c6f57af67d5db7b5a8a132ed3f683f30f",
          "score": 7
        },
        {
          "text": "![gif](giphy|93ok9g7JNtjRfoE7nn)\n\n",
          "score": 7
        },
        {
          "text": "that why all complaints kings but when the golden chance comes all suddenly become afraid thinking \"Oh PAP watching me I scared la how la\" little they know the process is truly vote secret as they had to according to our laws. ",
          "score": 6
        },
        {
          "text": "Sinkies are not known to think for themselves. Even from young our parents decide our path, what to study, what sports to learn etc",
          "score": 6
        },
        {
          "text": "https://preview.redd.it/upvp1za5o9jg1.jpeg?width=614&amp;format=pjpg&amp;auto=webp&amp;s=bb6fa73ebf6a513e882e329b3184ea08faac56b8",
          "score": 4
        },
        {
          "text": "https://preview.redd.it/383umlukw8jg1.jpeg?width=904&amp;format=pjpg&amp;auto=webp&amp;s=94648a2bdde0d615e5248591d44aaef74e99da75",
          "score": 4
        },
        {
          "text": "First they came for the people..",
          "score": 3
        },
        {
          "text": "In angmoh countries this is called NIMBY. Everyone wants more opposition members in the parliament and but not in their neighbourhood/wards.",
          "score": 3
        },
        {
          "text": "Love being tekan",
          "score": 2
        },
        {
          "text": "Stockholm syndrome",
          "score": 2
        },
        {
          "text": "Dumbest population in the world. That's why China is afraid of voting, but PAP isn't. They know sinkies are way too dumb",
          "score": 2
        },
        {
          "text": "When you see got people commenting what WP has done or what they didnt do, you can only cover your face.",
          "score": 2
        },
        {
          "text": "Cucks",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1r3r7xg",
      "subreddit": "SingaporeRaw",
      "title": "Sucked a girl’s boob and received HJ from a massage parlour am i at a high risk of STI?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r3r7xg/sucked_a_girls_boob_and_received_hj_from_a/",
      "score": 155,
      "num_comments": 154,
      "created_at": "2026-02-13T22:53:29",
      "selftext": "just as the title suggest i need some advice on whether i should get it checked for STD or would that be not necessary",
      "comments": [
        {
          "text": "Please check with your MP",
          "score": 665
        },
        {
          "text": "Best is go back ask her to suck your tities too so your STD can return to her.",
          "score": 345
        },
        {
          "text": "Gg bro, aids le",
          "score": 204
        },
        {
          "text": "Yes your life is over. RIP",
          "score": 199
        },
        {
          "text": "Another important reason why we need more sexual education in SG",
          "score": 197
        },
        {
          "text": "what the actual... very low chances since you only came in contact with skin rather than any body fluids.\n\nOn the side note, which massage parlour is this?",
          "score": 168
        },
        {
          "text": "more importantly, did she accept cdc vouchers?",
          "score": 128
        },
        {
          "text": "Knn u dis smol boi, suck Liao, teh liao, shiok Liao then say pple dirty. Sibei bo standard.",
          "score": 86
        },
        {
          "text": "Depends. If you sucked before the Singapore budget 2026 announcement you should be safe. If you sucked after the announcement then you're at high risk.",
          "score": 86
        },
        {
          "text": "first of all, wtf bro. second, how should ANYONE know whether someone at a unspecified massaged parlour has sti and spread it to YOU? if it's such a huge concern then go get it checked out la... who else can confirm for you other than yourself",
          "score": 35
        },
        {
          "text": "[https://www.cdc.gov/breastfeeding-special-circumstances/hcp/illnesses-conditions/hiv.html](https://www.cdc.gov/breastfeeding-special-circumstances/hcp/illnesses-conditions/hiv.html)\n\nif the girl is lactating, u got chance of catching HIV. not i anyhow say one, is CDC aka leading national public health institute in the United States (USA) say one. link above.\n\n\n\nif the girl is not lactating, u should check for SGC (SG chiobu)...i am joking lol.\n\nS = syphilis,  \nG = gonorrhea\n\nC =  chlamydia\n\n",
          "score": 23
        },
        {
          "text": "Her boobs were likely sucked by another ah pek before you. So yeah, chances are high as certain STDs can transmit through saliva. Plus the previous HJ also adds to the risk. Hate to break this to you, but you’re fucked. Get a check up instead of wasting time on Reddit",
          "score": 22
        },
        {
          "text": "Good night, sweet Prince.",
          "score": 21
        },
        {
          "text": "You might get pregnant",
          "score": 18
        },
        {
          "text": "How big is the boob? How was the suck?",
          "score": 10
        }
      ]
    },
    {
      "id": "t3_1r3iwu2",
      "subreddit": "SingaporeRaw",
      "title": "What next? 🤔",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r3iwu2/what_next/",
      "score": 108,
      "num_comments": 44,
      "created_at": "2026-02-13T15:29:56",
      "selftext": "https://www.bloomberg.com/news/articles/2026-02-13/singapore-plans-regulation-for-blind-boxes-over-gambling-risks",
      "comments": [
        {
          "text": "No blind box for you unless is sg pool selling lol",
          "score": 64
        },
        {
          "text": "KFC already doing blind box.\n\nInstead of regulating blind box why not clamp down on scammers, scalpers.",
          "score": 36
        },
        {
          "text": "Temasek also gambling why never regulate?",
          "score": 30
        },
        {
          "text": "Why is the government babysitting us ?",
          "score": 8
        },
        {
          "text": "Cb if i make baby also blind box ma, dk male or female dk look like what also",
          "score": 6
        },
        {
          "text": "Double standards - why not shut down Singapore pools",
          "score": 4
        },
        {
          "text": "Apply it to Pokemon TCG too. Fuck the scalpers up. Make it that all shops have to sell it at MSRP and set a purchase limit",
          "score": 3
        },
        {
          "text": "Can we also go after scalpers? Be it concert tickets, or any other things?",
          "score": 2
        },
        {
          "text": "Toto/4d/casino also gambling why gov dw just close door. Simple ma gov got cake eat. Blind box gov no cake eat",
          "score": 2
        },
        {
          "text": "Doesn’t make sense, when people really gamble like 4D and Toto",
          "score": 2
        },
        {
          "text": "Archived Link to full article: https://archive.ph/IMCD7",
          "score": 1
        },
        {
          "text": "wen things r more important den money😒",
          "score": 1
        },
        {
          "text": "If I am blind to begin with, this regulation should not apply right",
          "score": 1
        },
        {
          "text": "Next thing will probably be the stuff that falls under non collectable toys/models like gunpla",
          "score": 1
        },
        {
          "text": "What is the difference between blind box and booster pack in card games?\n\nIn both, you either get something you want or something you don't want. \n\nDespite being something you don't want, it still has some intrinsic value. \n\nIf we're going down this route, will booster packs face the same treatment in the future?",
          "score": 1
        },
        {
          "text": "GOOD.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r3k5z3",
      "subreddit": "SingaporeRaw",
      "title": "SEA vs South Korea except we are...",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r3k5z3/sea_vs_south_korea_except_we_are/",
      "score": 96,
      "num_comments": 65,
      "created_at": "2026-02-13T16:47:53",
      "selftext": "",
      "comments": [
        {
          "text": "Is it not funny they post all these kinds of things but they are competing with their own people to come work in Singapore? Or maybe they are the ones who cannot get permit to work here.",
          "score": 137
        },
        {
          "text": "Nah... Singapore is behind the door collecting entrance fee",
          "score": 103
        },
        {
          "text": "Because we are busy working ffs.",
          "score": 69
        },
        {
          "text": "From the photo, I think Singapore is the landlord to these tenants.",
          "score": 34
        },
        {
          "text": "fake drama.\n\nreality: Singles Inferno no1 across all those countries.",
          "score": 31
        },
        {
          "text": "Man why does the rest of SEA even like shitting on us?",
          "score": 30
        },
        {
          "text": "Is it even cool to hate or SG still? What is Singapore or a Singaporean exactly. \n\nMalaysian convert to PR/citizen go pump RON95 also say Singapore. \n\nCountry in economic issues due to corruption, racism also blame Singapore. \n\nTaylor Swift comes to Singapore also blame Singapore (when the other countries either got some ultra conservative drama, or rules for fans. Or worse unsafe security infra). \n\nTheir own politicians selling their country to China, Russia they also just LL.",
          "score": 30
        },
        {
          "text": "Singapore too employed for this",
          "score": 29
        },
        {
          "text": "No, we are not standing next to a bunch of kindergarten kids over such trivial matter.  \nAnd our most trusted as usual backward neighbour, who we live rent-free on their minds, cant wait to drag us in.  \nWe are good, please carry on without us.\n\n![gif](giphy|kf9dfB18XB6JGM8J7s)",
          "score": 21
        },
        {
          "text": "Always make this kind of low ses remark about Singapore, but when have chance to come work in Singapore they become like beggars.",
          "score": 21
        },
        {
          "text": "Poor country vs rich country. ",
          "score": 20
        },
        {
          "text": "Koreans: Hello illegal migrants",
          "score": 16
        },
        {
          "text": "We do nothing also kenna shoot 🫤",
          "score": 5
        },
        {
          "text": "Sg too busy studying /working to be involved please dont drag us into this loll",
          "score": 4
        },
        {
          "text": "Remember: “They hate us coz they ain’t us!”",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1r3km5b",
      "subreddit": "SingaporeRaw",
      "title": "Hor say liao. Let's see which errant Property Agent will be featured in the Hall of Fame (Shame) version 2",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r3km5b/hor_say_liao_lets_see_which_errant_property_agent/",
      "score": 81,
      "num_comments": 25,
      "created_at": "2026-02-13T17:17:04",
      "selftext": "SINGAPORE: Property flyers and pamphlets that are distributed to Housing Board (HDB) homes must not be visible to members of the public other than their intended recipients from Apr 1, the Singapore Institute of Estate Agents (SIEA) said on Friday (Feb 13).\n\nThe new guideline was established under a memorandum of understanding (MOU) aimed at reinforcing proper flyer distribution practices in HDB estates. The MOU was signed on Friday by SIEA and five major property agencies – PropNex, ERA, Huttons, OrangeTee &amp; Tie and SRI.\n\nAs part of the agreement, the participating agencies will implement a standardised approach to handle breaches of flyer distribution by real estate agents, SIEA said.\n\n\"This MOU is a joint commitment which establishes a unified industry-led approach to ensure that flyers and pamphlets are distributed properly by real estate salespersons and is supported by the Council for Estate Agencies,\" SIEA said in a media release.\n\n\"All parties to the MOU acknowledge the need to minimise the disamenities caused by flyers which are left improperly at gates, doors and common areas of HDB estates.\"\n\nAgents are recommended to place flyers in mailboxes or use distribution by postal or flyer distribution services instead.\n\nThe consequences for breaches are a letter of caution for a first offence; a letter of caution and mandatory attendance of an ethical flyer distribution course held by SIEA for a second offence; and a six-month suspension from distributing flyers to HDB homes, with continued escalation until a two-year clean record is achieved, for a third offence.",
      "comments": [
        {
          "text": "Still prefer them\n\nhttps://preview.redd.it/1b0vbrdxd8jg1.jpeg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=fb7c695ca56c9d1f160bfc66a866c9e2e958d5e4",
          "score": 45
        },
        {
          "text": "Must not be left visible, means they will slot under the door. ",
          "score": 28
        },
        {
          "text": "https://preview.redd.it/74eka0pkg8jg1.png?width=1125&amp;format=png&amp;auto=webp&amp;s=419cbeee2f01d2f2d18586bada600bb336bd8e80\n\n installing this before 1st April Fool's Day... LOL\n\nsee if they can still slot underneath the main door or not",
          "score": 13
        },
        {
          "text": "Yea I miss GrayceGate",
          "score": 8
        },
        {
          "text": "So how to report them if they put flyer ah.",
          "score": 6
        },
        {
          "text": "WTF is an ethical flyer distribution training course 🤣 what qualifications do you need to be the trainer??? Retired agent with 20 years of HDB only sales?",
          "score": 6
        },
        {
          "text": "Stop flyers all together. I hate flyers.",
          "score": 6
        },
        {
          "text": "This move just plays into Singpost’s hands… Singpost is already charging agents an arm or a leg to deliver flyers into the mail boxes. With this new rule, it will cost them an arm plus a liver.",
          "score": 5
        },
        {
          "text": "Just leave the flyers sticking out of your letter boxes and report them. Fast elimination of spam",
          "score": 3
        },
        {
          "text": "Lol so what’s stopping other agents from sabotaging or even the resident just shoving it outside? \n\nCannot enforce. Guess what they going to do next? \n\nApproved flyer distributor or only can use SingPost who are “trained” to adhere to the standard. Yes, increase the PTW element for property agents and get the newly found contractors rich money. \n\nNext, agents will complain too ex. So they start training 3PL to do it so they earn from training and licenses instead.",
          "score": 3
        },
        {
          "text": "They are fking parasites",
          "score": 3
        },
        {
          "text": "Actually I thought the penalty is too lenient. No fine at all. Should just insert $500 fine for each subsequent breach after 3 chances.",
          "score": 1
        },
        {
          "text": "What’s stopping other agents from messing with it or residents just pushing it aside? You can’t really enforce it anyway.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r43qn4",
      "subreddit": "SingaporeRaw",
      "title": "Previous driving offender Sy Yong Da about to be released?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r43qn4/previous_driving_offender_sy_yong_da_about_to_be/",
      "score": 76,
      "num_comments": 22,
      "created_at": "2026-02-14T06:50:29",
      "selftext": "In 2021 he was speeding under alcohol with eyes closed, mount the kerb and killed someone on the sheltered path, and escaped the scene and tried to repair the vehicle.\n\nHe was sentenced 6.5 years, and with good behavior he could have shorted his jail terms by a fraction, he might have been released or about to be released this year?\n\nThis case is almost sets the cap on any dangerous driving causing death, because you can hardly beat what this guy did. Hope our traffic law can punish harder.\n\n  \n[https://www.straitstimes.com/singapore/courts-crime/man-sped-with-eyes-closed-crashed-into-maid-and-left-her-to-die](https://www.straitstimes.com/singapore/courts-crime/man-sped-with-eyes-closed-crashed-into-maid-and-left-her-to-die)",
      "comments": [
        {
          "text": "How come not maximum penalties?\n\nIf the verdict was too light then why no appeal from public prosecutor?",
          "score": 44
        },
        {
          "text": "You can kill someone with a car  and not much happen",
          "score": 22
        },
        {
          "text": "Can this leniency be abused to cause deliberate and long lasting harm ?",
          "score": 9
        },
        {
          "text": "name don't look local",
          "score": 2
        },
        {
          "text": "[ Removed by Reddit ]",
          "score": 1
        },
        {
          "text": "[Does Yellow Ribbon support all types of offenders? : r/singaporelaw](https://www.reddit.com/r/singaporelaw/comments/1qqwka3/does_yellow_ribbon_support_all_types_of_offenders/) ",
          "score": 1
        },
        {
          "text": "knn kim moh ang gong siao 4 yrs come out can drive and kill again.",
          "score": 1
        },
        {
          "text": "until now has the ceca driver from chinatown accident been charged? if no, why not?",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r3np77",
      "subreddit": "SingaporeRaw",
      "title": "Should Singapore have a population cap like Switzerland?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r3np77/should_singapore_have_a_population_cap_like/",
      "score": 62,
      "num_comments": 46,
      "created_at": "2026-02-13T20:19:40",
      "selftext": "So Switzerland is undergoing a referendum to limit their population to 10 million.\n\nhttps://www.euronews.com/2026/02/12/switzerland-to-vote-on-proposal-to-cap-population-at-10-million-by-2050\n\nGiven that they are 55 times larger than us, should our population be much much smaller? Wouldn’t, say, a 5 million population be reasonable? How to achieve environmental sustainability and net zero with an ever growing population? How not have our shoebox units from shrinking further into coffin beds like Hong Kong?\n\nCurious about whether this would gain traction in Singapore. Of course, please refrain from racism and xenophobia in this post. This topic is about being realistic about our physical constraints, and not hating other people, especially not singling any other countries or peoples.",
      "comments": [
        {
          "text": "Never happening here. Singapore is run like a corporation. As long as the senior management make money, what happens to the workers is not important. Totally expendable and easily replaced.",
          "score": 47
        },
        {
          "text": "my experience in RTS games says when u hit popcap, and u need different units to fight ur enemy, uh... bad things happen to the existing units",
          "score": 35
        },
        {
          "text": "Senior management is not just pap. There are also generation x and boomers who benefit from this policy. \n\nNotice how Lawrence Wong keep emphasizing that the * government cannot do it alone* when for the longest time they have told us they alone can fix it and they need the mandate. \n\nAs a average citizen without Harvard and Oxbridge degrees , we should  be answering what are my options if Singapore reach 10 million. \n\n1. Move out of Singapore and rent HDB to the expats. Let the world top 1% compete with each other in Singapore. \n\n2. Go to another country where your skill set/ money have a outsize impact. \n\n3.stop having kids. Focus on yourself and your advantage.",
          "score": 18
        },
        {
          "text": "PAP always say we comparable to swiss standard, sweden, finland but nowhere near in reality.",
          "score": 8
        },
        {
          "text": "As someone else said, Singapore is virtually a massive MNC, with a glittery facade of being a nation state. In the absence of natural resources, it needs as much cheap and exploitable human capital as possible to maximise profits. Which is why there is a need for a constantly rotating foreign labour force.",
          "score": 6
        },
        {
          "text": "GDP gpes brrrrr",
          "score": 4
        },
        {
          "text": "We tot we are aiming 10 million? 🤣🤣",
          "score": 2
        },
        {
          "text": "sinkapore is not a country, it's a human farm",
          "score": 1
        },
        {
          "text": "Singapore should have limited to 3 Million max a long time ago LOL.",
          "score": 1
        },
        {
          "text": "It actually may be possible. PAP already says capital inflow may not create more jobs. With less jobs, we (pap) don't need more ppl. So even just talk about GDP, it doesn't have to be driven by more people.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r3hylc",
      "subreddit": "SingaporeRaw",
      "title": "Singapore plans regulation for blind boxes over gambling risks",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r3hylc/singapore_plans_regulation_for_blind_boxes_over/",
      "score": 59,
      "num_comments": 44,
      "created_at": "2026-02-13T14:33:45",
      "selftext": "Walao eh!! Like that also must regulate.. Damn sian, SG so jialat even Labubu also cannot play  ",
      "comments": [
        {
          "text": "Dont stop at Popmart , even Maxi Cash etc also got blind box. Heck, even one of our temple got blind box vending machine, its getting so ridiculous now.",
          "score": 50
        },
        {
          "text": "It is about time, regulate those in game gacha and currencies as well while we are at it",
          "score": 26
        },
        {
          "text": "Gamers who been playing gacha games for years will know that his has always been the problem.  I told some people you know you are gambling? They said to them is not gambling but a feeling of being surprise of what they get and until they get it.  \"shakes head\"",
          "score": 13
        },
        {
          "text": "[deleted]",
          "score": 13
        },
        {
          "text": "fuck blindbox.\n\nwhy can't i just choose and buy the thing i want.",
          "score": 8
        },
        {
          "text": "Everything also a blind box nowadays 🚬",
          "score": 3
        },
        {
          "text": "Huh gambling risk??? Only for those idiots who trade to make $. Don’t make toys more expensive for everyone else",
          "score": 3
        },
        {
          "text": "Based",
          "score": 2
        },
        {
          "text": "Technically it is gambling. I myself personally playing with the blokees wheels but I cheat using my ears to get the chase figures.. Hehehehe.",
          "score": 2
        },
        {
          "text": "long overdue, also rng pay and strengthen in game character such as equipment.\n\nMMO alot thise kind of stuff, like dragon nest, blade &amp; soul, black desert",
          "score": 2
        },
        {
          "text": "Huhhhhhh like that howwww the mama shop $1 token toy also considered blind box lehhhhhhh",
          "score": 1
        },
        {
          "text": "This probably means blind boxes are going to get more expensive?",
          "score": 1
        },
        {
          "text": "cant folks tell tis a way2take money from ppl🤦🏾‍♀️",
          "score": 1
        },
        {
          "text": "No blind boxes means businesses cannot earn quick cash.",
          "score": 1
        },
        {
          "text": "Regulate means what? \nNext time only sg pools can sell blind box?",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r3hm57",
      "subreddit": "SingaporeRaw",
      "title": "Let's not jump to conclusio- oh its an Indian again.",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r3hm57/lets_not_jump_to_conclusio_oh_its_an_indian_again/",
      "score": 57,
      "num_comments": 23,
      "created_at": "2026-02-13T14:14:34",
      "selftext": "",
      "comments": [
        {
          "text": "see lah, tell your helpers don't anyhow get into relationships with another foreign worker here lah. ",
          "score": 47
        },
        {
          "text": "This one's straight away name the CECA country",
          "score": 45
        },
        {
          "text": "Another [physical assault case](https://www.facebook.com/groups/complaintsingapore/posts/2382053902241490/) in Lucky Plaza,  Singapore is a safe country.",
          "score": 22
        },
        {
          "text": "Not high earning ceca talent they straight reveal lol",
          "score": 16
        },
        {
          "text": "7am. Shift change for police at 8am. Night shift team very suay need to do OT when its so close to shift change. These type of standby scene would need a few hours",
          "score": 14
        },
        {
          "text": "Dumb guy. Indon woman reject then reject la..so many SG women will happily let any foreign guy fuck them, why so see no open 😂😂😂😂",
          "score": 14
        },
        {
          "text": "Actually hor at first I thought it was some sinkie Chinese who too stressed with school or work like the River Valley kid leh....  \nOr maybe it was like that case of that sinkie Chinese husband who conned some teenager to murder his wife  \nOr maybe it was some Mat Rep high on drugs  \nOr maybe it was some mamak mabuk.\n\n",
          "score": 4
        },
        {
          "text": "When are they going to stop killing people? Or it is racist and we should allow them to kill?",
          "score": 2
        },
        {
          "text": "We should be integrating into this sort of \"culture\" right",
          "score": 2
        },
        {
          "text": "C",
          "score": 1
        },
        {
          "text": "India vs indonesia round 3 Singapore is the faciltator",
          "score": 1
        },
        {
          "text": "Problematic peepur",
          "score": -1
        }
      ]
    },
    {
      "id": "t3_1r3i4yj",
      "subreddit": "singaporefi",
      "title": "Is anyone here a full-time trader?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r3i4yj/is_anyone_here_a_fulltime_trader/",
      "score": 43,
      "num_comments": 66,
      "created_at": "2026-02-13T14:44:08",
      "selftext": "Is anyone here a full-time trader?\n\nWould love to understand:\n\n– What market do you trade? (options / forex / crypto / equities?)\n\n– How many years in?\n\n– What’s your average monthly income like?\n\n– Is it consistent or volatile?\n\nTrying to understand if this is realistically sustainable long-term. Thank you for all of your inputs in advance!",
      "comments": [
        {
          "text": "mostly trade commodities, part time trading for 7-8 years now but full time only last November \n\nincome varies from 7-10k. one advice, keep in contact with people in the industry in case things don't work out you still have plan B",
          "score": 78
        },
        {
          "text": "If you are not profitable, or have even started trading, don't think about going full time.",
          "score": 36
        },
        {
          "text": "I am not a full time trader in the sense that I am staring at charts for hours, but I have quit my full time job to do this as my primary source of income.\n\n\nI sell options, have done it for 4 years.\n\n\nI won't share my monthly rate but will share my weekly goal as that's what I sort of need to pay bills, eat, travel, etc and it comes up to US$2k a week. Thus my goal is to make that via weekly options. What I do is sell on Monday and wait for expiration on Saturday. So it is not a full time job but just an hour's work at most.\n\n\nReturns can be volatile or consistent, it really depends on your risk tolerance, if you increase risk, your returns are more consistent, and vice versa.\n\n\nFor this to be viable you first need to lock in 2 things: having a sizeable amount of cash and keeping the port size fixed.",
          "score": 25
        },
        {
          "text": "I started during covid, i tried many strategies like day trading stocks, options, futures, swing traded those as well. After 6 years now i mainly sell options and my annual is at around 100k USD.\n\nBefore that I was a furniture mover, 6 days a week 9am-6pm I am self taught and literally every day I spend time reading things about trading during my commute to work, after work I would be at my desk looking at charts and entering trades until 12 midnight and sleep but waking at 3am to check my trades.\n\nNow I only spend 15-20mins a week on my trades, and 90% of my time i am spending time with my P2 daughter with school work, play time and my own recreations activities. My wife helps me spend money.\n\nWord of advise is do not listen to fin-fluencers or those who flex $ on the internet or those who offer you courses. Because if they are already wealthy why would they be out there recruiting followers?",
          "score": 20
        },
        {
          "text": "reality is that if you dont have enough capital, please dont do full time trading. There are bad weeks or even months. Probably do it part time and keep your day job while trading for some small profit to keep you grounded.",
          "score": 17
        },
        {
          "text": "if you’re\n\nsustainable long-term\n\nyou’ll be at a hedgie not sharing your info here",
          "score": 13
        },
        {
          "text": "I used to work in a credit company and I’m really sceptical of the numbers being thrown here. Fact is there are not a lot of successful traders everywhere in the world. Those who claim as such are probably trying to sell you course or workshop.",
          "score": 10
        },
        {
          "text": "Not full time. But trade futures (NQ, GC, SIL) at prop firm. Started in Jan 2024, only start making life changing money, averaging 500-1K usd weekly. Mid December 2025 to just yesterday was my best period, averaged 4-5K usd weekly. Streak ended just ytd when I blew my account. \nJust restarted another account ytd, am up 1.1k today, aiming  for another 4-5K payout next week, if I don’t fk up tonight or next week.",
          "score": 6
        },
        {
          "text": "I work as a commodity trader where I trade with power. I have done for 5 years and I earn everything from 25-40k a month.",
          "score": 5
        },
        {
          "text": "On reddit and edmw, everyone makes 200k a year and is a stinking millionaire",
          "score": 4
        },
        {
          "text": "I actively trade buy/sell equity options every night but hold a healthcare job. Been 5 years and only beating S&amp;P last year. This is why I wont ever be a full-time trader, although the tagline is attractive to hold. If you can, try actually trading in a futures firm. I was in one before and learnt ALOT but the stress level is super high. Now I just trade with my own money. And no I dont use candlesticks, indicators or simi BS golden cross or crouching tiger flying bullshit 😆😆😆",
          "score": 4
        },
        {
          "text": "bro, fact that you’re asking this qn means u are not ready yet.",
          "score": 4
        },
        {
          "text": " I started during covid and now am trading forex full-time as a loser 😅😅😅\n\nIn other news, I have seen 2 close friends gamble trading and reached 1 million sgd. Only to lose it all in an instance. And i mean all till 0 dollars. \n\nTelling ya, greed knows no boundary. Before you start, have the end in mind and set a target how much is enough and what do you want it for.",
          "score": 2
        },
        {
          "text": "I am a full time futures daytrader. Retired from the fund industry. Have been in the industry for decades. Worked for US bulge bracket banks, hedge funds and a sovereign wealth fund.\n\nI currently run sophisticated algos that read the tape in real time to tell me whether the buyers or sellers are winning.\n\nPrefer not to say my returns.\n\nMost content in YouTube regarding daytrading using indicators is bullshit. People following them will invariably lose money.",
          "score": 2
        },
        {
          "text": "only sell options, 2 years in. \n7-10k a month typically - somewhat consistent",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r474f8",
      "subreddit": "singaporefi",
      "title": "Avantis has 3 new UCITS ETFs listed in London, Germany giving exposure to US, Europe and Pacific.",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r474f8/avantis_has_3_new_ucits_etfs_listed_in_london/",
      "score": 23,
      "num_comments": 11,
      "created_at": "2026-02-14T09:18:34",
      "selftext": "For those who are more buy-and-hold passive wealth builders, you might want to know that Avantis just started 3 new ETFs to add to their exist 3 ETFs, which is about a year old.\n\n\n\n|Fund|Ticker|Benchmark to Beat|Expense Ratio|Starting AUM|\n|:-|:-|:-|:-|:-|\n|[Avantis America Equity UCITS ETF](https://www.avantisinvestors.com/ucitsetf/avantis-america-equity-ucits-etf/)|AVUS \\[USD, EUR\\] AVAE \\[GBP\\]|Russell 3000 Index|0.20% p.a.|US$3 mil|\n|[Avantis Europe Equity UCITS ETF](https://www.avantisinvestors.com/ucitsetf/avantis-europe-equity-ucits-etf/)|AVEU \\[USD,EUR\\] AVUE \\[GBP\\]|MSCI Europe IMI Index|0.25% p.a.|US$3 mil|\n|[Avantis Pacific Equity UCITS ETF](https://www.avantisinvestors.com/ucitsetf/avantis-pacific-equity-ucits-etf/)|AVPE \\[USD, EUR\\] AVEP \\[GBP\\]|MSCI Pacific IMI Index|0.25% p.a.|US$3 mil|\n\nThis adds on to the 3 ETFs that they current have that  operated for a year.\n\n\n\n|Fund|Benchmark to Beat|Current AUM|1 Year Performance (Benchmark Performance)|\n|:-|:-|:-|:-|\n|[Avantis Global Equity (AVGC)](https://www.avantisinvestors.com/ucitsetf/avantis-global-equity-ucits-etf/#performance)|MSCI World IMI|US$476 mil|22.6% (19.9%)|\n|[Avantis Emerging Markets Equity (AVEM)](https://www.avantisinvestors.com/ucitsetf/avantis-emerging-markets-equity-ucits-etf/)|MSCI Emerging Markets IMI|US$146 mil|44.7% (41.2%)|\n|[Avantis Global Small Cap Value (AVGS)](https://www.avantisinvestors.com/ucitsetf/avantis-global-small-cap-value-ucits-etf/)|MSCI World Small Cap Value|US$ 1 bil|25.3% (23.4%)|\n\n1. These are Irish-domiciled ETFs which means they are more withholding and estate tax efficient. \n2. You can buy them through a broker like Interactive Brokers of Saxo.\n3. They are all accumulation class of shares so they don't distribute any dividends\n\n  \nAvantis was started by the ex-CEO and CIO of Dimensional back in 2018/19. \n\nThey are what we consider funds that allows you to express a more systematic-active strategy as oppose to the more well known systematic-passive strategies of low-cost index tracking funds.\n\nThey are not for everyone.\n\nThis might sound cheem to you but deep down, some of you may want to consistently own:\n\n1. Very cheap companies but at least they are profitable but inconsistently profitable. If they revert to a higher fair value, you make money.\n2. You also don’t like to own stuff that is expensive.\n3. Very profitable companies, which you acknowledge usually is not cheap, and you just want to pay fair value for them.\n\nIf this is more to your investment philosophy, then strategies like Avantis can help you execute it and you can have a more passive life.\n\nBut if you don't get what I am talking about, maybe this is not going to interest you.\n\nI think the benefit of having these 6 funds is that you can fine tune your investment philosophy better.\n\nIn the past we might see people express any of these leanings:\n\n1. I only want US\n2. I don’t want a shxt place like Europe\n3. I don’t believe in Emerging Markets\n4. I want more of Japan!\n\nAnd since Avantis have individual funds, that allow you to express a value, and profitability strategy covering small, mid and large cap equities, this allows you to consider how you want to structure your portfolio:\n\nIf you just want to keep it simple but stay in developed markets then it can be:\n\n1. 100% in Avantis Global Equity\n\nIf you want to cover developed and emerging markets:\n\n1. 90% in Avantis Global Equity\n2. 10% in Avantis Emerging Market Equity\n\nIf you read the madness of small cap value over the past 90 years and have an affinity towards it and wish to boost the portfolio you can:\n\n1. 80% in Avantis Global Equity\n2. 10% in Avantis Emerging Markets Equity\n3. 10% in Avantis Global Small Cap Value\n\nIf you don’t want to be so concentrated in the US:\n\n1. 50% in Avantis America Equity\n2. 25% in Avantis Europe Equity\n3. 15% in Avantis Pacific Equity\n4. 10% in Avantis Emerging Markets Equity\n\nThe only question is… what is your investment philosophy.\n\nFor those unfamiliar with Europe IMI, this is what it covers from MSCI:\n\nhttps://preview.redd.it/6km60zr03djg1.png?width=1162&amp;format=png&amp;auto=webp&amp;s=16665c93333c16a0478a092ead89d74ee91df745\n\nhttps://preview.redd.it/6ivi5ht13djg1.png?width=1171&amp;format=png&amp;auto=webp&amp;s=391dad8352084c83487a32e5b5ce41ed9b097d3d\n\nAnd Pacific IMI:\n\nhttps://preview.redd.it/1mcrqk043djg1.png?width=1170&amp;format=png&amp;auto=webp&amp;s=e5666528d6f2baa073040e4215db2b0b23e92c04\n\nhttps://preview.redd.it/4sj9pmx43djg1.png?width=1161&amp;format=png&amp;auto=webp&amp;s=5fba56debe5a19b386a02aade7331e961a4143fc\n\n",
      "comments": [
        {
          "text": "Thanks. Was waiting for them to launch their UCITS ETF. Need to see if the UCITS screen gives comparable results to the non-UCITS counterpart.\n\nThis post will just go to waste for 95% of the cult here who only worship VWRA, but I appreciate this. Diamonds before swine I say.",
          "score": 4
        },
        {
          "text": "Wow an ad",
          "score": 2
        },
        {
          "text": "Wow, Avantis Global Equity has been around for a year? 0.22% TER.\n\nOne more to the mix.",
          "score": 1
        },
        {
          "text": "Thanks, appreciate these alternative viewpoints and options - this wasn't on my radar but will explore",
          "score": 1
        },
        {
          "text": "Eg. If I want more exposure to Pacific equities, is VWRA and AVPE a good option? I stop DCA in VWRA and start DCA in AVPE",
          "score": 1
        },
        {
          "text": "Good stuff. But I lazy to switch nor add already. Just maintain whatever I have now. Rather simplify",
          "score": 1
        },
        {
          "text": "I don't know - it looks like an ad, or at least something with strong promotional bias, but it's from one of the mods, so who am I to say?",
          "score": -3
        }
      ]
    },
    {
      "id": "t3_1r3ezec",
      "subreddit": "singaporefi",
      "title": "CNY is coming, what are you doing with your kids' ang pao money?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r3ezec/cny_is_coming_what_are_you_doing_with_your_kids/",
      "score": 19,
      "num_comments": 55,
      "created_at": "2026-02-13T11:57:26",
      "selftext": "title says it all. \n\nFor the last few years, we've been putting their ang pao money into FDs because a) rates were ok b) relatively small amounts anyway. \n\nNow they've got a larger stash, I'm planning to buy VRWA. Thinking about DCA-ing for a couple of months (or maybe once every two months to spread out the risks), until about 50% is in there, then stop.  Rinse and repeat once the stash builds up again. \n\nThe idea is that I want to get something safe for them, so when they come of age (in about 15 years), they can cash it out and pay for what they need (including education if needed). \n\nAny ideas? I thought of putting it in their CPF, but who knows what the rules will be on withdrawal 20 years from now. \n\nMuch appreciated! ",
      "comments": [
        {
          "text": "All in D05",
          "score": 21
        },
        {
          "text": "put in the kids' piggy bank at home and I make them physically take out the money to (co-)pay for their own presents, ice cream treats etc. More impt to teach them the value of money and delayed gratification.\n\nI invest my own savings with the intention that some will need to be used for their further education, not just my living expenses in retirement.\n\ncompound interest may be the 8th wonder but it can't beat human stupidity (bad financial habits, psychology.)",
          "score": 16
        },
        {
          "text": "My child’s first CNY - I would love to put it in the stock market but my wife is risk adverse so probably just keeping it in FD. \n  \nYour arrangement seems like a good idea - 50% exposed to world index. 50% in FD for capital preservation - in about 21 years $100 per month in VWRA, assuming 6% return, would net you $30+k. Can afford a portion of Uni",
          "score": 13
        },
        {
          "text": "Take it and buy Microsoft.",
          "score": 5
        },
        {
          "text": "How much ang pao money do they get? At such small sums it's silly to DCA. You are just wasting their money on fees.",
          "score": 4
        },
        {
          "text": "If they are old enough, talk to them, explain the options and risks, get their agreement before investing the money. Keep them updated on the returns.\n\nIt's a good chance to start the financial literacy journey. It's what I do for my kid. ",
          "score": 2
        },
        {
          "text": "They have a bank account in OCBC. We put in money monthly and also these types of CNY ang bao money. On a monthly basis, we signed them up on to a blue chips investment plan with me as joint account holder and buy $100 worth of STI ETF monthly.",
          "score": 2
        },
        {
          "text": "Btc all in",
          "score": 2
        },
        {
          "text": "I have been putting my kid's into endowus cash management goal.",
          "score": 2
        },
        {
          "text": "I've been buying cspx for them. My 5yo port is 33k now while my 1yo port is 11k. It included 11k of baby bonus money for my eldest and 6k of baby bonus for my youngest. Yearly their angbao in total is about 1-2k each from CNY and birthdays.",
          "score": 2
        },
        {
          "text": "Help them learn how to handle it themselves. It's more important to teach them the right things to do when they're young and the money is relatively inconsequential, instead of leaving it till it's too late to build good financial habits imo.",
          "score": 2
        },
        {
          "text": "Combination of MM funds and SPY, SPY outperformed the MM easily",
          "score": 1
        },
        {
          "text": "My kid don't have much (about $4k) so i just leave it in the bank so that he can see his savings if he wants to.",
          "score": 1
        },
        {
          "text": "spy 0dte calls",
          "score": 1
        },
        {
          "text": "Ok la I just keep and continue the cycle of 'new' notes.",
          "score": 1
        },
        {
          "text": "I have bought gold/vwra+ some local stock with my kids money",
          "score": 1
        },
        {
          "text": "50/50 in mmf and a globally diversified fund",
          "score": 1
        },
        {
          "text": "CDA account balances converts into PSEA account at age 13, where it earns similar interest as OA. PSEA is to fund higher education. Any unused balance in PSEA is transferred to OA at age 30. Something l am considering… put in money into CDA account",
          "score": 1
        },
        {
          "text": "lump sum VWRA. Been doing it for 3 years le.",
          "score": 1
        },
        {
          "text": "Pump into their CPF MA (up to 20k) to earn 5%.\n\nMedical is needed sooner or later",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r3mtr2",
      "subreddit": "singaporefi",
      "title": "Historically, how reliable is 2-year/10-year US bond yield inversion as an indicator of recession?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r3mtr2/historically_how_reliable_is_2year10year_us_bond/",
      "score": 9,
      "num_comments": 9,
      "created_at": "2026-02-13T19:32:42",
      "selftext": "I can see it steepening at an aggressive rate. Are we (you?) in for a ride? ",
      "comments": [
        {
          "text": "2023 yield inversion didn’t accurately predict recession though.",
          "score": 14
        },
        {
          "text": "predictive until it isn't. yield curve previously inverted in 2022-2023. no recession then.\n\n\nsteepening is actually traditionally a good sign for the economy, since it indicates an expectation of higher returns in the future. but again, predictive until it isn't. ",
          "score": 6
        },
        {
          "text": "Its reached a point that I see the title and I know who posted it lol",
          "score": 5
        },
        {
          "text": "If we could reliably predict things then its priced in liao.\n\nThe best thing to do would be to inverse the prediction",
          "score": 3
        },
        {
          "text": "In simple terms, we can think of the 2Y yield as the market-expected overnight interest rate every day for the next 2 years, likewise for the 10Y yield. Yields curve inversion simply means that the market expects short-term (ie. overnight) interest rates to fall in the future. It does not necessarily predict recession, but can coincide with one. In theory, yields curves should steepen when in an interest rate cutting cycle.\n\nRight now, the Treasury yield curve is only inverted in the very front-end (from 1 month to 1 year) as rate cuts are still priced in for this year. After that, the curve starts to slope upward as: (1) the market prices in the next interest rate hiking cycle, and (2) term premium starts to increase, ie. investors demand a higher return for 'locking up' their money for longer. Under 'normal' economic circumstances, sovereign yield curves tend to be upward sloping.\n\nThe 2s10s Treasury curve has been steepening recently both as a result of  forward interest rates actually realizing, and more importantly due to fiscal woes. Uncle Sam runs a large budget deficit and this has to be financed by borrowing, resulting in the national debt increasing by $1 trillion every ~100 days. This means that the supply of bonds has to increase to facilitate increased borrowing and spending -- investors will demand a higher and higher term premium to absorb this increased supply. \n\nThe ongoing de-dollarisation theme also means that investors will demand an increased premium to hold longer-dated US Treasuries, further feeding the rise in term premium.\n\nYields curves globally have been steepening over the past 2-3 years as a result of similar dynamics, notable examples being Japan and the UK.",
          "score": 3
        },
        {
          "text": "'23 proved that it didn't work. Better to look at market liquidity than just the yields.",
          "score": 2
        },
        {
          "text": "going to a strip club in america and seeing hows the spending there is a better indicator",
          "score": 2
        },
        {
          "text": "This time it's different. /s",
          "score": 1
        },
        {
          "text": "Maybe 5 out of the last 2",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r3rx4m",
      "subreddit": "singaporefi",
      "title": "OCBC Rewards vs Citi Rewards",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r3rx4m/ocbc_rewards_vs_citi_rewards/",
      "score": 3,
      "num_comments": 2,
      "created_at": "2026-02-13T23:20:07",
      "selftext": "Currently using Citibank cashback+ card and it sucks.\n\nI'm considering 2 things since I do online shopping quite abit\n\n1. Switch to Citi Rewards\n2. Switch to OCBC Rewards (for sign-up bonus), then 1 year later switch to Citi Rewards (for another sign up bonus)\n\nI think option 1 is fairly straightforward, not much thinking needed. But for option 2, I read that minimum transfer of OCBC$ is 25k. Which means I can only transfer in batches of 25k points, hence requires tracking how much I've earned before I stop using the card\n\nAlso considered HSBC Revolution 4mpd but that deal seems to last only till 31 March 26\n\nIs my take on this correct? Thanks alot guys",
      "comments": [
        {
          "text": "DBS woman’s card? Also good for online shopping.",
          "score": 2
        },
        {
          "text": "Hsbc revo 4mpd promo is for the contactless part and travel, the 4mpd for the other category still apply. It is good enough for online shopping provided you don't get wrong mcc, which only crmc and wwmc will work. Ocbc reward is great if your online shopping is only ecommerce platform.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r46qcm",
      "subreddit": "singaporefi",
      "title": "Weekly Celebratory Thread!",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r46qcm/weekly_celebratory_thread/",
      "score": 2,
      "num_comments": 2,
      "created_at": "2026-02-14T09:00:31",
      "selftext": "This thread is for those looking to share hitting their milestones!\n\nCongratulations on being one step closer to FI!",
      "comments": [
        {
          "text": "Bull run not yet over, so won’t celebrate first 😅",
          "score": 3
        },
        {
          "text": "12 nights sober - saved at least $300",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1r47vvf",
      "subreddit": "singaporefi",
      "title": "Trust Invest: so far so good",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r47vvf/trust_invest_so_far_so_good/",
      "score": 1,
      "num_comments": 7,
      "created_at": "2026-02-14T09:54:24",
      "selftext": "Decided to try Trust Invest because I’m that weird guy that doesn’t like too many bank accounts so it’s wonderful to have a consolidated platform to save, transact and invest. \n\n  \n\nFX seems to be spot - it was 1.2689 - around the spot rate when I googled it. \n\n  \n\nAnother thing is - I went to sleep at 930 last night so decided to try set a limit at prevailing pre market price - it was executed at below my limit price when it opened so no complaints there.\n\n  \n\nOther than the commission, I think if you want to consolidate your investments, savings and credit card on 1 platform, I imagine Trust offers better value than your traditional local retail banks.",
      "comments": [
        {
          "text": "I checked IBKR for the same time, the spot rate then was 1.26453.\n\n  \nThe amount above spot rate was 0.34%. \n\n34 basis points\n\nThis is much more expensive than IBKR's spot rate conversion of 3 basis points using Auto FX.\n\n  \nAlso... you \"trust\" the banks so much? they have to make some money somewhere right?\n\n",
          "score": 8
        },
        {
          "text": "You cannot open a cpfis bank account or srs account with any of the digital banks. Just saying.",
          "score": 2
        },
        {
          "text": "There's a price to pay for convenience I guess. ",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r3lp7r",
      "subreddit": "singaporefi",
      "title": "How can I log in to SGX e-learning(SIP)?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r3lp7r/how_can_i_log_in_to_sgx_elearningsip/",
      "score": 1,
      "num_comments": 4,
      "created_at": "2026-02-13T18:25:41",
      "selftext": "I'm new to SGX and didn't know about SIP until I was rejected for my first order of ETF.\n\nThe broker told me to take an e-learning on a part of the SGX website, but I can't log in. As their system requirement is too tight and old, and I don't have a Windows machine, but somehow got it in the cafe, later in the cloud as well. Even though I accessed with IE in compatibility mode, which should meet the system requirement, I still can't log in. To be precise, nothing happens after pushing the \"LOGIN\" button in IE compatible mode, or \"user id or password is invalid\" in EDGE mode. \n\nCan someone give me hints on how to get into the system?",
      "comments": [
        {
          "text": "Just here:\n\nhttps://onlineeducation.sgx.com/specifiedinvestmentproducts/\n\ndont need to use anything other than browser.",
          "score": 1
        },
        {
          "text": "When you create the account you actually have to wait for a few days for the account to be approved at the backend, and it's a manual / human process, then they'll email you saying your account has been approved, then and only then you login.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r3isg4",
      "subreddit": "singaporefi",
      "title": "Historical valuation data for straits times index",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r3isg4/historical_valuation_data_for_straits_times_index/",
      "score": 1,
      "num_comments": 3,
      "created_at": "2026-02-13T15:22:23",
      "selftext": "Hi, do u guys know where to find monthly historical PE ratio for straits times index ?\n\nNotes :\nI don't want the data from ETF version,\n\nDon't suggest data from CEIC, all data from that website is fake\n\nAlso I don't have access to Bloomberg Terminal or Refinitiv Eikon\n\nThanks for the answer",
      "comments": [
        {
          "text": "There's an FSMone article with the data, albeit from mid-Jan. Table 1 and Chart 3 at the bottom of the article will have the index level and EPS over time, from which one can calculate the P/E. Their data is taken from Bloomberg.\n\nhttps://secure.fundsupermart.com/fsmone/article/rcms351201/non-bank-non-reit-constituents-lead-sti-earnings-growth-in-2026\n\nAs of 19-Jan, projected EPS for FY26 is 328.2, so forward P/E was 14.7x at that point in time.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r3lm16",
      "subreddit": "singaporefi",
      "title": "Applying Credit Card with Dual Income",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r3lm16/applying_credit_card_with_dual_income/",
      "score": 0,
      "num_comments": 3,
      "created_at": "2026-02-13T18:20:02",
      "selftext": "Hi everyone, \n\nWould like to ask for advice/sharing of past experiences with applying for Credit Card with dual income, below the scenario:\n\nJob 1: $1600/month (1 year) \n\nJob 2: $2000/month (6 months)\n\nBoth are permanent jobs with CPF. Tried applying online for Citi bank card but the system could only reflects Job 1 as the sole income source.\n\nAny shifus can provide advice, thank you in advance",
      "comments": [
        {
          "text": "Income tax notice\n\n\nYou not likely to get approved",
          "score": 3
        },
        {
          "text": "Don't use Singpass system. Submit manual documents to the bank to review.",
          "score": 1
        },
        {
          "text": "How to get 2 permanent jobs with cpf??",
          "score": 1
        }
      ]
    }
  ]
}