{
  "schema_version": "raw_scrape_v1",
  "report_id": "2026-02-02",
  "scraped_at": "2026-02-02T15:09:19.719233",
  "subreddits": [
    "singapore",
    "askSingapore",
    "SingaporeRaw",
    "singaporefi"
  ],
  "total_posts": 40,
  "total_comments": 862,
  "posts": [
    {
      "id": "t3_1qt0azs",
      "subreddit": "singapore",
      "title": "Nigerian man, 37, stalked girl, 14, from bus interchange to Nex mall, later made 12 police reports that she harassed him",
      "url": "https://old.reddit.com/r/singapore/comments/1qt0azs/nigerian_man_37_stalked_girl_14_from_bus/",
      "score": 560,
      "num_comments": 97,
      "created_at": "2026-02-01T22:46:21",
      "selftext": "",
      "comments": [
        {
          "text": "fuck me can we deport this guy",
          "score": 641
        },
        {
          "text": "Crazy how he had already started his stalking in 2024 and was still allowed to work here",
          "score": 327
        },
        {
          "text": "I think any foreigner who is sent to jail will be deported post their sentence",
          "score": 226
        },
        {
          "text": "Maybe this is the Nigerian Prince trying to pay the girl $1 million for her trouble to unlock his $10 million inheritance?",
          "score": 157
        },
        {
          "text": "2 police report before taking action? Or 2 police report before they identify and found the man? I hope anything regarding minors can be treated seriously by the relevant parties, our children should be allowed to live their lives without having to worries about shit like this",
          "score": 122
        },
        {
          "text": "Now I wondered if he was the same man who stalked me from serangoon mrt to opp my house. It was an eye contact in the train and he alighted at the same stop as me. At the road crossing, he came forward and asked me how old I was. I pretended to be on a phone call throughout and kept saying NO NO NO NO. He left after a while. Omg",
          "score": 104
        },
        {
          "text": "Oh Deportation follows after the sentence? That’s good news.",
          "score": 102
        },
        {
          "text": "mus b a talenttttt",
          "score": 94
        },
        {
          "text": "For all these shit he was jailed for 6 months. I wonder if that's a fair sentence considering one of the victims is a 14yo minor?",
          "score": 71
        },
        {
          "text": "what a waste! she was the chosen one",
          "score": 28
        },
        {
          "text": "Welcome to Singapore!",
          "score": 25
        },
        {
          "text": "smart",
          "score": 20
        },
        {
          "text": "Ah yes... the much needed doctors and engineers again.",
          "score": 18
        },
        {
          "text": "Yes I received a few in my spam folder still.",
          "score": 8
        },
        {
          "text": "Yes, this is true.",
          "score": 6
        },
        {
          "text": "If you see the reports for past cases, stalking has all the possible harsh penalties, but in the end it is treated with 0% seriousness in SG.",
          "score": 6
        },
        {
          "text": "Jfc",
          "score": 4
        },
        {
          "text": "Do those advance fee scams even still exist in the big 26?",
          "score": 4
        },
        {
          "text": "Wdym, they're alrd there working as nightclub touts in the seedy part of Tokyo",
          "score": 2
        },
        {
          "text": "Nonsense. Sg severely lacking engineers and managers. Why do you think so many talents get invited here? Cause locals cant do these jobs",
          "score": 1
        },
        {
          "text": "can you imagine what will happen to japan if these clowns starts to pour in",
          "score": 1
        },
        {
          "text": "Damn still need to feed them",
          "score": 0
        },
        {
          "text": "In many parts of the US, the judge would feel guilty and let them back on the streets.",
          "score": 0
        },
        {
          "text": "Don't need pretend next time, shows you're afraid. These type of predator look them straight in the eyes firmly and give the vibe you will call the police or scream.",
          "score": 0
        },
        {
          "text": "No shortage of engineers here sir.",
          "score": -5
        }
      ]
    },
    {
      "id": "t3_1qthnoo",
      "subreddit": "singapore",
      "title": "S’pore to set up national space agency on April 1 to develop and run space capabilities",
      "url": "https://old.reddit.com/r/singapore/comments/1qthnoo/spore_to_set_up_national_space_agency_on_april_1/",
      "score": 367,
      "num_comments": 148,
      "created_at": "2026-02-02T09:47:01",
      "selftext": "",
      "comments": [
        {
          "text": "Time to build that space elevator and tekong and finally launch the Singapore gundams",
          "score": 265
        },
        {
          "text": "I've been following regional space developments for a while now - found it interesting how the headline is phrased given that we currently already have the Office of Space Technology and Industry (OSTIn) under EDB. I take this to mean that we're going to have a distinct national organization with its own mandate and budget. EDIT: Seeing that my comment is getting some attention I wanted to add a bit more colour here :)  My understanding is that OSTIn was largely ineffective at promoting Singapore's space interests. In fact, when I was actively monitoring space related private sector and regulatory developments between 2020 to 2023, it wasn't OSTIn but SST (https://www.space.org.sg/) , an independent public org that drove much of the progress. My conversations with founders at spacetech companies like Aliena and Equatorial Space suggest that OSTIn was largely invisible and it was SST, DSO, and other IHLs doing a lot of heavy-lifting at the time. Happy to hear if anyone else has a different take!",
          "score": 111
        },
        {
          "text": "It wouldn’t surprise me if countries have secret undisclosed weapons and technology for military purposes, but the kid in me always wished someone out there is developing Gundams in secret.",
          "score": 52
        },
        {
          "text": "Are you over the age of 15? If so, you're automatically disqualified, even if you're the officially designated pilot, some 15 YP will steal the gundam from you",
          "score": 44
        },
        {
          "text": "get in the Gundam, Xiao Ming, or the XMM will have to do it again",
          "score": 25
        },
        {
          "text": "follow the money. space is expensive business, most people dont want to pay for it (your google maps is free), but those who are willing to pay for it, are willing to pay a fuckton for it in these 2 scenarios: war and disaster. the private stuff is unsustainable in SG by itself, the real backing and cash comes either from the government (ostin via EDB) and military (mindef) side. even IHL that can only do cube-sats cant launch unless they tompang the govt/military:https://spacenews.com/isro-launches-six-satellites-for-singapore/ in other words, u always needed a government body to drive the space industry, was OSTIn, now its NSAS i guess",
          "score": 21
        },
        {
          "text": "Is there a feisty redhead?",
          "score": 9
        },
        {
          "text": "My grandmother could have done better than you",
          "score": 8
        },
        {
          "text": "There is and she is in a hospital ward. And no, you can't visit her.",
          "score": 8
        },
        {
          "text": "Our souls have been weighed down by gravity for far too long, it’s time to move to space!",
          "score": 8
        },
        {
          "text": "Ah crap. Time to listen to Rhythm Emotion on repeat again",
          "score": 7
        },
        {
          "text": "Hopefully we won't have to fight wars over it, or planes trying to fly up it...",
          "score": 7
        },
        {
          "text": "I agree that a government body is needed: as a local nonprofit there was only so much SST could do. Space isn't necessarily expensive though: the whole point of nanosats / cubesats and new propulsion systems is to lower the cost of satellite launches to the point that most private companies can now affordably launch their own. IIRC Equatorial Space charges about S$30,000 / kg, but more mature space launch service companies can quote rates as low as US$8,000/kg. I think a more nuanced answer is that *some* space-related products and services or expensive, while others are less so.",
          "score": 5
        },
        {
          "text": "You're underestimating the impact SST has had on Singapore's spacetech developments - they were instrumental in setting up platforms like commercial accelerators and co-innovation programs that set the stage of spacetech commercialisation in Singapore, and they also played a key role positioning Singapore as a key stakeholder in global space dialogues. Funding is just one part of the equation here.  But as mentioned, I definitely support this development as it signals an alignment between the various actors now. \"cube-sats are good PR and training your tech team\" - not sure where this claim is coming from. I guess if you're coming from the angle that Cubesats are largely for demo / proof-of-concept purposes you're not exactly wrong, but NuSpace has proven that Cubesats can have some commercial utility (they're looking at at sensor-to-satellite IoT).",
          "score": 5
        },
        {
          "text": "Interestingly, the head of OSTIn since 2024 was the head of SST from 2019-2023. Also heard OSTIn has been beefing up it's team in the last year or so.",
          "score": 5
        },
        {
          "text": "Funny this is happening after I just finished Ace Combat 7 last Friday",
          "score": 3
        },
        {
          "text": "Shhhhhh!!!",
          "score": 3
        },
        {
          "text": "Space outlet for Mixue in 3, 2, 1...",
          "score": 3
        },
        {
          "text": "so what could SST without funding/authority? other than to convince OSTin to release funds? perhaps its better if we all fold them into the same org so that the network-marketing team is actually aligned with the technical/resource side. it isnt just the launch, the costs and materials to build the sat is enormous, even the down-link stations in limited parts of SG. cube-sats are good PR and training your tech team, but no-one is buying cube-sats data, they are literally crap hardware destined to become space debris without any propulsion or self-correction. if u want good data/sensors/comms that have any commercial value, u have to put a big one up there, and i think theres still a long way to go before we achieve this parity in terms of economics of scale/good enough tech for the private companies",
          "score": 2
        },
        {
          "text": "You're the worst",
          "score": 1
        },
        {
          "text": "RX-78SG Gundam Xiao Ming",
          "score": 1
        },
        {
          "text": "Need to outsource some jobs to aliens",
          "score": 1
        },
        {
          "text": "aren't feisty redheads in SG just ah lians?",
          "score": 0
        },
        {
          "text": "Eh SST was funded by ESG for those efforts. Governments work with “multipliers” for industry development. They don’t work in silos. Would be surprised if OSTIn didn’t also align on those efforts.",
          "score": 0
        },
        {
          "text": "Yes, I'm not saying that SST operated in a vacuum but that they were spearheading Singapore’s space industry developments without strong support from OSTIn - this was what I understood when I spoke to SST leadership sometime back in 2022.",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qsxkbw",
      "subreddit": "singapore",
      "title": "Record 19,000 devotees fill streets for Thaipusam 2026",
      "url": "https://old.reddit.com/r/singapore/comments/1qsxkbw/record_19000_devotees_fill_streets_for_thaipusam/",
      "score": 349,
      "num_comments": 42,
      "created_at": "2026-02-01T20:46:26",
      "selftext": "",
      "comments": [
        {
          "text": "Thaipusam should be a public holiday too",
          "score": 335
        },
        {
          "text": "Thaipusam was removed in 1968, when the British were withdrawing, and the government was trying to prep Singaporeans for economic hardship. And IIRC, they promised to reinstate it when the economy got better. I know the economy is shit now, but it’s certainly far better than in 1968. And didn’t the government wanted Singaporeans to have kids? GKY and Jeff Seow were chanting it like a mantra. Make it a holiday for Singaporeans to have some Made in Japan or Buatan JB babies.",
          "score": 152
        },
        {
          "text": "Mr E. W. Barker (Minister for Law and National Development): I ask Members to bear with me. If our island prospers, I am sure the Government will ask me to come :back here and on that day it will be my pleasure to move amendments to increase the number of holidays. But let us first show that we can work hard and that we deserve more holidays. Hansard, 1 August 1968, Column 816",
          "score": 103
        },
        {
          "text": "To think that we are taught racial harmony in school, but in reality the government might not be very invested in this",
          "score": 92
        },
        {
          "text": "Used to have to take mc and parents letter to attend as a kid… it’s high time we make this a PH",
          "score": 86
        },
        {
          "text": "Can’t believe it’s not a public holiday yet",
          "score": 54
        },
        {
          "text": "My friend and I watched the procession on our walk home from Renfaire! It was super lively... Honestly no reason not to make it a public holiday. It would please literally everyone.",
          "score": 53
        },
        {
          "text": "Of course, GDP over PH and happier citizens.",
          "score": 23
        },
        {
          "text": "TIL. Thanks for this little nugget of trivia",
          "score": 22
        },
        {
          "text": "do u have a source of the promise to reinstate it when the economy got better? am very curious this actually.",
          "score": 21
        },
        {
          "text": "Yes companies are rerouting. Singapore is often the beneficiary of the rerouting. Major players (like Micron’s $30.5 billion investment announced recently) don't dump billions into a country they think is about to be crippled by tariffs. Oso why are you treating tariffs like a fixed natural disaster? We've already seen \"tariff truces\" and sectoral exemptions from the US and we have one of the densest FTA networks in the world. Yes some \"front-loading\" (shipping early to beat tariffs) happened in late 2025, our non oil domestic exports have shown resilience beyond just early shipping. The growth is being driven by structural demand in the digital economy, which doesn't just \"turn off\" when a tax is applied. TLDR; Stop fearmongering",
          "score": 19
        },
        {
          "text": "Just so you know, Government usually refers to the Government of the day. So the promise already lapsed but it will be nice of the current government to honour the sentiment",
          "score": 17
        },
        {
          "text": "Singapore is still in a good spot",
          "score": 17
        },
        {
          "text": "The economy isn’t even ‘shit’ bro we have one of the best in the world 😢",
          "score": 16
        },
        {
          "text": "It was super lively. The I mean we say regardless of race but then have race quotas too…",
          "score": 16
        },
        {
          "text": "Went to batu caves this weekend and man, what a scene too. Well worth the trip up to KL despite not being Hindi.",
          "score": 10
        },
        {
          "text": "Serve NS and you know that all that is bullshit. Most Singaporeans are generally tolerant towards one another but our security policies, not so much.",
          "score": 9
        },
        {
          "text": "Ah that explained the crowd when I arrived near Fort Canning for the Renfaire event.",
          "score": 9
        },
        {
          "text": "*Hindu",
          "score": 8
        },
        {
          "text": "They can’t even honour LKY wishes lmao. Good luck with them honouring anything else.",
          "score": 6
        },
        {
          "text": "If the economy is shit now, I don’t wanna see what happens if it gets worst.",
          "score": 6
        },
        {
          "text": "Would be wild if Baker really ''came back' to give us more holidays.",
          "score": 1
        },
        {
          "text": "Not business friendly though. Have to frame it in such a way that it is beneficial to the government's agenda. Or have an opposition party make it a voting point.",
          "score": 1
        },
        {
          "text": "Tariffs???? Layoffs??????",
          "score": -20
        },
        {
          "text": "Bro, you are talking from your backside. Things may look good now, but it takes time for the impact or effects of the tariffs to kick in. The tariffs are not a case of announce today, implement tomorrow. Companies are busy rerouting supply chains to minimise the impact potential tariffs have on their bottom line.",
          "score": -23
        }
      ]
    },
    {
      "id": "t3_1qsvyto",
      "subreddit": "singapore",
      "title": "'Shocked and disgusted': Jade Rasif sues sugar daddy website over photo use, settles for $32k",
      "url": "https://old.reddit.com/r/singapore/comments/1qsvyto/shocked_and_disgusted_jade_rasif_sues_sugar_daddy/",
      "score": 235,
      "num_comments": 29,
      "created_at": "2026-02-01T19:22:10",
      "selftext": "",
      "comments": [
        {
          "text": "They purposely use her photo so they attract her attention to then publicly announce she's sueing and the website probably got free advertisement from this and prolly gained alot more views than before. So to them, they're willing to pay for cheaper advertisements I guess? Idk I'm not in that industry",
          "score": 193
        },
        {
          "text": "Lawyer fees probably cost way more than that",
          "score": 100
        },
        {
          "text": "She got lawyer friends, cfm friendly rate",
          "score": 89
        },
        {
          "text": "32k is cheap marketing now that mainstream media has picked it up.",
          "score": 60
        },
        {
          "text": "Even if the lawyer fees are more expensive than what she got back in return, it's better to clear her name and set the record straight that she is not in collaboration with such sites. What if someone really hooks up with \"her\" online, only to get scammed or realise that it is a different person when meeting up? The other party may pull up her other photos and dox her when she has nothing to do with it.",
          "score": 47
        },
        {
          "text": "Not sure how that affects what I said?",
          "score": 36
        },
        {
          "text": "Old people in Singapore enjoys talking down to the younger generations",
          "score": 25
        },
        {
          "text": "You mean notorious right? I thought still on Interpol wanted list.",
          "score": 16
        },
        {
          "text": "Old man cant string two thoughts tgt?",
          "score": 16
        },
        {
          "text": "Go home old man",
          "score": 16
        },
        {
          "text": "This is just another case of “just want to say something”",
          "score": 14
        },
        {
          "text": "Not likely. This is in Malaysia, so should be a Malaysian law firm. Plus they went through mediation instead of trial, so I doubt the lawyer fees would be more than the settlement sum of RM100k.",
          "score": 11
        },
        {
          "text": "i support her claim！ false advertising！！ making guys not wanna be in a normal relationship",
          "score": 11
        },
        {
          "text": "I’m not that young myself but wah, don’t understand what I said that was wrong leh",
          "score": 10
        },
        {
          "text": "Is she still a nurse in healthcare?",
          "score": 10
        },
        {
          "text": "By your logic,  should ban prostitution because morals and all.",
          "score": 7
        },
        {
          "text": "Big brain move. All publicity is good publicity!",
          "score": 5
        },
        {
          "text": "32k ameliorated the shock and disgust",
          "score": 2
        },
        {
          "text": "free publicity for her and her website",
          "score": 1
        },
        {
          "text": "Yes. Not wild idea at all. Bet you don't know in Thailand prostitution is illegal. It's just not enforced. People supporting sugaring is wild. Imagine your daughter and mom doing it.",
          "score": 1
        },
        {
          "text": "yup. their family or at least the father's generation are substantial members of the industry. so finding some help and money to chase down lawsuit is not a problem. Definitely family will help her given now everyone's mind share of the surname is gooning her thirst trap vs her father disappearing with that huge sum of money and changing the very landscape of property conveyancing work.",
          "score": -1
        },
        {
          "text": "Let's go queen!\nPersonally, I think Singapore should ban every sugaring platform. It's degratory to both males and females. Willing buyer willing seller doesn't supercede morality, to y'all that use whatever economics to justify it.",
          "score": -13
        },
        {
          "text": "bro. you must be young her father Singapore most famous lawyer so many laws changed due to him.",
          "score": -53
        },
        {
          "text": "No she goes around looking for unauthorised use of her photos on the net and then proceeds to profit through lawsuits.",
          "score": -69
        },
        {
          "text": "No she goes around looking for unauthorised use of her photos on the net and then proceeds to profit through lawsuits.",
          "score": -77
        }
      ]
    },
    {
      "id": "t3_1qswp7f",
      "subreddit": "singapore",
      "title": "Woman loses over $400k to investment scam; at least 20 cases involving over $1.7m reported",
      "url": "https://old.reddit.com/r/singapore/comments/1qswp7f/woman_loses_over_400k_to_investment_scam_at_least/",
      "score": 150,
      "num_comments": 34,
      "created_at": "2026-02-01T20:02:22",
      "selftext": "",
      "comments": [
        {
          "text": "In the beginning, my husband was doubtful. However, after researching the company, he realised it was legitimate and agreed to accompany me to the bank to make the withdrawal,\" said Lim. Husband also idiot",
          "score": 118
        },
        {
          "text": "It is staggering how much money that woman had in hand -  to the tune of  400k liquid.",
          "score": 96
        },
        {
          "text": "Unpopular opinion: I think we’re the only country that is trying our hardest to protect our citizens from scams. There is only so much we can do. With all this in place and people STILL falling for scams - can we all just agree that some people cannot be saved no matter what? Maybe focus our energies elsewhere.",
          "score": 69
        },
        {
          "text": "She was coached to lie to the bank for withdrawals and also had to physically deliver cash to a stranger and STILL thought it was legit? Deserved to be scammed of every cent.",
          "score": 55
        },
        {
          "text": "Not unexpected for someone in their 50s. They have 3 decades of savings, 400k of investment is possible if they go all in.",
          "score": 53
        },
        {
          "text": "They asked me to download the app from Apple Store which (made it appear) legitimate Looks like the government would need to update* it's scam advisory",
          "score": 41
        },
        {
          "text": "Banks and shared responsibility framework can't cure greed, esp when they blatantly lie to the bank about the reasons for withdrawal...",
          "score": 37
        },
        {
          "text": "ideally yes BUT left alone, they become burden to society or at the very least, to their children.",
          "score": 33
        },
        {
          "text": "I too have the perception that Apple is more stringent on vetting apps in their App Store.",
          "score": 29
        },
        {
          "text": "Bruh.",
          "score": 28
        },
        {
          "text": "theyre perfect for each other",
          "score": 20
        },
        {
          "text": "Here's how most scam works :",
          "score": 18
        },
        {
          "text": "Due to transfer limits at the bank, Lim said that on one occasion, she met the \"investment personnel\" in person to hand over cash. What… what… what…? It’s pure bright red flag. Her greed made her ignore the obvious signs",
          "score": 15
        },
        {
          "text": "why not go down to the company office and check himself if such company will deploy investment tactics over social media. Or even better check with SPF itself if such company exist. If its a legit company in sg at least can file civil law suit to claim back the asset they have in sg but if overseas syndicate its zero chance of getting anything back.",
          "score": 8
        },
        {
          "text": "You can't protect people from being geh kiang and greedy",
          "score": 6
        },
        {
          "text": "IF they got all in on blackjack maybe still got some chance to double it.",
          "score": 3
        },
        {
          "text": "In order to survive in the 21st century not only u need to be frugal, but u also need to be smart to prevent ppl from scamming.",
          "score": 2
        },
        {
          "text": "Idk why people still havent gotten the memo. The entire telegram group are collectively scamming them. Every account in the group are all part of the group of scammers. The only real person is the (potential) victim.",
          "score": 2
        },
        {
          "text": "This just seems out of place in an article dated 29 Jan: Speaking to the media at the Police Cantonment Complex on Thursday (Aug 29),",
          "score": 1
        },
        {
          "text": "\"They asked me to download the app from Apple Store which (made it appear) legitimate.\" \"Lim added that the app was more user-friendly than conventional investment platforms.\" I had reported an app to (SG Secure) claiming to be SGPools on the Google Play Store before. The app has the exact same App Icon and screenshots, but different author name.\nSGPools app is not available on the Play Store, but rather, can only be downloaded from the SGPools website.",
          "score": 1
        },
        {
          "text": "What's app group. Oh no I'm curious which app from apple store. Aren't iphone apps supposed to be more secure and have more strict review process Also who is moomoo selling customers data to?",
          "score": 1
        },
        {
          "text": "Scammers deserve life imprisonment and canning. They are no different from murderers. They destroy lives and families.",
          "score": 1
        },
        {
          "text": "Infact thats also how most sales business works, they hire insider ppl to add to the crowd to create that sense of urgency, u dont know the person beside u is also a potential customer or their own employee",
          "score": 0
        },
        {
          "text": "can we jus hab a national exam for every forking peasont to test if they r phishing aware and da cyber awarenesssssss shetttt ffs",
          "score": -1
        },
        {
          "text": "After reading many news report on this, it’s clear that the weak link is YouTrip.  I suspect the gov will go down on them hard",
          "score": -9
        }
      ]
    },
    {
      "id": "t3_1qtjro7",
      "subreddit": "singapore",
      "title": "Some shots of Thaipusam 2026",
      "url": "https://old.reddit.com/r/singapore/comments/1qtjro7/some_shots_of_thaipusam_2026/",
      "score": 146,
      "num_comments": 10,
      "created_at": "2026-02-02T11:20:40",
      "selftext": "1st photo: Kavadi on the move\n\n2nd photo: The distinctive self mutilation of a devotee\n\n(Scares the cap out of my mother)\n\n3rd photo: Another view of the Kavadi\n\n4th photo: Crowd in front of HDB Blk 663 waiting for Kavadi to move\n\n5th photo: Gathered crowds at Tekka Market/FC bus stop\n\n6th photo: Looks like a rest stop for the Kavadi carriers?\n\n7th photo: Milk pot carrying devotees on 31st Jan\n\n8: Devotees walking past Blks 8,9, 10 Selegie HDB blks, 31st Jan\n\n9: Teochew building used as gathering point, 31st Jan\n\n10: Paiseh notice by RC or TC\n\n( 1st time they put up one in 25 years of existing here)\n\nI apologise for the mix of portrait and landscape photos, I mostly take landscape photos.",
      "comments": [
        {
          "text": "About time we make this a PH.",
          "score": 40
        },
        {
          "text": "Thaipusam is a Hindu festival, not \"Indian\" per se. I knew a Chinese guy in NS who celebrated Thaipusam. He had the photos to prove it so I don't think it was just an excuse to chao geng.",
          "score": 17
        },
        {
          "text": "yup, really no reason for this not to be a holiday. i don't think an addition of 1 day for a total of 12 public holidays is too much to recognise and help preserve something so special.",
          "score": 10
        },
        {
          "text": "I have some close up photos. Will post it later when at home 😃",
          "score": 8
        },
        {
          "text": "Thaipusam is a Tamil Hindu festival (small correction) coz only Tamil Hindus celebrate it as a festival and not the rest of the Indians.",
          "score": 7
        },
        {
          "text": "I really don't understand government logic. They acknowledge of the celebration of Thaipusam let alone LHL and LW posted it and seeing these many people celebrate it, it makes sense to be a PH. This year was lucky because it's on a weekends.",
          "score": 6
        },
        {
          "text": "piss off mate",
          "score": 6
        },
        {
          "text": "Your mother",
          "score": 4
        },
        {
          "text": "Hooray for Indian culture!",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1qtgmnh",
      "subreddit": "singapore",
      "title": "Why do people ignore “Do Not Touch” signs, play with display items, and then get angry at the staff when they’re reminded not to touch?",
      "url": "https://old.reddit.com/r/singapore/comments/1qtgmnh/why_do_people_ignore_do_not_touch_signs_play_with/",
      "score": 105,
      "num_comments": 55,
      "created_at": "2026-02-02T09:00:53",
      "selftext": "I went to a popmart store recently and noticed this happening again.\n\nVery often in retail stores, pop ups and exhibitions there are “Do Not Touch” and “Do Not Climb” signs, some people still mess with display pieces.\n\nSome parents also don’t manage their kids, and when staff politely tell the kids not to touch or climb or mess up the product shelves. The adults get angry and rude towards the staff instead.\n\nWhy does this behavior seem so common?",
      "comments": [
        {
          "text": "Some people cannot read English. Some people pretend they cannot read English . Some people are just assholes. Cheers.",
          "score": 84
        },
        {
          "text": "Some people really just have itchy fingers, seen it in museums where they step over the line and try to touch the frames/display and the staff have to intervene and remind them not to touch anything. Same thing in zoos where they ignore the no flash sign, and when you tell them they act like you’re the problem. And I would think that such signs are pretty universal in design (e.g. crossed out palm) so even if you don’t understand the text, use your common sense. But alas that is also lacking.",
          "score": 72
        },
        {
          "text": "People always want to test system. It's a psychology, if you say something, people are reminded to do or not to do something. Instead, put \"$500 for touching\".",
          "score": 39
        },
        {
          "text": "Because parents think that only they have the right to discipline their kids so when other ppl do it, they see it as an intrusion of their sovereignty. Usually the same ppl that like to say it takes a village to raise a kid btw.",
          "score": 23
        },
        {
          "text": "If the \"village\" only includes people they personally approve of then it becomes delegated parenting rather than communal parenting. A real village includes people the parents  don’t choose (including strangers) and that also means accepting shared responsibility and not just shared convenience that diffuses parental accountability.",
          "score": 13
        },
        {
          "text": "Because inside every man, there are two wolves. And sometimes, the one called moon moon wins.",
          "score": 11
        },
        {
          "text": "Because they made that money in countries that speak other languages, and Singapore makes it stupidly easy to bring money into the country and foreign asset ownership.",
          "score": 8
        },
        {
          "text": "I love parents who immediately will jump in with \"yeah but not ALL parents!\" when they don't refuse to proactively correct kids. Yesterday go dinner and two tables with kids drowned the entire restaurant with noise because they decided that \"kids will be kids\" = allowing their kids to run around, pull each other's hair, scream at top volume, play tag around strangers' chairs, etc while the parents eat and watch tiktok. Suddenly the other parents with kids all diam diam. But the moment the kids kanna scold by a patron (a youngish couple) after the kid almost bump into a server with a full tray of food, all the \"wah kid only they don't understand\", \"kids will be kids\", \"people have no empathy/understanding\", etc comments come out. cb you don't want to police, you say you are not like the rest, you say \"not all parents\", then you let them do whatever the f they want, what's the difference? Basically \"not all cops\", then covering for the bad cops.",
          "score": 6
        },
        {
          "text": "Unless kids are going to stay forever in some carefully curated village of parent-approved NPCs, both they and their parents need to accept the simple truth that mommy and daddy can’t shield them from every moment of real life. So learn the lessons while the law and society are still relatively nice... or don’t, and let the real world teach them instead 🤷‍♀️",
          "score": 5
        },
        {
          "text": "Touching what? Came the query",
          "score": 3
        },
        {
          "text": "*terms and conditions apply. Try it to know it.",
          "score": 3
        },
        {
          "text": "i remember Daiso have a fun way of telling potential thieves what they will get. \"Win a police car ride by stealing\".",
          "score": 3
        },
        {
          "text": "Love these kind of ppl. Prolly condoning those behavior because they also want to have that kind of grace for themselves when they lapse into bad parent mode. Istg parents really are one of the most entitled ppl in SG. Bad enough that they're mollycoddled by gov, but they also believe the entire world revolves around their kid. A little time touching grass with non-parent/single friends might remind them that no one else actually cares about their kid they way they do.",
          "score": 3
        },
        {
          "text": "The best part is that they get soooo outraged when people sick of this shit float the idea of \"no kids\" wedding, \"no kids\" cafe, \"no kids\" restaurant, etc. HOW DARE YOU EXCLUDE MY MONSTERS?! THIS IS BLATANT DISCRIMINATION!",
          "score": 3
        },
        {
          "text": "I've been wondering for years how do people get to buy million dollar condos without having the ability to read announcements and instructions in plain simple English.",
          "score": 2
        },
        {
          "text": "When a stranger needs to step in to discipline the kid, the village has failed.",
          "score": 2
        },
        {
          "text": "Or \"If You Touch It, You Pay It\" ~",
          "score": 1
        },
        {
          "text": "Absolutely, some people want to do it no matter what. There is even a saying: Sometimes it is better to ask for forgiveness then to ask for permission.",
          "score": 1
        },
        {
          "text": "This anecdote sounds as credible as RK's.",
          "score": 1
        },
        {
          "text": "Also known as the rapist mindset.",
          "score": 0
        },
        {
          "text": "Then they should jolly well keep said kids at home and not let them out into the village.",
          "score": 0
        },
        {
          "text": "“Needs to”? Says who? Who you?",
          "score": -2
        },
        {
          "text": "Speaking from experience",
          "score": -3
        },
        {
          "text": "Okay noted. Village = all (no you don’t get to choose)",
          "score": -4
        },
        {
          "text": "Ya it takes a village, but not a stranger",
          "score": -9
        }
      ]
    },
    {
      "id": "t3_1qtg1vr",
      "subreddit": "singapore",
      "title": "S’poreans Should Work In M’sia Instead? M’sian Minister Reshares His Old Speech On The Day The Ringgit Hits 2-Yr High Against SGD",
      "url": "https://old.reddit.com/r/singapore/comments/1qtg1vr/sporeans_should_work_in_msia_instead_msian/",
      "score": 81,
      "num_comments": 51,
      "created_at": "2026-02-02T08:36:00",
      "selftext": "",
      "comments": [
        {
          "text": "Back in the 1990s, it was SGD1 : RM1.60, give or take. Malaysians still came here to work then. Singaporeans still went there to shop then. Nothing will change. Life will go on. Meanwhile, this minister will continue living on his delusions.",
          "score": 133
        },
        {
          "text": "Whos gonna tell him 🤭",
          "score": 116
        },
        {
          "text": "\"Don't you think we Johoreans aren't miserable? Do your fellow Johoreans need to lead this kind of life?\" He speaks as though we forced them over to work a slave wage or something. They can stay at their side of the bridge if they feel miserable coming over.",
          "score": 99
        },
        {
          "text": "He can continue to dream. Unless they fix their race based policies, it’s basically a pipe dream.",
          "score": 37
        },
        {
          "text": "Kuala Lumpur used to be the power centre of Malaysia, where many Malaysians go to, for many things. Now, times are different. People in KL city used to look down on others from other states. Now, Johoreans' earning power far surpass people from KL. Plus, you cannot deny Sultan Johor is implementing a lot of right policies, and... erm.. cleaning up a lot of things. His cleaning up acts are making him popular and he also has a lot of support from Singapore. To me, the power is obviously shifting to Johor and inevitable, someone will try to stir up such shat.",
          "score": 34
        },
        {
          "text": "No one, in this case Malaysians, are exactly chomping at the bit to give us compassion and understanding, besides they are here for the money lol, it’s just business.",
          "score": 30
        },
        {
          "text": "Ask him stand at jb kastam and tell all the JB folks crossing over to work in SG.",
          "score": 27
        },
        {
          "text": "It’s more than race based policies that is causing this. Malaysian Malays are working in Singapore because they get paid more, even when compared to having the race advantage back home. The rampant corruption, unsustainable subsidies, religious laws, etc hamper their economic potential. They need to completely flip their entire system of governance if they want to retain talent.",
          "score": 21
        },
        {
          "text": "Typical Malaysian politician. Instead of improving the lives of their citizens, Singapore is living rent free in his head.",
          "score": 20
        },
        {
          "text": "Fix your country first then talk",
          "score": 19
        },
        {
          "text": "Compassion for what exactly? Its actually a great opportunity for them to come and earn money and go back to their condos and Semi D after work. They are building a bright future. You got pity the maids and helpers who have to leave their families , see them maybe once a year or even lesser and earn a crap wage on top of that?",
          "score": 18
        },
        {
          "text": "Not to mention Sarawak has ditched the Bahasa Malaysia as first language plan and is working toward LKY’s Malaysian Malaysia. Their economy, while not exploding, is improving year by year. Add to that the states that choose their beliefs over economic well-being, they believe that money alone isn’t everything. This is despite having teh tarik coloured water coming from the taps. KL and by extension Putrajaya is no longer seen as the peak of the nation.",
          "score": 16
        },
        {
          "text": "Bruh",
          "score": 14
        },
        {
          "text": "Malaysians in general. I often wonder if they are secretly jealous or something. So many issues in this world and they focus on the little red dot.",
          "score": 12
        },
        {
          "text": "Malaysia Boleh but let’s not get ahead of ourselves",
          "score": 11
        },
        {
          "text": "Tbf a lot of influencers/creatives seems to be going over to msia. Their work doesnt need to be in singapore so they are able to stay in msia, do whatever they need to do for the sponsored posts and whatnot (or come sg as and when needed), and still charge sg rates (if their TA is singapore). So these people are able to make use of the lower cost of living in msia and earn sg money. But for other kind of jobs where it isnt so flexible, msia isnt going to pay sg salary leh.",
          "score": 8
        },
        {
          "text": "Credit where it is due. Singapore picked itself up and ran with it. Setting goals and beating them. What did Malaysia do? Race based policies with a bunch of pollies more interested in plundering their wealth for personal gain, and if you think this is me throwing shade at Malaysian politics, the local Malaysians say so themselves. Malaysia has so much potential to be a regional powerhouse. Blessed with resources, and well educated population. Just not properly implemented.",
          "score": 7
        },
        {
          "text": "The Separation ended up benefitting us a lot more than it did them. It's hard not to think something went wrong with their planning. This really shouldn't have happened under normal circumstances.",
          "score": 6
        },
        {
          "text": "I agree with you but unfortunately that’s what our SG gov actually said: https://www.channelnewsasia.com/singapore/pm-lawrence-wong-success-definition-4428761",
          "score": 5
        },
        {
          "text": "With such comments coming in, it means the top for MYR is in 🤣",
          "score": 5
        },
        {
          "text": "Plus, you cannot deny Sultan Johor is implementing a lot of right policies, and... erm.. cleaning up a lot of things. His cleaning up acts are making him popular and he also has a lot of support from Singapore. To me, the power is obviously shifting to Johor and inevitable, someone will try to stir up such shat. Giving the Johor Sultan credit for Johor's development is certainly one way to put it. The only thing the Sultan does is take his cut of the deal and sign off, see Forest City. The theatrics his family does and their history of violence, as well as a certain regent's oversized role in Malaysian football, are viewed by most Malaysians with disdain. If anything, the Sultan adds complexity to doing business in Johor. As a corporate top flyer put it in the media a few months back, doing business in Johor is complex because you're dealing with 4 figures, Johor State government, Malaysia Federal government, Singapore government and the Sultan. If anything, Johor's development in recent years is a natural state buoyed by the SG+ twinning model, where companies are encouraged to set up in SG while taking advantage of cheaper labour and land in Johor/Batam.",
          "score": 4
        },
        {
          "text": "He speaks as though we forced them over to work a slave wage or something. They can stay at their side of the bridge if they feel miserable coming over. I mean this guy is a moron but please don't be a moron like him. The Malaysians that work in Singapore are indeed miserable if they have to do a daily commute, it's just tough. They also just want to get a better life, unlike this gundoo minister they aren't thinking about Singaporeans working in Johor. Do you think it's helpful for the SG government to tell Singaporeans hey no one is forcing you to be stressed in the sg rat race, if you fell miserable have you tried just being poor?",
          "score": -2
        },
        {
          "text": "why post Malaysia in r slash singapore? Hypocrite much",
          "score": -3
        },
        {
          "text": "Singapore also has race based policies… that’s not the main cause of it. There’s a number of other issues in Malaysia, including poor infrastructure planning and execution, and corruption. Just from a an outsiders pov. I’m sure the locals have something to say about it.",
          "score": -3
        },
        {
          "text": "We don’t but the reality is that the daily commute is painful and exhausting. If Malaysia is able to provide these Malaysians the same opportunity and salary, no one would want to do this on a daily basis. We can all be a little more compassionate and understanding",
          "score": -11
        }
      ]
    },
    {
      "id": "t3_1qtnl5n",
      "subreddit": "singapore",
      "title": "BMW driver gets jail for killing pedestrian by speeding into him while drunk, severing body",
      "url": "https://old.reddit.com/r/singapore/comments/1qtnl5n/bmw_driver_gets_jail_for_killing_pedestrian_by/",
      "score": 67,
      "num_comments": 69,
      "created_at": "2026-02-02T14:33:23",
      "selftext": "",
      "comments": [
        {
          "text": "The force of the crash severed the victim's body into three parts, with the torso and head crashing through the windscreen and into the offender's lap. A man who drove drunk with his two young children in his vehicle Fucking hell",
          "score": 0
        },
        {
          "text": "That poor elderly man. RIP. The driver was so irresponsible.",
          "score": 0
        },
        {
          "text": "Fuck me. Body severed into three parts and only 11 years jail and 15 years driving ban. Mf is a repeated offender. He should be locked up for life. After his jail term and driving ban, he can continue with this shit again.",
          "score": 0
        },
        {
          "text": "\"The driver, a 46-year-old Australian who is a Singapore permanent resident, was sentenced on Monday (Feb 2) to 11 years' jail, a S$12,000 (US$9,430) fine and a driving ban of 15 years.\" Way too lenient. Imagine the victim's loved ones having to identify the 3 pieces of the body because this Australian decided to drive 122km/h on a 70km/h road.",
          "score": 0
        },
        {
          "text": "Knn.... Drunk or dangerous driving first time should whack the offender jialat jialat, cannot give chance.. Tmd don't whack that's why got this kind of repeat offender pos la.....",
          "score": 0
        },
        {
          "text": "Ya jail and revoke his PR",
          "score": 0
        },
        {
          "text": "was sentenced on Monday (Feb 2) to11 years' jail, a S$12,000 (US$9,430) fine and a driving ban of 15 years. ... The man pleaded guilty to one count of dangerous driving causing death as a\"serious repeat-repeat offender\" and a second charge of repeat drink driving. It took the trinity of fatal accident, drunk driving, and repeat-repeat offender just to net him 11 years. Singapore's driving laws are a joke. Parliament and TP spend all their time figuring out how to catch lorries without speed limiters, but nary a whiff about increasing drink driving penalties. And fucker is still gonna appeal his sentence. This is exactly the kind of situation where I miss CJ Yong Pung How.",
          "score": 0
        },
        {
          "text": "agreed. we should all write to our MPs to expresss our outrage at this. i know i will be",
          "score": 0
        },
        {
          "text": "They even reduced the minimum punishment for driving offences before this.",
          "score": 0
        },
        {
          "text": "Justice Choor Singh would be better",
          "score": 0
        },
        {
          "text": "this is absolutely gruesome, i genuinely cannot imagine the horrors from that day.",
          "score": 0
        },
        {
          "text": "Indeed. The poor children.",
          "score": 0
        },
        {
          "text": "Damn dude, should deport him after serving his 11yrs sentence A man whodrove drunk with his two young childrenin his vehicle barrelled into a pedestrian at high speed, severing his body into three parts and killing him. The driver, a 46-year-old Australian who is a Singapore permanent resident, was sentenced on Monday (Feb 2) to 11 years' jail, a S$12,000 (US$9,430) fine and a driving ban of 15 years. He cannot be named as his two children, then agedthree and four, are victims of the crash and are protected by a gag order. The man pleaded guilty to one count of dangerous driving causing death as a \"serious repeat-repeat offender\" and a second charge ofrepeat drink driving. A third charge for dangerous driving involving his children was considered in sentencing.",
          "score": 0
        },
        {
          "text": "Kick this fucker out, fuck this guy seriously",
          "score": 0
        },
        {
          "text": "exactly just kick him and his whole family out, still have to waste taxpayer's money to jail him.",
          "score": 0
        },
        {
          "text": "What did his family do?",
          "score": 0
        },
        {
          "text": "What if his wife and kids are Singaporeans? Kick to where?",
          "score": 0
        },
        {
          "text": "So we have to think for the fucker? He chose to drink and drive, knowing how reckless it is AND knowing he has a family of his own.",
          "score": 0
        },
        {
          "text": "Considering his kids in there, he obviously do not think and the children did not choose to be born to this useless dad either.",
          "score": 0
        },
        {
          "text": "Wtf. This 1 straight up murder alr sia",
          "score": 0
        },
        {
          "text": "Disguising murder as a traffic accident in the future",
          "score": 0
        },
        {
          "text": "Now, now, let's not get ahead of ourselves. The wealthy and powerful all drive, this could happen to anyone or their relatives. /s",
          "score": 0
        },
        {
          "text": "it is a shared responsibility, if the victim isnt around the area when the incident happened he wont have died right? Cant blame it all on the driver. /s",
          "score": 0
        },
        {
          "text": "The victim was just asking for it, walking in that manner /s",
          "score": 0
        },
        {
          "text": "https://www.judiciary.gov.sg/hearing-listfind the lawyer firm name and date of trial can find out the fella name",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qti4kq",
      "subreddit": "singapore",
      "title": "ST Engineering's AirFish to launch Singapore route",
      "url": "https://old.reddit.com/r/singapore/comments/1qti4kq/st_engineerings_airfish_to_launch_singapore_route/",
      "score": 53,
      "num_comments": 23,
      "created_at": "2026-02-02T10:07:46",
      "selftext": "",
      "comments": [
        {
          "text": "Singapore gets an ekranoplan was definitely not on my 2026 bingo card. The fact that there's no destination announced yet suggests that there's a decent chance this is hype/vapourware and they don't have a solid plan or agreements locked in yet. But I've always wanted to ride in one, so I'm cautiously optimistic.",
          "score": 35
        },
        {
          "text": "Probably cuts the ferry journey time down by half based on the operational speed. The question would be if docking procedures etc. take longer than with a ferry and if specialised infrastructure is needed. Based on 6 rev pax per trip, this is probably going to be more like a \"private jet\" option than for the masses.",
          "score": 9
        },
        {
          "text": "Since 90s, we are still waiting for flying cars. I think we are slowly getting there.",
          "score": 7
        },
        {
          "text": "And pedestrians now have to look up as well ",
          "score": 6
        },
        {
          "text": "Cool. Question is how much it will cost and what’s the time reduction compared to ferries",
          "score": 5
        },
        {
          "text": "AirFish is a direct descendant of the Merlion.",
          "score": 5
        },
        {
          "text": "I'm sure it's faster and since it's on air it'll be a cushier ride. Riding on a bed of air vs travelling on water where the waves will knock you around",
          "score": 5
        },
        {
          "text": "“ST Engineering will announce at the Singapore Airshow 2026 a partnership with a ferry operator to run the route.” Fly to Batam here we come /s",
          "score": 4
        },
        {
          "text": "Measuring 17m long and 15m wide, the AirFish is designed to be operated by two crew, and can carry six to eight passengers. Most likely to Bintan or Batam. But wish to see the Airfish taking to Tioman island , Malacca etc.",
          "score": 4
        },
        {
          "text": "They said they're announcing it during the airshow, so maybe they just don't want to spoil that main announcement.",
          "score": 3
        },
        {
          "text": "Ground effect/WIG vehicles are not really analogous to flying cars though. And unlike flying cars, they have already been in development, prototyped and produced since the 50s and 60s. Edit: typo",
          "score": 3
        },
        {
          "text": "Analogous",
          "score": 3
        },
        {
          "text": "I would love to ride this planeboat thing. The first commercial journey ticket is probably going to be expensive and sold out within the first week.",
          "score": 3
        },
        {
          "text": "Looking at the standards of driving in SG… that would just be a disaster.",
          "score": 2
        },
        {
          "text": "Imagine going to Malacca in this thing. You get to see the sea and the coastal area of Malaysia as you pass by at high speed.",
          "score": 2
        },
        {
          "text": "Good spot, thanks! Edited",
          "score": 1
        },
        {
          "text": "Yeah, I think it will operate like private charter.",
          "score": 1
        },
        {
          "text": "just saw this vehicle when embarking at Tanah Merah Ferry Terminal last night! Think you're on to something.",
          "score": 1
        },
        {
          "text": "Interesting! But Singapore waters are quite congested, so I'm not sure whether a high speed, low altitude vehicle is that feasible.",
          "score": 1
        },
        {
          "text": "I remember the wigetworks prototype at SAFYC Changi years ago. Kinda surprised they’re still around, but good for them i guess.",
          "score": 1
        },
        {
          "text": "Flying cars would just cause congestion in 3d + more pollution",
          "score": 0
        },
        {
          "text": "and can carry six to eight passengers. I don't think this will be for public use. Just think of the amount of trips it have to make daily just to be economically viable. Probably only for VIPs and official government use.",
          "score": 0
        },
        {
          "text": "What’s the benefit of travelling by airfish vs ferry?",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qtdas6",
      "subreddit": "askSingapore",
      "title": "Why do so many Singaporeans leave for Australia and take up their citizenship, but hardly any the other way around?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qtdas6/why_do_so_many_singaporeans_leave_for_australia/",
      "score": 273,
      "num_comments": 322,
      "created_at": "2026-02-02T06:42:42",
      "selftext": "Granted I am aware that race is a major factor considered in Singaporean immigration, whereas in Australia immigration is completely race-neutral, so maybe it's hard for non-Asian Australians to get SG PR / citizenship\n\nBut you hardly hear anyone giving up AU citizenship for SG, but lots of people SGeans want to migrate to AU and eventually take up citizenship?\n\nLogically it should be the opposite right? Since SG is wealthier than AU ?",
      "comments": [
        {
          "text": "Wealth isn't everything. A lot of people like Australia because the lifestyle and culture suits them more.",
          "score": 477
        },
        {
          "text": "Logically? No it should not be the opposite. SG citizenship takes a long time to get, and most Aussies are white meaning they are below Chinese, Malay and Indians in the pecking order. Many also don't see the poin t in living in SGP permanently due to high cost of living, boring lifestyle compared to Australia and because they would have to give up their Australian passport. Many Australians also have dual or triple passports, meaning in theory they would have to give up all of them. So its a combination of not wanting it, and/or the need to wait far too long for it.",
          "score": 429
        },
        {
          "text": "SG's wealth is often due to high net-worth individuals rather than more equitable wealth distribution. Even it were the case, SG isn't seen to be more wealthier than AU. It's not like SG vs some developing country. Also countries like UAE are also wealthy. I don't think many want to move there except short-term for work. AU has a more slower pace of life and the last I know they require healthcare professionals",
          "score": 204
        },
        {
          "text": "This is pretty accurate as an Aussie. Generally also families are reluctant if they have boys due to the NS requirements.",
          "score": 170
        },
        {
          "text": "It's actually a lot harder to get residency status in SG than AU. My boss has been in Singapore for the last 10 years and he can't even get a PR even though he has been applying consistently.",
          "score": 144
        },
        {
          "text": "better overall life balance in AU i guess, and good for those with children growing up. SG is a better option for young adults looking for uni degrees and career exposure",
          "score": 110
        },
        {
          "text": "Well, it depends on your degree. Singapore is good with the finance, tech and shipping sectors. If you're in the arts, trades or manufacturing, Australia is better.",
          "score": 81
        },
        {
          "text": "A relative of mine got married to an Aussie and moved to Australia. They live in a huge house with a huge yard, own 2 cars, she works from home full-time, he works from home 2 days a week. They finish work at 5pm sharp and their companies don't contact them after hours. The only downside would be the taxes. Like a good 40% of their gross income are taxes. But in terms of work-life balance and space, it's way better than anything in SG.",
          "score": 65
        },
        {
          "text": "My previous boss was Indian, studied from top university there and was genuinely super smart. Didn’t get PR after 10yrs after multiple tries, eventually fed up and left for New York - settled there with a green card now",
          "score": 45
        },
        {
          "text": "Chinese is the race that gets the bulk of the quota.",
          "score": 28
        },
        {
          "text": "I was there for holiday and people were heading back from work at 3pm.",
          "score": 24
        },
        {
          "text": "And you can be a tax resident without having to take up permanent residency.",
          "score": 21
        },
        {
          "text": "Let me guess, you boss is not Asian or Chinese?",
          "score": 19
        },
        {
          "text": "Yes many shops close at 6pm, after that its mainly bars and restaurants open, just like anywhere else. I don't think most people do much after 6pm, if you want to go to a cinema or an event, yes they will be open. With lifestyle, I mean a worklife balance, there is limited overtime, so you have more time for hobbies and families. You also have  access to great nature, facilities to play sports, many families invite friends over for dinner, etc .",
          "score": 18
        },
        {
          "text": "OP could be in Woodbridge if he is above 16 years and could not understand the basic sensitivities of each country. Also many sinkie think it’s so easy to apply and get sg citizenship",
          "score": 17
        },
        {
          "text": "Definitely not a coincidence. Malaysian chinese who do NS is almost guaranteed.",
          "score": 11
        },
        {
          "text": "My staff (Indonesian/Chinese/Malaysian) have been getting PR within 1 year of me obtaining their work passes (EP and SP both). It is also their 1st job. Granted, having studied in one of the Unis in Singapore may have played a major part because i believe they have to work in Singapore for x duration upon graduation.",
          "score": 9
        },
        {
          "text": "boring lifestyle compared to Australia asking as someone who've never been there: dont ausie shops close at 5-6pm? ig the bars still open but what else is there to do after work?",
          "score": 8
        },
        {
          "text": "Still not without its challenges. Malaysian chinese parent tried 6 years with some giving up in between. Coincidental or not, only after i finished NS then the application successful.",
          "score": 8
        },
        {
          "text": "Sounds bleak",
          "score": 7
        },
        {
          "text": "Yeah, they take into account your family as well. That's why when you apply for PR/citizenship you have to input a ton of information about your immediate family. Definitely not a coincidence.",
          "score": 5
        },
        {
          "text": "Because they think just because they heard many stories of how PRCs can easily convert to citizen/PR in the 2010s, they think it's easy for other Tom/Dick/Harry to get SG citizenship too.",
          "score": 4
        },
        {
          "text": "Or they look down on themselves so much and they assume the nation also looks down on itself so much and take in Tom dick Harrys. Also PRCs also having ‘not so easy’. For every success story people heard there are so many fail stories. Nobody knows how ica chooses except Malaysian Chinese may have it easier. But no guranteed.",
          "score": 4
        },
        {
          "text": "I was born here. My dad was the one that had to apply",
          "score": 3
        },
        {
          "text": "Loads to do! Lots of people do sports, exercise or this time of year heading to the beach is pretty popular. Generally people I know from Aus don't really view shopping as an exciting activity, or if they do it's a (expensive!) treat when they're on holiday somewhere like SG. Plus there's plenty of shopping to do on the weekends or on e.g. Thursday when shops open late.",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1qstk8z",
      "subreddit": "askSingapore",
      "title": "Why does the Singaporean sun make me extremely tired?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qstk8z/why_does_the_singaporean_sun_make_me_extremely/",
      "score": 157,
      "num_comments": 55,
      "created_at": "2026-02-01T17:04:03",
      "selftext": "Been staying here all my life, born and bred. In recent times the sun has made me have headaches and feel extremely fatigued. Especially when hot seasons like this come. I am keeping hydrated, clear pee, loads of water.\n\n(I have heat exhaustion before if that matters)\n\nAnyone feels the same? How are you handling it?",
      "comments": [
        {
          "text": "It’s not the sun it’s the humidity bro. Wear a cap, put on sunglasses. Why is this not a thing in Singapore I don’t understand. Glare from the sun can cause headaches. Notice how we feel soooooooooooo much better in the shade when it’s hot out? rock an umbrella when you’re walking. I gotchu on the glare and heat, humidity you’re on your own dude.",
          "score": 232
        },
        {
          "text": "It's the humidity. I could walk hours under the dry sunny weather in Spain which is sometimes 40 degrees. In Singapore? 10 minutes and I am exhausted from all the sweating",
          "score": 53
        },
        {
          "text": "No wonder LKY said whoever governs singapore must have an iron in him",
          "score": 34
        },
        {
          "text": "probably cos we spend so much time indoors and the skyline is mostly shaded from tall buildings, so don't feel the need for sunglasses. i suddenly got why europeans wear shades so much when i went there though - many places dont have as dense tall buildings as we do so the suns always glaring in their eyes",
          "score": 33
        },
        {
          "text": "The humidity + heat drains yr energy.",
          "score": 33
        },
        {
          "text": "Are you female? Could be low iron.",
          "score": 29
        },
        {
          "text": "I call it “heat rage”when it gets too hot and I can feel the glare of the sun, how dumb i look squinting and makeup melting off, my sweat on my face and my hair getting greasy and limp and my body starting to itch and stink. My irritability and short-temperedness suddenly skyrockets from the sensory irritation.",
          "score": 26
        },
        {
          "text": "Many people wear glasses too, leceh to switch around. But the comfort from the reduction in glare is life changing, especially when driving",
          "score": 17
        },
        {
          "text": "Wrestled with daily fatigue until i started taking iron supplements per doctor’s advice.. Ladies!! Don’t overlook your iron and haemoglobin levels!",
          "score": 13
        },
        {
          "text": "Use AC on dry mode + fan in the afternoons. I wfh and I can’t work properly if it’s unbearably hot.",
          "score": 9
        },
        {
          "text": "Can be age too, sometimes sensitivity increases with age.",
          "score": 8
        },
        {
          "text": "I feel you too. There’s something about the heat from the past few years that feels particularly glaring and  piercing to the skin and feels particularly sapping.",
          "score": 7
        },
        {
          "text": "It makes all of us tired and annoyed, not just a you thing.",
          "score": 7
        },
        {
          "text": "I used to be like this until I lost 10kg and included walking as my main exercise. Now I still sweat loads but the heat doesn’t bother me anymore. In fact I feel invigorated when I get to sweat it out.",
          "score": 7
        },
        {
          "text": "Yes!! Also 1 thing to remember with iron supplements is you should avoid taking them together with calcium-rich foods because they block iron absorption.",
          "score": 6
        },
        {
          "text": "Vitamin d deficiency too",
          "score": 5
        },
        {
          "text": "Not sure if you know this, but fitover sunglasses that go over your glasses exist and are actually very affordable. I almost never leave home without my pair.",
          "score": 4
        },
        {
          "text": "Got recommendations for those?",
          "score": 3
        },
        {
          "text": "Owndays, Lenskart and Foptics offer snap-on sunglasses with glasses. Owndays has polarised snap-on, quite convenient",
          "score": 2
        },
        {
          "text": "I do, and I’ve bought my husband a pair (I don’t wear glasses) but most of them don’t look very nice.",
          "score": 2
        },
        {
          "text": "Transition glasses? They have been around forever too.",
          "score": 2
        },
        {
          "text": "There are solution to this problem for as long as I have been alive. Just fix it.",
          "score": 1
        },
        {
          "text": "Yup yup yup, especially with the sunglasses.",
          "score": 1
        },
        {
          "text": "This! I even kept a hat in my work locker previously in case I need to run errands during lunch because the heat gives me such bad headaches, not to mention facial skin flare ups. Now hats/caps and sunglasses are non negotiables if I’m gonna be under the sun for longer periods of time, oh and an umbrella too.",
          "score": 1
        },
        {
          "text": "I’ve had two iron infusions in the last 13 months, about to have another one. It’s such a struggle for women 😅😅",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qt2svt",
      "subreddit": "askSingapore",
      "title": "What will make you support a local F&B business?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qt2svt/what_will_make_you_support_a_local_fb_business/",
      "score": 101,
      "num_comments": 84,
      "created_at": "2026-02-02T00:21:09",
      "selftext": "I don’t usually post this kind of thing, but lately it’s been sitting quite heavy on me, and I hope I can share some of my woes.\n\nMy family runs a small F&B business. I help out when I can, but honestly it’s really shag. It is physically tiring, mentally draining, and financially quite stressful. I used to work corporate, but have taken a step back because it feels like such a waste if no one continues this, and serving local food we are proud of.\n\nWe’re on our feet for hours. And when there are no customers, it doesn’t mean we’re resting, there’s always prep, cleaning, stocking up, paperwork. There’s almost no real “break”, just different kinds of work.\n\nManpower is a constant headache too. Hiring non-local staff is getting harder with all the rules, and locals understandably expect higher pay because living costs here are no joke. We really want to pay more and hire more locals, but our margins are already super thin. Rent keeps going up. Supplier prices keep increasing. Utilities, ingredients, packaging, wages, everything has gone up.\n\nThen there’s the customer side. Most are nice, and we’re very grateful. But sometimes we meet really unreasonable people who treat us like we owe them something. It can be quite disheartening. Some days we just look at each other and wonder… is it even worth continuing?\n\nWhenever we adjust prices to keep up with rising costs, there will definitely be complaints. But the truth is, we’re always trying to balance being affordable with simply surviving. We can’t compete with big chains and multinational brands that have scale, systems, and pricing power that us small local businesses just don’t have.\n\nWe’re always thankful for every bit of support, but there’s this constant worry about whether its sustainable. Behind the scenes, it’s a daily struggle to make the numbers work, while still serving food we’re proud of.\n\nTo those who are patient, who understand that small businesses are run by very tired humans just doing their best, rly thank you 😭\n\nJust curious, what makes you choose to support a local business and when will people be willing to start paying more for local food?",
      "comments": [
        {
          "text": "If the food is good and its not run like a money grab",
          "score": 119
        },
        {
          "text": "As a fellow fnb person, my only advice to you rn is this: Some \"influencer\"/\"marketing agency\" person might see this post and send you  a DM offering to \"help boost traffic\" to your socials/physical location for a small fee etc. DO NOT ACCEPT THIS. These people are worse than leeches. You will almost never get any tangible ROI from these people.",
          "score": 84
        },
        {
          "text": "Value. That doesn’t mean cheap. It means delivering something beyond the price point. Could be really great taste, or nutritional balance that’s beyond what we expect from a hawker. On the last point, most of our hawker food is quite imbalanced (in my opinion). Too much carbs, not enough veg, fiber and protein. Happy to pay $10 or more for Hokkien mee, but that plate has to set itself apart somehow. If it’s going to be larger $5 plate, I’m afraid that’s not going to cut it. Consider the concept of customer delight.",
          "score": 51
        },
        {
          "text": "if the local F&B business has good food and service. Or try differentiating it and blowing it up on social",
          "score": 28
        },
        {
          "text": "This may sound heartless, but your endless hard work and tiredness isn't a reason for me to support you. I support the stalls with tasty food and reasonable pricing. I'm not rich, so pricing does affect how often I buy to some extent, but if it's average hawker price range, tasty is most important. What your nearby competitors offer also important. If they're much tastier and much cheaper, I would probably patronise your stall a lot less. As for paying more... did you know Shangri-La has local food like nasi lemak for room service? I can tell you it's definitely not cheap. It was tasty as heck though. Would totally order it again (but not on a daily basis since I'm not that rich). If you have the same standard, why not? Ps. I rather stalls raise the price by a dollar than practice shrinkflation where the proportion of ingredients get thrown out of whack. I might buy less with higher price, but I won't buy at all if it tastes bad.",
          "score": 24
        },
        {
          "text": "I really love small local brands that listen to customer feedback. Cause chain restaurants, they can’t change much unless given permission from corporate but small businesses have the opportunity to interact with their customer base. For me, in general, if the products are of decent quality i.e. matches the price point, I buy it from local businesses. I can’t say much abt F&B cause I’m not really a foodie but advertising on social media can help, otherwise you’re “just another food stall” yk? It might reach the fyps of students from a school nearby etc.",
          "score": 22
        },
        {
          "text": "Quite a few has mentioned “value”. For me, I’m after the other kind of value(s):\nIf a stall owner respects my queue position whilst some random boomer not queuing up, just yells his order from behind me, that stall owner will have me as customer for life.",
          "score": 18
        },
        {
          "text": "It is bleak. If it is affecting ur family badly, just throw in the towel. \nThere is no shame in doing so. Plus there is no prize in enduring it out too. I am sure i will get a lot of hate for this. But you do need to take care of your family and yourself. All the best!",
          "score": 18
        },
        {
          "text": "What makes me not return to any f&b a second time is when I'm paying more than average price for mediocre tasting food and/or portion that does not justify the price. What makes me stop supporting any f&b is when prices get higher while the serving gets lesser - unless the food tastes really good. I think what is lacking in our local f&b scene is innovation/being differentiated and a genuine interest in the art of cooking and delivering good quality food.",
          "score": 15
        },
        {
          "text": "If I come to know of a reasonable business with decent value, i will make sure to try at least once. Will come back if if the experience is pleasant",
          "score": 11
        },
        {
          "text": "This is the only factor and in fact I will pay more if the food is good. I won't support a business with shitty food, local or not.",
          "score": 8
        },
        {
          "text": "Things or food handmade from scratch not just get pre-made from suppliers cause the taste is too standardised and mediocre This is one thing that I noted in Singapore food scene and I still stand by my view cause Malaysia food always taste better than Singapore ones",
          "score": 8
        },
        {
          "text": "because of perceived value yes the fries are frozen and the parmesan may be too, but that’s not what is being sold the perceived value comes from the air-conditioned environment, the music being played over the sound system, the photos you can take for your social media, the vibes you can share with friends the food is merely a justification for the entire experience which is what is being sold",
          "score": 8
        },
        {
          "text": "Taste, Price, Service. It's a classic \"pick 2\", but if there's a nostalgia or proximity factor I can accept a 1.5 (one great criteria, one acceptable). If your stuff taste good and is cheap, I can accept mediocre service. If your stuff is cheap and your service is great, I can accept meh taste. If your stuff taste good and your service is great, I will gladly pay a good price.",
          "score": 7
        },
        {
          "text": "It’s understandable, but sometimes I can’t help wondering why people are willing to pay $12–15++ for fries that are clearly just frozen fries with some parmesan on top, yet aren’t willing to pay $7 nett for a plate of noodles where every ingredient is hand-prepped and cooked over a heavy wok, (which requires someone to stand there and constantly cook it, not just leave it in a deep fryer) :(",
          "score": 7
        },
        {
          "text": ">$15++ horfun Let me introduce you to Han's horfun. They're around that price range / just slightly less. Han's has been around for a long time, so presumably people are giving them business. I'm not that impressed with their horfun, but my mom goes there with her colleagues quite often, and she eats the horfun every time.",
          "score": 7
        },
        {
          "text": "I expect different things from different classes of F&B businesses. 1. Daily eateriesFor places I visit multiple times a week, I expect predictable speed, consistent taste, and good value for money. 2. Date-night placesWe usually don’t visit a date-night place more than three times a year. What I expect here is great food, pricing that doesn’t feel exploitative, and service that’s at least a 4+/5. Minor service hiccups are fine. At least two out of the four dishes we order should be exceptional. One place that executes this well is Dumpling Darlings. 3. Nostalgia placesThese are legacy businesses or places known for classic dishes. My expectations here are lower in some ways. I forgive bad service because I know how hard it is to keep these places running. I even forgive price hikes, as long as they aren’t astronomical. But the food must taste the same as it always did. The day my soon kueh place or laksa stall starts cutting corners, I stop going. I understand there will always be some variability due to sourcing or preparation, but it needs to be good at least four out of five times. There are many great examples of this category—my top spot is Joo Siah BKT at Chinese Garden, which I visit religiously. That said, I’ve stopped going to many places because it’s obvious they no longer maintain quality. 4. Milestone placesThese are for big moments—birthdays with a zero in them, important anniversaries, reunions—events where the food becomes part of the memory. Here, I expect near-flawless execution. I don’t want a single variable I need to worry about. Prices can be high, but they must be earned. Most dishes should be excellent, and ideally, memorable. Across all categories, there’s one non-negotiable: the food should actually be cooked. I’ve encountered too many places where food is centrally prepared by a vendor and the restaurant is essentially a glorified microwave. I hope such places slowly shut down and realize this isn’t acceptable. If I want reheated frozen food, I’ll get it from FairPrice.",
          "score": 7
        },
        {
          "text": "If food is good and it’s reasonably priced, I don’t care local or not. I will support and tell many people. All things being equal, I will prefer to support local uncles and aunties. Near my house, there are some very good hawker stalls for $4-$7 a pack. We support many times a week. I don’t think their margin is high but all stalls sold out daily.",
          "score": 6
        },
        {
          "text": "But it does make me wonder, why can’t local food carry that same perceived value too? People can still take photos, still hang out with friends, still enjoy the moment. Yet the moment it’s “just” a plate of noodles or fried rice, it’s seen as nothing special, espcially given how we grow up with the same type of food since young. Hawker-style food is usually fast and efficient, and the focus has always been on speed, flavour, and price. But if the same fried hor fun were served in an air-conditioned space, like a food court or casual restaurant, would people really be willing to pay $15++ for it? I think most people would demand more premium ingredients if so. Sometimes it feels like local dishes are judged by a different standard, even though the skill, labour, and effort behind them can be just as much (if not more). But of course, we are not here to compete with cafes/restaurants, but just showing an example.",
          "score": 6
        },
        {
          "text": "You are not in the cafe market segment so there’s no point comparing with those. The cafe is offering air con, interior decor, music, vibe, sometimes table service. The value proposition is different. Look at hawkers that charge what you want to charge. Some hawkers linked below. One sells a $20 prawn noodle, and the other $12 ckt. I’ve had the ckt myself and I enjoyed it. Very generous portion and in my opinion the value was there. What is it about their offering that makes people pay $$$. How about their margin and volume? Thats a business question I suppose you have to ask yourself if you want to consider moving up in price. https://maps.app.goo.gl/AvKyjub1MjWQGgZL6?g_st=ic https://maps.app.goo.gl/HkxBRbtpBU6UxmYk9?g_st=ic",
          "score": 6
        },
        {
          "text": "Valid point.. I assume the huge cost is due to rent and manpower if any additional people are employed.. the rents are exorbitant and average customer eating out daily cannot bear these additional costs..",
          "score": 5
        },
        {
          "text": "It’s because again, it’s not the food that is being sold but the experience Just as how name brands under the LVMH umbrella do offer pret-a-porter products, people will still line up to buy Berkin bags or luxury cars like Ferraris over a trusty Toyota The perceived value is cultivated in a specific way to make you want a specific product that they can then sell, and you will never beat them at this game so the easiest way to win is not to play Business 101 is to sell people what they want, marketing 101 is to sell people the idea of what they want so curate your product in that way Like you said, hawker fare is fast and efficient and the focus is on speed, taste, price. Thus people will not be willing to pay 7++ dollars for noodles when they can get it one stall over for cheaper, even if you promise premium ingredients or a high skill food because that’s simply not what they want to buy. Local dishes are indeed judged by a different standard, and I am not one to talk because I eat almost exclusively food from my local hawkers and coffee shops but I will say that the industry is now backed into a corner of rising costs and prices, yet still having to provide “affordable” fare that is also tasty and convenient. I do not envy your situation, and I wish you all the best, but if you want my very layman advice it would be to refresh your thinking and expand your advertising to stand out against the rest. Film content with the phone you already have, advertise your business through means that are available to you and it may level the playing field even just a little. All the best, and godspeed.",
          "score": 3
        },
        {
          "text": "Tasty food or excellent service and that’s generally true everywhere. For example. HDL’s food was quite trash but the people supported the business because the owner was willing to go out of his way to provide excellent service (cleaning customer’s shoes etc)  that eventually became the hallmark of HDL. Overtime their service standard drop due to aggressive expansion / cost cutting measure and business start dropping.",
          "score": 3
        },
        {
          "text": "I think it’s really amazing that you’re choosing to take over the family biz. I really respect that! My family also runs a small F&B biz and I’ll be the 3rd gen if I choose to take over. But similarly, it’s really too much physical work and hours so both my sibling and I have decided not to continue after my mum retires. We also face the same issues of rising rent and difficulties in hiring manpower. It’s sad that we’re losing our local heritage but the pain and challenges of keeping the family biz doesn’t seem to be something we wanna keep taking on",
          "score": 3
        },
        {
          "text": "I guess for me as a young adult, usually I would post instagramable food in a cafe or newly opened or hype up eateries. Likely people will to pay higher price for cafe food for ambience. I feel to get people to buy local food esp in hawker or coffee shop setting need a lot marketing effort to gain traction unless it’s 老字号 😅",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1qsv958",
      "subreddit": "askSingapore",
      "title": "Fresh grad salary negotiation - how realistic is it?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qsv958/fresh_grad_salary_negotiation_how_realistic_is_it/",
      "score": 63,
      "num_comments": 47,
      "created_at": "2026-02-01T18:41:30",
      "selftext": "Asking for a friend: My friend is a Year 4 student about to enter the workforce after graduation in May and has received a full-time offer in banking/finance, but the salary is below the NUS GES median.\n\nWanted to ask those who’ve been through this:\n\n– Is it common for fresh grads to negotiate their starting salary?\n\n– How receptive were employers when you tried (or did they shut it down immediately)?\n\n– Does this differ by industry, especially for banking/finance roles?\n\nWould appreciate hearing real experiences especially from recent graduates about both successes and “don’t even try” cases.",
      "comments": [
        {
          "text": "What does your friend have that is so special ? It’s so easy to rescind offer. If your friend doesn’t need the offer sure go try. Analyst programs are fixed. At below GES median it’s not FO role.",
          "score": 108
        },
        {
          "text": "It just comes down to supply demand. If you only have this 1 offer and really want a job, whatever price they lowball is the price. If you have options then, feel free. Generally there's no harm. The other thing about fresh grads is that likely there isn't anything tangible to negotiate against. You are mostly a blank piece of paper, same as your peers. You need to have something extra like \"oh I also have this skill which would be valuable\" or \"would you take into consideration the fact that I interned at xxx and that it would cost a shorter time to train me\" etc. \"This is not the market salary I read about\" just looks completely ignorant.",
          "score": 70
        },
        {
          "text": "Large firm have standard packages for analysts. Don’t act smart.",
          "score": 39
        },
        {
          "text": "The only way to nego is if your friend has a higher offer on hand. GES median is not a negotiating point.",
          "score": 36
        },
        {
          "text": "Btw I think median includes aws also, so please go check properly unless really lowballed by non sme",
          "score": 36
        },
        {
          "text": "Probably not realistic, given your friend still needs you to ask on behalf.",
          "score": 29
        },
        {
          "text": "Too many fresh grads think they are some big fucks because they graduate from local unis. I interviewed a couple of NUS and NTU students for a position about 5 months ago. One of them tried to nego for a salary of $5k when our budget for this position is $4.2k. He refused to budge stating that he has a lot to offer and even suggested that if his performance is stellar after 6 months of hiring, he demand his pay to be increased to his desired salary. I just noted to my manager that he failed the interview the moment he said that.",
          "score": 28
        },
        {
          "text": "What negotiation? Most grads barely have any work experience if any.",
          "score": 20
        },
        {
          "text": "If you think you’re top 5% in Singapore, then please negotiate. If not, it should be really hard.",
          "score": 18
        },
        {
          "text": "I think year by year, it's gonna be more difficult to negotiate salaries as a fresh grad because of the surplus of graduates (and the openness we have towards foreigners) so I'm really sorry my juniors 😢",
          "score": 16
        },
        {
          "text": "I conducted an interview last month and had a somewhat fresh graduate who said that he expected a minimum of $5k starting salary, permission to work part time on the side, and asked if he can \"try to work for 1 week to see if he likes the culture and environment first\" I kindly showed him the door",
          "score": 14
        },
        {
          "text": "Yes depends which stat used it may contain  aws and employer cpf Also, there’s plenty of grads, they will just go down the line .",
          "score": 12
        },
        {
          "text": "Lol fresh grad wanna negotiate?",
          "score": 11
        },
        {
          "text": "Neh he is the guy … he is asking for himself",
          "score": 8
        },
        {
          "text": "What I was trying to convey is that fresh grads need to tamper their expectations especially when it comes to salary. Majority of them have unrealistic expectations of wanting higher salaries for entry level jobs because of social media influences and other factors.",
          "score": 8
        },
        {
          "text": "Don’t even try",
          "score": 8
        },
        {
          "text": "Any negotiation runs the risk of the company rescinding the offer so proceed at your own risk",
          "score": 7
        },
        {
          "text": "Grad program? Lol zero room for nego. HR dulan, will just rescind the offer since there’s plenty of other candidates anyway. Simple demand vs supply.",
          "score": 5
        },
        {
          "text": "😥😂 Depends. Some of the quieter ones are actually pretty diligent and smart folks; just that they don’t express it upfront or out-front to others.",
          "score": 4
        },
        {
          "text": "Yes median includes not just AWS but all your OT/bonuses as well as your employer’s side of CPF contribution too on MOM. Really need to see properly lmao, the median is actually very low on average last I checked It’s around 3K take home(includes AWS and 17% employer side CPF) for age 25-29, which is the typical Uni student’s first few years in the work force. This is without considering any performance or CNY bonus too, those who do give them will lower the basic accordingly. So the actual median is around 3.2-3.4K base (take home 2.6K) assuming AWS + VB included in the package. Those without AWS and VB, please look for higher base pay or factor it in when looking at the overall remuneration",
          "score": 4
        },
        {
          "text": "Bro tot he had a unawakened sharingan. Lol I interview loads too over the years. The problem is they are instiable because they expect to be rewarded based on the effort they put in and not based on the result they bring . Even at 4.2 k I can easily get humble and talented fch ( means at least they are hardworking )  smu, nus ntu",
          "score": 3
        },
        {
          "text": "Yes, and now you know what the “Smokes and \nMirrors” on the Social Medias are doing to our \nYouths right? Pretty insidiously effective uhhh.",
          "score": 2
        },
        {
          "text": "Have you interviewed SIM grads? I’m wondering if there’s a difference in the way they communicate or think, or if it’s all the same between grads from these unis.",
          "score": 1
        },
        {
          "text": "Yeah so that’s even higher then ur monthly reality",
          "score": 1
        },
        {
          "text": "No? Both basic and gross monthly salaries in GES exclude all bonuses or cpf contributions, and I’m pretty sure AWS is excluded as well since it’s considered a bonus.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qt0qpk",
      "subreddit": "askSingapore",
      "title": "Leave windows open or sealed when away?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qt0qpk/leave_windows_open_or_sealed_when_away/",
      "score": 54,
      "num_comments": 47,
      "created_at": "2026-02-01T23:03:21",
      "selftext": "I’ll be away for 3-4 weeks a few times this year, and am worried about how to leave the house, to prevent issues like insects and mould.\n\nShould I leave the windows slightly ajar like 1 inch or as sealed as possible?\n\nIs it necessary to tape up all the drain covers and toilet bowls?\n\nEDIT: consolidating response and got some questions too.\n\n- close all windows unless you have known areas with condensation (if so, open windows to ventilate). toilet window can leave open to ventilate if definitely no rain or other stuff will come in\n\n- cover traps on the floor, add bleach to toilet bowl. should I also add bleach to the toilet water tank or will it damage the parts?\n\n- switch off all electricity points possible\n\n- leave as little in the fridge and freezer as possible. leave as little open food in the cupboards as possible (I think I may have to throw out the rice…)",
      "comments": [
        {
          "text": "Close all windows please. You never know the weather or what might come in. Switch off all unnecessary switches too.",
          "score": 198
        },
        {
          "text": "Just get one of those drain covers from shopee. Pour a bottle of bleach in the toilet. Plug up the sink. Close the windows completely ah. Otherwise, you come back got bird nest, bee hive, bats. All kinds of funny funny animals. Maybe snakes and monkeys if your unit is low enough. If your unit is old kind with the garbage chute indoors, better go tape it up. It only takes one hour of fumigation during that one month to turn your place into Hotel Roach.",
          "score": 102
        },
        {
          "text": "Leave the switch for fridge on. I read so many horror stories of people who were over zealous with switching things off when leaving for long holiday",
          "score": 89
        },
        {
          "text": "It is fine if you don’t cook or have near minimal stuff in the fridge but I doubt people plan so far ahead to empty their fridge before they leave overseas.",
          "score": 32
        },
        {
          "text": "I'll usually pour some bleach into the toilet bowl to inhibit anything from growing",
          "score": 27
        },
        {
          "text": "3-4 weeks not that long imo. Don't leave food lying around unless you wanna get new pets tho.",
          "score": 25
        },
        {
          "text": "Close. Open is how you get mold - learnt by accident in hall last time. Then just close your toilet bowl covers and turn off the water mains. Electrical you honestly don’t use much when not around so I don’t really bother.",
          "score": 24
        },
        {
          "text": "Here’s a checklist that we usually do when leaving for awhile. If you have someone to help air your place out now and then would be good too, but this has worked for us!",
          "score": 18
        },
        {
          "text": "Seal up. Leave it open who knows what comes in. Worse case scenario cigarette butt fly in and everything catch on fire. Close toilet bowl lid to prevent mosquitoes and odour. If no chute inside then nothing to worry, if chute has new sealing doors then just leave it. Close all doors and off breakers and water supply. Put towels to collect water from defrosting fridge (or do this ahead of travel).",
          "score": 18
        },
        {
          "text": "Leave some windows open for airflow. \nMay be toilet windows. Else you will get mould",
          "score": 13
        },
        {
          "text": "Stinky meats are one thing but it could get worse. My brother and family went away for almost a month and in the middle of that month, their fridge broke down without warning. My mum went into the house a few days later to bring in their mail and stuff and she said the smell was like someone passed away… but the smell was nothing compared to the drawers of maggots she found when she opened the fridge doors.",
          "score": 11
        },
        {
          "text": "off breakers and water supply. Put towels to collect water from defrosting fridge (or do this ahead of travel). So extreme? Wah",
          "score": 9
        },
        {
          "text": "Off water mains for sure. For electricity,  why noone want to keep it on so u have WiFi to watch your in home cam and door cams.",
          "score": 9
        },
        {
          "text": "No need so extreme seal ba. Unless normally your room got some sort of moldy smell. Just close windows, off water supply, keep toilet seat cover closed Last check on all electrical appliances off.\nNormally will keep wifi on for cctv. I will take out battery for robo vacuum off because I don’t want it to either get stuck somewhere or suck some stray wire hanging. Then empty the water tank later mosquito breed. Anyway the water only can last for 3-4 days for my house no point to keep it running.",
          "score": 6
        },
        {
          "text": "Seal everything up",
          "score": 6
        },
        {
          "text": "Second this. You need to leave windows open (where rain cannot come in). We left for 3 weeks once with everything closed and the bed and sheets all were mouldy had to strip everything down and deep clean the entire bed. Second time when we left for 3 weeks, we kept the bedroom window open and all good.",
          "score": 6
        },
        {
          "text": "Check if your fridge has a “vacation mode” like Samsung does",
          "score": 3
        },
        {
          "text": "Curious on why need turn off water mains? To avoid water leaking issues?",
          "score": 3
        },
        {
          "text": "Yeah mostly that, you don’t want something to fail when you aren’t around, water damage is terrible to fix. You can also turn off the individual valves if that is available for things like bidets for example, just that the main is much easier to catch everything.",
          "score": 3
        },
        {
          "text": "🤮",
          "score": 2
        },
        {
          "text": "If you close windows. And your neighbors on aircon. There will be condensation and this moisture will lead to mould. Having open windows and airflow allows the moisture to escape The other ppl that said close windows. May not have neighbors that on aircon long enough to lead to condensation.",
          "score": 2
        },
        {
          "text": "lol. Please don’t put bleach at toilet bowl. It will evaporate and the concentrated acid will damage your toilet bowl over time. I think you can’t trust Reddit. 🤣",
          "score": 2
        },
        {
          "text": "If it is for a long trip, you should empty your fridge. No fun coming back to a house to realise the power tripped and your once frozen meats are stinking up the freezer. Personal experience.",
          "score": 1
        },
        {
          "text": "Last thing you want is some appliances go haywire and either house on fire or flooded or just super expensive water bill. Come back pay bills for nothing, so rich ah.",
          "score": -6
        },
        {
          "text": "why? isn’t it fine if you remove everything edit: why did I get downvoted LOL, bunch of retards",
          "score": -39
        }
      ]
    },
    {
      "id": "t3_1qtlk9v",
      "subreddit": "askSingapore",
      "title": "Graduates/Alumni of NUS/NTU, do you feel connected to your alma mater after you graduated?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qtlk9v/graduatesalumni_of_nusntu_do_you_feel_connected/",
      "score": 46,
      "num_comments": 31,
      "created_at": "2026-02-02T12:46:22",
      "selftext": "My wife and I had this conversation the other day. She is from NTU while I am from NUS. We both graduated more than 20 years ago. Somehow, we both do not feel connected to our universities. We do not even consider that our alma maters.\n\nNot sure if this is strange, or just us. I do feel that, both NUS and NTU fail to shape an identity for the students, an identity that the alumni feel connected, or want to be a part of. And weirdly, I feel SMU does create that identity and their alumni are more connected. I am not familiar with SMU and I don’t even know many SMU graduates, it is just and impression.",
      "comments": [
        {
          "text": "As an alumni of both NUS and SMU, SMU does a far greater job in engaging its alumni. Not just in terms of asking for donations, but also networking opportunities, upskilling, nurturing young undergrads and alumni. NUS on the other hand, has mostly been asking me for donations since I graduated.",
          "score": 89
        },
        {
          "text": "I see many young working adults still wearing their 'Halls Of NUS' & 'NBS' shirts everywhere. Especially in the gym / running around the neighborhood.",
          "score": 23
        },
        {
          "text": "All emails. NUS did call me once a few years ago to seek donations. I asked if my donations can be directed to local students, they said cannot. That was the end of it.",
          "score": 22
        },
        {
          "text": "\"How many times have me and my uni classmates overlooked the XXX-giving email sent to our junk box every year...\"",
          "score": 15
        },
        {
          "text": "I stayed in one of the halls, made some great friends. So I guess it is more about the halls, the faculties, rather than the university itself…",
          "score": 12
        },
        {
          "text": "I don't think its a graduate of xx University issue to be fair. The moment I entered the working force and made new connections, those became more important in the present. If I still met people from my uni days on a weekly basis then maybe it would make me more connected to the memory of it. Ultimately, universities can't make that choice for you, its whether you want to be involved enough in the ecosystem to be connected.",
          "score": 10
        },
        {
          "text": "To prevent misunderstanding, I think what the university meant is that we don’t get to decide to whom the donations go to. That they will decide what/how to use the donations. Not that they will channel all donations to international students.",
          "score": 8
        },
        {
          "text": "its a two-way street. alumni needs to be feel that there's something to be gained by being connected. and univeristies need to gain something from their alumni (other than just donations)",
          "score": 8
        },
        {
          "text": "I graduated from ntu engineering 20yrs ago All I remember was that my cohort is more than 50% foreigners. All china indian Malaysian. Very obvious that Profs all favor the foreigners too Very hard to feel connected to them tbh Hopefully nowadays not so bad",
          "score": 8
        },
        {
          "text": "Nanyang University (Nantah) gradudates have the strongest connections in the world to their university....",
          "score": 8
        },
        {
          "text": "Agreed, and I kinda feel shameless of NTU to link themselves with Nantah alumni.",
          "score": 7
        },
        {
          "text": "Graduant from NUS (twice) and NTU (once). Worked in SMU for seven years and NUS for ten. Nowadays, I only  willing to occasionally wear NTU school shirt for a run (have long dispose shirts from NUS and SMU after my employment). There were some attempts for NUS to reconnect, mostly cos of the big celebrations in the last decade. Unfortunately, usually felt quite disconnected whenever I join those events, cos most of the faculty that taught me have retired or deceased. I would still proud to be known as an alumni of NUS though. Can understand why SMU is more serious about creating the identity. NTU though... I really didn't like the experience when more than 90% of the class is made up of PRC (postgrad level lah).",
          "score": 6
        },
        {
          "text": "Tbh at that time I really resent the govt and school for taking in so many foreign talents Use our tax money give them scholarship Every month few k and free lodgings and jobs upon graduation while locals like us have to struggle",
          "score": 6
        },
        {
          "text": "NTU does call alumni got donation too. Thankfully I change the phone number on my student portal to someone else's number.",
          "score": 5
        },
        {
          "text": "Those foreign students formed a home country association club which NTU does not recognised it. But they themselves still complain that they cannot integrate well into singapore.",
          "score": 5
        },
        {
          "text": "How do they do that?",
          "score": 4
        },
        {
          "text": "Most of them just see Singapore as a springboard to USA or Europe They're always saying how they would break bond etc and govt can't do anything to them",
          "score": 4
        },
        {
          "text": "My batch, overall batch, not just my course, got many PRC, Malaysian Chinese (some were from JCs here) and Mauritius.",
          "score": 4
        },
        {
          "text": "I stayed in hall for a year and i feel more connected that year, as compared to the rest of the years where it was mostly lessons and going off on our own ways pretty much. Graduated 15 years ago. Recent years when i go back for lunch, everything looks and feels so different, really don't feel connected to it lol",
          "score": 3
        },
        {
          "text": "If you value grad school, here's my perspective: not at all, and there's little to any effort done by the university to engage with you unless you're into finance or investment. Often asking for money, while the \"mentorship\" provided (at the time) was terrible. No support for grad students because the PI is god, even if the research output is subpar or non-existent. Unrelated, but it's quite shameful of some departments in one of the big two unis can't be bothered to remove faculty members from their website who passed away less than 6 months ago. Gives me the impression that the institution doesn't care about faculty as well.",
          "score": 3
        },
        {
          "text": "How come",
          "score": 2
        },
        {
          "text": "As alumni of both NUS and NTU, nah no connections after graduation!! I am not keen to be associated, slightly ashamed even, with all the sexual assault cases from NUS at one point in time too. Myself having experienced a close shave with a peeping Tom who was ultimately not disciplined in any way. And hall seniors behaving obnoxiously and childishly over hall rivalry. I do note that NUS asks me for donations more often.",
          "score": 2
        },
        {
          "text": "No because I never created any valuable IP that would want any of those uni to call me to stay in touch. ** Alma mater of big 3 uni btw.",
          "score": 2
        },
        {
          "text": "Intel now hiring Nantah grads?",
          "score": 1
        },
        {
          "text": "Not a misunderstanding. I get where they are coming from but I also want my money to go to a cause I believe in.",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qtj7qw",
      "subreddit": "askSingapore",
      "title": "Those who worked 11 month contract jobs in government institutions: How was it?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qtj7qw/those_who_worked_11_month_contract_jobs_in/",
      "score": 26,
      "num_comments": 24,
      "created_at": "2026-02-02T10:56:06",
      "selftext": "For context/background, I'm a fresh uni grad from 2025 and was in a local big 3 uni. Unfortunately, I was one of those who was somewhat unlucky and graduated without a job despite multiple internships and previous fulltime/parttime jobs (none of them rehiring), so I started working in a low level contract role while waiting for a proper offer in the industry I was looking at.\n\nOriginally, I was in the application process for a highly specialised fulltime gov role, and I passed all the interviews / assessments and was even given a conditional offer, but I failed the medical assessment due to a medical condition. Fast forward to today, and I was recently offered an 11 month contract in the industry I was looking at, and also have a senior title attached to my job title (together with the corresponding pay increase over a junior role in the same industry).\n\nWhile I have already accepted the offer (it's a no-brainer for my current situation, especially since the job title and high base pay gives me both working experience and bargaining power if I move on to another company in the future), I just wanted to know the experiences of other people who took up contract roles with the government, especially with regards to extension of contract or conversion to fulltime. Thank you!",
      "comments": [
        {
          "text": "Odd. First time hearing of a failed medical condition. Has to be very serious.",
          "score": 21
        },
        {
          "text": "Basically the role I was going for had the exact same visual acuity requirements as becoming a pilot (even though I wasn't actually applying to be a pilot) so I failed cos I have a chronic eye condition.",
          "score": 9
        },
        {
          "text": "Hi there, I took on a 12 month non-renewable contract job last year, same as you as I couldn’t find any job. (Decent pay) Currently in my 10th month, leveraged on my current role & found a perm job in private sector. (A slight increase in package) Despite forfeiting potentially some completion bonus, I decided to leave the Govt role as the other company couldn’t wait for another 2 months. But I am lucky the other company compensated in some forms.",
          "score": 7
        },
        {
          "text": "Yep ATCO. I was honestly very upset I did not get the role cos of a medical condition I have no control over, especially since it fulfilled my requirements of being an extremely stable job with guaranteed career progression (everyone in the ATCO hierarchy, including up to director level, has to start as an ATCO).",
          "score": 6
        },
        {
          "text": "Wild guess. ATC?",
          "score": 5
        },
        {
          "text": "contract roles with the government, especially with regards to extension of contract or conversion to fulltime this depends on whether you are a casual or a perm staff. seeing as you have a 'senior' title it is very unlikely to be casual role for perm staff, conversion depends on two things:\n1) whether there is estab to put you on a perm role\n2) whether your job performance warrants putting you on a perm role, and thus your superiors help fight for you 1) is far more important than 2). If there is no estab it doesn't matter how good you are, conversion is impossible unless your div works on a 'musical chairs' system whereby perm staff hop around on contract positions despite being full-time employees. this happens in divisions who get their headcount mainly through RF instead of central pool (for e.g. research divs who get headcounts only for short term research projects, and the headcounts are not renewed after unless there is a new proj coming in)",
          "score": 3
        },
        {
          "text": "you are misunderstanding what contract and perm staff mean in gov context. there are basically three kinds of roles:\n1. casual (contract)\n2. perm staff (contract)\n3. perm staff (perm role) Your contract role is the second kind. You can be perm staff not sitting on a perm role, which would require your contract to be renewed every time it is up. not every role can be perm (e.g. research roles on a project basis, SWEs for gov projects to babysit vendors); typically only central functions are like that. you would know best whether the role you are being hired for is a central function or not. why they aren't looking for an actual perm staff to fill the role lol you are a perm staff, just on contract. there are two kinds of contract, perm contract and RF (reinvestment fund) contract. for 11 months it is not the perm contract type, since those are 2 years. to move from contract to a perm role, your div needs to have a perm role estab to put you on (this is known as 'emplacement to permanent establishment'). typically, when hiring for perm roles, the person is put on an initial 2 year contract (this is the perm contract), and with good performance, has the potential to be emplaced to the perm role permanently (thus moving from contract -> perm role). your role is likely an RF role (that's why 11 months only; this means that they only have secured funding for this role for 11 months). after this RF contract expires, they have no cost centre to pay your salary and will need to let you go unless the RF contract can be renewed. if you perform well, they may find some other perm role to move you to (contingent on the division being able to expand its estab). You can read your contract to confirm whether it is RF or perm - perm contracts have a clause \"potential to be emplaced to permanent establishment, depending on performance\", something like that. RF contracts do not have such a clause because there is close to zero potential to be emplaced on a role that is inherently not permanent.",
          "score": 2
        },
        {
          "text": "my contract is going to come from an external manpower agency ah, if that's the case, then actually your role is very likely to be casual. (one of the ways ministries sidestep perm estab restrictions is by hiring through a holding company, like BGC. these are where all the casual roles are held.) if that's the case, internal gov staff passed your details to the holding company so that they can contract you without using any of their estab at all. unless the manpower agency you are referring to is VITAL (which is actually a gov one, not external), in which case all's good!",
          "score": 2
        },
        {
          "text": "I took an 11.5 month contract recently during mid 2025. Benefits were much lesser compared to the other employees (less AL, medical coverage, no bonus, no wfh, etc.). The basics were good for the industry I was in. Started job hunting 1 month into the job because I couldn't stand the \"third class\" treatment compared to the full time employees. I landed in another gov agency 6 months into the contract and left asap. Pay was good since the agency based my package on my basic instead of annual.",
          "score": 2
        },
        {
          "text": "Being discriminated against sucks. Was it just your department, or did u manage to observe it company wide? Cos if it's company wide, that's really worrying. The company that I just left treated its temp contract staff really really well. Also, did the other gov agency ask u why you were leaving your original contract role early?",
          "score": 2
        },
        {
          "text": "Yeah experienced the same treatment as you for contract staff. The irony is they are the ones who keep hiring yet don't want to treat us equally lol 🤣",
          "score": 2
        },
        {
          "text": "Once contract forever contract Liao Just a joke.. wish you the best ahead",
          "score": 2
        },
        {
          "text": "Thx man. 2025 was a terrible year for me (literally everything possible went wrong except for one single thing), so hopefully this is a step towards something better.",
          "score": 2
        },
        {
          "text": "Did your contract company ever indicate an intention to extend ur contract or convert u to fulltime when it got closer to the end of ur contract?",
          "score": 1
        },
        {
          "text": "Nope, in the interview they told me they will not renew regardless, if need be, it will be a new contract (end today, start next 2 day kind). But as of now, I have no intentions to continue the contract as I find the new job’s JD more interesting. However I loved the people at my current job, sadly there wasn’t much progression & work is mundane.",
          "score": 1
        },
        {
          "text": "Yea I literally have a \"senior\" title affixed in writing to my job title itself, and the pay is much higher than a regular contract role in my actual industry, so honestly I'm not sure why they aren't looking for an actual perm staff to fill the role lol. Funnily enough, I originally applied for the GRIT traineeship with this gov institution, but then they reached out to me with this role on their own initiative, so it feels even less like a regular contract role lol.",
          "score": 1
        },
        {
          "text": "Thx for the detailed writeup! I did read about the estab part previously when doing research, and I understand what you mean regarding the perm staff (contract) and perm staff (perm role) part. I also believe my role shld belong in the perm staff (contract) category you mentioned, and I'm going to be part of a team doing something that occurs consistently on an annual cycle on a nationwide basis, so it feels like a central function too. The only part causing me doubt is that my contract is going to come from an external manpower agency, even tho I did not apply externally and I was also contacted by internal gov staff. Can't really go into more details cos I risk doxxing myself. When the contract reaches me (i only just accepted the offer, so the contract is still under preparation) I will keep a look out for the clause you mentioned. Thanks again for ur help!",
          "score": 1
        },
        {
          "text": "Very very interesting. I will take note of this and keep a lookout for the things you have told me then. I do know that the role I was scouted for was posted on careers@gov, if that makes any difference lol.",
          "score": 1
        },
        {
          "text": "The discrimination is more policy-related rather than work-related. The contract staff were exempted from department lunch, townhall and network sessions with the higher management despite doing the exact same work as the other staff. Yes! I just told them it was a temporary contract for 11.5 months and I wasn't questioned any further.",
          "score": 1
        },
        {
          "text": "Ohh very interesting. They must have somehow decided internally that u wldn't be a flight risk despite cutting contract earlier. Thx for answering!",
          "score": 1
        },
        {
          "text": "Took similar 11 months contract role with ministry. Used that to try and pivot quickly to a full time role outside. From working within, I could tell the role was both not worth the pay nor was there prospects for extension and conversion given my superiors I was working within were rather toxic, my workload was overloaded on its own and I needed to pick up the slack of work by the regulars who couldn’t complete their own share of work which exasperated my toxic superiors (so already wasn’t helping) and that it was strictly project basis, project was going faster than expected with some of my help and that because I was expediting the process, I lowkey lowered my own chances for any form of extension (lol). Pivoted out only 3 months on that job, very happy and never looked back.",
          "score": 1
        },
        {
          "text": "When you pivoted out, did the next company match ur contract pay or offer u a higher amount? Did they also question u a lot on why u were cutting contract early?",
          "score": 1
        },
        {
          "text": "It is what it is in this industry as a pilot/ATCO whether civilian or RSAF. Like it or not, your career is in the hands of medical professionals who can one day turn off your career. I chose to walk away from my childhood dream and am in a much better place now lol.",
          "score": 0
        },
        {
          "text": "Wow that means urs is one of those \"temporary headcount for a certain period of time\" position.",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qtigd6",
      "subreddit": "askSingapore",
      "title": "Why do so many singaporeans prefer to go overseas for beauty treatments?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qtigd6/why_do_so_many_singaporeans_prefer_to_go_overseas/",
      "score": 27,
      "num_comments": 41,
      "created_at": "2026-02-02T10:22:17",
      "selftext": "I’m genuinely curious why so many people choose to do skin treatments overseas instead of here. Some say it’s cheaper even after flights and hotels, which honestly makes me wonder how is that possible? and is it actually safe and worth all the journey?\n\nI have friends who go to JB for facials quite often since it’s cheaper and lately it feels like more people I know are flying to Korea or Thailand for botox or surgery. Personally, I’ve always done my treatments here (facials, skin tightening, etc) since it’s easier for monthly maintenance, but it feels like more people rather doing it overseas instead…\n\nFor those who’ve tried aesthetic treatments overseas before, was it really worth the time and effort compared to just doing it in sg?",
      "comments": [
        {
          "text": "For me? I absolutely hate PACKAGE AND HARDSELL. I once did a laser in SG for $1K per session. But I refuse to even sign a package for $888 for 10 sessions of Q switch laser. But unfortunately these local aesthetic places just don’t care if you’ve the money or not, they just want to lock you in. So ya I will spend the money to fly and stay in a lux hotel and spend $2k-$5k for a treatment (that could cost 2X more in SG) and come back happy.",
          "score": 86
        },
        {
          "text": "Yes, I do my aesthetic treatment overseas e.g JB. Price is half that of Singapore for acne scarring treatments and the standard is very marginally different. Singapore aesthetic provides better before and aftercare, but results both the same imo. In Thailand BKK, you can even get them cheaper and the standard is also really very good, and their body sculpting is rather good and cheap from what i heard. In korea, filler, RF Microneedling are literally cheap af, it is so common there and prices for fillers can be $150-200 SGD while in SG might be $600-800 for the same brand per syringe (2cc)",
          "score": 35
        },
        {
          "text": "The hard sellers turned me off ever getting a facial in a spa here. I don’t know how anyone can say these are relaxing. I get so annoyed and the hard selling leaves a horrible taste in my mouth. I would be happy if they all shut down. Realistically, what’s needed is better training for the providers and more punishment for the companies who engage in such practices. Until then I’ll just chillax with my sheet mask and be happy.",
          "score": 31
        },
        {
          "text": "It’s cheaper and you’ve got better services ;)",
          "score": 27
        },
        {
          "text": "10x better service, better outcome, 50% of the cost. Still have so much extra $$ left to travel n have fun in Seoul and Bangkok after. No brainer.",
          "score": 10
        },
        {
          "text": "yes it's cheaper even after the flights and hotels. u don't go overseas just to do ONE botox treatment. you'll do a cocktail and also travel while at it.",
          "score": 9
        },
        {
          "text": "better quality and cheaper, simple",
          "score": 7
        },
        {
          "text": "It's like \"agree\".............",
          "score": 6
        },
        {
          "text": "depends on how much you value your $ and whether there are other things you want to do overseas. for me i won't go to jb for the sole purpose of skin treatments cos the cost and time to go not very worth. but if I'm already planning to go to jb and spend the day then why not throw in the treatment and save some $$? or they're just really rich so they don't mind seeking better quality treatment for less $ outside SG",
          "score": 6
        },
        {
          "text": "Its not only cheaper or same price as flight + hotel, or just flight with daytrip, its more value for money, better service quality and no hardsell.",
          "score": 5
        },
        {
          "text": "Ditto, the moment anyone begins to hard sell, i make a mental note NEVER to come back and to warn my friends about the hard-selling. :(",
          "score": 4
        },
        {
          "text": "What's your recommendations for jb aesthetic treatment clinics?",
          "score": 3
        },
        {
          "text": "Expensive\n很贵\nMahal\nவிலையுயர்ந்த",
          "score": 3
        },
        {
          "text": "I understand if its just JB, but after all costs are tabulated (including lodging and flight), are the prices still comparable if done in bkk or sk, for those that have done them?",
          "score": 3
        },
        {
          "text": "I tried to permanent laser hair remove the left over hair on my head. The clinic quoted the complete package pricing to be 25k SGD. They have never done laser hair removal on someone’s head before. I got the pricing from a reputed clinic in Miami that has multiple videos of the procedure done and they qouted me 150 USD per session and a total of 6-10 sessions. Both clinics use the same exact laser.",
          "score": 3
        },
        {
          "text": "Do you have recommendations for JB aesthetic clinics that you saw good improvements progressively after facials and skin treatments. Can drop a list of clinics if you have here. I am looking for a good place. I went to skinwork at JB previously, it's ok only (just for hydration) not good in terms of improvement to skin",
          "score": 2
        },
        {
          "text": "Hi, I have went multiple in SG and in JB. For context, my concern were mainly acne scarring, instead of hydration (which can be in tandem). I can share my experiences below For Singapore, I previously went to Radium in Suntec i think 4 years back which was super pricey, did a combination of subcision + RF microneedling (Secret RF), 3 sessions for around 4,500 SGD and that was for partial face, because I had a tight budget. I felt that because of the lack of fillers, after subcision, my scars fibrous bands retethered, and the RF micro needling which is super expensive did not much. I would say only 10% improvement. Then I decided to go JB for aesthetic treatments, I have done Dr Chong in Bukit Indah Outlet, which I did subcision + filler, I cannot remember which filler, but I think it was Profhilo. So the idea of acne scars is, if you are tethered scarring, it is vital to add a kind of filler to prevent the scars for reattaching, I cannot really remember the price, I believed it was $2000 SGD for three sessions. I thought the improvement was really good for this. I moved to Clinic RX (Mid Valley) recently and was rather fuss-free. They had sales person and all  but they provide credits and all with great deals. I purchase around 10,000 RM of credits on my own accord (I mean in SG, you cant get much with around 3,200 SGD). I was able to get 2x filler + subcision sessions (Each session was 2 syringes of 2cc Juvederm) which in SG will be double the pricing) and threw in 2x Fotona sessions and 2x exovive with I think 300 SGD of credit remaining. In this kind of cases, you can ask them throw in free stuff like a treatment that you want, and the sales person will most likely agree, because they need to hit target and please never accept their first offer. In terms of consultation, doctor consulted suggested subcision and filler first for level my scars which was what I want instead of expensive RF microneedling from the start, so I thought that was a plus point. In terms of result, I think I had very great improvement, around 30% improvements which is really great after the treatments, as mentioned, don't expect the aftercare to be similar to SG, the process is fast, doctor comes in does the procedure and leave you to the nurse and probs won't check back during the aftercare. If you are looking for clinics for acne scarring, always ask the doctor to assess what kinds of scars you have rolling/tethered/ ice pick/ boxcar during the consultation. If they suggest an RF microneedling (most expensive) from the start, if your scars are tethered or lots of ice pick, dont continue on with the clinic. What I would suggest for first-timers is to take a mirror, look at your scars, and search online what kinds of scars do you have. You can always compare online so easily. Once you go for the consulation. Always go for the cheaper ones first, subcision, TCA cross. Once your scars are levelled, then consider RF micro needling/ CO2 laser for the resurfacing.",
          "score": 2
        },
        {
          "text": "Hi, I answered in the thread",
          "score": 2
        },
        {
          "text": "Yeahh.. aesthetic medical treatment in JB is just as good as Singapore at a fraction of the cost.. and if you have to do multiple sessions its literally just a bus ride away..",
          "score": 2
        },
        {
          "text": "Hello, can I know which clinic you recommend in jb for acne scarring",
          "score": 2
        },
        {
          "text": "Hi, I answered in the thread",
          "score": 1
        },
        {
          "text": "Word.",
          "score": 1
        },
        {
          "text": "Agree with cheaper and better quality. I know 3 guys that did hair transplant in SG, BKK and Malaysia. The one with the worst result did his in SG at the highest price also.",
          "score": 1
        },
        {
          "text": "More money than logic. Respect",
          "score": -8
        },
        {
          "text": "What word ?",
          "score": -16
        }
      ]
    },
    {
      "id": "t3_1qteso3",
      "subreddit": "askSingapore",
      "title": "Anyone else smelt haze on 1/2 night and 2/2?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qteso3/anyone_else_smelt_haze_on_12_night_and_22/",
      "score": 28,
      "num_comments": 18,
      "created_at": "2026-02-02T07:42:53",
      "selftext": "Smell in the East/Northeast seems to be worsening since last night, even can smell it in the kitchen and toilet. This morning the sky is rather clear, PSI is low moderate but smell still lingers quite significant. How's the situation in your area?",
      "comments": [
        {
          "text": "Northeast area smells so bad. I am having dry eyes",
          "score": 26
        },
        {
          "text": "It's actually from Johor this time",
          "score": 11
        },
        {
          "text": "Went to Pasir Ris/DTE ystd in the morning, almost died from the haze.. I stay central south, still got smell ystd till this morning but more comparable compared to Pasir Ris/DTE.",
          "score": 7
        },
        {
          "text": "West also can smell",
          "score": 6
        },
        {
          "text": "Bad. Throat is scratchy and eyes sting.",
          "score": 5
        },
        {
          "text": "Serangoon. The wind has been strong over the past nights, carrying this smell. There is something in it, which irritates my nose.",
          "score": 4
        },
        {
          "text": "Central yes have.. smelt it when I woke up but I don’t smell it anymore",
          "score": 2
        },
        {
          "text": "my nose so clogged i cant even smell shettttttttt",
          "score": 2
        },
        {
          "text": "Ok I’ll email Mahatir instead thanks for the tip",
          "score": 2
        },
        {
          "text": "it's also used correctly here though",
          "score": 2
        },
        {
          "text": "You should use AQICN for more accurate figures if you have not. And yes the smell is still around. According to the website the PM2.5 is forecasted to get worse next few days but I am not sure how true it is. Just get ready your air purifiers if you have it.",
          "score": 1
        },
        {
          "text": "Yes, Bishan area got",
          "score": 1
        },
        {
          "text": "East was bad from Sat to Sun evening. Felt like someone was burning hell notes right outside the house. Sinus was damn congested on Sun. By evening, the smell wasn’t very noticeable.",
          "score": 1
        },
        {
          "text": "Yes, I can smell it very strongly outside my aircon room",
          "score": 1
        },
        {
          "text": "Northeast area, the smell is on-and-off, with strong wind. My nose is running 🫠",
          "score": 1
        },
        {
          "text": "River valley area smell quite strong yesterday night",
          "score": 0
        },
        {
          "text": "Central area, I feel like sending Indonesia an email to thank them for clean air for the last few months but not for these few weeks",
          "score": 0
        },
        {
          "text": "Smelt is a fish…",
          "score": -1
        }
      ]
    },
    {
      "id": "t3_1qstg7s",
      "subreddit": "askSingapore",
      "title": "NHG Management Associate Programme",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qstg7s/nhg_management_associate_programme/",
      "score": 26,
      "num_comments": 2,
      "created_at": "2026-02-01T16:57:30",
      "selftext": "Hi everyone, just wanted to understand more about this position if there's anyone in this programme currently or have done it before!\n\nWhat's the live after these 2 yeara like in terms of career progression?",
      "comments": [
        {
          "text": "Upvote to remind me to come back for the commentsss",
          "score": 9
        },
        {
          "text": "it’s not a bad programme, i know a few people doing it. your home institution matters quite a fair bit. you will graduate as a assistant manager and can continue as management executive and fellow if you wna climb at the career ladder else u can sty in ur perm role as assistant manager. pm me to find out more :))",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1qt1a0w",
      "subreddit": "SingaporeRaw",
      "title": "Lee Kuan Yew was mentioned in the Epstein Files",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qt1a0w/lee_kuan_yew_was_mentioned_in_the_epstein_files/",
      "score": 285,
      "num_comments": 46,
      "created_at": "2026-02-01T23:24:00",
      "selftext": "Dunno what it means, wouldn't overthink it. Meeting probably wasn't official since dates don't match with the news. Interesting to see his indirect affiliation with Jeffrey Epstein through Peter Mendelson.\n\nWas gonna post this onr/Singaporebut my karma requirements don't meet. 🫩 By the time I get that karma, this would be old news.",
      "comments": [
        {
          "text": "<image>",
          "score": 205
        },
        {
          "text": "So Peter Mandelson telling Epstein, he just had dinner with LKY. And LKY could help him in china. Seems like nothing much really. I would be big if LKY himself is communicating with Epstein.",
          "score": 143
        },
        {
          "text": "Dont know why this guy is bragging about having dinner with an 86 year old LKY at the time.",
          "score": 98
        },
        {
          "text": "<image>",
          "score": 83
        },
        {
          "text": "Back then LKY forged pretty close ties with China. Angmos want to get in on the action. But China don’t like them. So use LKY connection to get in. Nowadays.. China don’t give a damn about us liao.",
          "score": 82
        },
        {
          "text": "Epstein case feels like the surface of the iceberg for the many unethical horrendous stuff elites have done... He's just the mule for them",
          "score": 78
        },
        {
          "text": "True, wrote that in the desc. He's already over 80 then, don't think he would even bother to link with Epstein. More than likely, the discussion was just business and Lee Kuan Yew wasn't in the know.",
          "score": 42
        },
        {
          "text": "Dont think too much lah.",
          "score": 39
        },
        {
          "text": "Link for the curious:\nFind an existing link to the epstein files through the USA justice website,\nChange the Data Set to 9,\nAdd the file code /EFTA00744404.pdf. This was really hard to find manually so using the URL would be easier",
          "score": 38
        },
        {
          "text": "China is never friends with anyone, not even amongst their own kind They only friends with one thing: money",
          "score": 34
        },
        {
          "text": "He was a famed financier, realistically he will interact with a ton of important people. Can't be anyone including janitor and cab driver that talked with him is guilty right.",
          "score": 26
        },
        {
          "text": "and some sinkies still think china is our friend....🤣",
          "score": 23
        },
        {
          "text": "This means nothing lah aiyo. LKY was a very important world leaders and epstein was connected with billionaires, at that level being connected to world leaders is practically normal thing. It would be like the quality of your second degree connection would be different if you are a C-suite vs if you are an intern.",
          "score": 22
        },
        {
          "text": "The unethical horrendous stuff is to keep everyone silent and helping each other. Nothing short of a great purge of these sickos would change anything.",
          "score": 21
        },
        {
          "text": "Because to Western political operators LKY was THE China Whisperer.",
          "score": 20
        },
        {
          "text": "And power.",
          "score": 15
        },
        {
          "text": "Another fucking nothing burger news.",
          "score": 14
        },
        {
          "text": "you sure? even stephen hawking still can have fun  on the island while on his robot wheelchair",
          "score": 10
        },
        {
          "text": "prince of darkness conversing with harry. what's new.",
          "score": 6
        },
        {
          "text": "Yup. Just wanted to share because it's not every day your leaders get a mention in a controversial file set 😂",
          "score": 6
        },
        {
          "text": "he was more than just a \"financier\"",
          "score": 4
        },
        {
          "text": "Sounds just pure business",
          "score": 3
        },
        {
          "text": "Butu/kongweeneverdiesays we need to bow down and import more prc because they’re superior in culture and intellect than Singaporeans. How?? WE must kotow and go out of our way to friend them!",
          "score": 2
        },
        {
          "text": "And ideology",
          "score": 1
        },
        {
          "text": "He was a felon after his conviction in 2008 for “of procuring a child for prostitution” LKY keeps odd company",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qtfly3",
      "subreddit": "SingaporeRaw",
      "title": "Epstein files shows them recruiting from Singapore and accompanied by Singapore girls",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qtfly3/epstein_files_shows_them_recruiting_from/",
      "score": 175,
      "num_comments": 61,
      "created_at": "2026-02-02T08:17:04",
      "selftext": "https://www.justice.gov/epstein/files/DataSet%209/EFTA00742231.pdfhttps://www.justice.gov/epstein/files/DataSet%2011/EFTA02460666.pdfhttps://www.justice.gov/epstein/files/DataSet%209/EFTA00383843.pdf",
      "comments": [
        {
          "text": "What was ever scary was how in the files it was mentioned that Trump is actually working under the control of mossad and israel",
          "score": 226
        },
        {
          "text": "Don't say that here, bro. A lot of people here gonna downvote you on that considering how pro israel they are lmfao 😂",
          "score": 139
        },
        {
          "text": "Epstein had his hands in everything. Really mind blowing. And he still somehow managed to find time to play WoW. Wow.",
          "score": 106
        },
        {
          "text": "How about a foto with some ppl we know. <image>",
          "score": 76
        },
        {
          "text": "Giving you both upvotes to cushion the impact",
          "score": 49
        },
        {
          "text": "I appreciate it a lot, bro. 90% of these people here are super pro israel even after you show evidence of how fucked up them 🥷 be",
          "score": 42
        },
        {
          "text": "He was a fixer who did everything. Not sure why they focus on his pedo tendencies.",
          "score": 23
        },
        {
          "text": "Our president has the look of this guy is giving the creeps. Note to himself: reject any opportunity to be PM. GCT is way too comfortable here /s",
          "score": 19
        },
        {
          "text": "Thats why they are called cattle 😂",
          "score": 19
        },
        {
          "text": "Wa bill Clinton also standing up! Epstein really was da man",
          "score": 13
        },
        {
          "text": "Aka brainwashed. White worshippers",
          "score": 13
        },
        {
          "text": "Israellis aren't white tho And Israel is nuanced for Singapore, cause they are pretty much deep friends with us thanks to the SAF formation days It's why we are still as close as we are to the Brits in some areas, we don't forget who helped us",
          "score": 12
        },
        {
          "text": "Trvth nvke",
          "score": 6
        },
        {
          "text": "I literally am Singaporean.  When you said they are waking up, fuck tons of them months ago loved to argue for them lol, majority of em here",
          "score": 6
        },
        {
          "text": "Unfortunately they are, under the pretext of \"pro Zionism\", which I have to say is a poor understanding of 'Israel'.",
          "score": 6
        },
        {
          "text": "Same thing tbh. Same people who control the central banks, the media.",
          "score": 6
        },
        {
          "text": "Why would he be down voted by supporters of Israel? They'd be proud that Israel has that much influence.",
          "score": 5
        },
        {
          "text": "r/israelexposed",
          "score": 3
        },
        {
          "text": "Yeah but inb4 someone gonna call you out on that 🙄",
          "score": 3
        },
        {
          "text": "Oy vey",
          "score": 2
        },
        {
          "text": "For anyone that is interested in what this post is about: https://x.com/lulex/status/1740967132702425437",
          "score": 1
        },
        {
          "text": "they ARE white. transplanted to ME",
          "score": 1
        },
        {
          "text": "They gonna blame it on Hamas regarding this. Mark my words",
          "score": 1
        },
        {
          "text": "It's a very 🧃thing to manipulate numbers, just sayin’ you know?",
          "score": -1
        },
        {
          "text": "Nonsense. 90% of Singapore is pro-israel ? Do you even live in Singapore? Are you even singaporean ? Its probably 15% of Singapore pro-israel at most. And that number is dropping. Singaporeans are not stupid. We are waking up.",
          "score": -9
        }
      ]
    },
    {
      "id": "t3_1qsw6d5",
      "subreddit": "SingaporeRaw",
      "title": "Wake-up call for toxic workplace",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qsw6d5/wakeup_call_for_toxic_workplace/",
      "score": 174,
      "num_comments": 49,
      "created_at": "2026-02-01T19:34:21",
      "selftext": "Lowkey was hesitating to post this here but after seeing all the tea about the ppty scandal i realized i’m basically living a version of that nightmare.\n\ni’m a young recent fresh grad (F), worked at this boutique marketing agency near Marina One for about 8 months. Most on the outside thinks the office is so vibey and family culture because my boss (Early 40s M, married) is always posting those cringey hustle quotes and team bonding reels on IG. But behind the scenes? it’s actually a pretext for spending extra time to flirt with young ladies.\n\nBecause i’m \"TikTok-pretty\" (his words not mine), I was shoved into every client meeting and networking dinner since day 1. At first, i thought i had pretty privilege and was getting ahead but i realized quickly i was just there as office decor. My manager has been mentoring me by sending me late night tele messages asking about my career goals and inviting me for 1-on-1 drinks at 10 PM. When i started making excuses to not go, my workload suddenly became impossible and he even CC-ed HR on a tiny typo just to warn me.\n\nBut what really hurts is the senior women in the office, instead of helping me, i heard them in the pantry calling me a diversity hire and saying i only got the job because of my pretty face. Nobody stood up for me even when a guy is clearly being a creep.\n\nSeeing the ppty scandal news about the cheating and toxic power dynamics made me feel physically sick. it’s the same thing, these male leaders using their status to groom fresh grads who don't know any better.  The family branding is just a cover for them to act like they own us. The final straw was last Friday when he told me i should dress more cute an feminine for a pitch because the client likes that aesthetic.\n\ni’m going to tender next week as i so tired of being treated like a pretty trophy. If your office feels like a high-SES cult and the boss is too chummy, please just run. it’s not worth your mental health.",
      "comments": [
        {
          "text": "Think about it: The reason those seniors have stayed inside the company long enough to reach senior status instead of leaving earlier just shows that they are aware and don't care about such behaviour of the boss. You're most likely not the first who have been put in such a position, and they probably have also watched and gossiped about previous ones without trying to help in any way. They're probably also salty about not being the chosen ones despite being of the same gender. You don't have to feel bad or hurt about not having any support there at all. Don't need to bother about the gossip of such people. They're of the same shade as the boss and not worthy of your time or energy.",
          "score": 76
        },
        {
          "text": "Hate to break it to you but women will always be favoured because of youth and beauty. Why you think cabin crews are mostly women? Why do you think front desk receptionists are always women? Why do car shows have female models?",
          "score": 44
        },
        {
          "text": "Thanks for this... i never thought about it that way but you’re so right. The fact that they’ve stayed there for years while seeing all this happen and just condone their creeping behaviours of male bosses.\ni remembered we had this sweet and bubbly ntu intern who only lasted 3 weeks before she quit. Back then, the bosses were saying she was weak and couldn't take the pressure, but afterwards some of us realised she probably quit because the supervisor was doing the same creepy shit to her like asking her out after working hours and she was smart enough to run early.",
          "score": 29
        },
        {
          "text": "i am in marketing myself and at director level. i guess ur company must be damn small... the part abt asking u to go see clients cus ur pretty...well that's a sad fact of life in sales and bd...i personally wont do it but everyone knows this trick... the whole thing about what 10pm meetup and what career goals thats very obvious he wants to leverage his position to sleep with u. thats way across the line. report this to HR and in fact speak to a laweyer on this. dont just resign quietly. share this with the whole office for gossip.",
          "score": 28
        },
        {
          "text": "Thanks for the advice, but tbh my company is a typical SME... HR director is literally the boss's sister. So reporting him is just reporting him to his own family lol. Totally pointless.\ni get the pretty girl sales tactic, but it went way overboard for me. i gym quite a bit and it’s like he thinks that gives him a free pass to make suggestive remarks? He made remarks about my figure and how he stared at my glutes during a pitch while telling me that i should wear tighter skirts to close the deal. It’s actually nauseating. The 10pm meetups were another red flag for me to quit. I want to walk away with my dignity and never see his face again.",
          "score": 23
        },
        {
          "text": "Check the glassdoors always. Don’t walk into a scam.",
          "score": 13
        },
        {
          "text": "Ok.. but what’s the relevance to OP’s post though? Seems like she’s facing completely unacceptable and unprofessional behaviours ( e.g. creepy comments, being retaliated after rejecting late night drink invite etc) from the people at her workplace and obviously feeling uncomfortable about it leh Nobody should have to deal with this, regardless of gender To OP, pls run from this kind of workplace ah, it only gets worse",
          "score": 13
        },
        {
          "text": "Bait him into making a move on you then report the evidence to MOM for sexual harassment",
          "score": 12
        },
        {
          "text": "I am the only guy working in my team at MBFC , my colleagues and boss are all women. Now i am getting pushed out because my boss doesnt like me anymore and is picking at me for every error possible and i kena bully and micromanaged by those aunties in my team. But what to do i need the job until i can get out of this shit hole. This is power abuse and harassment but HR dont care",
          "score": 11
        },
        {
          "text": "You are right, and that’s the most exhausting part. i've known this reality since i was a teenager. Growing up, some may discredit your hard work, because you're aesthetically pleasing to look at. It’s sad because pretty privilege feels like a shortcut until you realize it’s actually a trade-off. You get things easily, but you lose the respect of your efforts. The moment you step into the room, you’re already fighting the stereotype that you’re are front-desk material, hired because you look good and smile well. i didn't ask to be favoured for my youth and looks. i asked for a career where i could grow without being looked at as a just a pretty marketing face. Being office decor isn't a privilege when it comes with a shelf life and constant harassment. I know people think we should be grateful for it, but it’s also a burden and derogatory to be a labeled as a pretty vase.",
          "score": 11
        },
        {
          "text": "Not MOM, Police is the place!",
          "score": 10
        },
        {
          "text": "Lol you were happy to have pretty privilege when you thought you were getting ahead and now you're complaining. Okay",
          "score": 10
        },
        {
          "text": "I am the only guy working in my team at MBFC , my colleagues and boss are all women. Now i am getting pushed out because my boss doesnt like me anymore and is picking at me for every error possible and i kena bully and micromanaged by those aunties in my team. But what to do i need the job until i can get out of this shit hole. This is power abuse and harassment but HR dont care HR only protects the company's interests",
          "score": 8
        },
        {
          "text": "family culture It's a major red flag for a company that says this. You are at the boss's mercy regardless whether you're at work or not.",
          "score": 8
        },
        {
          "text": "join a big ad agency like havas publicis these things wont happen there they are usually v professional",
          "score": 6
        },
        {
          "text": "Evil.. But I like it.",
          "score": 6
        },
        {
          "text": "my boss (Early 40s M, married) is always posting those cringey hustle quotes and team bonding reels on IG Wtf",
          "score": 5
        },
        {
          "text": "most guys manager hire young ladies not for ability one",
          "score": 5
        },
        {
          "text": "Totally sad situation - but there’s a fallacy in your comparison. ML didn’t groom G. G was seeing ML for a giant wallet, whereas ML sees a hole for use. Believe your situation is different. Leave and find a better job for yourself please.",
          "score": 5
        },
        {
          "text": "You go interview for the next job i think u will be hired cause of looks also…",
          "score": 5
        },
        {
          "text": "Gender reverse boss also have.",
          "score": 4
        },
        {
          "text": "There’s a reason I avoid SMEs. Most of them have no standards and no proper policies. You’re basically at the mercy of a self-entitled boss with an oversized ego. I worked in SMEs twice in my career, and both times I resigned within 3 months. Honestly, I’m surprised you even lasted 8 months. In many SMEs, the company exists to feed the founder’s ego, not to build systems or people. Decisions change based on mood. Feedback depends on whether you stroked the boss’s ego that day. They want people to call them “boss,” expect blind obedience, and confuse authority with leadership. From a career perspective, SMEs are bad for marketing your profile. They usually have no budget, so whatever ideas you have are severely limited. You can be creative all you want, but without resources, you’re stuck doing small, low-impact work that doesn’t showcase real capability. My suggestion is take mnc even pay is low work for 1 year than move to another mnc. Taking contract is also ok rather than sme. Secondly, SMEs are scrutinized by MNCs and top firms. The longer you stay in an SME, the harder it is to move out. It’s always easier to go from MNC → SME, but much harder the other way around. The only SMEs worth considering are well-funded startups with strong backing, like Grab or Carousell in their early days with serious angel investors. Lastly, HR in most SMEs is basically a one-person show, often reporting directly to the boss. Policies are flexible when it benefits management and rigid when it doesn’t. In MNCs, contracts are legally tight, rules are clear, and you have mandatory compliance training on harassment, ethics, and reporting. Means they have these point that I already pass what define as harassment so we all guys cannot act blur say we dont know when we cross the line. I",
          "score": 4
        },
        {
          "text": "Err same thing happened to me (in a design event company). Except im a guy and my boss is gay. (im gay too can tell). So my colleagues and seniors just ask “so do you know xxx before this.” and “how did you get this job”. But in the end i didnt pass the probation.",
          "score": 4
        },
        {
          "text": "If OP has texts, email etc evidence to imply unprofessional or behaviour that has crossed the line, do consider to whistleblow to mom after you tender.",
          "score": 3
        },
        {
          "text": "are u sure about that? jumping from the frying pan into the fire....lolz",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qt1l5k",
      "subreddit": "SingaporeRaw",
      "title": "‘They are yes men’: Local man claims he rejected every Singaporean applicant for junior and mid-level roles at his company, sparks backlash online",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qt1l5k/they_are_yes_men_local_man_claims_he_rejected/",
      "score": 81,
      "num_comments": 33,
      "created_at": "2026-02-01T23:35:39",
      "selftext": "",
      "comments": [
        {
          "text": "True. My colleagues gossiped to me about an ex-colleague who only joined for a few weeks, claiming her to be \"a weirdo, one of a kind, trouble\" because she had a strong character and dared to say something like \"I am not a yes man. If i think the boss is incorrect I will point it out and propose something better to the client\". Apparently most of the people cannot accept it.",
          "score": 112
        },
        {
          "text": "Actually, I think he’s overgeneralizing. Not every local is a yes-man — it’s more that our education and corporate culture train us to survive that way. Our education does teach critical thinking — not exams, which are mostly memorization. I’m talking about essays and theses, where you have to use citations, analyze arguments, and produce your own points. It’s not just memorizing and answering; we do have training in critical thinking and generating different ideas. So why do locals become yes-men? Here’s the thing: many local managers are hypocritical. In traditional Asian workplaces, respect for elders is ingrained seniors are assumed to “know best.” Many managers say, “I want people to challenge me, bring new ideas,”but the moment you do, their face turns black and they dismiss you saying things like“You don’t understand our business model,” or “That’s your problem, you don’t know what you’re doing.”so basically instead of discussing ideas to come out with the best solution it become we are the one dont know our work well. After working in that kind of environment long enough, who’s brave enough to speak the truth? Everyone learns to be a yes-man to survive. And honestly, based on what I observe many bosses only pick ideas from people they like. If they like a colleague, that person’s idea becomes “genius.” If they don’t, it’s dismissed. Therefore I think it is just survival mechanism that people take to survive. If everyone was thrown to a flat heriaichary work place. I am sure everyone will speak up fast. That why reddit is a place where people can truly say what they think without people knowing his identity",
          "score": 67
        },
        {
          "text": "Most bosses here especially Gen X and boomers won’t admit it but prefer yes men cos they were yes men climbing up the ladder + NS and schooling indoctrination. It’s a selfish mindset of if I went through it so must you. No iconoclastic sense of breaking toxic cycles. I’m sure this goes on in how they run their families as well - that’s why there’s so many toxic hierarchical families run my mini dictators. If you’ve worked in more progressive western international environments this culture is fking toxic and stifling. This is one of the reasons people say sg still has a third world mindset. Apart from the minority of progressive Gen X and boomers who were educated overseas most of the locally educated have this mindset and they’re one of the main causes of the toxic SME stereotype since many of them run them.",
          "score": 28
        },
        {
          "text": "usually if the local challenges the management or leadership he gets shot down immediately. but on the other hand, if AMDK does so, it is considered not being a yes man and providing constructive discourse. see the irony there? most sinkies and the local populace are still stuck in the colonial mindset / mentality. its just a sad byproduct of our education system, and NS makes it even worse by promoting a top-down subservient mentality",
          "score": 24
        },
        {
          "text": "Isnt that a product of sg education system? It is intended by design",
          "score": 22
        },
        {
          "text": "Yup. I’d say angmoh managers are generally more open. When you challenge them, you don’t see their face turn black or their expression change. Instead, they’ll say things like, “That’s a lovely idea, why didn’t I think of that?” They don’t shoot ideas down immediately. Even if they disagree, they’ll say, “Let me think about how this could work.” And if it really can’t be done, they’ll come back a few days later and explain why it’s not feasible. At least the idea gets proper consideration. Local management, on the other hand, tends to reject ideas instantly No thinking, no discussion — just shut it down. Which I find really bad. Why not at least think it through first? What if it actually works? A lot of local managers have serious ego issues. They can’t accept being challenged or the idea that someone junior might be smarter or see things differently. I’ve worked with angmoh bosses who openly admit they’re not the best at everything, but believe the team can improve together. They’re willing to learn. With many Asian managers, the mindset is more like: “I’m senior, you respect me, you listen to me.”That kind of thinking is toxic. To be frank If you grow up in that system, once you become a manager, you tend to repeat the same behavior. The “I suffered, so why should others have it easier?” mindset slowly forms . That why our leadership keep going same cycle. I suffer when I go up I make sure others suffer like my last time. That what you see in army also.",
          "score": 19
        },
        {
          "text": "He's not wrong. Culturally most here are extremely wary of confrontation,even among family members. In the office most are concerned with what the boss wants then solving the problem.",
          "score": 9
        },
        {
          "text": "My friend had this insane manager who couldn’t take even the smallest slight and regularly took it out on the whole team. The craziest part is that he’d keep quoting LKY to justify his actions. No surprises his team had the highest MC rate in the whole department. But he was also a sycophant and upper management loved him because he was great at sucking up, so he got promoted quickly.",
          "score": 7
        },
        {
          "text": "Not surprise. Sucking the top and put down the bottom. Typical singkie method. Other nations is sucking the top and bring the whole bottom go up with him. Ours is always opposite way. That why in  career i always careful of people who working time instead spend time working they go around talking and make friends. These people usually have another strong area that is they always like to buy food buy this buy that for people. Like out of no where will say I bring this tidbits for everyone to share.",
          "score": 6
        },
        {
          "text": "He is not wrong. Majority of Singaporeans are yes men. The only thing is how he judged them from just an interview to be one.",
          "score": 5
        },
        {
          "text": "It’s more a product of workplace politics and leaders with egos and play favourites.",
          "score": 4
        },
        {
          "text": "Nah it’s not as ideal as you think outside. The politics exist but is run differently. You ever watch House of Cards? It’s more direct bullying. In Asia it’s more like the old Chinese dynasty dramas where different advisors are whispering into the emperor’s ear to influence him.",
          "score": 3
        },
        {
          "text": "I think what we are reading is a red herring argument, we should consider that what he claims as unable to find “daring, courageous and bold” likely due to his expectations of finding a unicorn at a wage level of a junior to junior-mid level employee. Gen Z in general have no issues wearing their opinion on their sleeves tho the lack of experience might limit the usefulness of such expression. He claims the “Singapore Premium is declining” but that just sounds like an excuse for him to hire someone at a cheaper entrant salary or an over inflated “expat”. It seems like a common trope these days, while this trend has always been a local boss favourite - they like to demean the “local talent” as internally they likely feel that said local talent don’t deserve as high as a salary they are asking for and doubt why he should even pay such high salaries, especially for what he deemed as “poor value” These days, we have to read between the lines when management or local entrepreneurs bitch or bemoan out such statements as it’s likely merely a cover for their taste for cheap labor. Singapore’s capitalist economy after all has been sustained all these decades by a ready pool of cheap labor. It’s just that it’s getting harder over the years due to tighter government regulations and also what was once “cheap” is no longer as such. Thus when pushed to hire “local talents” what we see on the ground these days are still the same old - if they want talent they will hire expats, if they want cheap they will hire migrants. Of course, “local talents” are a limited pool by nature and it’s not perfect by itself. But that’s another conversation all together.",
          "score": 3
        },
        {
          "text": "Yup that normal in singapore. Many people like to listen to good words. That how influence happen and that how such people are able to influence the boss.",
          "score": 2
        },
        {
          "text": "survival mechanism indeed... for every one of him who prefers an independent employee who speaks up his/her mind.. there's prob ten thousand that prefer the other way around",
          "score": 2
        },
        {
          "text": "I agree. Most yes man don’t even know they are yes man and what is a yes man. They believe in what they are doing. It’s not wrong to be a yes man. You need a certain amount of capable yes man in a team, in a department. If all depends on your leadership style, management philosophy etc.",
          "score": 2
        },
        {
          "text": "And what’s so bad about being a yes man?",
          "score": 2
        },
        {
          "text": "It really depends on how you say it. I've seen a lot of people who have 'strong character' or are 'outspoken' or 'opinionated' and they are just people who have no tact. Ironically, they are also the same people who get offended easily and make a big fuss the moment you say something they don't like and cause others to walk on eggshells around them because of their 'strong character'. I actually dislike people like that because what they are are just loose cannons will cause a lot of problems for everyone. It's not a matter of if but when.",
          "score": 1
        },
        {
          "text": "Not just ego, it’s deep seated insecurity",
          "score": 1
        },
        {
          "text": "Can’t speak for that guy but we test for conflict management styles with variations of “Tell me about a time you convinced a more senior colleague to take a different course of action”.",
          "score": 1
        },
        {
          "text": "education serves the ruling collective so we know why things are designed and enabled as so",
          "score": 1
        },
        {
          "text": "Indoctrinated from young.",
          "score": 1
        },
        {
          "text": "Low IQ yes men from local education system.",
          "score": 1
        },
        {
          "text": "That local man he could be a Malaysian that converted to Singaporean citizenship or he could be a Singaporean that married a Malaysian wife. Way back in 1995 to early 2000s when I work in a SME company, my company's boss is a Singaporean but his wife is a Malaysian-chinese. He always give preferences to hire Malaysian workers over Singaporeans and his behavior is same as that traitor Loo YouTuber that married a Malaysian-chinese wife. He is always praising Malaysia and he always belittle or criticize Singapore. Same as that Traitor YouTuber Loo, that YouTuber traitor Loo he is also always praising Malaysia in his YouTube videos and he criticizes Singapore",
          "score": 1
        },
        {
          "text": "das riteeeeeeeee sinkiessss r sheeples",
          "score": -4
        }
      ]
    },
    {
      "id": "t3_1qtjcz6",
      "subreddit": "SingaporeRaw",
      "title": "I guess it’s the thought that counts…?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qtjcz6/i_guess_its_the_thought_that_counts/",
      "score": 69,
      "num_comments": 19,
      "created_at": "2026-02-02T11:02:14",
      "selftext": "",
      "comments": [
        {
          "text": "It depends on the active ingredient. Some expire because they become less effective over time and thus cannot meet standards as promised on the label...... Some expire because they become toxic over time. Depending on which is the reason... it is/is not usable.",
          "score": 67
        },
        {
          "text": "Expired liao it only kills 99.8% of germs.",
          "score": 66
        },
        {
          "text": "Like this also want to make noise..simple, u want, u take it and use. You don't want to use, don't take? People like to overcomplicate things..",
          "score": 35
        },
        {
          "text": "It's actually very easy to make hand sanitizers. U just need 3 ingredients, isopropyl alcohol, water and carbomer to thicken it into gel. Alcohol do evaporate gradually and hence the effectiveness of it's antiseptic property will degrade over time. It's good for 2 to 3 years and therefore after the expiry date, it's antiseptic property is definitely questionable.",
          "score": 27
        },
        {
          "text": "Maybe can be used to wipe off glue or sticky residues instead.",
          "score": 11
        },
        {
          "text": "So Covid hoarder turned litter bug?",
          "score": 8
        },
        {
          "text": "9 out of 10 dentists recommend.",
          "score": 5
        },
        {
          "text": "Not good enough for them obviously.",
          "score": 5
        },
        {
          "text": "Still good to use for thee, not for me",
          "score": 2
        },
        {
          "text": "permanent marker too!",
          "score": 1
        },
        {
          "text": "Sanitizers good for cleaning, removing stains, polishing, etc. 👍🏻❤️🌟",
          "score": 1
        },
        {
          "text": "If its good to use despite being expired why dont you keep it? Because they have expired and it's not good to use for themselves. But they don't want to throw them away so they want to earn some good karma to give expired items away.",
          "score": 1
        },
        {
          "text": "Saw it and took one haha",
          "score": 0
        },
        {
          "text": "Use to make slime bah, time to bring it back 😁",
          "score": -1
        },
        {
          "text": "This kind of stuff in Japan has no expiry date.",
          "score": -3
        },
        {
          "text": "Still good to use? Based on whose assessment?",
          "score": -7
        },
        {
          "text": "This reminds me of the recent malaysian influencer that gave food to the homeless, chicken bones and rice.",
          "score": -7
        },
        {
          "text": "So they are essentially giving out expired products lol. How unethical. The good stuff they keep for themselves.",
          "score": -11
        },
        {
          "text": "If its good to use despite being expired why dont you keep it?",
          "score": -14
        }
      ]
    },
    {
      "id": "t3_1qtgq9r",
      "subreddit": "SingaporeRaw",
      "title": "Epstein's circle has Singapore phones and Singapore friends. Wonder if we have our own files on them too",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qtgq9r/epsteins_circle_has_singapore_phones_and/",
      "score": 35,
      "num_comments": 28,
      "created_at": "2026-02-02T09:05:18",
      "selftext": "https://www.justice.gov/epstein/files/DataSet%2011/EFTA02333695.pdfhttps://www.justice.gov/epstein/files/DataSet%2011/EFTA02410565.pdf",
      "comments": [
        {
          "text": "Pure speculation here. Email address begins with Ong. Initials are BS. I wonder if there’s anyone named Ong BS who’s pretty prominent in Singapore? Maybe Iswaran knows.",
          "score": 50
        },
        {
          "text": "<image>",
          "score": 29
        },
        {
          "text": "Singapore is a rich man's playground. It's only strange if theynevercame here to play.",
          "score": 20
        },
        {
          "text": "It’s amazing how simple and casual emails of such powerful individuals go. It’s like sending a WA text. Here I am fighting with my dumb ass manager over spacing and word choices in the age of ChatGPT.",
          "score": 18
        },
        {
          "text": "My man Peter refers to him as BS in his reply.",
          "score": 14
        },
        {
          "text": "Where do you see that the initials begin with BS?",
          "score": 8
        },
        {
          "text": "<image>",
          "score": 8
        },
        {
          "text": "RBS? The bank?",
          "score": 8
        },
        {
          "text": "<image>",
          "score": 7
        },
        {
          "text": "Second pic, BS probably refers to Ong Beng Seng? But not sure why the email is onge though...",
          "score": 7
        },
        {
          "text": "MM isn't who i think it is right",
          "score": 7
        },
        {
          "text": "Could be ongeurope, ongemail, ongentertainment?",
          "score": 6
        },
        {
          "text": "Min. Mentor?",
          "score": 6
        },
        {
          "text": "onge@ and BS ong BS?",
          "score": 4
        },
        {
          "text": "Ong beng seng?",
          "score": 4
        },
        {
          "text": "Oh I see it now, thanks.",
          "score": 3
        },
        {
          "text": "who leh",
          "score": 3
        },
        {
          "text": "ohohoh LOL thxx",
          "score": 3
        },
        {
          "text": "Singapore mentioned!!! 🥳🥳🥳🥳🥳",
          "score": 2
        },
        {
          "text": "Ok lah. I admit. I am in the files too.",
          "score": 2
        },
        {
          "text": "You know you've made it when you're mentioned in the Epstein files.",
          "score": 2
        },
        {
          "text": "This is the trick SG plays very well with its control of the media and use of courts to bankrupt for defamation. SG elites look clean, but it’s mostly because nobody dare say anything, not because nothing happens.",
          "score": 2
        },
        {
          "text": "Ong BullShit. 王补屎。",
          "score": 1
        },
        {
          "text": "He isn't Singaporean, and im definitely wrong, but it's Mahathir or",
          "score": 1
        },
        {
          "text": "How’s this comment of yours related to the thread? Get a life.",
          "score": -6
        }
      ]
    },
    {
      "id": "t3_1qstvfx",
      "subreddit": "SingaporeRaw",
      "title": "Excessive Joss Stick Burning in 5RM HDB Flat, Need SERIOUS Advice.",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qstvfx/excessive_joss_stick_burning_in_5rm_hdb_flat_need/",
      "score": 35,
      "num_comments": 70,
      "created_at": "2026-02-01T17:22:35",
      "selftext": "Hi guys, i really really need genuine advice for this matter. Just a bit of context, My selfish father is a crazy addicted Buddhist to the point we have a whole Altar at home like temple size. He places Buddha in the middle, Di Zhang Wang and Guan Yin on sides. The hypocrite part is his marriage failed and currently in the midst of divorce.\n\nDuring special festive months, like hungry ghost, moon cake, vesak day etc… he will burn 100 joss sticks at one go (I kid you not) and the whole house becomes so damn smoky and formaldehyde is everywhere in the house??? On top of the 100 joss sticks, he buys those 24 hours long thicker joss stick and burns it??? (He gets all his joss stick from JB)\n\nSince today is the 1st day of February, he believes in the Chinese new year month and will burn excessive amount of joss stick everyday till the end of the month??? Im pretty sure religious wise he is doing too much? Like he doesnt if have to do it?? To add on, he closes the house door and the windows and also off the fan in the hall while having his food on the dining table? Its like he is trying to recreate the smoky while cloudy atmostphere in the hall like he is in heaven?\n\nFortunately for him, my neighbours just close their doors and I have no choice but to hide in my room with my xiaomi air purifer. I just cant wait for the divorce to finalised to finally breath fresh air and not have headache everyday. I have tried talking to him but he really really is a selfish individual and doesnt care about people’s opinions. (He uses the toilet and does clean up after himself after using and people have to clean up for him, quarrelled with him but he doesnt accept the reality of whats happening)\n\nIs there anything i can do to make him stop his excessive joss stick burning? Does reporting to NEA works? I really cant stand this anymore. To add on, he has been fined by the courts currently in the divorce proceedings, is it possible to get him fined for the joss stick burning so he will stop? Does reporting to the police helps? I am so done.",
      "comments": [
        {
          "text": "Not your house, nothing you can do. Just make sure when you move out next time\nDon’t be so dog",
          "score": 30
        },
        {
          "text": "I confronted him on whatsapp about him not cleaning up the toilet after using, he sends me a youtube reel of a Buddha song… im was so pissed… he keeps avoiding this topic be it on whatsapp on face to face. Im so done about this too man.",
          "score": 25
        },
        {
          "text": "Tell him, \"若以色见我，以音声求我，是人行邪道，不能见如来\" . If one sees the Buddha through forms e.g. statue, talismans and so on. If one begs the Buddha through sounds e.g. chantings, prayers and so on. Such a person followed the wrong way and does not understand the Buddha and his teachings. If the above won't work then let alone burning joss sticks. If he can't understand then try buying him some Buddhist books or audio tapes e.gYouTubeto read or listen.",
          "score": 20
        },
        {
          "text": "He is deeply into Buddhism but for the wrong reasons, he believes he will reach enlightenment or go to heaven. At this point, he is so addicted to buddhism but does not practice the way of the Buddha. To keep it straight, i am not against Buddhism or any religious belief people have. It’s just that he is selfish ritualistic hypocrite.",
          "score": 20
        },
        {
          "text": "I didnt know Buddhism taught and allowed Ragebaiting",
          "score": 20
        },
        {
          "text": "You have to send him to IMH, this is call mental illness or a.k.a. siao lang.",
          "score": 18
        },
        {
          "text": "Invest in good air purifier and big fan to blow the smoke out. Fan will also help to make the joss sticks burn faster.",
          "score": 17
        },
        {
          "text": "Oof, your father is a real piece of work.",
          "score": 12
        },
        {
          "text": "Yes i do that, he will come and turn off the hall fan and unplug the plug and even remove the circuit pin. Yes he goes to this extend.",
          "score": 11
        },
        {
          "text": "ROFL!",
          "score": 5
        },
        {
          "text": "sorry i know this is not the point but this is how im going to deal w all my enemies now",
          "score": 5
        },
        {
          "text": "My gdad and uncle pollutes SG everyday with habits like this but can’t be helped cos it’s their house, had remarks before from friends that i smell like incense cos it sticks to my shit, for u best thing to do is just leave the house till it clears to spare ur lungs, gov also can’t do anything cos it’s occuring in ur dad’s property (i assume) so don’t expect external intervention, even if it escalates to being neighbours complain to town council they also can’t do much but mediate because religion is sensitive issue.",
          "score": 4
        },
        {
          "text": "Hey...its like exactly like my old man, but he is taoist. All these statues hoarding of their deities and excessive burning of incense and paper is only found in south east asia and taiwan and are folklore level already. The real buddhist and taoist way of prayers isnt even about all these excessive burning of offerings, which is now more towards satifisying the living beings. These older folks will never understand because they dont want to learn and been living with these praying for whole life. As I told my dad, he is missing the true meaning of being devoted to his God, prayers.",
          "score": 4
        },
        {
          "text": "well i’m no legal expert but i believe incense burning within someone’s property is not illegal but if u really wanna go the full nine yards can go try seek advice from town council first, other than that can consider taking the opportunity to do something else outside the house while waiting like walking ur dog exercising or smth uk",
          "score": 3
        },
        {
          "text": "cheer up bro, myself i’ve 25 years suffering similar to u alr, often times the child pays for the parents mistakes but can’t be helped cos well it’s ur fam and unless u wanna burn bridges and make things uglier than it is, and legally there’s really nothing until someone takes the first step by complaining town council, call police they will also redirect to town council or social services one",
          "score": 3
        },
        {
          "text": "OP try to get sponsors for air purifier..",
          "score": 2
        },
        {
          "text": "If you can't help him solve his problem then at least you can solve your own problem. Start planning a life away from your parents. It is going to be difficult staying alone if you cannot resolve the problems in your mind. But if you figured out the issues that prevented your mind from being peaceful then living and interacting with anyone will be much easier in future. Trust me, even if you find your significant other in life, living with them will be difficult if you don't resolve those issues within. We all have emotional and mental issues that we carried around, oftentimes unaware......many carried these unresolved issues until the last days of their life. Maybe once you resolved yours, you'll have a different perspective of your father and his problem.",
          "score": 2
        },
        {
          "text": "But burning such a excessive amount of joss stick per day should be illegal right? I am being serious when i says he burns 100 sticks at one go. Im still able to handle this period as my parents are in the midst of divorce, i actually more worried for my dog who is exposed to such levels of Formaldehyde. I try my best to keep my dog in the room with the purifier as he keeps sneezing.",
          "score": 2
        },
        {
          "text": "Thanks bro. I hope this divorce proceedings settles soon as it keeps getting delayed and i cant wait to live in a place with no formaldehyde and gaslighting toxicity.",
          "score": 2
        },
        {
          "text": "maybe find ur own peace by exiting the situation when it happens, or find support from ur other family members and friends ah",
          "score": 2
        },
        {
          "text": "For this chinese new year month everyday, he is going to burn those 24/7 long and big joss sticks on top of the 100.",
          "score": 1
        },
        {
          "text": "is he open to smokeless joss sticks?",
          "score": 1
        },
        {
          "text": "unless ur neighbour or u complain than really nothing much will change, and even then considering the steps u taken i don’t think he will change without much effort",
          "score": 1
        },
        {
          "text": "He is not into Buddhism. This is taoism. And Buddhism has 2 school the China ones and the Thai/Indian ones. So pick your religion 😂",
          "score": 0
        },
        {
          "text": "Do the pray and spray. Pray to the Buddha to excuse what you're about to do, then take a fire extinguisher and spray on all the Joss stick your father has lighted at home to prove a point.",
          "score": -1
        }
      ]
    },
    {
      "id": "t3_1qtimwl",
      "subreddit": "SingaporeRaw",
      "title": "Chasing the rainbow with Leong Mun Wai, newest Tiktok series",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qtimwl/chasing_the_rainbow_with_leong_mun_wai_newest/",
      "score": 29,
      "num_comments": 12,
      "created_at": "2026-02-02T10:30:28",
      "selftext": "",
      "comments": [
        {
          "text": "I hope it extends to other platforms cos not everyone wants to be on tiktok",
          "score": 15
        },
        {
          "text": "if you think of gays even in the most innocuous of circumstances, maybe you are actually gay?",
          "score": 3
        },
        {
          "text": "oookkkay... isnt the \"rainbow\" tagline was quoted by LKY?",
          "score": 2
        },
        {
          "text": "Now v. Free liao also come out be influencer",
          "score": 1
        },
        {
          "text": "yes, The Quote: \"There's a glorious rainbow that beckons those with the spirit of adventure. And there are rich findings at the end of the rainbow. To the young and to the not-so-old, I say, look at that horizon, follow that rainbow, go ride it\".",
          "score": 1
        },
        {
          "text": "i understand you may be receiving a lot of hate as a homosexual and palestine sympathizer. Is ok. We are here for you ❤️",
          "score": 1
        },
        {
          "text": "Is controversy just like watermelon",
          "score": 0
        },
        {
          "text": "Based.",
          "score": 0
        },
        {
          "text": "No need to podcast lah. Chase Simi sai ?? All chasing the same thing, $$$$ and more $$$. With $$$$, you can have good life, stay condo stay landed and drive big cars. Then post socials haolian nice house, travels to JP Europe, make all your frens and relatives all jelly drip salivas. That's why u keep seeing ppl fighting in court over inheritance, scam your hard earned money and even MIW keep taxing you, directly and indirectly. Rot starts from the top...what's Wrong with having more money ?",
          "score": -2
        },
        {
          "text": "He is very short. I saw him once in Ang Mo Kio",
          "score": -3
        },
        {
          "text": "This phrase belongs to founding father. Stop imposing",
          "score": -8
        },
        {
          "text": "Hey using rainbows is not a good choice, people may interpret as LGBT, woke kind of social movement",
          "score": -12
        }
      ]
    },
    {
      "id": "t3_1qsro57",
      "subreddit": "SingaporeRaw",
      "title": "Lai who want swim at sentosa? Need more thrill in sg",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qsro57/lai_who_want_swim_at_sentosa_need_more_thrill_in/",
      "score": 30,
      "num_comments": 12,
      "created_at": "2026-02-01T15:14:02",
      "selftext": "",
      "comments": [
        {
          "text": "Buaya spotted",
          "score": 9
        },
        {
          "text": "With all the construction work and destruction of more mangrove forests, even crocodiles are looking for a new place to live. Our canals have plenty of fish in them. Soon they will discover that too.",
          "score": 4
        },
        {
          "text": "Is that a certain property agent swimming to Batam",
          "score": 4
        },
        {
          "text": "They can eat the rich, I dont care.",
          "score": 3
        },
        {
          "text": "I hope they eat the otters who sorely lack any natural predators. If not there’s plenty of chickens running amok everywhere.",
          "score": 2
        },
        {
          "text": "Sad that it’s going to end up dead in all likelihood.",
          "score": 1
        },
        {
          "text": "Good, stay there please",
          "score": 1
        },
        {
          "text": "Oh my. No coast guard to warn others",
          "score": 1
        },
        {
          "text": "An animal being in it's natural habitat: Singaporeans: \"How can the government allow dis?!?!\"",
          "score": 1
        },
        {
          "text": "We used to have them at Kallang River. Gnarly.",
          "score": 1
        },
        {
          "text": "crikey",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qsxve0",
      "subreddit": "SingaporeRaw",
      "title": "Budget 2026 wish list: Singaporeans want more CDC vouchers, job security",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qsxve0/budget_2026_wish_list_singaporeans_want_more_cdc/",
      "score": 26,
      "num_comments": 42,
      "created_at": "2026-02-01T21:01:22",
      "selftext": "",
      "comments": [
        {
          "text": "As someone who is reaching 40 soon, job security is very important. Many of my friends got retrenched to be replaced by FTs and a lot of their plans got disrupted such as raising a family, mortgage payments and others. I am seeing a lot of fresh grads struggling to find jobs which is not a good sign for our local talents as companies are continuously hiring FTs in entry level jobs.",
          "score": 79
        },
        {
          "text": "CDC voucher is like a drug. Once u get used to it there’s no turning back. Our gov decided to make us addicted to it & it can only mean more & more welfare in future. Well done Lawrence",
          "score": 51
        },
        {
          "text": "The govt will say those that were retrenched were not competitive enough.",
          "score": 43
        },
        {
          "text": "Many sinkies like you don't realise that all are fighting a losing battle. One by one is being taken out of the job market to be replaced by cheaper hirings. This illusion that it is an isolated thing affecting a tiny portion of the local population is a result of asymmetric information. But there are always hints and indications for sinkies who are not delulu and willing to pay attention. First, unemployment benefits by the authorities. Totally unheard of 10 years ago, introduced in 2024. Because there is a significant shift in the job market. Second, more younger professionals are losing their jobs and not finding new jobs in their old profession. Many are doing gig jobs and they are getting younger. Third, therecord high bad credit card debt trendsince 2022. Don't be fooled by the usual narrative that it is due to indiscriminate spending.",
          "score": 38
        },
        {
          "text": "We need solutions, not band-aids. More of the same, and hope for the best, is not a strategy. I personally would like to see Higher marginal tax rate for those earning $250k and above, and 50% marginal tax rate for those earning $5m. Quota on all passes, ONE, EP, S Pass, etc. subjected to COE bidding style to control the number of FTs. Abolish vouchers. Just put the money in the bank. Why treat the people like beggars when this is the people's money in the first place. CPF reform. There should be a BRS calculated for each age group from 21. If they have more than what they should have for their age, they should be able to withdraw the money in the event of unemployment, and return with interests once they find a job and pass their probation period. Reduce sovereign debt (currently at 175% of GDP). We are borrowing against future generations, and the only hope to control spiraling interest payments is to keep gdp growing. This is not sustainable and our children will have to pay for it sooner or later.",
          "score": 26
        },
        {
          "text": "CDC is like their experiment on universal basic income",
          "score": 20
        },
        {
          "text": "It’s on purpose. They realised the GST increase hit us much harder than expected & the biggest victim are restaurants. 10% service + 9% GST = death of many restaurants. No need to even include rental costs",
          "score": 15
        },
        {
          "text": "Fix economy not fix opposition.",
          "score": 15
        },
        {
          "text": "Honestly AI is a less bigger threat than the risk of offshoring key functions to neighbouring countries. AI, no matter how reliable will continue to have flaws and will require human oversight (unless the AI become sentient but that’s another thing altogether). I don’t understand why our govt keeps harping on AI replacing jobs…",
          "score": 11
        },
        {
          "text": "Might be an unpopular option but I don’t like vouchers. How I see it is that we pay tax in SGD and any rebates we get should be in the form of cash. Cash allow us to freely spend on what we want, be it shopping online or offsetting some of our overseas traveling expenditure. We have to understand that welfare payment (like vouchers) are not equivalent to tax rebates. Just like what some others say, what if we pay ministers and those in cabinet CDC vouchers instead of a cash salary since our ministers often claim that CDC vouchers are “as good as cash”",
          "score": 10
        },
        {
          "text": "I understand the reason for the CDC vouchers. Restricting it to basically \"HDB\" shops means generally speaking, local businesses get the stimulation, so it keeps the money in the local economy (mostly), VS online shopping on shein or other overseas retailers. This way, they get to control the usage of the vouchers, at least somewhat.",
          "score": 10
        },
        {
          "text": "The way I see it, CDC vouchers aren’t a welfare payment and more of a tax rebate. As a tax rebate, you paid your taxes in cash and any rebates should be in the form of CASH and not a bunch of vouchers that is limited to where I can spend them.",
          "score": 10
        },
        {
          "text": "Not unpopular, my whole family has this view too",
          "score": 9
        },
        {
          "text": "Just think about it. The government is controlling what you can spend your money on because they are issuing vouchers to you. It's just another extension of CPF. Your earnings do not belong to you, and this latest scheme is simply a more communist version of it.",
          "score": 9
        },
        {
          "text": "das riteeeee sinkiessssssss r too expensibbbbbb",
          "score": 8
        },
        {
          "text": "Idk if it's just me but I don't think 3 dollar econ rice exist anymore unless you are taking like 2 veg or 1 meat 1 veg? Any other permutation surely exceed 3 bucks",
          "score": 7
        },
        {
          "text": "Missing out on the all important medicines",
          "score": 6
        },
        {
          "text": "Still remember previously LHL and by extension HSK (who was FM) introduced additional Cost of Living Payout all in CASH especially in response to covid-19. Since the current AP-Cash payout (2022-2026) is expected to be fully disbursed by 2026 (the last payout is currently standing at $250 in December 26), I sincerely hope that this budget will consider enhancing the distribution of cash for GSTV and AP over additional CDC vouchers but I am not hopeful. I personally think we will see more CDC vouchers lol and call me a conspiracy theorist but the fact that our state media is currently publishing articles along the lines of “Sgporeans want more CDC vouchers” seems to incline that that will be the case? :3",
          "score": 5
        },
        {
          "text": "U forgot the AI spectre coming to replace all white collar jobs",
          "score": 4
        },
        {
          "text": "Another thing about voucher is that there is a set expiry date and a limit to where it can be spent on. At least for cash I can use it whenever and wherever I like with no expiry date.",
          "score": 4
        },
        {
          "text": "I think the intention not bad. It's UBI but can only use for groceries",
          "score": 3
        },
        {
          "text": "Thats why you should go about as if you never get it. Family and colleagues discussing about seeing the numbers go up on cdc voucher day, I'm still eating 3 dollar econ rice every day 🥲",
          "score": 3
        },
        {
          "text": "we see how AI can do the job better than anyone with less than 5 years of experience today, no hurry to hire the young to let them start their careers. Now project that for 5 more years of AI development. Let’s combine that with ur offshoring, now a lower skilled less educated offshore hire can do the supposed higher skill job of the remaining sinkie",
          "score": 1
        },
        {
          "text": "*angry Big Pharma noises*",
          "score": 1
        },
        {
          "text": "Its a cash injection to local businesses as much as to regular citizens",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qtlhon",
      "subreddit": "singaporefi",
      "title": "Civil service salaries",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qtlhon/civil_service_salaries/",
      "score": 99,
      "num_comments": 49,
      "created_at": "2026-02-02T12:42:43",
      "selftext": "Came across this estimate of CS salaries in SG online. Does anyone know if this is accurate esp for the mx10 and mx9 ones?",
      "comments": [
        {
          "text": "Accurate, I have ex-colleagues in MX10 range, add about 4 months bonus, whole day complain nothing to do, can instagram, surf shopee, upgrade condo and car... :D  haiz so envy them now.",
          "score": 68
        },
        {
          "text": "This is pre-bonus",
          "score": 30
        },
        {
          "text": "former MX11 here.\nwas offered $6500 plus medical benefits. the team i supervised, all MX13, tells me that they are at $4k",
          "score": 15
        },
        {
          "text": "MX 10s get about 5 months bonus if they get the default C grade",
          "score": 14
        },
        {
          "text": "This one is outdated range liao. Looks like Pre-covid range. Now the starting number of each band should be 20-25% more. Superscale definitely don't start with 11k liao.",
          "score": 14
        },
        {
          "text": "Seems too low actually. SuperScale H starts at a quarter million per year, 30 years ago, not end at that. MX10 is probably still middle management if that is the salary. Note: I am not a civil servant and have no insider knowledge.",
          "score": 14
        },
        {
          "text": "I think the names of the grades are not accurate. Snr management starts from mx9",
          "score": 9
        },
        {
          "text": "Feels kinda low. Senior management just drawing 7.5k?",
          "score": 8
        },
        {
          "text": "I remember seeing this table quite a few years ago. I think the numbers will be outdated by now. Salaries should be higher.",
          "score": 6
        },
        {
          "text": "why not?  stable rice bowl and no crazy KPIs",
          "score": 5
        },
        {
          "text": "Director",
          "score": 5
        },
        {
          "text": "I wish",
          "score": 4
        },
        {
          "text": "It's quite close. Maybe a few hundred lower here. It also depends on your grade.",
          "score": 4
        },
        {
          "text": "2 YOE will join as what sia ?",
          "score": 2
        },
        {
          "text": "What is superscale H in terms of the AO and MX grades?",
          "score": 2
        },
        {
          "text": "Okay principals were making 250k a year 30 years ago? That seems like a lot.",
          "score": 2
        },
        {
          "text": "Is that base salary or total comp?",
          "score": 2
        },
        {
          "text": "Maybe few years ago, like 3 years ago salary?  or maybe it's for specific agencies?  but from my limited understanding, it should be across the board.. I don't know about others, but a fresh grad SAF officer (should be MX13? or are they?) makes over $6K from when they're officer cadet.",
          "score": 2
        },
        {
          "text": "What title is mx9?",
          "score": 2
        },
        {
          "text": "Hard to compare because statutory boards don’t use this but have similar job scope",
          "score": 2
        },
        {
          "text": "Accurate for MX 11 and 11A at least",
          "score": 2
        },
        {
          "text": "Seemed like top tier stat boards are significantly higher for middle management and above, even a decade ago.",
          "score": 2
        },
        {
          "text": "When is this?",
          "score": 1
        },
        {
          "text": "Only some principals are that senior. A lot promoted fast and are not at that pay grade.",
          "score": -2
        },
        {
          "text": "I'm sorry I have no idea about AO/MX. According to my wife who is a teacher, the SuperScale H is their official job title.",
          "score": -5
        }
      ]
    },
    {
      "id": "t3_1qsxug0",
      "subreddit": "singaporefi",
      "title": "Free tool to quickly get estimates of your property (hdb, condo, landed)",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qsxug0/free_tool_to_quickly_get_estimates_of_your/",
      "score": 65,
      "num_comments": 33,
      "created_at": "2026-02-01T21:00:17",
      "selftext": "Hey everyone - I made a free tool for homeowners, buyers, or anyone curious about property prices in Singapore.\n\nYou can key in a postal code, development name, or street name (for options) and it’ll return:\n\nIt uses 30 years of past data for HDB, and 5-7 years for condo and landed properties.\n\nI built it originally for myself because I was sick of guessing what fair value was when looking at listings. Having clean data helped me negotiate better and avoid overpaying.\n\nFigured it might help others too, so I’m sharing it:\n\n👉https://singaporehomeprice.com/\n\nIt’s completely free, no login or ads. Just public data from URA, HDB (data-gov-sg) pulled into 1 clean interface. It's hosted on a free Cloud Postgres instance  - so if it gets too many users or absolutely no one uses it, it’ll eventually die either way.\n\nTry it out and let me know what’s useful, what’s missing, or what’s broken. Happy to improve it / add features if there’s interest.",
      "comments": [
        {
          "text": "Love the interface. I think one feature that will be cool to include is to toggle to also see the data of nearby flats with similar remaining lease. Like in the HDB map services, it shows the resale transactions within 200m. Just that the data in HDB map is limited only to the past year",
          "score": 10
        },
        {
          "text": "Thanks! It's a clean interface with clear data. However I tried with an old 1970s flat. Dun think the future 5 to 10 years projection should be linear; may need to incorporate Bala's curve?",
          "score": 5
        },
        {
          "text": "Thank you! good suggestion - I will add a section with +-5/10 blocks for HDB",
          "score": 4
        },
        {
          "text": "Its public data from here -https://data.gov.sg/datasets/d_ee7e46d3c57f7865790704632b0aef71/view",
          "score": 4
        },
        {
          "text": "Very nice ui! Though my search for my zip code and it only shows the latest data from 2023?",
          "score": 3
        },
        {
          "text": "Thank you for your contribution This is the kind of meaningful value add society needs",
          "score": 3
        },
        {
          "text": "Whats this zip code youre talking about? Watched too many us movies?",
          "score": 2
        },
        {
          "text": "it depends on your block, for example my block & floor range has no transactions since 10+ years (mature estate). I also know all my neighbours since then and nobody moved. could be similar case.",
          "score": 2
        },
        {
          "text": "Really nice clean interface! I like it very much! Thank you!\nMaybe add a switch for dark mode. Just a suggestion.",
          "score": 2
        },
        {
          "text": "Like the clean UI.  How do you come up with the 5 and 10 year outlook? Also which free Postgres provider do you use?",
          "score": 2
        },
        {
          "text": "My flat 1.9m in 10 years time. Ok bro.",
          "score": 2
        },
        {
          "text": "Easy to use and straightforward.Maybe have a new model for rental fees in the area that users are searching for. This would be great and save time for research for lessees or lessors.",
          "score": 2
        },
        {
          "text": "Cool stuff! Love it. Helps a lot for many buyers and sellers, I usually pull data for ura. Is your platform using api?",
          "score": 2
        },
        {
          "text": "Umm srx, edgeprop, etc all have the same estimated value feature. What makes yours different / better? Their estimates are down the to unit # and includes the exact size. Your interface may be \"sleeker\" but what buyers want is a proper estimate. Also, the recent transaction data is quite off.",
          "score": 2
        },
        {
          "text": "Thank you for the feedback - you can DM me the postal codes if you want to, and I can look into it further. It uses onemap, so if the property is newly built or any issues with post code it won’t show up.",
          "score": 1
        },
        {
          "text": "Same mine shows only till 2022 and 4 room price for specific level is way higher than 5 room 🤣",
          "score": 1
        },
        {
          "text": "Yea i did a search for a particular zip code and it shows data up to feb'24 only, whereas HDB map services show there are more recent transactions in dec'25 & jan'26",
          "score": 1
        },
        {
          "text": "Thank you! It’s using a basic growth rate for now - I didn’t want to over complicate it yet but will look into Bala’s curve.",
          "score": 1
        },
        {
          "text": "Yes recent transaction is off. I’m getting Covid era prices which is 60% of today’s value",
          "score": 1
        },
        {
          "text": "Thanks! 3-room HDB in redhill area is showing 940k, vs HDB valuation at 790k 8 months ago - if true I would be delighted!",
          "score": 1
        },
        {
          "text": "The estimate value is so far offff",
          "score": 1
        },
        {
          "text": "It’s using a basic growth rate for now - I didn’t want to over complicate since I didn’t know if anyone would actually use it.",
          "score": 1
        },
        {
          "text": "The agent thingie.. is it a breach of pdpa?",
          "score": 1
        },
        {
          "text": "Thank you for the feedback!",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qtlxx1",
      "subreddit": "singaporefi",
      "title": "South Korea halts trading after stocks freefall",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qtlxx1/south_korea_halts_trading_after_stocks_freefall/",
      "score": 59,
      "num_comments": 51,
      "created_at": "2026-02-02T13:04:53",
      "selftext": "Remember what I told you yesterday? This is just the beginning. When US markets wake up, all hell is going to break loose\n\nGet ready",
      "comments": [
        {
          "text": "I remember you saying “keep calm and carry on DCA-ing”. What happened to being calm? 🤔",
          "score": 66
        },
        {
          "text": "Koreans are chicken. -4% only halt trading.  No balls.",
          "score": 44
        },
        {
          "text": "Pet1003 4 days ago: \"keep calm and carry on DCA\" Pet1003 1 day ago: \"better to cash out when valuations are at an all time high\"",
          "score": 30
        },
        {
          "text": "That is not very DCA of you 😡",
          "score": 25
        },
        {
          "text": "You are so funny. WSB welcomes you -> Adaptability number 1.",
          "score": 16
        },
        {
          "text": "He never believed in DCA nor index investment. He's our resident alpha trading only in high risk/high stake trades.",
          "score": 14
        },
        {
          "text": "Oooooooo did someone get caught 🌚",
          "score": 9
        },
        {
          "text": "His DCA is dip cost accumulation. Lol. Obviously... He is trying to time the market",
          "score": 6
        },
        {
          "text": "That's why their national food is ginseng chicken.",
          "score": 6
        },
        {
          "text": "bro, stop scaring them lah.",
          "score": 5
        },
        {
          "text": "alamak ... he loves to talk to all of u, not just me. but u got to admit - he's more entertaining than the usual \"I bought ILP so sell or not\".",
          "score": 4
        },
        {
          "text": "This is called hedging. You say enough things, one of them is bound to be right.",
          "score": 4
        },
        {
          "text": "Don't follow him. The difference is he is playing the market like a sport but others are treating it as retirement funding.  He can lose 30% and still laugh.",
          "score": 4
        },
        {
          "text": "Can you help to control him? Like maybe you two just DM each other sometimes and keep this sub from turning into WSB?",
          "score": 3
        },
        {
          "text": "Haha I was thinking the same!",
          "score": 3
        },
        {
          "text": "The buy high sell low strat",
          "score": 2
        },
        {
          "text": "No, because you don't know if you sell now, tomorrow will already open at higher than when you sold. You have to be right twice.",
          "score": 1
        },
        {
          "text": "I went through the GFC and learned this the hard way myself. Took a few years just to break even. Don’t fall in love with your stock.",
          "score": 1
        },
        {
          "text": "More like \"please everyone DCA so you can pump my bags thanks\".",
          "score": 1
        },
        {
          "text": "Ya lor",
          "score": 1
        },
        {
          "text": "Meanwhile , Indonesian stock market crashes 8% in 30 mins. Chad Indonesians",
          "score": 1
        },
        {
          "text": "Objectively speaking, if the market is tanking right before your eyes, the least you could do is stop loss, take profits and move back in at a much better price. Things are now at ATHs and the window of opportunity is closing fast. Is this not true?",
          "score": -1
        },
        {
          "text": "If you do VWRA then do your DCA la I’m not doing VWRA and we have different risk appetite I don’t believe in holding stock at ATHs and would rather take profits",
          "score": -21
        },
        {
          "text": "I’m super calm, the Korean stock exchange is not lol Portfolio now at 90% cash and ready to go in bro",
          "score": -51
        },
        {
          "text": "And right now markets are crashing You have to adapt and move fast SP500 is going to tank tomorrow and you want to DCA? Just cash out and go back in after the carnage…is common sense bro",
          "score": -63
        }
      ]
    },
    {
      "id": "t3_1qsslwj",
      "subreddit": "singaporefi",
      "title": "If you were rich enough for a condo but still eligible for a BTO, which would you pick?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qsslwj/if_you_were_rich_enough_for_a_condo_but_still/",
      "score": 39,
      "num_comments": 83,
      "created_at": "2026-02-01T16:07:33",
      "selftext": "If let’s say you have about $1.5M cash waiting for you (e.g. inheritance), but your current household income is still below the $14K HDB ceiling, would you still bother with a BTO or go for condo straight?\n\nOn one hand, BTO is \"free money\" from the govt. On the other hand, you have to wait 3-5 years for it to be built and another 5 years for MOP. That’s almost a decade of HDB living and restrictions.",
      "comments": [
        {
          "text": "BTO also must see location and luck. Luck cannot be bought by money, if you're suay and keep getting lousy ballot numbers, then you also won't have much of a choice left.",
          "score": 83
        },
        {
          "text": "Depends. Where is condo? What about mortgage? What will you do with balance $ if you buy BTO?",
          "score": 52
        },
        {
          "text": "bto la, still can get subsidies and loan leniency from HDB. Your 1.5M pf can use to generate extra returns unless you planning to buy resale 40th floor 5room at clementi. 1.5m can only get you a newer 2bedder or an older 3bedder. Is it really worth the price? Unless your current living conditions feels like hell else just wait.",
          "score": 47
        },
        {
          "text": "Gt 1.5m dunnid wait for bto lottery already. Time is money. Why don't consider resale hdb? More value for money imo.",
          "score": 26
        },
        {
          "text": "Congrats on winning the recent toto",
          "score": 22
        },
        {
          "text": "When are you gonna get the 1.5M, that's the impt distinction. 5 years? 10 years?",
          "score": 17
        },
        {
          "text": "What’s so good about condo in your opinion? Whats wrong with a decade of HDB living (I plan to live many decades in HDB even though our HHI is way higher)?",
          "score": 13
        },
        {
          "text": "BTO. Easy choice",
          "score": 12
        },
        {
          "text": "Buy EC balance units, assuming you don't mind the location",
          "score": 11
        },
        {
          "text": "Agree with the luck part",
          "score": 9
        },
        {
          "text": "your reply was completely off coz he suggested a resale hdb is more value for money exactly like what you parroted after him",
          "score": 8
        },
        {
          "text": "Am very confused at your reply but agree with u on resale choice. All the best!",
          "score": 7
        },
        {
          "text": "Assume right away, or in time before the property purchase?",
          "score": 6
        },
        {
          "text": "Other than the occasional very infrequent (like once every 2-3 months) door to door which can be ignored, never encountered any of the things you listed that is disruptive Some like crazy exes or MIL is a you issue nothing to do with HDB or condo, and definitely not worth the extreme premium of condo + inconvenience of delivery",
          "score": 6
        },
        {
          "text": "Less waiting time. Because most balance units can directly buy and move in immediately (or less than 12 months) Furthermore, EC typically takes 3-4 years to build. Most of the profits come from after the 5 years MOP. So you are essentially achieving a similar profit in a less amount of time, improving your annual property growth rate",
          "score": 3
        },
        {
          "text": "Can get immediately without waiting 3-5 years, regardless of marital status or to a lesser extent, race. Thats the main benefit over bto imo.",
          "score": 3
        },
        {
          "text": "Ballot for BTO at prime location. Use the extra cash to get really good renovation and furniture. Invest the remaining balance.",
          "score": 2
        },
        {
          "text": "Agree! I don’t get why so many people chase after private property? The one who wins 100% is the property agent. IMO property is likely a big chunk of a Singaporean’s portfolio which means the latter will be sensitive to Singapore’s future. Think long term. With 1.5m, OP will be in a very good place if the OP goes with a BTO. OP can invest the amount in global passives, say MSCI ACWI (USD), which has generated 7.11% SI (annualised; Dec 2000 - Dec 2025) and is implicitly a bet that the world will remain relevant (vs single country/ SG risk). Just punching the numbers into a fin calc: FV = 6+ m where i/r = 5% (haircut from 7-11%); t = 30 (years); payment = 0 OP can live like a king and will likely be able to negotiate any financial decision from a position of strength, ie (hopefully) buy whatever you want whenever you want.",
          "score": 2
        },
        {
          "text": "Can elaborate more why you recommend this?",
          "score": 2
        },
        {
          "text": "Can sell faster, higher capital appreciation, more control over your property, higher SES and generally better neighbours (exceptions exists)",
          "score": 2
        },
        {
          "text": "1.5 is unfortunately longer that much in Singapore. We are looking at relocating full time back to Sg, and have to buy the property in cash (left young, no cpf, not inheritance either), and right now,  I'd rather pay 1.5 for a young resale then a crappy condo with only 2 rooms. More space is more important than the vague status symbol.",
          "score": 1
        },
        {
          "text": "you’re not making sense.",
          "score": 1
        },
        {
          "text": "[ Removed by Reddit ]",
          "score": 0
        },
        {
          "text": "No door to door charity. No door to door salesmen. No ah long. No crazy exes. No surprise visits from your mother in law. No drug addicts hiding in the stairway. No sex in the stairway. No bikes going brooom broooom brooom. No bastard teens in the basketball court. No screaming toddlers in the playground. No random jungle in the corridor. No Getai concert downstairs. No Malay wedding downstairs. No Chinese burning paper.",
          "score": -6
        },
        {
          "text": "What's so confusing? 🤣 That we left the country young and have no cpf and also the money is not from inheritance?",
          "score": -17
        }
      ]
    },
    {
      "id": "t3_1qth6jd",
      "subreddit": "singaporefi",
      "title": "What are some resources for a person starting his financial journey at 33?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qth6jd/what_are_some_resources_for_a_person_starting_his/",
      "score": 37,
      "num_comments": 26,
      "created_at": "2026-02-02T09:25:43",
      "selftext": "I’ve read The Psychology of Money, and about to start on The Art of Spending Money.\n\nAny resources for someone with a cooked dopaminergic system? Recovered drug addict, sober for 12 years but am into legal vices such as drinking, smoking and gambling.\n\nAm in debt but non interest bearing because these are loans from friends and family during a bout of unemployment.\n\nAnnual package / 12 sits around median income.\n\nare there any resources? support group? or lessons from 过来人 (people who have been through this before)",
      "comments": [
        {
          "text": "Knowing your enemy is half the battle won. The fact that you’re posting this shows that you know there’s a problem, so that’s a great start. For someone like you, who’s in debt and needs to find solid ground, Dave Ramsey’s baby steps is probably something to look into. While he’s from Tennessee and speaks mainly to an American audience, many of his concepts are quite universal. For starters, if you haven’t already done so, do what you can to get to a $1000 emergency fund. This is the bare minimum to tide you through dire times (illness/injury, job loss, unexpected expense) on a bare bones budget. Then the next step would be to pay down your debt. While much of your debt is zero interest, I would still consider paying it down before further bolstering your emergency fund because you don’t want to gamble (pun intended) on your friends’ and family’s goodwill. After that you can start bolstering your emergency fund to about 3-6 months of expenses. Post back after you’ve completed these steps. Wishing you success in your journey.",
          "score": 39
        },
        {
          "text": "Maybe not financial advice but more of 做人 advice... if you have debt to FRIENDS/FAMILY please for the love of god prioritise paying that off before even thinking about VWRA/investments. If not you're basically leveraging their kindness of charging 0% interest to invest first AT THEIR EXPENSE. Which is simply insane. Assuming that's not the case... once you've paid off everything then it's just building emergency fund, and starting to invest. If you've read the pinned post, you'll know the brokerage, tickers, the buttons to click and strategy to buy. You just need to make it an automatic process and that part is easy. If the struggle is from not being able to 'unlock' disposable funds month by month then probably it's a budgeting issue. Median salary in Singapore is plenty. Have to look at outflows and where to cut. That said, if you're already doing 1-2k to pay off debt every month, it's also being realistic - that's already a pretty good job and it's just managing mindset and emotions from there.",
          "score": 20
        },
        {
          "text": "Yeah OP is not paying interest for his debt but the friends are familyarepaying for them because they could have invested it and gained those interest instead.",
          "score": 11
        },
        {
          "text": "I'm pretty sure somewhere or it already has happened, that the usual VWRA slop will be fed again. Your first discipline to getting finances in order is to quit smoking, gambling and severely lessen drinking alcohol. If you cannot do these, there is absolutely no point in giving you any resources simply because you lack discipline. This is the best advice I can give you.",
          "score": 7
        },
        {
          "text": "Pay your friends and family back first. Clear that amount and you'll feel much better about the future. From what you've posted before, you clearly think ahead a little more than what's in front of you and while that can make you feel like you're in control, it's a farce. There's a linear progression to finances. I tried to build an emergency fund while investing and it left me with less cash on hand than I anticipated because I was trying to just plug holes in a sinking ship. Clear the debt, build the emergency fund, settle your renovation budget then start investing once all that is done. Delete the Singapore Pools app if you have to. Spend that money on an experience a month with your wife and kid.",
          "score": 6
        },
        {
          "text": "OP has been posting here for months. His problem is not lack of knowledge. But this is his first post where he has revealed his psychological struggles with gambling/addiction mentality.",
          "score": 5
        },
        {
          "text": "Yeah I mean we talk about 'good debt' and if this was a bank or org I would probably be the asshole and advocate you go and arbitrage by all means. But for friends and family....",
          "score": 3
        },
        {
          "text": "Your first and most important source of income is from your Job, hence look to see where your strengths or interest lie and proceed from there.",
          "score": 3
        },
        {
          "text": "You might be one of the rare people for whom ILP is a good thing. Force you to stick to the DCA plan and cannot deviate.",
          "score": 3
        },
        {
          "text": "Why can’t you start ?",
          "score": 3
        },
        {
          "text": "The best time to plant a tree was 10 years ago, \nthe second best time is today",
          "score": 2
        },
        {
          "text": "Pay back your plans before worrying about investing.",
          "score": 2
        },
        {
          "text": "I honestly don't know how to help you man... You're already doing good... You are already doing the right things and just stay the course... Have you tried i don't know, exercising more or something? I heard that can help with a \"cooked dopaminergic system\"",
          "score": 2
        },
        {
          "text": "People like OP just irks me. Haven start to climb but already thinking of flying. Perhaps you should gamble more, higher chance to strike rich.",
          "score": 1
        },
        {
          "text": "I haven’t been exercising as regularly as I had been because I moved and the gym requires a bus ride unlike a 5 minutes walk previously. I did start meditating tho… I’m at 6 minutes daily now. Yet weekend comes around and I’m itching for a good gamble. Singapore Pools thankfully instead of the sinkhole that is casino. I’ve been tracking my expenses and cigs are largely fixed, I don’t go overboard. Alcohol is relatively affordable as long as I consume at home. Gambling is….wack",
          "score": 1
        },
        {
          "text": "The Singapore Pools gambling fix abit the hard, unless you do something to replace it. Invest in a set of dumbbells or do calisthenics at home? Calisthenics can still get you jacked haha.",
          "score": 1
        },
        {
          "text": "Being rich, imo, goes hand in hand with attitude and discipline. Set aside money every month (known as DCA), for investing in a good, reputable fund and don't panic sell when it drops. Just hold. Whenever you want to spend money on your vices, go grab some 1 OZ silver coins instead. In ten years time you will thank yourself. If you are in debts right now, you gotta take on extra jobs and pay that off. Harsh reality of being in debt.",
          "score": 1
        },
        {
          "text": "Start with saving up a sum of money then see how from there, focus on your debts and clear off small sums, 1 by 1",
          "score": 1
        },
        {
          "text": "Hey — first off, 12 years sober is no small thing. That already tells me you’ve got more discipline and self-awareness than you’re giving yourself credit for. Since you’ve read The Psychology of Money, you probably already know this, but money issues are rarely math problems: they’re behaviour + environment problems. Especially if your dopamine system is a bit fried, you don’t want systems that rely on willpower. A few things that helped people I know: • Automate everything — salary → savings/investing immediately so you can’t “decide” later• Friction for vices (no betting apps on phone, cash limits, cooling-off periods)• Separate accounts: bills only / spending only / savings only• Gamify saving, not spending (track streaks, milestones) Also, parking spare cash somewhere that earns steady yield without you having to “trade” or tinker helps remove temptation. Platforms like chocolate finance (or similar cash management tools) are useful because they’re boring on purpose: boring is good when impulse is the enemy.",
          "score": 1
        },
        {
          "text": "Stop glorified him. If he has discipline, he wouldn’t even be engaging in these 3 major vices after quitting drugs. It is an insult to disciplined people.",
          "score": 1
        },
        {
          "text": "Check the pinned thread tbh",
          "score": 1
        },
        {
          "text": "Get Good with Money by Tiffany “The Budgetnista” Aliche. It lays out a 10-step plan for financial wholeness, starting with creating a realistic budget (like her “noodle budget” approach), tracking spending, building savings, and handling life events. The Total Money Makeover by Dave Ramsey.Straightforward and motivational, especially for getting out of debt and building emergency savings. Ramsey’s “baby steps” include strict budgeting, cutting unnecessary spending, and living below your means. Budgeting and setting aside funds monthly for repayment over a fixed schedule. Once clearing the debt is done, you can start go into savings/dca investing regularly. Good luck on your journey and wish you the best.",
          "score": 1
        },
        {
          "text": "Yeah was a pothead from the periods between 18 and 21 years old and experimented with ecstasy that saw me progressively increasing my dosage and started doing it weekly. Developed psychosis shortly after and with the help of a psych, I quit. What helped too was enlisting into BMT so I had the benefit of exercise. Doesn’t help that I’m on life long medication for chronic mental condition that blocks my dopamine receptors.",
          "score": -1
        },
        {
          "text": "I have. I can read all about how VWRA is a world diversified ETF that is great for passive investing but the problem here is I can’t even start. I guess my question is looking for unconventional resources or wisdom for my specific journey.",
          "score": -8
        },
        {
          "text": "Username checks out",
          "score": -12
        }
      ]
    },
    {
      "id": "t3_1qt4v38",
      "subreddit": "singaporefi",
      "title": "What would you do differently if you were to restart your investment journey?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qt4v38/what_would_you_do_differently_if_you_were_to/",
      "score": 11,
      "num_comments": 28,
      "created_at": "2026-02-02T01:35:52",
      "selftext": "Hi all,\n\nI’m in my early 30s, based in Singapore, and at an early stage of building a long-term investment plan.\n\nCurrent position: Mainly cash, with some exposure to ETFs\n\nI’m currently reading up on different approaches and would appreciate perspectives from the community on how people here think about:\n\n• global equity ETFs vs US-focused (e.g. S&P-style) exposure\n\n• whether and how much SG-centric exposure makes sense in a long-term portfolio\n\nNot looking for specific product or stock recommendations — more interested in overall strategy, trade-offs, and common pitfalls to watch out for as a Singapore-based investor.\n\nI’ve accumulated about SGD 300k in cash so far, and I’m trying to think through how best to deploy it over time\n\nThanks in advance, and appreciate any shared experiences.",
      "comments": [
        {
          "text": "i'd suggest first to establish an expected annual return that you're working towards to, and consider to build a diversified portfolio with a blended average return that match your expectation (using average across your time horizon) and making adjustments accordingly over time with more experience gain in the market and changing market conditions. Also advisable to create a DCA plan and not do a one single lump sum investments unless you dont mind short term market volatility. if you're keen to put in some effort for research, you can look into individual companies to invest in too that may yield better overall returns. ETFs - less volatile, diversified, generally simpler to hold. global vs US just means you dont have single country exposure risks, though potential lesser returns as trade off. consider thematic ETFs to tap on trending momentum too (AI, data centers, energy, fintech, robotics, semiconductors, etc.) Stocks - higher volatility, single company exposure = risker, potentially higher capital growth if chosen right. SG exposure - STI had an incredible year in performance, however historically many SG stocks tends not to be growth focus (more towards dividends) , probably good for a safeguard in a portfolio setup. common pitfalls - emotions involvement in investments. FOMO rush into investments that had already had a huge run up alr (you become other ppl's exit liquidity), and then panic sell when there's a short term selloff happening (it happens if you dont have convictions in your holdings). FX risks if investing in other currency dominated investments.",
          "score": 9
        },
        {
          "text": "If you're looking for capital gains - go for US / Global exposure. Here atr/singaporefi, there's a huge consensus for ETFs (SP500) - SPY, VOO, CSPX, VWRA etc. Simple reason (Pro) - tested and proven. But it also depends on your own risk appetite and goals. (Con) Trump (for now at least) - there's a great deal of market manipulation. One week he will threaten tariffs like a spoilt brat (with the powers of a president), and the next he will claim world peace. Case in point - look at the Greenland episode recently. If you're looking for dividends (Pro) - you can consider SG stocks. (Con) Do note that SG stocks are highlynotrecommended for capital gains - STI has been going sideways for the past 30Y. However, given that SG Gov / MAS is pushing for more reforms, there could potentially be some action in the next 5Y period.",
          "score": 6
        },
        {
          "text": "If I were to restart, I would put majority into world ETF and over the years, slowly include STI and then later bonds 10 years before retirement. Diversification more broad based than what I did",
          "score": 3
        },
        {
          "text": "Take your time with your investment decisions; there’s no need to rush or let FOMO influence your actions. The year ahead is expected to present plenty of attractive buying opportunities. Before entering any position, take a step back and reflect on your investment preferences. Which sectors, themes, or regions resonate with your long‑term outlook? What type of portfolio are you aiming to build, one that emphasizes steady income or one focused on growth? Clarifying your objectives and time horizon will help ensure that each investment aligns with your broader financial goals and risk tolerance.",
          "score": 3
        },
        {
          "text": "Buy a low cost etf and leave it alone. Let it compound. Hold it through the highs and especially the lows. I did it in chunks back in 2020 and early 2021. Should have just did it in one shot instead. Sitting at 90% gains now. Going to let it continue to compound until I retire.\nSee proof:https://imgur.com/a/xR5srMu",
          "score": 2
        },
        {
          "text": "DCA is definitely the right choice to grow and it's a tested and proven strategy. There are many helpful resources on this sub. Also I will assume that you're talking about market diversification since ETFs are already in and of itself diversified (although albeit in the same market). \"Dividend farming\" is also a common and proven strategy which works in SG's stable and predictable economy.",
          "score": 1
        },
        {
          "text": "I’m only invested in S&P and VOO atm",
          "score": 1
        },
        {
          "text": "Thanks for sharing. I wanted long-term capital growth, but a lack of consistent buying held me back. Looking back, plenty of missed opportunities.",
          "score": 1
        },
        {
          "text": "Genuinely happy for you! My portfolio comes nothing close to this",
          "score": 1
        },
        {
          "text": "I would invest my cpf earlier. I would also not top up cpf not repay my hdb cpf loan. I would finally skip sg reits.",
          "score": 1
        },
        {
          "text": "Skip sg reits because of the lack of growth?",
          "score": 1
        },
        {
          "text": "Yes",
          "score": 1
        },
        {
          "text": "BTC",
          "score": 1
        },
        {
          "text": "Honestly have 0 exposure in cryptocurrency",
          "score": 1
        },
        {
          "text": "Take action.. the mistake most ppl do is analyse and then don't execute properly or consistently.. when things take a turn they forget their convictions. Be it etf or unit trust or stocks..taking action and consistency is key",
          "score": 1
        },
        {
          "text": "Pretty sure my biggest mistake has been doing nothing. Been telling myself “it’ll go lower” for a couple of years now",
          "score": 1
        },
        {
          "text": "Note that no one ever said “buy an ILP”",
          "score": 1
        },
        {
          "text": "It’s been awhile since we last met, catch up over coffee?",
          "score": 1
        },
        {
          "text": "Can start with your expected returns then only look at the financial products to best support it Dividend stocks is 1 option that is pretty stable imo You might also want to carve out a portion of the funds for emergency funds as well.",
          "score": 1
        },
        {
          "text": "Don’t have an expected return in mind as of now Honestly just looking at building a portfolio so I let my money work instead of rotting in the bank",
          "score": 1
        },
        {
          "text": "If that is the case, can start with ETFs and Savings Bonds first.",
          "score": 1
        },
        {
          "text": "Answering your title question. If I were to restart, would have liked to be more consistent in DCAing to the market and not delve too much into headline news,  influencers, forum posts, etc.",
          "score": 1
        },
        {
          "text": "Thanks! I guess it’s not too late to start now I’ve been sitting out for a couple of years. FOMO didn’t strike",
          "score": 1
        },
        {
          "text": "Thanks for sharing! Still got some time on my side, so ETFs + DCA is my main plan. Will take stock picking and FX slowly",
          "score": 0
        },
        {
          "text": "Thanks for sharing! I’m mainly focused on long-term capital growth, so I’m leaning towards US/global ETFs and taking a DCA approach rather than worrying about short-term noise SG stocks make sense for income, but for now I see them more as a diversification piece than a core growth driver",
          "score": -1
        }
      ]
    },
    {
      "id": "t3_1qtiy4f",
      "subreddit": "singaporefi",
      "title": "should i opt for higher risk?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qtiy4f/should_i_opt_for_higher_risk/",
      "score": 8,
      "num_comments": 25,
      "created_at": "2026-02-02T10:44:23",
      "selftext": "currently 21M serving NS, drawing 1.6k monthly. planning to DCA 1k monthly into ETF\n\nhowever, i lumped sum 8k into VWRA 6 months ago and the returns seems slow. should i go for a high risk ETF like SMH?\n\ncurrently waiting for uni in aug, dont have foreseeable high purchases in the upcoming years. planning to downpay BTO with CPF, uni fees all fully paid for\n\nTLDR: 8k VWRA to SMH for higher potential returns? please advise",
      "comments": [
        {
          "text": "brother it's been 6 months lol, 13% in 6 months is pretty good. this sounds like a prime recipe for a follow up post in a few months about how you got burnt playing options.",
          "score": 31
        },
        {
          "text": "Lol. Go for it man. Some people need to burn their hands first to learn. Even though Im fully vested, I am ready for the bubble to pop. In fact; I WANT the bubble to pop. Genuine question, why SMH? Why not GLD or even leveraged gold (UGL)? They have higher 1 year returns than SMH... Hell, why not a Western Digital + Sandisk + Micron combination? They increased the most within the S&P500 last year...",
          "score": 20
        },
        {
          "text": "Yea, im kinda sure. It'll hurt, but atp, I have more stuff to worry about lmao. Itll be cool to see how ill react also since my portfolio wasn't that big when the covid drop happened. Maybe I'll become the next electronic tear or smth",
          "score": 5
        },
        {
          "text": "Dude sounds like he's about to make 8k turn into 800k by the power of investing with the way he talk it about bto, cpf and uni fees.",
          "score": 4
        },
        {
          "text": "Chill on switching just for \"fast gains.\" 13% in 6 months isn't bad at all. SMH swings hard, could double or halve before u even graduate. Patience, bro.",
          "score": 4
        },
        {
          "text": "Good.  Markets have always recovered. The real danger isn't a drawdown.  It is panicking and selling during one. Best thing to do during a drawdown is to be busy with other stuff and stop looking at your port :)",
          "score": 3
        },
        {
          "text": "I hope u become the next electronic tear haha. Guy is so wrong tt inverting him is so profitable. Even better than cramer.",
          "score": 3
        },
        {
          "text": "i like this quote \" no one likes to get rich slowly\".higher risk = higher return. who dont like high return but can you take it if your portfolio becomes zero? or 8k become 2k? now the risk is 8k, in the furture, can you take it if 80k become 20k or even 800k become 400k? have these sort out to know your risk capacity before you take the risk. cheers. its good to be young.",
          "score": 3
        },
        {
          "text": "Sure? We are at 40, mean is 17.  A true reversion to mean pop is a close to -60% haircut.",
          "score": 2
        },
        {
          "text": "I been through 2000, 2008, 2020 .... Only a small minority that truly waited will buy.  Majority that were already fully vested will crumble.",
          "score": 2
        },
        {
          "text": "Boring is good but some people prefers dopamine",
          "score": 2
        },
        {
          "text": "Your progress is slow because your initial capital is low for now. You will see the gains once you have saved and invested six figures.",
          "score": 2
        },
        {
          "text": "Yes of course, you are so young. Definitely take more risk. But need more context\n- are you from a poor household? \n- is 8k a lot?\n- uni fees who pay?\n- if lose all, will parents give pocket money? I think a middle ground would be to have 3k in etf, 5k for high risk",
          "score": 2
        },
        {
          "text": "SMH is not leveraged.",
          "score": 2
        },
        {
          "text": "Young people generally can handle larger risks, but leveraged ETFs have leverage deterioration, (performance takes a heavy long-term hit if price stays low for a long time) Id suggest identifying what time horizon you're looking for, and whether to seperate short term and long term trades/investments or not. Most people go for an all world etf like vwra but you can always go into world industry etfs like tech, or if u rlly like Cryptos, an etf made for that. Most importantly is if the risk sounds right to you or not.",
          "score": 1
        },
        {
          "text": "Establish your risk tolerance and investment time horizon 1st (with your profile, may target 10-15 years). May consider diversifying some weightage of your portfolio into more focused ETF (geographically, sector, thematic) importantly understand what you are holding. I’d say aiming for around 10% p.a. could be a good starting point however with risker investments, understand short term volatility may occur. NFA - take some time to do some research and dip in slowly. Good luck!",
          "score": 1
        },
        {
          "text": "No, don't let greed blind you. You buy VWRA now, you still have a chance to switch into SMH at bargain basement price if there is an AI bubble pop. You buy SMH now and there is high risk that you will be wrecked because tech/semiconductors has a big chance of reversal after running up so much last year.",
          "score": 1
        },
        {
          "text": "You want higher gains but can you tolerate larger losses?",
          "score": 1
        },
        {
          "text": "Slow is smooth. Smooth is fast. SMH will sound nice, until it isn't.",
          "score": 1
        },
        {
          "text": "All in TQQQ!",
          "score": 1
        },
        {
          "text": "SMH if you really go into SMH",
          "score": 1
        },
        {
          "text": "Are you okay with losing 8K? Do you think you can earn back 8K easily? If the market goes sideways this or next year, you can be down 50%. Will you hold your position? If you can answer yes then go ahead and buy SMH.",
          "score": 1
        },
        {
          "text": "how u draw 1.6k in NS",
          "score": 1
        },
        {
          "text": "Precisely. If shit really hits the fan, doubt those 'crash buyers' will actually do what they say. Alot of things can go wrong during that period.",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qtmtws",
      "subreddit": "singaporefi",
      "title": "Inputs welcome on lower income CoastFI strategy",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qtmtws/inputs_welcome_on_lower_income_coastfi_strategy/",
      "score": 7,
      "num_comments": 2,
      "created_at": "2026-02-02T13:51:59",
      "selftext": "Hi everyone, will like some inputs on my current plans for FI earlier on a lower income as I tend to be over-optimistic in my plans.\n\nStatus: 41F, single no kids, own 3 room HDB, mortgage fully paid by Q2 2026, no plans to change housing as of now.\n\nFinancials:\n\n- CPF OA left 20k. 6 months emergency funds in place. Already have ISP and early CI for medical coverage. Also own term life coverage till age 60 (for parents mainly).\n\n- 1 savings insurance plan to be fully paid in 8 years time, not letting go as already far in and intend it as a low risk option in the meantime and maybe use it to top up VWRA or CPF to FRS/ERS after maturity.\n\n- No other investments currently as I was focused on being debt free.\n\n- Salary in the 7% income tax bracket.\n\nCurrent Plan:\n\n- Top up CPF SA to FRS to get tax relief and the low risk interest.\n\n- Invest all spare cash from employment into VWRA via IBKR for at least 10 years (est 12 - 20k annually, dependent on bonuses). I opened an account and am ready to DCA.\n\n- Reinvest CPF OA monies above 20k balance into an ETF (most likely Amundi World?)\n\nFuture plan:\n\n- stop working at age 50 for maybe 1-2 years and survive via whole unit rental and geo-arbitrage through slow travel in LCOL countries. Like this, visa is not really a concern as intend to just stay a few months. I will likely to have to split a portion of the rental income with a sibling as I intend to use their home extra room as a base, we may also decide to formally move in together and share the rental income. In worst case scenario, may have to draw from savings or investments.\n\n*Caveat: This plan may be delayed a few years dependent on parent health situation as well.\n\n- find a lower paid and stress free role to cover daily expenses to coast till retirement age\n\n- Intend to not touch my ETFs and let it compound till retirement age.\n\nSome thoughts:\n\n- I do not foresee myself able to retire early as I am lower income. However, don't think I can continue the slog till retirement age. Maybe this is me still stuck a bit in the YOLO mindset but I prefer to take a break in between and not delaying plans to travel at a much older age.\n\n- simple lifestyle works for me, not exactly cai png only as I enjoy food. But not the kind must dine at restaurants regularly and am ok to cook own meals. Hobbies are generally cheap (reading, taking outdoor walks and playing games).\n\n- will need to work after the break as still need to pay for medical insurances, also think I am the type that prefers some structure and routine regular employment  provides. Have a family member who is PHV driver, we discussed before can share and split the rental cost as an employment option.\n\n- also am padding more for retirement age (targeting ERS) as single must take care of ownself, have extended family (nieces and nephews) as support but do not want to trouble them financially, just probably need help with admin stuff if one day I have to move to a home.\n\n- Plan to die with zero, if I go early or have leftovers from CPF and investments to benefit my nieces and nephews will be nice but no a must.\n\nWelcome any inputs to help take a more cautious approach or update me of any major gaps I missed. Thanks a lot in advance!",
      "comments": [
        {
          "text": "My view is there will be higher chance of FIRE if you buy VWRA instead of topping up CPF SA, given about 20 years horizon. Of course, the risk level is different. You can always top up CPF later. The higher returns of equity may beat whatever tax relief you can get, and you have more liquid assets. I wouldn't say 7% tax bracket is low income, and you have a simple lifestyle. You can probably FIRE but it depends on your expenses.",
          "score": 2
        },
        {
          "text": "Thanks for the inputs! I guess then it comes down to risk tolerance whether to focus on equities for higher returns. Feeling the uncertain employment climate and may want to front load as much as possible to equities. Already picking the vanilla choice, VWRA… Maybe I just feel lower income as a lot of active posters in the sub seemed so much more ahead. But you are right, not that lean with 7% tax bracket, just need to be careful with planning.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qti9y5",
      "subreddit": "singaporefi",
      "title": "What to do with life insurance policies my parents made me buy?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qti9y5/what_to_do_with_life_insurance_policies_my/",
      "score": 7,
      "num_comments": 14,
      "created_at": "2026-02-02T10:14:26",
      "selftext": "I have 2 whole life (I believe investment-linked) policies with a death benefit of between $100k and $250k that my parents made me buy. One of them no longer requires a premium but I’m still paying an annual premium of over $4000 for the other.\n\nI have since moved abroad and I personally want to surrender these policies (or at least the one that I’m still paying premiums for) because they no longer serve any purpose (and tbh didn’t really serve any purpose at all). While I now have a kid, I am also at a household net worth where these death benefit amounts aren’t going to move the needle much, and on top of that I have almost $1 million in life insurance provided by my employer as part of my benefits package. Also, paying it is an inconvenience since I moved abroad and I don’t want to keep having to move money around every year to pay it. On top of that, in the event of my demise, I doubt my spouse and kid will even know about the existence of this policy and making a cross-border claim is a hassle.\n\nHowever every time I bring up the issue of surrendering these policies, my parents react in a very offended way and say that I would be stupid to give up the security of these policies. What would you do in this situation?",
      "comments": [
        {
          "text": "Are you still illiterate now? Go find out dude.",
          "score": 16
        },
        {
          "text": "What policies are they? How to give advice when there are no details? However every time I bring up the issue of surrendering these policies, my parents react in a very offended way and say that I would be stupid to give up the security of these policies. What would you do in this situation? Don't tell them",
          "score": 8
        },
        {
          "text": "Dude grow a spine and just take action since u are paying it. My parents also say dumb financial stuff which I will completely ignore.",
          "score": 6
        },
        {
          "text": "I don't know why some adults still ask permission from parents when the parents are not paying anymore.",
          "score": 3
        },
        {
          "text": "Mean but true",
          "score": 3
        },
        {
          "text": "Whilst you have corporate insurance provided, you shouldalwaysstill have your own personal insurance. You can never guarantee that you will not be made redundant. And if/when that day happens, you need something to fall back on. Also, the way you phrase your post is concerning. According to you: I have since moved abroad ... the one that I’m still paying premiums for ... While I now have a kid You have moved abroad, are the premium payor and are also a parent now. Why does your posting still reflect that of a kid's mentality? It's 2026 - there's google AND AI, you could easily find out more about these policies whether they are life insurance or ILP. Secondly, you are already a full-grown adult but you're still caught up in the \"what would my parents think mentality\" as if you need validation and permission? However every time I bring up the issue of surrendering these policies, my parents react in a very offended way and say that I would be stupid to give up the security of these policies Why do you need to ask them for permission when you're the payor? Are you truly an adult capable of making your own decisions or do you still need to be babysat?",
          "score": 3
        },
        {
          "text": "Too little details but from your post, there are a few points I can make The employer life insurance benefit is nice, but common advice is to not fully rely on the employer given schemes. Main reason is that if you get retrenched, you may be at an age to not qualify/overpay for personal insurance. I would treat it as an add on, but make sure you are covered with your own policies. The ILPs do indeed provide low payouts for the high premiums. This does not mean your alternative is not having any insurance (I'm assuming the employer insurance is not part of the financial plan). You should aim to get term insurance, which provides high payouts for cheaper premiums, refer to posts in this sub as a guide. Even being overseas, my knowledge is that SG insurance is still cheaper to get and cover almost worldwide. For approaching your parents regarding this, one way is to not tell them, or brush it off when it comes up in conversation. You took over the plans and have the right to decide what to do. However, if you prefer a more level headed conversation, tell them firmly your overall plan, eg buying term insurance to guarantee higher payouts/reduce costs, using your current country insurance for ease of claiming, using the employer insurance as a stopgap (likely won't sit well as per reasons above). To not let them be offended, it probably involves a nuanced explanation on the uses of insurance, as \"safety\" is not part of the ILP given the premium/payout ratio. This is up to your explanation skills and their personality, so all the best.",
          "score": 3
        },
        {
          "text": "Alternative take You tell your parents you make an irrevocable nomination on those 2 policies that pays out the $350k to them. Then your parents take over the premium, you wash your hands of it. If you pass early, your parents get that $350k, since you see $350k not as significant. The other comment already brought up the risk of employer provided insurance so I wont touch it. Life insurance is the only product that will be accessible after your death. All your other assets are frozen pending probate. Its not about moving the needle, its about having options and funds during times of need.",
          "score": 2
        },
        {
          "text": "No harm keeping the one without a premium since you don't have to do anything anymore. I would say cancel the one that still requires a premium since financially you don't care for it. If your parents disapprove, tell them to pay for it lor. It's your money, you have the right to do whatever you want with it",
          "score": 2
        },
        {
          "text": "There are many types of ILP. If you have the old days types of ILP, you generally don’t need to surrender. You can take out the sum from the ILP and invest it yourself (if you want). Meanwhile, continue to pay to keep the insurance portion running. Since you are wealthy, it doesn’t matter. You can treat it as a small saving plan, which comes with insurance coverage (instead of an investment linked plan). Thus, honestly, unless I am better off by surrendering, I won’t bother to do anything and just continue with the plans.",
          "score": 1
        },
        {
          "text": "I would suggest to stick to it unless you have your own personal whole life that is larger than this that your parents bought",
          "score": 1
        },
        {
          "text": "Having corporate insurance is good but you should have your own insurance as well. Corporate ones only in effect during your employment tenure",
          "score": 1
        },
        {
          "text": "Ideally get hold on some key information of your policies (surrender charge, min years of holding, how many more years of premium paying, whats the underlying funds invested, what’s the total annual fees you are charged) so you could make a more informed decision. If there’s no more surrender penalty charge, check what’s current surrender value and if you deem satisfactory you may consider redeeming them. However, also consider what you intend to do with the surrender value cash that comes back to you. Your parents may not be aware of how ILPs work, might be good to sit them down and explain to them the facts (the portfolio values are non guaranteed, admin fees are usually charge on the total portfolio hence can be quite costly cumulatively)",
          "score": 1
        },
        {
          "text": "I frankly don’t really know since I signed for them when I was financially illiterate. I think they are investment linked whole life policies. There is a surrender value that I will get if I do surrender them.",
          "score": -2
        }
      ]
    },
    {
      "id": "t3_1qsrvds",
      "subreddit": "singaporefi",
      "title": "Travel Insurance for partially used ticket",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qsrvds/travel_insurance_for_partially_used_ticket/",
      "score": 2,
      "num_comments": 5,
      "created_at": "2026-02-01T15:25:32",
      "selftext": "Hi, I bought FWD Travel Insurance + Cancel for any reason.\n\nI bought round trip tickets. I took the departure flight but cut short my trip by refunding the return flight (got back $16 of taxes) and booking another return flight.\n\nUnder Cancel for Any Reason, it seems that I can claim for the unused portion of the original flight ticket (so I assume just the original return flight). However, I only have the round trip price and not individual flight price. Anyone knows how much I can claim back?",
      "comments": [
        {
          "text": "Usually, for such scenario, you can still input the full amount first. The claim officer will then assess what is the suitable pro rated amount to be reimbursed, subject to the policy wording.",
          "score": 6
        },
        {
          "text": "Thanks! I read through the policy but didn’t find anything, do you know of the way that they will prorate/calcukate the flight price?",
          "score": 1
        },
        {
          "text": "Thanks! I read through the policy but didn’t find anything, do you know of the way that they will prorate/calculate the return flight price?",
          "score": 1
        },
        {
          "text": "Not anywhere near the insurance industry, but it makes sense if they reimburse you for the exact amount it cost you to fly back to Singapore on the new return flight (unless it's a different class/airline). Make sure you ask them for at least that much.",
          "score": 1
        },
        {
          "text": "Thanks!",
          "score": 1
        }
      ]
    }
  ]
}