{
  "schema_version": "raw_scrape_v1",
  "report_id": "2026-02-05",
  "scraped_at": "2026-02-05T12:18:01.194202",
  "subreddits": [
    "singapore",
    "askSingapore",
    "SingaporeRaw",
    "singaporefi"
  ],
  "total_posts": 40,
  "total_comments": 536,
  "posts": [
    {
      "id": "t3_1qvoz2t",
      "subreddit": "singapore",
      "title": "Woman in S'pore, 34, charged for allegedly telling daughter to drop rape case against stepfather to be 'one happy family again'",
      "url": "https://old.reddit.com/r/singapore/comments/1qvoz2t/woman_in_spore_34_charged_for_allegedly_telling/",
      "score": 511,
      "num_comments": 50,
      "created_at": "2026-02-04T21:46:15",
      "selftext": "",
      "comments": [
        {
          "text": "Worthless mother",
          "score": 466
        },
        {
          "text": "&gt;She also allegedly promised to give her daughter anything she wanted if she did so.\n\nReally? Cause the daughter wants justice and she clearly doesn't want to give her daughter that! Fuck off with this one happy family bullshit. Happy for who?",
          "score": 323
        },
        {
          "text": "I think this shows the mindset that some asian parents have. They rather sacrifice their child's happiness and safety for status quo and face, my parents are like this too, Face is more important than happiness. If there wasn't a gag order, the family is ruined but with gag order, no one really knows which family it is, on the outside, it looks like a happy family but all family have their secrets and sooner or later, it will destroy and erode the family\n\nThis is just disgusting",
          "score": 173
        },
        {
          "text": "Feel so sorry for the poor victim to have a mother like this.",
          "score": 172
        },
        {
          "text": "I hope the judge imposes the harshest sentence possible on this scum of a mother to make an example of her. It is really really sad that the person whom you are supposed to trust the most, who is supposed to protect you from harm, chose to screw you up.",
          "score": 73
        },
        {
          "text": "&gt;In early 2023, the woman purportedly told her daughter that if she withdrew the case, she would remain in a girls' home \"for only about two years\".\n\n&gt;She is also accused of telling her daughter that the man would otherwise face a prison term of around 20 to 30 years, while she was in a girls' home for a much shorter period of time.\n\nThis is a lot, for some reason I rather she stayed longer in a girl’s home than with her “real family” because you know, obviously they are the real monsters",
          "score": 65
        },
        {
          "text": "This case is objectively horrific, but the one silver lining is that either the daughter found the courage to speak up, or someone reported it on her behalf. Imagine if she had just suffered in silence the entire time.",
          "score": 62
        },
        {
          "text": "Toss her in jail.\n\nSince she wants to worship Ghislane so much, she can go to jail too.",
          "score": 44
        },
        {
          "text": "If there is no consequences, it will happen again!😠",
          "score": 37
        },
        {
          "text": "you can never be a happy family after this.\n\nyou cant just pretend this never happened.",
          "score": 32
        },
        {
          "text": "After rape, there can be no happy family. Only crime and punishment. The mother, is no mother at all.",
          "score": 24
        },
        {
          "text": "The focus on a good image, face and harmony in society is really toxic. All those are meaningless if it causes pain and harms people. \n\nGood for the law to step in here but honestly, it is also so sad that the situation needs the intervention of law.",
          "score": 17
        },
        {
          "text": "Reminds me of the presch with the SA cook--the vice principal said if her kid was SA, she'd rather not know (as a sorry excuse for a defense). TF? So out of sight out of mind? Same type of garbage meatsacks.",
          "score": 15
        },
        {
          "text": "That’s just disgusting to do.",
          "score": 15
        },
        {
          "text": "All child deserve parents but not all parents deserve a child.",
          "score": 11
        },
        {
          "text": "&gt;Each charge of perverting the course of justice carries a maximum penalty of seven years’ jail, a fine, or both.\n\nGive her BOTH",
          "score": 10
        },
        {
          "text": "I think it's related to this case\n\n \"Man admits to sexually abusing stepdaughter; he and victim’s mother pressured girl to drop case\" \n https://www.straitstimes.com/singapore/courts-crime/man-admits-to-sexually-abusing-stepdaughter-he-and-victims-mother-pressured-girl-to-drop-case",
          "score": 8
        },
        {
          "text": "Hope mum gets punished too for trying to conceal a crime",
          "score": 8
        },
        {
          "text": "What a horrible human being that mother is. And of course, the stepfather.\nThat poor kid, was probably relying on her Mum to help and protect her and she does that.",
          "score": 5
        }
      ]
    },
    {
      "id": "t3_1qvfy05",
      "subreddit": "singapore",
      "title": "What’s Wrong with putting Lunar New Year",
      "url": "https://old.reddit.com/r/singapore/comments/1qvfy05/whats_wrong_with_putting_lunar_new_year/",
      "score": 454,
      "num_comments": 293,
      "created_at": "2026-02-04T13:25:56",
      "selftext": "I saw this discussion on XHS and noticed that some Chinese students strongly prefer the term “Chinese New Year” over “Lunar New Year.” Some even say that it is based on a lunisolar calendar rather than a purely lunar calendar.",
      "comments": [
        {
          "text": "Some Chinese nationals can be triggered by very minor things. Best to ignore.",
          "score": 911
        },
        {
          "text": "I'm Korean but I never really cared so I just said CNY, but I might have just been convinced to start saying Lunar New Year from now on.\n\nIt's like those white people who see a single black or Asian actor in their favorite show and scream as if they're being ethically cleansed.",
          "score": 441
        },
        {
          "text": "Every year during this period will have this \"debate\" being surfaced. Not sian meh? 😒",
          "score": 424
        },
        {
          "text": "Actually it's bullshit tbh. In China they call it 春節. Why these PRCs are raising hell over nothing is beyond me.\n\nIn fact I believe the PRCs who are raising hell just happen to be scum that floated over here from China. Not all China ppl are like that.",
          "score": 164
        },
        {
          "text": "Why every year same shit",
          "score": 124
        },
        {
          "text": "Tbh… I can call it as CNY and I don’t care… You can call it LNY and you don’t care.. it’s still the same celebration and traditions… why the need to be a pickle over how someone calls it?",
          "score": 48
        },
        {
          "text": "The PRC version of Happy Holidays vs Merry Christmas. They think its wrong you say LNY over CNY because its a Chinese holiday. Personally I don't get mad over either one, especially if you know your audience includes people who celebrate LNY (e.g., Vietnamese and Koreans) but are not Chinese.",
          "score": 33
        },
        {
          "text": "Xin Nian Kwai Le literally means Happy New Year, not Happy Chinese New Year.",
          "score": 23
        }
      ]
    },
    {
      "id": "t3_1qw7gqj",
      "subreddit": "singapore",
      "title": "Amos Yee's Letter to the Singapore Government: You shouldn't let me back into Singapore",
      "url": "https://old.reddit.com/r/singapore/comments/1qw7gqj/amos_yees_letter_to_the_singapore_government_you/",
      "score": 401,
      "num_comments": 160,
      "created_at": "2026-02-05T09:26:06",
      "selftext": "&gt;Call me naive but I think if I really put my mind to it, I can topple Singapore 60 years dictatorship. I know you regretted arresting me 10 years ago and all the negative national &amp; international press you received from shining light on the human rights abusing hellhole Singapore for imprisoning a 16-year-old who just expressed his political opinions.\n\nHe delulu the max. The main fear is that he is going get prison sentence for evading NS, which is why he doesn't want to come back to Singapore.",
      "comments": [
        {
          "text": "&gt;I can topple Singapore 60 years dictatorship \n\nHow about you stop being a pedo first",
          "score": 441
        },
        {
          "text": "Looks like he hasn't matured a bit. Those years in prison must have stunted his development. Still writes like an edgy teenager.",
          "score": 240
        },
        {
          "text": "The level of delusion is off the charts. But then if you go and listen to what his mother has to say. He’s just a product of crazy bad parenting.",
          "score": 102
        },
        {
          "text": "\\&gt;delulu\n\nRemember that this idiot attacked an Asian person in America for being Asian during the lead up to COVID.",
          "score": 83
        },
        {
          "text": "Lai I want to see you topple the govt. Faster try we want to see.",
          "score": 41
        },
        {
          "text": "Is this his desperate attempt to avoid being deported?\n\nHe's a pedo. He's a criminal.\n\nWe don't want him.",
          "score": 39
        },
        {
          "text": "reset the counter!!!!",
          "score": 34
        },
        {
          "text": "Our very own Johnny Somali. This guy would get the beat the fuck up no matter where he go.",
          "score": 30
        },
        {
          "text": "Last time he was a kid. \n\nNow if he comes back SG, he’ll be an adult. The law will regard him differently. Maybe ISD will bring him drink kopi.\n\nI interpreted his letter as a fear that if he’s deported back to SG, his life could be much worst.",
          "score": 30
        },
        {
          "text": "US doesn’t even want that piece of trash anymore, nobody wants to save a pedophile",
          "score": 19
        },
        {
          "text": "Lol I'm ashamed of myself for clicking to read his drivel",
          "score": 19
        },
        {
          "text": "He will still need to serve NS even after serving his jail sentence for defaulting. \n\n\nSo after all that trouble to avoid NS, going to jail in America and Singapore, he will still have to serve his 2 years. \n\n\nThat's his biggest fear. ",
          "score": 14
        },
        {
          "text": "The SG Government is not stupid, as he'll still cause his mischief wherever in the world he is. So better to have him here where they can keep locking him up.\n\nHe's writing this because he's scared of going back to Singapore where the government has more tools available to them to curb his behaviour.\n\nThe Singapore Government will definitely issue his travel documents and will personally escort him back, straight into a holding cell, where he will likely go before a court for absconding from military service, and he will get the three years. After that they will still make him do NS, or explore other options.",
          "score": 9
        }
      ]
    },
    {
      "id": "t3_1qvinku",
      "subreddit": "singapore",
      "title": "Top agent Rayne Chua at Melvin Lim’s KW Singapore leaves for ERA with many members of her team",
      "url": "https://old.reddit.com/r/singapore/comments/1qvinku/top_agent_rayne_chua_at_melvin_lims_kw_singapore/",
      "score": 322,
      "num_comments": 69,
      "created_at": "2026-02-04T16:00:20",
      "selftext": "",
      "comments": [
        {
          "text": "ERA CEO seeing recent events be like\n\n![gif](giphy|l0Hlzm2YMSFzLLJZK)",
          "score": 306
        },
        {
          "text": "can anyone actually tell me what's the point of these agencies? Is it just access to market insider news and offerings ahead of the competition? As an agent.",
          "score": 141
        },
        {
          "text": "What watching intern got 200k salary does to a mf.",
          "score": 89
        },
        {
          "text": "The start of exodus.\n\nJoin in Jun 2025, quit and join ERA after 6 mths",
          "score": 43
        },
        {
          "text": "Wow their Growth director really bad at her job ah... Or it's not the business she's growing?",
          "score": 39
        },
        {
          "text": "[removed]",
          "score": 37
        },
        {
          "text": "Falling like dominoes.",
          "score": 24
        },
        {
          "text": "Will KW sue M for loss of reputation not",
          "score": 14
        },
        {
          "text": "Wa wonder if they’ll try to enforce non-compete and non-solicitation clauses. Lawyers kaching.",
          "score": 12
        },
        {
          "text": "Competing with Autobahn to see who is faster to the bottom",
          "score": 9
        },
        {
          "text": "Actually what’s the reason why they have Property Lim Brothers and KW Singapore? Aren’t they effectively doing the same thing?",
          "score": 5
        },
        {
          "text": "Who’s going to tell these people that wearing a suit doesn’t make you a professional",
          "score": 5
        }
      ]
    },
    {
      "id": "t3_1qvldja",
      "subreddit": "singapore",
      "title": "Singapore ministers’ pay unchanged while median incomes up 80% since 2012: Chan Chun Sing",
      "url": "https://old.reddit.com/r/singapore/comments/1qvldja/singapore_ministers_pay_unchanged_while_median/",
      "score": 240,
      "num_comments": 258,
      "created_at": "2026-02-04T18:47:24",
      "selftext": "",
      "comments": [
        {
          "text": "14 years unchanged and still competitive. Wild.",
          "score": 707
        },
        {
          "text": "Something something National Services cannot be measured in dollars and cents?\n\nAs ministers and head of state, they should lead by example. I don’t buy the argument, especially when a minister can so easily discredit the NS sacrifice of every Singaporean son.",
          "score": 274
        },
        {
          "text": "So we’ve been overpaying since 2012?",
          "score": 201
        },
        {
          "text": "But still earning more than enough for a comfortable life?",
          "score": 200
        },
        {
          "text": "Here we go, here comes the gaslighting",
          "score": 161
        },
        {
          "text": "You know like some things that you can't help but just laugh? this is one of em",
          "score": 99
        },
        {
          "text": "Super unpopular opinion, but I don't mind ministers *who have performed well* to be paid a fuckton. Like, if you can fix the MRT breakdowns for good, whats 5 million a year? Or 10? For perspective, the abominable founders memorial cost 300+ million excluding land costs.\n\nThere are a ton of practical considerations, but in general, I am very strongly in favor for having ministerial salaries pegged to some kind of metric 4 years down the road. Some kind of delayed payment. Low-ish (relative to current levels) starting pay, but high \"commission\". \n\nAnd if the PAPpies go \"but like that who is gonna take the risk\" in leaving their corporate job. Yeah well, that's how you get run-of-the-mill people who are trying the same old thing over and over and failing.",
          "score": 40
        },
        {
          "text": "If you can presumably earn much higher in private sector, then you are free to go there.   \ni believe the normal rank &amp; file civil servants are also told this by their HR/bosses. The govt or the agency is not going to stop you from earning more &amp; you are free to leave if you want to do so.  \n  \nIf you stay, then you are working for passion &amp; service to the nation (or you are working for the iron rice bowl/can't survive in the cut-throat private sector). Salary increase should not be your priority; the most any increase is to survive the inflation rate.",
          "score": 25
        },
        {
          "text": "Greed has no limits.",
          "score": 24
        },
        {
          "text": "&gt;_The government has appointed an independent committee to review and recommend appropriate salaries and propose refinements to the framework. The committee will submit its report when ready, after which Parliament will be updated, Chan said._\n\nTest balloon with justifications provided le.\n\nI think by now, we should expect what's going to come next liao.\n\nJust like multiple mentions of how a certain motion was going to be raised, then the follow-up after the passing of the motion.",
          "score": 24
        },
        {
          "text": "Means now they are just grossly overpaid. 2012 and after they were grossly, obscenely, disgustingly overpaid.",
          "score": 19
        },
        {
          "text": "Give me their pay. I also can don’t change for 15 years.",
          "score": 15
        },
        {
          "text": "Are these ministar even capable of earning $1-3m in the private sector?",
          "score": 15
        },
        {
          "text": "Does this mean that today’s ministers are less competent than the ministers we had in 2012, since one of the jurisdictions for the pay is that it attracts talented individuals?",
          "score": 13
        },
        {
          "text": "Articles from this site may be behind a paywall which affects others' ability to view the content. If so, please comment a summarised but not copied version of it, or your submission may be removed.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/singapore) if you have any questions or concerns.*",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qvftj6",
      "subreddit": "singapore",
      "title": "This made my day: Woman distributes food and drinks to rough sleepers at Our Tampines Hub",
      "url": "https://old.reddit.com/r/singapore/comments/1qvftj6/this_made_my_day_woman_distributes_food_and/",
      "score": 207,
      "num_comments": 23,
      "created_at": "2026-02-04T13:19:26",
      "selftext": "",
      "comments": [
        {
          "text": "Nothing makes your day more than a privare citizen doing what ultimately should be the government's job",
          "score": 69
        },
        {
          "text": "there are volunteers who goes about OTH to check in and befriend these group of rough sleeper friends, every 1 to 2 weeks.\n\nthis volunteer group is under MSF PEERS Network",
          "score": 55
        },
        {
          "text": "&gt;The meals are contributed by customers of home-based businesses who support the initiative by covering the cost of an extra meal.\n\n&gt;\"The people who usually join me when I help distribute food are my viewers and supporters who voluntarily participate,\" she was quoted as saying.\n\n&gt;\"So next time when we do live-selling... we can do infaq (charitable spending) and we can give it out to them.\"\n\nIs live-selling, live-streaming shopping? Not sure how I feel if it is, like paying for the meal and watch it be given to a rough sleeper on TikTok?\n\nRough Mukbang? Tough to swallow man",
          "score": 43
        },
        {
          "text": "**Singapore's Second Nationwide Street Count of Homelessness (2022)**  \n[https://www.youtube.com/watch?v=AYBuKg3JZEo](https://www.youtube.com/watch?v=AYBuKg3JZEo)\n\nConducted by Lee Kuan Yew School of Public Policy (LKY School), if anyone is interested.[](https://www.youtube.com/@LKYSchool)",
          "score": 16
        },
        {
          "text": "A lot of people do it. Few are sick minded to video themselves for clout",
          "score": -1
        },
        {
          "text": "No! Singapore is a 1st class country, there are no poor or homeless people here. All taken care of by the PAP government.",
          "score": -9
        }
      ]
    },
    {
      "id": "t3_1qvj3po",
      "subreddit": "singapore",
      "title": "We Checked Out The Hotpot Restaurant Previously Linked To Ex-PropertyLimBrothers’ Grayce Tan",
      "url": "https://old.reddit.com/r/singapore/comments/1qvj3po/we_checked_out_the_hotpot_restaurant_previously/",
      "score": 208,
      "num_comments": 35,
      "created_at": "2026-02-04T16:27:51",
      "selftext": "Baby Hotpot restaurant in Balestier has quietly built up an online presence since opening mid last year. Influencer (@babygrayce on IG and TT) and former VP of strategy at real estate agency PropertyLimBrothers, Grayce Tan, had earlier posted a video of herself buying the eatery. Marketed as a pet-friendly hotpot joint, Baby Hotpot offers both air-conditioned and alfresco seating that allows diners to have their fur babies by their side during meals.\n\nIn recent days however, the restaurant has found itself under the spotlight for reasons that extend beyond its food. It’s unclear whether Grayce is currently still the owner of Baby Hotpot — her personal Instagram and TikTok accounts have been deactivated (although her Facebook account hasn’t been taken down yet).",
      "comments": [
        {
          "text": "The reviews truly rabak, even oysters can moan.",
          "score": 278
        },
        {
          "text": "I'm not sure whether these 8days ppl are noob or what. If you approach them like that, they have been instructed to deny everything. You can check the ownership and directorship via ACRA.\n\nPlus, you can also search for a \"People profile\" search to see which companies they have directorships or shareholdings in.",
          "score": 98
        },
        {
          "text": "\"Is this Baby Hotpot or Yu Dong Lai?\" \"It's both. Both same. All same. Same same.\"\n\nYeah sure they don't know anything my pantat.",
          "score": 94
        },
        {
          "text": "much rather support A Hot Hideout than this one,  at least its a worthy cause and the owner needs it more",
          "score": 79
        },
        {
          "text": "I guess we know why some F&amp;B operators prefer foreign workers now\n\n\nEasier to use as meatshield that can intentionally and unintentionally use the \"I don't speak English well don't ask me\" excuse during such saga\n\n\nYes yes I am on one of my cynical moods today don't mind me",
          "score": 72
        },
        {
          "text": "The article also revealed picture where its mentioned how this babyhotpot will have 20% CNY surcharge, really siao eh, already at such empty state",
          "score": 33
        },
        {
          "text": "though I will not patronise any of the business/services from grayce/melvin, and its definitely natural/okay for people to judge them and make those comments ,\n\nI dont think its right for the media/any organisation to hound them in this manner",
          "score": 33
        },
        {
          "text": "Can't believe this topic is still going on",
          "score": 16
        },
        {
          "text": "They keep deleting comments lol. Do wrong thing alr delete comments. Shd go comment more",
          "score": 14
        },
        {
          "text": "Childish folks leaving 1 star reviews for totally non related issues on food",
          "score": 10
        },
        {
          "text": "Even if the food and services are good, wouldn’t go.\n\nBut they already committed a taboo in society.",
          "score": 5
        },
        {
          "text": "I think the news outlets have really milked this story dry. Sorry, but let's move on. This voyeuristic human drama culture is pushed to the extreme.",
          "score": 4
        },
        {
          "text": "this is just kinda weird now\n\neveryone that bored that they're basically stalking her now?",
          "score": 1
        },
        {
          "text": "The reviews... Melvin tasted grayce's oyster...clam...",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qw6jhi",
      "subreddit": "singapore",
      "title": "PSP rebuts Koh Poh Koon and calls for mandatory retrenchment benefits of at least 2 weeks salary per year of service",
      "url": "https://old.reddit.com/r/singapore/comments/1qw6jhi/psp_rebuts_koh_poh_koon_and_calls_for_mandatory/",
      "score": 188,
      "num_comments": 40,
      "created_at": "2026-02-05T08:45:50",
      "selftext": "",
      "comments": [
        {
          "text": "By the way, Mr Koh hasn’t been retrenched before, so what does he know about losing his job. For him, even if lose elections, he can be parachuted somewhere else. Can’t blame Mr Koh.",
          "score": 81
        },
        {
          "text": "The argument by PSP is logically sound.",
          "score": 67
        },
        {
          "text": "Stronger Labour Laws? \n\nHeresy!!",
          "score": 47
        },
        {
          "text": "&gt;**The price of flexibility for businesses is often paid by workers.**\n\nOnce more for the people in the back.\n\nThe same applies to OT. Flexibility would mean we OT during peak periods and get off in lieu for use during down periods. Perpetual OT means employees are doing the work of more than one person. It means we're donating our time and labour for free to employers who earn more than us.",
          "score": 21
        },
        {
          "text": "It’s good that PSP are still active and publishing policy statements to rebut the govt, but in our local electoral context, the route to winning seats remains doing the community work and setting roots in constituencies, which not sure if they have been doing that. \n\nThere is no point having say 10% support spread across the country, as this doesn’t translate to winning any seats. With no seats they will just continue to be ignored by the govt.",
          "score": 20
        },
        {
          "text": "Our government will constantly score own goals because they already know they will still win",
          "score": 9
        },
        {
          "text": "It doesn't matter. Because companies are now hiring by contracts. My friends work in a hospital for 1 year they refused to make her permanent but want to recontract her for 1 more year.",
          "score": 8
        },
        {
          "text": "Management aged 50 to 60 who previously supported hiring foreigners over locals because it benefited them should not complain now if they are retrenched without benefits. By their own logic of market competitiveness, prioritizing the most “hungry” and therefore supposedly most deserving, they are simply facing the consequences of the system they endorsed. Lol",
          "score": 7
        },
        {
          "text": "Unfortunately even with such laws its useless because many companies play cheat by putting employees on PIP or make their work life difficult to force them to resign without paying a single cent.",
          "score": 5
        },
        {
          "text": "feels like the leading narrative by the current government is that that corporations make decisions based on the good of the people. and ordinary people like us make bad decisions cos we are too stupid.",
          "score": 5
        },
        {
          "text": "Not to be a contrarian, but this PSP statement seems like just a motherhood statement and doesn’t “rebut” the weird points made by KPK? \n\nLike KPK contends that stipulating a minimum quantum for retrenchment in law would result in that quantum becoming a norm. That makes no sense as wouldn’t not stipulating a minimum would result in no retrenchment benefits being the norm? \n\nWhen companies make a decision to retrench, the benefits to be made out are often made considering not just the legal requirements, but also its effect on its branding, future talent attraction/retention, morale etc. \n\nBy KPK’s logic, there should not be any speed limits, as having a fixed speed limit mean motorists will try to get as close to the speed limit as possible. Should be free for all then. With any other laws too then",
          "score": 4
        },
        {
          "text": "low wage, mom protect. higher wage, who protect.😒",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1qvgkd8",
      "subreddit": "singapore",
      "title": "Behold, one of the most deep cut SG mascots ever",
      "url": "https://old.reddit.com/r/singapore/comments/1qvgkd8/behold_one_of_the_most_deep_cut_sg_mascots_ever/",
      "score": 104,
      "num_comments": 10,
      "created_at": "2026-02-04T13:59:04",
      "selftext": "Apparently this guy is called MICOS (Malay, Indian, Chinese, and Others, though he seems to be only the C). He first appeared at Kampung Chai Chee (and apparently was restricted to appearing only around there) as part of the “Good Neighbour” campaign, and for some reason he's super kaypoh. I don't expect him to return anytime soon.",
      "comments": [
        {
          "text": "The buck tooth look is asking us to pass the buck ah issit \n\n\nNo wonder we are a nation of taichi masters haha",
          "score": 27
        },
        {
          "text": "Correction: His name stands for Malays, Indians, Chinese, and Other Singaporeans (thats what the S is for). Still odd he's designed like only the C of that though.",
          "score": 26
        },
        {
          "text": "Simple yet effective designs",
          "score": 5
        },
        {
          "text": "why he so cute leh",
          "score": 1
        },
        {
          "text": "I nominate Daiyaku to create an updated version!",
          "score": 1
        },
        {
          "text": "Why the fella tooth so big",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qvhwzb",
      "subreddit": "singapore",
      "title": "Former Biofourmis CEO to be charged over alleged fraud and falsified invoices worth US$16.5 million",
      "url": "https://old.reddit.com/r/singapore/comments/1qvhwzb/former_biofourmis_ceo_to_be_charged_over_alleged/",
      "score": 95,
      "num_comments": 24,
      "created_at": "2026-02-04T15:14:59",
      "selftext": "",
      "comments": [
        {
          "text": "First, I guessed right, second, post will be taken down soon 😆😆",
          "score": 66
        },
        {
          "text": "The 2005 agreement only benefits 1 country",
          "score": 48
        },
        {
          "text": "Hmm. But how come SPH bluff subscription numbers no issue leh ?",
          "score": 17
        },
        {
          "text": "20 + 10 years for him",
          "score": 8
        },
        {
          "text": "So what is the outcome of OutcomesAI",
          "score": 7
        },
        {
          "text": "![gif](giphy|dBYrT1GZ7CbmH67cXg)",
          "score": 6
        },
        {
          "text": "feaking cheater. Govt money also dare to cheat, how audacious ! company shd be called Biofourkmee.",
          "score": 5
        },
        {
          "text": "Cheat anyone also better than cheat our govt. He's in for a good time.",
          "score": 4
        },
        {
          "text": "Articles from this site may be behind a paywall which affects others' ability to view the content. If so, please comment a summarised but not copied version of it, or your submission may be removed.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/singapore) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "text": "Why am I not surprised…",
          "score": 1
        },
        {
          "text": "LMAO. Guess mods are less heavy handed these days",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qvmpsl",
      "subreddit": "askSingapore",
      "title": "In Singapore, what’s the fastest way you have ever seen someone ruin their life?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qvmpsl/in_singapore_whats_the_fastest_way_you_have_ever/",
      "score": 326,
      "num_comments": 162,
      "created_at": "2026-02-04T20:01:52",
      "selftext": "Saw this thread in the ask Reddit sub and in light of recent events, what are some instance where you where you have seen someone ruin their in the fastest way in SG?",
      "comments": [
        {
          "text": "I know someone who cheated on his wife. And she chased him out of the house so he became kinda homeless (had a small office space). And then he had a bad case of diabetes and his leg got black. Around that time, he had loansharks hounding him because the mistress ran away with his gifts and money. \n\nNaturally the wife hated him, so he became alone and helpless. And one day he passed away alone in his office.\n\nIdk what to think because he was very kind to me when I was a kid.",
          "score": 504
        },
        {
          "text": "Y'all remember Anton Casey? British finance bro who married a Singaporean beauty queen. He made a FB post of his son inside an MRT carriage with the caption, \"Daddy where is your car and who are all these poor people?\"\n\nLost his job and had to move to Perth.",
          "score": 483
        },
        {
          "text": "Lose all the money in MBS",
          "score": 277
        },
        {
          "text": "[https://sg.news.yahoo.com/ntuc-assistant-director-says-sorry-for-racist-post.html](https://sg.news.yahoo.com/ntuc-assistant-director-says-sorry-for-racist-post.html)\n\nThe NTUC exec who posted a racist rant about $50 Malay void deck weddings. She got fired from her job, was investigated by the police, and had to emigrate to Australia, I believe.",
          "score": 212
        },
        {
          "text": "I always remember this Ang Mo who talked shit about Singapore on social media just because Pokemon Go is not released in Singapore. It was on news and he lost his high paying job lolz",
          "score": 192
        },
        {
          "text": "Pick One :\n\n* Drunk driving\n* Gambling + loansharks\n* One “small” corruption/cheating shortcut\n* Affair that nukes family + career\n* Posting something stupid online thinking it’ll disappear",
          "score": 139
        },
        {
          "text": "Nick Leeson was a British banker working for Barings Bank in Singapore, one of the oldest banks in Britain. He accidentally lost £20,000 by misunderstanding a customer's request. Instead of paying it back he tried to hide his mistake by using the bank's money to try earn back £20,000. He then started using this hidden account to hide all of his trading losses. He kept losing money until he was down £200,000,000 in 1995. In a last ditch attempt to earn this back he made a gigantic investment in the Tokyo and Singapore stock exchanges... the night before a massive earthquake in Japan, which had the side effect of tanking the Tokyo market. He ended up losing 1.4 billion USD, about double the value of his bank. He ended up getting arrested and sent to prison for 6 years in Singapore.",
          "score": 124
        },
        {
          "text": "Ok, used to know this schoolmate.\n\nHe was in the N(T) stream but he's pretty smart. Not many guys like him because his personality is pretty f\\*\\*ked up - like he will flirt and be touchy-touchy with girls even when he knows his guy friends had a crush on them. He has no boundaries. Anyway, teachers always held him in high regard and believed he would do well in life.\n\nSo, sure enough, he went to ITE and so on. Got a nice GPA. Then went to poly and also scored a full GPA. After poly, he managed to get a place in a good local uni and even got an academic award for his good grades. He was really on a smooth highway to success.\n\nAround this time, though, he did something f\\*\\*ked up. He was exposed in Stomp for trying to sell N95 masks at crazy mark up rates during the horrible SG haze back in 2013-2014. The PSI was like 300-500 IIRC... even stray cats died from it. Anyway, one box of N95 masks was like $10-12 during its peak and it was often out-of-stock... A pregnant woman wanted to buy from him and he told her \"Sure, $100\".  She asked if he has any conscience for doing this and he merely replied \"Everyone's doing it! :) \"   When she exposed him on Stomp, he actually threatened her and she exposed him on Stomp again. lol\n\nAnyway, he then started trying to sell some scam course to his own Facebook friends. He kept giving fake stories like \"See how I made thousands a day!\"  Of course, it is fake and all photoshopped but he was trying to sell some overpriced course through his affiliate link.  His own friends even publicly commented and ask about the course and he still told them, \"I was a struggling boy who grew up successful. I recommend you get it.\"\n\nSo yeah, you can see how notorious his character can be. He really has no conscience.\n\nHowever, he went on and got a pretty good job and even got a girlfriend around this time.\n\nOne day, he went to meet up his friend for a drink.  After drinking, he sent his friend off to the bus stop and he went to a nearby building. He snuck into a woman's toilet and hid there. A young teenager was using it and he tried to take video of her pee-ing. When she saw the camera, she screamed and ran outside while he still hid inside. She alerted her friends who were outside waiting for her. They and the security guards managed to apprehend him until police came. He tried to act pitiful to get away but they refused. He kept apologising and asked for leniency but they refused. The most epic part is he wished them season's greetings. They took photos of him. Police came and he was arrested.  They published it on Stomp and his face was plastered everywhere. His seasons greetings became a huge joke, and the news went viral for that. And, yes, I know - he is no stranger to Stomp. lol\n\nThe court later charged him for voyeurism and so on. I think he was jailed for several months. He lost his job and his girlfriend left him. He lost practically everything. His future is gone. And he has disappeared... his social media were all deactivated, etc.\n\nSome of his friends even told me, \"Maybe it's just karma...\"  but some believe he became over-confident about his abilities that led to his downfall. An acquaintance told me he believed he saw him doing Grab delivery... Another said he may have taken his own life a few years back (can't confirm).  We don't know. But his future is really gone, all because of one stupid act.\n\nedit: removed and edited some parts as I am recalling the memories correctly.",
          "score": 119
        },
        {
          "text": "Falling for scams.",
          "score": 43
        },
        {
          "text": "Married the wrong person",
          "score": 37
        },
        {
          "text": "Spending spree on travel and luxury goods until lied about mother illness/death to scams his friends/customers.\n\nWent to jail for 50 months",
          "score": 35
        },
        {
          "text": "believe the siam diu lady more than us tell him wake up he said \"you jelly is it no girl come for you!\" throw all his money in. After that she left he asked why we never stop him",
          "score": 35
        },
        {
          "text": "Friend graduated from a decent overseas university. Came back to SG and worked his way up the ladder in corporate. Earned a very comfy salary (I guess, based on his biz segment and rank). Splurged on designer goods and luxury items. Had a super expensive lifestyle and got into credit card debt. \n\nHe refused to say how much he owed but I guess it was pretty bad when he couldn’t even afford to pay $300 for his bill. That was when I knew he was in deep shit.",
          "score": 22
        },
        {
          "text": "Colleague got promoted. During the celebration dinner, he got drunk, stripped off his shirt and try to force kiss a female colleague. Got sacked the next day.",
          "score": 22
        },
        {
          "text": "Reservist OC was a full time nurse who decided to live out his erotic fantasy by posing as a Dr and 'examining' a lady\n\n\nhttps://www.channelnewsasia.com/singapore/male-nurse-who-posed-doctor-and-molested-woman-gets-7-months-jail-808416",
          "score": 17
        }
      ]
    },
    {
      "id": "t3_1qvewck",
      "subreddit": "askSingapore",
      "title": "Why do Singaporeans have not so common western first names?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qvewck/why_do_singaporeans_have_not_so_common_western/",
      "score": 192,
      "num_comments": 240,
      "created_at": "2026-02-04T12:33:37",
      "selftext": "Many have typical Christian or Anglicised names like Alvin or David but quite a large number of Singaporean names sounds niche compared to the west or other Asian countries that are former British colonies. \n\nI'm talking about names like Delvin, Mervyn, Shermaine, Chryshelda, Godric, Dunstan, Janine, Bernadine, Althea etc. These are quite different from your John's and Mike's and Sarah's. I was wondering why is that? ",
      "comments": [
        {
          "text": "Parents want to make their children special lor. So they go online to look for some “rarer” names\n\nTo add: having special names may come back and haunt you one day.  E.g. grace versus grayce LOLLL",
          "score": 571
        },
        {
          "text": "You talk to hongkongers before? \n\nBanana’s friend Abcde wants to talk to Circle about July’s marriage",
          "score": 206
        },
        {
          "text": "r/tragedeigh",
          "score": 168
        },
        {
          "text": "Dunno, but I once worked on a legal case where a mother dealing with her estranged husband wanted to change the name of their child.\n\nThe kid was named after a Final Fantasy character",
          "score": 123
        },
        {
          "text": "SAF truly has the wildest angmo names I've seen. I rmbr got one encik making the news and his name is Ranger . WTF",
          "score": 112
        },
        {
          "text": "A very trend conscious people but not a lot of taste or wide exposure. Hence tend to gravitate to whatever is fashionable, then it becomes Ayden Brayden Kayden Jayden.",
          "score": 52
        },
        {
          "text": "could be because majority of chinese have the same few surnames so wanna stand out lor",
          "score": 30
        },
        {
          "text": "Dunno man. All tryna be unique but either are terrible at phonics or just choose to ignore it.\n\nI have heard of names Grossinthe (boy) (Gross-inth), Anallee (girl) pronounced Anna Leigh, Myeylynne (girl) pronounced Mia-Lynn, and Keraynvius (boy). These are the worst of the horrible ones I've seen.\n\nIdk why I get to see all these special names out in the wild.",
          "score": 28
        },
        {
          "text": "Sometimes it sounds like they just merge all the names they have in mind lol.",
          "score": 24
        },
        {
          "text": "Batman Bin Suparman",
          "score": 23
        },
        {
          "text": "Funny you say Singaporean names sound niche compared to other asian countries that are former British colonies because Hong Kong english names can give our Jaydens a run for their money. \n\nThe amount of Ansons + random noun names make Jayden look normal",
          "score": 21
        },
        {
          "text": "When you try to be unique and ‘atas’ but not having very good taste.",
          "score": 20
        },
        {
          "text": "there was a study somewhere that it's mostly less educated families giving their kids 'special' names, this is true everywhere.\n\n\ndunno what that says about singaporeans",
          "score": 17
        }
      ]
    },
    {
      "id": "t3_1qvfant",
      "subreddit": "askSingapore",
      "title": "Is it bad to quit immediately after bonus?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qvfant/is_it_bad_to_quit_immediately_after_bonus/",
      "score": 155,
      "num_comments": 155,
      "created_at": "2026-02-04T12:53:09",
      "selftext": "Bonus will be paid out either next friday or after cny. I have received a job offer and i am trying to negotiate to push back the start date a little. However, even if i could stretch it a little , i would be quitting literally the very next day after bonus have been paid. \n\nI feel a bit bad , and i dont know how to approach the topic to HR and my manager. At the same time , i am sure my colleagues would gossip about me literally leaving INSTANTLY . What should i do? Would you judge people who leave right after bonus payout and not even bother to wait 1 or 2 weeks? Also, how should i go about this topic with my manager? \n\nEdit : also a lot of my colleagues have already been joking around saying “lets see who quit this year” etc etc and i have just been smiling and not commenting. Especially knowing i am the one… ",
      "comments": [
        {
          "text": "tbh nobody cares in the long run. just do what you think is best for yourself",
          "score": 451
        },
        {
          "text": "Who cares.\n\nYou know what’s worst than quitting after your bonus? \n\nIt’s quitting before your bonus.",
          "score": 331
        },
        {
          "text": "Your bonus is for what you did the previous year, which you presumably did well and so justifies you receiving the bonus. It’s not like you’re getting paid something in advance and running away with it so what’s the issue.",
          "score": 105
        },
        {
          "text": "1. Take the bonus first  \n2. Then throw in the resignation the day after  \n3. Ignore the gossip/comments for nthe ext 30/60 days  \n4. Start new job and move on",
          "score": 88
        },
        {
          "text": "Your bonus was for your work/performance for the previous year, not what you're about to do. No need to feel guilty.",
          "score": 30
        },
        {
          "text": "this is just smart. If the new company wants you to start earlier, they can give you a sign on bonus equal to your bonus.",
          "score": 23
        },
        {
          "text": "If there’s no legal clawback, what do you care ?",
          "score": 17
        },
        {
          "text": "Don't feel bad. My company just did a mass firing right before announcing bonus. You care about the company, company also don't care about you. Just do what is best for yourself",
          "score": 14
        },
        {
          "text": "I throw letter the same day I got my bonus in my bank account bro.",
          "score": 14
        },
        {
          "text": "I think people will gossip no matter what u do la. So just do what's best for u as long as it's not illegal / actively hurting anyone",
          "score": 11
        },
        {
          "text": "In cases like this, u jst hv to be abit more thick skin. \n\nWhat your colleagues say or will gossip won’t matter once u leave ur current company. You won’t see them anymore and neither will they. Within a week or two they will also forget abt u and carry on with their own work. \n\nAlways remember that colleagues are not your friends. \n\nEven if you were to approach your HR and manager to inform them abt your resignation, your colleagues wouldn’t know that u literally gave it right after the bonus (unless HR or ur manager spilled the beans).\n\nKeep your chin up and be proud that you found a better job offer. With that said, a big congratulations to you on receiving the new job offer. 🥂",
          "score": 9
        },
        {
          "text": "Gossip la. This is tradition ",
          "score": 7
        },
        {
          "text": "Resign and clear leave",
          "score": 6
        },
        {
          "text": "Don't ever let this leak. Company may claw back your bonus if so. You don't have to tell them anything until the day you quit.\n\nThis is just how the corp game is played. Enjoy your bonus and the new job.",
          "score": 6
        },
        {
          "text": "Every company expects a resignation wave after bonus.\n\nYou're just another statistic.",
          "score": 5
        },
        {
          "text": "No la lmao? It's very common. Just make sure no rule that states minimum service period after taking the bonus before quit, if not need pay back lol.",
          "score": 5
        },
        {
          "text": "Your company likely will have a clause stating either party to give a X days of notice period. It might be also include \"paid\" if you want to exit earlier \n\nYour company can also do the same to you.\n\nSo, don't feel bad.\n\nBonus is recognition for your pass works not a thing to tie you.",
          "score": 4
        },
        {
          "text": "Nah it’s completely normal.\n\nHowever, exercise some caution and check for any clawbacks that the bonus may be subject to. It’s quite typical for companies to say that bonus is payable only if employees have not tendered as at a specific date (for example a company may pay out a few days before the end of the month, and the bonus may be conditioned on the employee staying until the end of that month).",
          "score": 4
        }
      ]
    },
    {
      "id": "t3_1qvprr4",
      "subreddit": "askSingapore",
      "title": "Of blind bags and consumerism in Singapore",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qvprr4/of_blind_bags_and_consumerism_in_singapore/",
      "score": 107,
      "num_comments": 73,
      "created_at": "2026-02-04T22:19:21",
      "selftext": "Is this a problem in Singapore? I noticed over the last years an increasing number of shops and pop ups selling “cute” toys and blind box etc. I get that seeing cute things make you happy, but do people actually keep them for long? Especially for blind bags where you get 30 seconds of excitement opening it (and might get something you don’t like)? To me it seems like a lot of trash being generated for short term dopamine.\n\nAlmost nobody I know here has “minimalist” lifestyles, or cares about reducing consumption. People seem to love shopping and material things. And of course it doesn’t help when single use plastic is everywhere. Do people not feel guilty about it or do they just not care? Do people just value short term pleasure and convenience over sustainability?\n\nEdit: not stopping anyone from collecting toys you like, I just think it’s wasteful when you buy stuff that you just throw away after\n\nThanks for the fun discussion y’all! Those with rude comments and nothing to contribute, hope you get the worst blind bag luck hahaha",
      "comments": [
        {
          "text": "I have a few friends who have done reno or going through reno, they have built storage shelves specially for these collections. It makes them happy and I consider them hobbies. Not that I understand it but happy to see them happy. They like cute stuff. Also it makes gift giving easy haha",
          "score": 94
        },
        {
          "text": "It's a global thing. It's not a local problem. If it was, Popmart wouldn't be as big as it is. There are Americans that live in perpetual credit card debt that buy that shit. It is what is is.",
          "score": 51
        },
        {
          "text": "Not just Singapore, but worldwide. Blind box is the meta now after Pop Mart, Smiski and Sonny Angel blew up.\n\nI think the popularity is from the gambling/gacha aspect. Particularly in times of economic uncertainty, people seek out a \"windfall\". I think blind boxes are a cheap thrill for most people. If you get a secret/limited edition one, it's like a small win. \n\nAs others pointed out, collecting hobbies is not new and has existed for ages. Go back 20 years and there was the Hello Kitty craze, a very similar phenomenon to Labubu.",
          "score": 46
        },
        {
          "text": "&gt;Is this a problem in Singapore? I noticed over the last years an increasing number of shops and pop ups selling “cute” toys and blind box etc. I get that seeing cute things make you happy, but do people actually keep them for long? Especially for blind bags where you get 30 seconds of excitement opening it (and might get something you don’t like)? To me it seems like a lot of trash being generated for short term dopamine.\n\nSomeone skipped the entire match attax phase of primary school I see\n\nEdit: I'm not saying this isn't objectively a problem, but this post gives off \"back in the past people were much more frugal/in tune with nature etc.\" energy when...that's not quite true.",
          "score": 33
        },
        {
          "text": "I think that blind box for people who enjoys that kinda stuff, let them be. We are not the fun police. But when I suddenly get attacked by blind boxes is where I’m drawing the line. Like the other day I went to NTUC and was checking out and the auntie working there was like hold on you hit xx amount. You get a free gift. So I asked what is it? They say don’t know, they told us to give out. It’s a freaking blind box from Yeo’s. Yeo’s theme zodiac plushie blind box. =.= it just clutters the house. Like throw away feels wasteful but no one I know wants it. Recycle also feels bad cause it’s brand new. Also happened when I was buying Coke and got a random blind box for a Coke keychain purse. And when I buy Milo and got a random plushie tote bag blind box. \n\nI rather they go back to giving out take away box or plates or cups or cutlery. At least those are useful and I can donate to Salvation Army without feeling guilty cause the item is useless.",
          "score": 29
        },
        {
          "text": "My friends don't really indulge in those habits. Not sure if it is because my circle generally prefers spending on travelling over owning items but I'm surprised people find it an issue in Singapore because I don't notice it around me.",
          "score": 14
        },
        {
          "text": "A lot of things in Singapore (and the rest of the world) are getting very expensive; things like cars and houses are all getting away from the remits of affordability for a lot of young Singaporeans. When all these traditional milestones become unavailable to you, there’s a natural tendency to seek out other things you can work towards and be proud of. So it isn’t just blind boxes, it’s luxury watches, handbags, audio systems: aspirational purchases that you can care about to at least give the sense that your life is moving forward in some way. \n\nI guess the additional element with blind boxes is its function for dopamine release. It isn’t very different from pulling the levers of a slot machine for that very momentary high, but maybe this one comes with the added cost of single-use plastics. That said, I don’t like to be too judgmental about how people spend their money, because the second I take a plane or buy something in a disposable bottle, I won’t be able to see my criticism as anything other than hypocritical. There are things far worse for the environment than buying a few smiskis and my own view is that negative externalities just need to be priced in into these kinds of purchases.",
          "score": 14
        },
        {
          "text": "No, people do not feel guilty nor do they care about overconsumption or sustainability. Is this a surprise? The average person has NEVER cared about such things; majority people just want their hard-earned money to buy some pleasure and dopamine hits, as you say.",
          "score": 13
        },
        {
          "text": "I thought of that too. And that’s literally gambling also. Stupid trend started and followed blindly.. People like what others like, monkey see monkey do. I think that’s human nature.",
          "score": 13
        },
        {
          "text": "Not sure why you're being downvoted OP, but you bring up a fair point. I don't consider myself an environmentalist or something, but people denying that our country has an issue with overconsumption is quite telling. And I don't understand why people are bringing up the US, guess we just need a scapegoat haha.",
          "score": 12
        },
        {
          "text": "Trendy\n\nEven supermarket products has blind boxes and I’m surprised, very surprised that people will go buy like for example 10 packs of milo to get the toy they want. It’s crazy.",
          "score": 10
        },
        {
          "text": "Its gambling but packaged in a socially acceptable way, see https://youtu.be/uvSFKsJnLo4",
          "score": 7
        },
        {
          "text": "TBH the “minimalist” lifestyles thing has long been hjiacked to sell more stuff.... used to be decluttering and only focusing on what matters to you but also you have to be privileged it’s easier to not keep things around if you can easily afford to replace them as needed. Being poor (and without access to resources like parents to help you out), means you simply have to hold on to things, because you don’t have the resources to get them back once gone.\n\nit's not so easy to just assume people are materialistic just because they don't go minimalism. \n\nAdd on the govt vouchers that expire and encourage spending and it compounds the issue. \n\nAlso too much focus is on consumers using plastic when the vast majority of plastic usage is in a vast industrial complex system that is out of the control of consumers. You can say consumers have choices but often the system makes it more expensive to make that choice so you conform. We need regulation and more participation in the process upstream to really solve this. \n\nTo frame the thing as people value short term pleasure and convenience is a bit limiting. People will always aspire to make better choices but often are limited by their financial capabilities and personal situations. An example is removing straws but then you see the bulkier plastics used in replacement. ",
          "score": 6
        },
        {
          "text": "On the flip side, thrifting is mainstream too. It’s becoming socially acceptable to buy/ use second hand. Many of my friends avoid buying brand new things. Instead, buy ‘new-to-me’ things from thrift shop, carousell, Facebook marketplace. You have furniture shops like hocksiong and co, and grocery stores like mono food that’s getting super popular. \n\nThere are all sorts of people here. People who’s into consuming and people who’s conscious of their consumption. Most of my friends are the latter. Maybe you can surround yourself with more likeminded people who’s into minimalism like you?",
          "score": 6
        },
        {
          "text": "Used to love buying keychains and blind boxes. Then recently when my house was undergoing renovation, I realised all these things were just sitting in a box collecting dust. Since then I'll always think a lot before buying things: Are they really useful to me? Or do they just give me a few seconds of happiness before ending up somewhere in a corner of my house?",
          "score": 5
        },
        {
          "text": "I wish more people were like you OP. There's an instant gratification problem with a lot of consumers nowadays, and trying to support non-exploitative business models is difficult when it seems the majority just doesn't care. Thanks for posting this",
          "score": 4
        }
      ]
    },
    {
      "id": "t3_1qvrdm3",
      "subreddit": "askSingapore",
      "title": "Advice of whistleblowing on a neighbour’s helper situation?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qvrdm3/advice_of_whistleblowing_on_a_neighbours_helper/",
      "score": 80,
      "num_comments": 24,
      "created_at": "2026-02-04T23:22:14",
      "selftext": "I got to know from my friend that she knows of a helper (mid 20s from Myanmar) who has not been treated well… \n\nShe doesn’t get much food to eat for her meals, takes care of their special needs child (9 years old) accompanies him IN school for half a day, brings him down for walks but has to CARRY him (idk, 20-25kg?) round the HDB block a few time to get some outdoor time. She is penalised with a confiscation of identity card, passport and mobile phone when she commits minor mistakes (wearing the wrong set of uniform on for the child) \n\nHelper is feeling very weary but also afraid that she will be blacklisted by MOM if she attempts complain or a final resort she has thought of - to run away. Here’s the worst thing - she has not gone for any off days for months at a time, perhaps 2 times in the last 1 year… \n\nHas anyone attempted whistleblowing on such questionable employer behaviour? Was it effective? ",
      "comments": [
        {
          "text": "I would suggest to start gathering evidence first before whistling blowing.",
          "score": 106
        },
        {
          "text": "Wah lao these people really sick fks. Starve people dont let them eat is really messed up. Later end up like the helper who died and was like 24kg only when she died wah lao.\n\nPlease get evidence so they dont worm their way out of this. \"Orh no la she dont like to eat\" or \"she ok with the sleeping in there one\". Sick",
          "score": 55
        },
        {
          "text": "Before reporting to MOM, you can try giving a call to TWC2 and HOME, which are NGOs who can give some practical advice on how to go about reporting to MOM tactfully.",
          "score": 42
        },
        {
          "text": "It’s illlegal to keep their passport and ID. But check properly first. No proof.\n\nBefore hiring helper got mandatory training. Employer also have.\n\nShe can also complain to agent that she’s being mistreated too.",
          "score": 19
        },
        {
          "text": "If I have any info regarding mistreatment that has been going on for years I will report it asap! Better act now or be sorry later. In case I whistle blew and it turned out false then I would apologise to the employer involved rather than risk the life of someone in danger.",
          "score": 12
        },
        {
          "text": "This one best to call up MOM already. Everyday delay means there is a risk of something going awry. MOM also dont wan a case whereby another helper dies because of some crazy ass family and makes it in the news. \n\nMy advice is NOT to wait and collect evidence but whistleblow immediately. Can call up MOM to speak what will happen and all. U see that Simonboy kid, because so many agencies did not escalate or take it serious enough.",
          "score": 10
        },
        {
          "text": "Report to MOM they have a new team that does spotchecks \nGood one",
          "score": 7
        },
        {
          "text": "Call HOME and ask for advice. For the case I tried to report, apparently it wasn't severe enough. Helper had one small meal per day only among other things.",
          "score": 6
        },
        {
          "text": "what if she lies?",
          "score": 5
        },
        {
          "text": "I would suggest to get more evidence before whistle blowing tho",
          "score": 3
        },
        {
          "text": "There's always 2 side to a story.....",
          "score": 2
        },
        {
          "text": "do verify the situation if you wanna take some action. at the moment, its 3rd hand information",
          "score": 2
        },
        {
          "text": "Why would she get blacklisted by mom if she is being mistreated? It dont make sense to me. But yeah like what other redditor says, gather evidence first. The confiscating passport is 100% illegal. Refer to passport act section 47(5).",
          "score": 2
        },
        {
          "text": "I hate disgusting employers who do this shit. Just because they pay a (measly) salary of $600-1000 they think they hired a personal slave. I’m sure they’re big on having good welfare in their jobs but suddenly welfare and basic human rights don’t apply in their own households. Fuck all of them and I hope they get the worst karma",
          "score": 1
        },
        {
          "text": "best to call mom and other authority ",
          "score": 1
        },
        {
          "text": "You or your friend, yourselves gather evidence, without and must not disclosing any clue to the helper. \n\nGet the genuine situation. \n\n",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qvn1lm",
      "subreddit": "askSingapore",
      "title": "Am I 'wasting' money living in SG if my job is full remote?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qvn1lm/am_i_wasting_money_living_in_sg_if_my_job_is_full/",
      "score": 77,
      "num_comments": 46,
      "created_at": "2026-02-04T20:18:14",
      "selftext": "So my job just recently transited to full remote.  My employer has no qualms about it as long as I'm able to be online during standard SGT working hours.  \n\nThinking of renting out my apartment and go somewhere that's cheaper.  Has anyone done something like that? ",
      "comments": [
        {
          "text": "If you have nothing tying you down to Singapore, your employer allows you to work anywhere in the world and you're able to secure working nomad visas for the countries you plan to reside in, then sure go for it.",
          "score": 75
        },
        {
          "text": "Yes I am doing that now and your main concern will be the visa/visa-exemption stuff and to not overstay in each country",
          "score": 71
        },
        {
          "text": "https://www.iras.gov.sg/taxes/individual-income-tax/basics-of-individual-income-tax/tax-residency-and-tax-rates/working-out-my-tax-residency#title2\n\nRemember if you wanna be a tax resident in Singapore you have to be here at least 183 days a year. If you’re fine with being a tax resident elsewhere then sure.",
          "score": 34
        },
        {
          "text": "of course… if your job is more or less needed and safer from this economy and u have enough cashfow, that would make the most perfect sense. get a visa, get out of here. I was working in bangkok living in a duplex luxury condo; oh boy it was amaaaaaaazing",
          "score": 22
        },
        {
          "text": "If you have to ask, then yes.",
          "score": 21
        },
        {
          "text": "You can stay in Jb but visa is a problem",
          "score": 13
        },
        {
          "text": "You can look into digital nomad visas. Malaysia has https://www.mdec.my/derantau.",
          "score": 10
        },
        {
          "text": "Just make sure internet is reliable and timezone acceptable",
          "score": 8
        },
        {
          "text": "A few countries offer digital nomad visa that you can explore. I think thailand also has, besides Malaysia",
          "score": 6
        },
        {
          "text": "You’re in a good position to geo arbitrage if you fancy living somewhere else",
          "score": 6
        },
        {
          "text": "Cheaper you go JB lah. Can return if urgent meeting.",
          "score": 3
        },
        {
          "text": "The concept is nice, but the devil is in the details.  You'll need to sort out:\n\n1. Visa - Make sure you have the correct visa in place, or you could wing it like many others and work on the go with a tourist visa.  Don't get caught.\n2. Taxes - Like the other Redditor mentioned, make sure you still qualify as SG tax resident else your tax bill might take a hit.\n3. Objective - Is your objective to save costs or to be able to travel yet maintain the same or lower COL when compared to staying in SG ?  Assume traveling, you could do any Asia countries on a tourist visa and yet still work, likely able to wing it on a tourist visa.  We get 30 days in TW, JP and HK I believe, not sure about TH, VN and ID.\n4. Timezone - Any country with a max of 4 hours diff works.  For short term actually EU works too.",
          "score": 2
        },
        {
          "text": "I tried this for a while. My relatives have property in JB so i stayed there for about 6 month, going into singapore about once or twice a month for f2f meetings with team or to fix issues. mainly used bike. saved so much money on utilities, groceries, transport.\n\nedit: forgot to add, sometimes when im bored, i just drive over to another state and stay for a week or 2 there in hotels.",
          "score": 2
        },
        {
          "text": "Yes",
          "score": 2
        },
        {
          "text": "Probably can. However, your Company may eventually land itself in tax issues.",
          "score": 2
        },
        {
          "text": "Binance？\n\nJust go to JB camp out or travel around the world to Japan or something lol",
          "score": 1
        },
        {
          "text": "Yes, had a friend who did it but then moved back because job doesn’t cover medical insurance.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qvj1t9",
      "subreddit": "askSingapore",
      "title": "how to stop WWF calls for donation",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qvj1t9/how_to_stop_wwf_calls_for_donation/",
      "score": 58,
      "num_comments": 37,
      "created_at": "2026-02-04T16:24:34",
      "selftext": "I donated $1 at the singapore zoo in 2021 and since 2025 they’ve been calling me non stop to ask for donations. All different numbers, always more than once. If u end their call they call again. Seriously why pester people for donations?? calling me almost everyweek??",
      "comments": [
        {
          "text": "Tell them if they don't stop calling, you'll start donating to hunting organisations.",
          "score": 105
        },
        {
          "text": "cuz likely outsourced to agencies, like those you see at MRTs, and they take a cut out of the donations",
          "score": 78
        },
        {
          "text": "ARE YOU READY FOR THIS SUNDAY NIGHT WHEN WWF CHAMP JOHN XINA DEFENDS HIS TITLE, IN THE WWF SUUPPERRRRRR SLAMMMMMMMMMM!!",
          "score": 68
        },
        {
          "text": "I requested for them to put me on a “do-not-call” list. Same situation as you. Made a one-off donation and they kept pestering me after.",
          "score": 24
        },
        {
          "text": "Put yourself on the DNC list.\n\n[Go here. 😊](https://www.dnc.gov.sg/index.html)",
          "score": 16
        },
        {
          "text": "That's why I donate only via giving.sg also I want to get my tax deduction lol",
          "score": 13
        },
        {
          "text": "I normally just do not pick up calls i dont recognize, if its so important, they will probably find another way to contact me eg email",
          "score": 7
        },
        {
          "text": "I would be meowing at the phone every time they call me",
          "score": 5
        },
        {
          "text": "If you're iPhone user and on iOS26, you can turn on \"Ask Reason for Calling\" function under phone settings.  \nIt will direct unknown caller to a voicemail (either Siri or your own voice) to leave a voicemail, Siri will type out in text.  \nYour phone will still ring, and you will see the message and choose whether to pick up or not.\n\nI think android should have similar function as well.",
          "score": 4
        },
        {
          "text": "Tell them u are John cena",
          "score": 2
        },
        {
          "text": "This is why you don't feed the animals bro...",
          "score": 2
        },
        {
          "text": "Hey! Same situation here. I just mainly give my \"time\" to listen to them talking over the phone. And they send me sms for a one time off donation. I totally ignore the message. And now i already know what's their number. So next time, i wont answer anymore.",
          "score": 2
        },
        {
          "text": "Register your number as paid call service for few hundred bucks. They pay you for every call.",
          "score": 2
        },
        {
          "text": "Did you... just tell them to take your number off their calling list? \n\nThey are obligated to do that. No need to try all kinds of weird tricks. Just tell them politely and firmly what you want. After you tell them that, ask them if confirm that they can do it, and how long it will take to process. So that if they can't do it, they have to admit it, and then you can ask them how to get off their list.",
          "score": 2
        },
        {
          "text": "as i am cannot dont pick up unknown numbers so usually i will say i would like to be taken off the calling list if not i will report to the relevant authorities. ",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qvom6g",
      "subreddit": "askSingapore",
      "title": "Turning 30 soon! I’m celebrating by trying 30 new things - would love ideas for the final stretch (and a meaningful gift for myself)",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qvom6g/turning_30_soon_im_celebrating_by_trying_30_new/",
      "score": 53,
      "num_comments": 41,
      "created_at": "2026-02-04T21:30:55",
      "selftext": "Hi guys, I’m turning 30 in July this year!! 🥹\n\nMixed feelings, because the past decade really flew by in the blink of an eye. I’m proud of what I’ve achieved - graduating from uni, finding a decent job, being able to give my parents and grandparents an allowance every month, and travelling quite a bit to make up for what I didn’t get to experience when I was younger.\n\nAt the same time, I do feel anxious sometimes. You can’t help but compare and wonder if you’re not good enough or somehow “behind” your friends. For example, I’m still single after two short-lived relationships, and I always thought I’d be married with kids by now haha.\n\nIn any case, in a bid to feel more alive - and to mark my 30s with a bang and really challenge myself - I decided to try 30 new things/experiences. I’ve completed about 20 so far! Some unforgettable ones include catching the aurora in Norway, getting a tattoo, climbing the Great Wall, and learning a new language (korean). Others were less dramatic but still fun (like trying pickleball and table tennis).\n\nAs I’m down to the last 10 items, I’d love to crowdsource some ideas. What would be on your list?\n\nI also want to get myself a meaningful, amazing birthday present. If you were in my shoes, what would you choose to celebrate this milestone? A nice bag? A watch? A donation to charity? I don’t know - at this point, everything feels a little underwhelming.\n\nWould love your thoughts 🤍",
      "comments": [
        {
          "text": "Go for a silent retreat",
          "score": 30
        },
        {
          "text": "Attend a music festival overseas. Run a race (5k/10k/half marathon depending on your fitness level). Learn a musical instrument. Take a road trip (or learn to drive). Take an improv/comedy class.",
          "score": 17
        },
        {
          "text": "1 kg of 999 pure gold bar.\nThx me when you reach another meaningful life  milestone :)🤣",
          "score": 14
        },
        {
          "text": "go for a solo trip with no agenda",
          "score": 9
        },
        {
          "text": "Go solo holiday",
          "score": 8
        },
        {
          "text": "Volunteering at a soup kitchen!",
          "score": 7
        },
        {
          "text": "If you have some funds, buy a investment that cashes out in about 10-15yrs",
          "score": 6
        },
        {
          "text": "Go run a Spartan race or Hyrox… do it for the fun of it, no need so serious.",
          "score": 5
        },
        {
          "text": "Sky diving.",
          "score": 4
        },
        {
          "text": "You prob did 99% of things this sub wld nv do in their lives bro. Most here planning to FIRE at 50 yr old n eat cai png",
          "score": 3
        },
        {
          "text": "Rage room",
          "score": 3
        },
        {
          "text": "solo trip to japan’s countrysides :)",
          "score": 3
        },
        {
          "text": "If you’ve never done a road trip solo with no gps I highly recommend. I did this for my 30th and couldn’t recommend more",
          "score": 3
        },
        {
          "text": "Buy a watch, set a budget, and look around what fits it. For ladies, I can happily recommend a Seiko Tank, just go check if your skin tone matches gold plated or regular stainless steel",
          "score": 3
        },
        {
          "text": "I'm also turning 30 this year but I have no idea what I want lol.",
          "score": 2
        },
        {
          "text": "I’m really interested to know what the completed items on your list are!",
          "score": 2
        },
        {
          "text": "Cycle 100km (or 160km, a century) around sg!\nOr walk the coast to coast trail!",
          "score": 2
        },
        {
          "text": "I’m 29 and on my to do list before 30 was “Save a life”.\n\nEnded up getting pregnant this year",
          "score": 1
        },
        {
          "text": "Doing a yoga stretch until u can bend ur leg",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qvrrd1",
      "subreddit": "askSingapore",
      "title": "Gift ideas for colleague who is getting laid off",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qvrrd1/gift_ideas_for_colleague_who_is_getting_laid_off/",
      "score": 42,
      "num_comments": 15,
      "created_at": "2026-02-04T23:36:33",
      "selftext": "as title suggest. appreciate all responses :D \n\ninfo about colleague: single male in his 30s\n\nhobbies/interests: typical sports like running, badminton basketball or general fitness, into shows like anime, english comedy \n\nthank you! ",
      "comments": [
        {
          "text": "referrals for his next job",
          "score": 204
        },
        {
          "text": "An ang pao with money inside",
          "score": 45
        },
        {
          "text": "Just go out for a meal. I find the gifts mostly will not be useful or kept unless is gold bar haha.",
          "score": 29
        },
        {
          "text": "Ntuc voucher",
          "score": 19
        },
        {
          "text": "a gift card has to be the most practical option. if not a good water bottle, since his into sports",
          "score": 11
        },
        {
          "text": "Sponsor 1 year of coursera\nFucking government keep saying upskilling right",
          "score": 9
        },
        {
          "text": "Packet of dried cuttlefish from nearest ntuc.",
          "score": 6
        },
        {
          "text": "Gift ideas for colleague who is getting laid? oh i have to reread this. ",
          "score": 2
        },
        {
          "text": "Red packet",
          "score": 1
        },
        {
          "text": "\"Hi XXX, you know... we haven't really had 1 to 1 talks before, but i know this much about you. and i know you are single, if you don't mind we could explore this friendship and maybe even explore a romantic relationship outside of the workplace. all the best, and let's stay in touch 💖💖\"\n\n\\- OP",
          "score": 1
        },
        {
          "text": "NTUC vouchers.",
          "score": 1
        },
        {
          "text": "Thoughts and prayers",
          "score": 1
        },
        {
          "text": "Your job",
          "score": 1
        },
        {
          "text": "Give Ang Bao lahhh",
          "score": 0
        },
        {
          "text": "Get him a live streaming kit and a OF account. Do sports guy as the selling point. A lot of room for the market, your colleague will thank you. /s\n\nSerious answer. No gift is wrong if you are close with the colleague, because you would had known what he likes for sure. Since you are asking probably two of you not that close at work of off work. No one will be able to guess what your colleague like.\n\nIn this case just leave him a good impression will do, or join the farewell if invited, don’t burn bridges. It is normal not to have gifts.",
          "score": -3
        }
      ]
    },
    {
      "id": "t3_1qvlwn0",
      "subreddit": "askSingapore",
      "title": "How’s living in Sembawang like?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qvlwn0/hows_living_in_sembawang_like/",
      "score": 28,
      "num_comments": 48,
      "created_at": "2026-02-04T19:18:10",
      "selftext": "Feb 2026 BTO just launched and I’m considering the two Sembawang projects due to the likely low application rate.\n\nAs an area that’s usually considered as “ulu”, for those who are staying at Sembawang now, how’s it like living in that area? Any regrets or any pleasant surprises?\n\nP.S. I’m aware that Sun Plaza’s toilets are rabak lol",
      "comments": [
        {
          "text": "it’s getting more and more unbearably crowded, cant imagine what it’ll be like when the chencharu (yishun orto area) folks come in. connectivity isnt the greatest (one line at sembawang+ NSL is SLOW, even if you consider TEL line its still an hour travel to city centre). food options wise, pretty good if you have a car, even if not, opening of bukit canberra has added lots of food options + modern exercise facilities which is great\n\nif you plan to start a family, most decent schools at the poly/jc/uni level is 1h+ of travelling time. can bid goodbye to visiting anywhere outside the NSL because everywhere is so far you’re lazy to go unless it’s necessary",
          "score": 39
        },
        {
          "text": "Stay for 10 years. \nNear endeavor sch. \n\nI hate this place. \nIf u drive out , expressway is in woodland or Yishun .\nWaste alot of time before u reach expressway.",
          "score": 35
        },
        {
          "text": "Used to live nearby. Chill and quiet, but commute is a bitch. I work in town so it's min 50 mins to raffles place by train, if driving can cut the timing to half but erp is $7 in morning, and another $2.50 at night coming back home. Not sure about the price now lol",
          "score": 31
        },
        {
          "text": "Very far commute to central area and general connectivity to rest of SG is poor. ",
          "score": 18
        },
        {
          "text": "Pretty crap honestly. Far from central areas, and no charm of its own.",
          "score": 15
        },
        {
          "text": "Lived in Sembawang all my life, I wouldn’t consider Sembawang exactly ulu unless you have to travel to extreme ends of SG like Katong/Marina Bay/Boon Lay/Pasir Ris\n\nPros imo \n- Easy to go jb\n- 1 of the biggest ActiveSG gym with hawker centre beside it\n- Roughly equal travelling time to JE/Central SG\n- Easy access to Punggol area with 117\n- Feels less crowded than areas like woodlands/yishun, can kinda feel the difference during peak hours",
          "score": 15
        },
        {
          "text": "I am saying this as a 20+years resident.\nIt’s not worth unless you live near the MRT.\n I work in town so it takes 1 h to and fro for me to reach office and return home.\nConnectivity is not the best to other parts of Singapore.\n\nSun Plaza is getting more and more crowded.\nAddition of Bukit Canberra is great with hawker centre, poly clinic, gym, swimming pool.\nBut I need to frequent Yishun or Woodlands often for more things to be accomplished because it’s a smaller town after all\n\nI have a property agent friend whom moved to SBW condo and I asked her why.\nShe said property prices here is undervalued.\nSo it really depends what’s your priorities",
          "score": 14
        },
        {
          "text": "If you can afford a Prime BTO, then do it. Because that’s what I’m doing after living in SBW for the past decade. \n\nDuring peak hour, be it by car or train, it’s like one hour minimum to CBD due to traffic jams. Not to mention the crowd, with the new projects. Even buses are packed. \n\nAnd best part Chencharu estate at Khatib is up and coming… get out while you can. I mean don’t even get in in the first place.",
          "score": 14
        },
        {
          "text": "The Sembawang Shipyard will stop operations by 2030 and the area will be converted to a resort",
          "score": 8
        },
        {
          "text": "Been here for about 15yrs. (Before was Yishun)\nI live near station .. bout 8 mins walk. Its quiet &amp; peaceful enough compared to Yishun. Mayb Woodlands? but I feel woodlands is much bigger. I like that there's a canal nearby for evening walks. \n\nNow there's bukit canberra. Food is good enough. Place clean. I've started using active sg gym and the gym here is one of the bigger &amp; cleanest gyms I've used. Pool have sheltered indoor pool so it's a plus if you're into these.\nThe polyclinic at bukit canberra is great. Very short waiting times. est within 15mins during weekdays. \nRecently Venus just opened an outlet at Sunplaza yay.\n\nIf I need wet markets that sort, it's a bus ride to Yishun Chong Pang. Or mayb northpoint 2 stops away is fast enough. \n\nI think it may be far from town but I would take sembawang over east or west sides. I'm biased. Also.. I don't work in cbd so daily travel time doesn't really affect me much.",
          "score": 7
        },
        {
          "text": "Sun Plaza toilet doesn’t got to do with living in Sembawang 😅\nI am currently staying at Admiralty Link, the blocks in front of the current Feb 2026 BTO. \n\nThe area is calming- why? No cars, no lorries travelling around. \nThe area is windy- the area is near the seas, so it is super windy. Love it. \n\nAs for ulu- I don’t find it ulu, there’s actually quite a lot of people here. Evening time a lot of people jogging around the area.\n\nThe only drawback is the travel. It is far from MRT and have only 859, 859A, 859B that goes to MRT station. Hopefully they will increase the frequency after the bto are build up.",
          "score": 6
        },
        {
          "text": "rather quiet neighbourhood which i like. mall wise we only have sun plaza here and ssc which are quite small but good enough for daily essentials. go anywhere also far, esp CBD. central like amk still ok. go jb is near",
          "score": 5
        },
        {
          "text": "Used to jog from my home at Admiralty Link to Sembawang Beach area. The place has a rustic feel &amp; lots of greenery compared to other places. It may appeal to those who prefers a less crowded and peaceful environment. Unfortunately they are developing the area further, so it may lose its charm soon.",
          "score": 5
        },
        {
          "text": "Good potential. \n\nLawrence wong’s NDR (iirc) from last year has major plans for the north",
          "score": 5
        },
        {
          "text": "Been staying in Sembawang for many years. Work place : nearest raffles place; furthest changi airport.\n\nLike no luck to move out. It's still green. Lol.",
          "score": 2
        },
        {
          "text": "Living in Sembawang all my life and i have no issues. In fact, i always feel other parts of Singapore somehow feel too crowded. I guess Sembawang itself around the MRT to Chong Pang area isn’t that bad, there are many amenities and food options. However, for the new BTO area, I wouldn’t really be keen. It is quite far away from everything and isn’t well connected by public transport right now. Might be ok if you drive, else commute will be tough.",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1qvn667",
      "subreddit": "SingaporeRaw",
      "title": "Ok mr smarty pants",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qvn667/ok_mr_smarty_pants/",
      "score": 158,
      "num_comments": 45,
      "created_at": "2026-02-04T20:24:33",
      "selftext": "",
      "comments": [
        {
          "text": "Hmmm but can he also use the diagram to justify the need of having 5 mayors and the increasing cost of living in Singapore too?",
          "score": 85
        },
        {
          "text": "Math passes, but where did he get the angle of 4.8 degrees and… the average person I see on those PMDs… are above 65 kg.\n\nA bit dangerous… problem is that the people under LTA will not say that the MP is wrong or being too simple. They might even bend over backwards and make it such that his minister math is right.",
          "score": 49
        },
        {
          "text": "A whole family weighs only 65kg? That’s severely underweight!",
          "score": 38
        },
        {
          "text": "They tighten the laws but don’t step up enforcement. End up all these changes only affecting genuine users while some Si-Gina still race with their modified PMD/A at night.",
          "score": 26
        },
        {
          "text": "better than brain dead ministers wasting taxpayer money to remove PS as LO, only to shift him 2 seats away",
          "score": 17
        },
        {
          "text": "Isn't this like O level physics \n\nChatgpt can generate for you lei",
          "score": 12
        },
        {
          "text": "Friction neglected. He's not really an engineer, is he? There is friction in the real world.",
          "score": 11
        },
        {
          "text": "Must have thought this will garner him brownie points in parliament.\n\nExcept this is not the kind of political smarts we need.",
          "score": 7
        },
        {
          "text": "I also can draw this model, can get 1.1m salary?",
          "score": 5
        },
        {
          "text": "I bet PAP will use his math to next determine their new salaries",
          "score": 5
        },
        {
          "text": "I am lost. when it’s stipulated 6km/hr isn’t it the case that the vehicle just had to output more energy to continue to achieve that 6km/hr? \nThey didn’t stipulate that you can only output xxW for your vehicle. \nSo what’s the problem of rolling backwards?!?\n\nOr I am stupid to understand this. \nEven you add 100kg it simply just add more output to achieve the same 6km/hr. \nOr is he saying he is concern that the current restriction on the watt of vehicle may not be sufficient to maintain that speed up slope, hence it’s not feasible?",
          "score": 5
        },
        {
          "text": "Cannot convince, u confuse.",
          "score": 5
        },
        {
          "text": "means watttttt",
          "score": 3
        },
        {
          "text": "They would unelectable if it weren't for our controlled system. Remember that dork who almost became PM.",
          "score": 3
        },
        {
          "text": "put in chatgpt, and just paste it out",
          "score": 3
        },
        {
          "text": "Who is he?",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1qvii3g",
      "subreddit": "SingaporeRaw",
      "title": "Only child taking care of my aging parents. Anyone with similar experience?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qvii3g/only_child_taking_care_of_my_aging_parents_anyone/",
      "score": 111,
      "num_comments": 65,
      "created_at": "2026-02-04T15:50:49",
      "selftext": "Hi everyone, I’m reaching out because I’m feeling burnt out with my parents. I’m in my 30s, and I feel like the weight of my parents' lives is falling entirely on me.\n\n**The Background:** My parents are in their mid-70s. My dad stopped working 20+ years ago. Since he stopped working, he has done zero housework and has no social life. He just sits at home watching TV all day, everyday, my mom went out to work instead. My mom (primary school ed, cannot speak English) is a back to being a full-time housewife who caters to his every whim—even pulling the window blinds for him while he sits right next to them since 8 years ago. \n\n**The Current Situation:** Dad is currently hospitalized and officially diagnosed with Dementia. He’s physically mobile, but he constantly \"cries wolf\"—insisting he’s dying and needs the A&amp;E, or demanding to go to the bank because he’s paranoid the government is stealing his money.\n\nI’ve already spoken to the Medical Social Worker and have an AIC referral for respite care. However, I am hitting a brick wall with my mother:\n\n* I’m setting up sensors, emergency alarms, and cameras for safety.\n* I bought a portable wheelchair for emergencies; Mom complained he \"won't like it.\"\n* Every time I suggest a plan, she shuts it down with *\"He won't want.\"*\n\nThe reality is that while they are physically independent, they are \"logistically helpless.\" They cannot handle admin work, bills, or medical appointments. If I’m not there to manage their lives, everything collapses. Yet, my mom tells me I cannot go overseas or go out too much because she can’t cope alone—while simultaneously fighting every support system (daycare/respite) I try to put in place.\n\n**The Internal Struggle:** I know my mom is enabling him. Honestly, if I were \"less Asian,\" I would have walked away years ago. He didn’t provide for me, he took my money, and now I’m spending my 30s being his personal administrator and 24/7 \"on-call\" crisis manager.\n\n**I need advice on:**\n\n1. **Breaking the \"He won't want\" loop:** How do you convince an uneducated, traditional mother that safety and logistics trump the \"boss's\" preferences?\n2. **Managing the \"Cry Wolf\" hospital trips:** How do you handle the constant demands for GP/A&amp;E trips driven by dementia paranoia or fear of death? Ironically he doesn't follow doctor's instructions upon returning home.\n3. **Boundary setting:** How do you reclaim even a small part of your life (like a short trip) when you're being guilt-tripped into staying?\n\nHas anyone else been the \"only functional adult\" in a household like this? How do you survive this without losing your mind?\n\nThank you!\n\n  \n",
      "comments": [
        {
          "text": "&gt;Honestly, if I were \"less Asian,\" I would have walked away years ago. He didn’t provide for me, he took my money, and now I’m spending my 30s being his personal administrator and 24/7 \"on-call\" crisis manager.\n\n  \nThe best decisions are the hardest ones.",
          "score": 90
        },
        {
          "text": "On point number 1, I feel that with the older generation they have this mentality or stubbornness for variable reasons. It could be they are not keen to accept new technology, scared of changes, don’t want you to splurge on them. I find that it helps when I just go ahead with the purchase without their “approval/blessing” and eventually they come to terms with it and actually secretly enjoy how the new technology bring some improvement to their lives.\n\nDon’t give them an option, just do it.",
          "score": 70
        },
        {
          "text": "Are they compliant to what the government says ? If yes then just say things like oh now he has dementia - GOVT SAYS must be admitted into xxx home. It’s a country law. \n\nYears ago when I was working in a dementia daycare centre we have this absolutely violent aunty that refuse to come in everyday. The family lied that actually she’s here to “ work “ . We gave her some tasks to cut things up, paste things colour things and tell her it’s for something we need and we pay her $x/ hr. Her family will give her the money instead. \n\nSorry to hear about your situation. While daunting and helpless pls know you’re not alone. Years ago someone I know had a dementia father passed away ( very similar to how you describe your dad, always waiting to be served, do not contribute to household etc )… she told me: I only started living the day he died. \n\nI think those of us in the same or similar situation can feel it in our bones.",
          "score": 40
        },
        {
          "text": "Both my parents had already passed away.  Before that, they too have health issues.\n\nMy father had dementia for few years.  Late stage dementia is bed ridden.\n\nMy mother got stroke for like 14 years, also bed ridden.\n\nGot an elderly brother that is mentally retarded, no instructions from parents on their intentions.  Still staying with me.\n\nIt is a tough journey, not fun at all handling their hospital visits, sudden A/E trips and daily care.  I stay with them, not married, and still have to juggle work and income to sustain the household.\n\nThat time, my mother is still fully aware, don't like to go old folk homes.  **So, solution is hire maid (helper) to take care of them.**\n\nI have brothers, but they are married and don't stay at the house, so this means burden on me, financially and time.\n\nLooking back, life is really tough on me since childhood till now.",
          "score": 17
        },
        {
          "text": "Do you have uncles, aunts etc who your mum listens to? As in anyone who could step in to convince her",
          "score": 14
        },
        {
          "text": "I’ve been in your position for the past 7 years. I am the youngest in the family, unmarried. Both elder sisters married, has their own family troubles, so I am the one who sacrificed my time to bring parents in and out of hospital during office hours, their treatments and follow ups. If I’m not there, elderly parents will do nothing.\n\nI’ve been called useless, good for nothing, while trying my best to care for them. Parents told me to let go and let them live lives the way they want.\n\nEventually I walk away, cut contact with family, now they listen to my other siblings and I live my life the way I want. On a positive note, they listen now.\n\nBut you’re a single child, I don’t know if you can afford to walk away for some time just to teach them a lesson. A bit of your absence and making them feel lost might be good. Us giving in to any one of them is just condoning their illogical and selfish behaviours. Just do what works for you and the best care and best effort can give.\n\nAnyway, jiayou, remember take care of yourself too.",
          "score": 13
        },
        {
          "text": "Nursing house is only choice since ur dad is not 'behaving'.",
          "score": 12
        },
        {
          "text": "Aiyo, you’re mid 30s and sticking to “Asian” thinking? \n\nLet mid 50s uncle here tell you a story. \n\nWhen I just got married, my mom was expecting me to do the “Asian” thing and stay with her since I’m the only son of the family. \n\nStood my ground and told her NO, as I know I don’t want to deal with MIL/DIL issues on daily basis. My mom was quite upset but I held firm. However, I do insist on bringing the family back to have a meal with her on weekly basis.\n\n30 years later, things are fine and everyone is comfortable with current arrangement. Heck, my mom now consults my wife more than me! \n\nSo, what is this “Asian” thing? Just do what’s right for your parents and most importantly, yourself, as a whole!",
          "score": 9
        },
        {
          "text": "Give them the plan, not options, then they will get it, with a “no choice / bo bian” attitude.\n\nNot the best but you need to limit the choices available, and no need to explain too much, you will face even more resistance this way from either parent.",
          "score": 5
        },
        {
          "text": "Send him to a home for elderly?",
          "score": 5
        },
        {
          "text": "Just do it. Do what you think is right or at least reduce your workload.\n\nTo share, my late dad was out of work since my poly days. I had a huge fall out with him because he was pinching my money that I needed for school books and fees. Money that I had earned while studying and working part time. But later we came to a mutual understanding, which I plainly said that if he needed cash, just tell me, don't take from me without my knowledge (yeah i did not want to say he stole) which he agreed and honoured. So we reconciled.\n\nFew years on when I finished NS and started working, my dad had colorectal cancer. My mum who is a bit health freak, literally went all in on my dad. The food was exactly the same and it was so tasteless that my dad refused to eat after a week. Coupled with chemo, he was already weakened, so he was in no shape to go out and get his own meals. So after nearly 10 days, I had enough and and told my mum, I will buy his dinner meals. So he would have more variety, actually eat and get in some nutrition. Needless to say she was not thrilled at all since I essentially ignore her decisions.\n\n\nRemember parents are still human. Sometimes they might be coming from a good place or just plain ol stubborn. But if you see they are doing decisions that actively harm themselves or even you, you have to put your foot down.",
          "score": 5
        },
        {
          "text": "You need to try disappearing for a week",
          "score": 4
        },
        {
          "text": "for #1, sometimes parents dont like to listen to their own children. if it comes from your relatives or hospital staff, they might be more receptive to it\n\nfor #2, are you linked up with dementia sg? they may be able to offer you some advice on this.\ndid social worker explore dementia nursing home? because it sounds like a huge challenge to cope with caregiving",
          "score": 3
        },
        {
          "text": "Why don’t you go on a “work trip” to take a break.",
          "score": 3
        },
        {
          "text": "Not sure if this is even something you’d be receptive to but perhaps considering nursing homes in JB might help. Some are specifically catering to Singaporeans. \n\nIt’s incredibly helpful with both #1 and #2 since we can afford multiple nurses solely attending to one patient (round the clock) and prove that they can provide better care than we can. The nursing home also brings and accompanies the patient to any hospital in Singapore so we don’t have to cross the border multiple times every appointment, but only with our consent. Logistically this has been great because just being in a different country has drastically reduced the cry wolf tendency…",
          "score": 3
        },
        {
          "text": "Im nearing 30s, only child as well. Ive amassed $150K at 22 years old if I recall. \nIve done well in my uni, career and have taken on many govt programs, exchange programs and travelled to 30+ countries. Im now waiting to buy a house with my partner and ready to start a family, with furkids as well, in the meantime working on my start up.  \n\nMy family is VERY eerily similar to yours, almost exactly the same. But for me, I spotted the red flags very early on. I was 16 when I noticed all these toxic traits and I knew as an only child, I had no siblings to rely on and my only escape was either death or education. \n\nI worked minimum 3 jobs at any one time. Some were odd jobs, some were more consistent. I was a waiter, a cashier, a UAT tester, giving surveys etc. I did so many things but I honestly had SO MUCH fun working, made some friends along the way too. \n\nI also learnt time management - this was crucial because I knew I had to leave my toxic household. I needed to play the long game. \n\nSo whilst doing all these, I moved out at around 17? I rented all kinds of homes, its actually good to rent because I knew what type of landlords there are and learnt what kind of house I want in the future. E.g. a room I rented had a built-in furniture that blocked the door (???) Im definitely clocking that. \n\nIt was messy, tiring, gruesome as a low income kid but I knew I had one life and I am NOT going to be constrained and serving my time to 2 useless adults. I much rather do actual charity to people who needed it (which I did). \n\nThere is NOTHING guilty about leaving them. I took every opportunity to leave (exchange programs, work travel, part time jobs, midnight study sessions). Please LEAVE soon or slowly, if not a fight or some form of violence or your breaking point will erupt and something worse will transpire. \n\nPeople often show their worst sides to us, yet we choose not to see it. If you feel the need for filial piety, justify it elsewhere. For me, I give back to other family, relatives that have taken great care of me.  \n\nBest of luck and feel free reach out to me if you need any tips on therapy welfare, time management, side hustles, housing lifehacks, volunteering opportunities, govt exchange programs, startups, jobs, amassing 6 figures quickly or just someone to talk to!",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1qvh398",
      "subreddit": "SingaporeRaw",
      "title": "Goh Chok Tong’s son is in trouble",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qvh398/goh_chok_tongs_son_is_in_trouble/",
      "score": 73,
      "num_comments": 34,
      "created_at": "2026-02-04T14:27:30",
      "selftext": "",
      "comments": [
        {
          "text": "Ask his mother to pay the peanut fines for him.",
          "score": 69
        },
        {
          "text": "Looking more and more like his father",
          "score": 29
        },
        {
          "text": "Missed opportunity to name him Jin Heng",
          "score": 19
        },
        {
          "text": "Sue until pants drop",
          "score": 17
        },
        {
          "text": "Yucks sia Suay family. Lao bu's BFF is that golden toilet bowl cheater TT Durian somemore. Birds of the rotten feathers really F together aPui.",
          "score": 16
        },
        {
          "text": "Wow the case drag so lonngggggg, initial reports were years ago",
          "score": 7
        },
        {
          "text": "So this one will get light sentence only la. He still can happy happy reunion dinner with lao goh. Dont forget ong beng seng. Medical conditon = light fine. This guy got what cancer?",
          "score": 6
        },
        {
          "text": "Lousy and xia suey kia lol",
          "score": 4
        },
        {
          "text": "Aiyah.... After the election 2025 results...... Boh tai ji one lah..... Otherwise won't delay until so long...... 😎",
          "score": 4
        },
        {
          "text": "Odds on judicial mercy?",
          "score": 3
        },
        {
          "text": "one PM got house problem, another got son problem",
          "score": 3
        },
        {
          "text": "He can say \"he's not my brother\" last time but now cannot say \"he's not my son\".",
          "score": 3
        },
        {
          "text": "Jin sian",
          "score": 2
        },
        {
          "text": "He's got the splitting image",
          "score": 1
        },
        {
          "text": "Splitting image",
          "score": 1
        },
        {
          "text": "Peanuts",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qvgtpm",
      "subreddit": "SingaporeRaw",
      "title": "Ghislaine Maxwell is shown telling Israeli Yariv Zghoul to \"be careful of your self surrounded as you will be Muslim Israeli hating people\" when he is in Singapore. Zghoul, who founded 2 Singapore private companies, himself displays intimate knowledge of Maxwell's life and the Island",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qvgtpm/ghislaine_maxwell_is_shown_telling_israeli_yariv/",
      "score": 72,
      "num_comments": 30,
      "created_at": "2026-02-04T14:12:58",
      "selftext": "Beyond giving advice on Maxwell's lifestyle, Zghoul noted \"we are running seriously low on intelligent sexy women ... we simply can't spare any for such tradegy...\" .\n\nBesides Zghoul, the Epstein files underscores a number of connections Singapore has with Israel, most strikingly when MHA, MINDEF, SCDF and SPF are stated to be part of a \"strategy\" to \"work with\" Israeli surveillance and monitoring company \"REPORTY The Social Safe City\". Information about the company, it's and how they are doing now is hard to find with a google search being unable to find mention of this company.\n\nhttps://www.justice.gov/epstein/files/DataSet%2011/EFTA02332525.pdf\nhttps://www.justice.gov/epstein/files/DataSet%2011/EFTA02332487.pdf\nhttps://www.justice.gov/epstein/files/DataSet%2011/EFTA02332487.pdf\n ",
      "comments": [
        {
          "text": "Damn OP you got balls for this. But watch how alot of people are gonna call you out for this. You gotta post the documents related to Trump being under control of them",
          "score": 39
        },
        {
          "text": "Honestly, the whole rehashing of old times about how Israel helped us, I think that goodwill has to fizzle out at some point in time for us and we should not forever glorify them, given the present actions of their country. \n\n\nIt's like we can still be thankful for how lky brought our country forward with the old PAP, but with the present state of the party, we have to face the facts of their performance and not continue to dwell in past glories to justify their actions.",
          "score": 37
        },
        {
          "text": "Zghoul is also in Epstein's black book\n\nhttps://preview.redd.it/99j7m2hq8fhg1.jpeg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=b037648b938bf0ba366046af077989a47a7ea078",
          "score": 23
        },
        {
          "text": "When would ethics be rewarded &amp; unethics get punished? I've seen it like the opposite nowadays...",
          "score": 8
        },
        {
          "text": "As in what’s really surprising? Singapore has always been working with Israel. We are literally working with anyone as long as it’s profitable. If we evict lots of “blood money”, CBD won’t have as many business, that’s just the reality of it.\n\nThe “intelligent woman” line seems to be a small talk one liner and it’s directed to maxwell no? As in nothing to do with Singapore.",
          "score": 7
        },
        {
          "text": "It's pretty much amazing... after so long... Nobody in AI industry or even the paid professionals in the government going thru all these stuff to use an AI to read thru and summarize each part and then let LLM do conjecture on who are guilty , who are innocent bystanders.",
          "score": 3
        },
        {
          "text": "Raid his house and check all his devices.",
          "score": 2
        },
        {
          "text": "But what he said is true, aint it?",
          "score": 1
        },
        {
          "text": "We probably can start having SID/ISD to monitor him.",
          "score": 1
        },
        {
          "text": "Well…they always say “We don’t hate the Jews, we only hate the zionists” LOL",
          "score": 0
        },
        {
          "text": "I think she talking about you thats why you so offended by that one statement. Lol",
          "score": -20
        }
      ]
    },
    {
      "id": "t3_1qvish9",
      "subreddit": "SingaporeRaw",
      "title": "Why is this kongweeneverdie allowed to spam his China food advertisements everyday ah?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qvish9/why_is_this_kongweeneverdie_allowed_to_spam_his/",
      "score": 56,
      "num_comments": 34,
      "created_at": "2026-02-04T16:08:27",
      "selftext": "Knn every single day I open this sub the front page sure will see his PRC exclusive food advertisements and always see him gloating over the fact that local eateries are being taking over. Sometimes can see him opening political threads shilling for PRC too. Is he a shill from China promoting their interests or something",
      "comments": [
        {
          "text": "It's a well known fact bro. He is not even Singaporean. Before his account was privatised he used to go round reddit defending everything PRC from EV to god knows what else. At least last time he got other outlets but I think mods from diff subreddits kept banning him so now he spend his free time here instead.",
          "score": 46
        },
        {
          "text": "Not only that, he's got a bunch of buddies always with him. Tentacle\\_ , jypt98, cherishlogic, Maleficent\\_Today\\_79 and etc. If you observe carefully they are always in his thread supporting him and upvoting his threads. I believe he has other alts too. It's clear that they are part of a grp that are on a psyop operation here and up to no good. Always talking bad about our govt and country, and always talking down to us like we are subservient to them.",
          "score": 21
        },
        {
          "text": "Ask him about the Cambodia scam ring owners from China. See if he can shill about them or not.",
          "score": 13
        },
        {
          "text": " i can't even tell if he pro or anti PRC, just that he keep posting about them",
          "score": 12
        },
        {
          "text": "Nabeh tiong",
          "score": 5
        },
        {
          "text": "Coz they got a huge marketing budget and shrewdly targeting prospects by geography maybe!?",
          "score": 4
        },
        {
          "text": "Breathe in too much PRC smog and eaten too many toilet washed meat and vegetables already.\n\nI'm not eating anything MIC, even see Shieng Song house brand sourcing from PRC now.",
          "score": 4
        },
        {
          "text": "For all we know you also advertising for him\n\n🤣🤣🤣🤣",
          "score": 2
        },
        {
          "text": "5 mao lor, everywhere.",
          "score": 1
        },
        {
          "text": "If you block can still see the post?",
          "score": -1
        },
        {
          "text": "It's ok bro. We need to emphatise with people from Teban Gardens. They've endured so much.",
          "score": -2
        },
        {
          "text": "Free speech for me but not for thee eh?",
          "score": -3
        }
      ]
    },
    {
      "id": "t3_1qvh8qf",
      "subreddit": "SingaporeRaw",
      "title": "The influx of Native Chinese eateries opening in Singapore – are we losing our identity?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qvh8qf/the_influx_of_native_chinese_eateries_opening_in/",
      "score": 58,
      "num_comments": 104,
      "created_at": "2026-02-04T14:36:01",
      "selftext": "You all don't support local food lor.",
      "comments": [
        {
          "text": "We have been selling our identity and dignity for money since like forever.....when is the next round of CDC vouchers?",
          "score": 68
        },
        {
          "text": "Losing? Nah\n\n\nLost? Definitely.",
          "score": 31
        },
        {
          "text": "100%.\n\nBut then again the real local options nowadays are so limited, especially in malls.",
          "score": 31
        },
        {
          "text": "To put it bluntly, the newish Chinese eateries are usually major franchises.\n\nSo not just local eateries or franchise are getting hit, even smaller Chinese (mainland style food) China auntie uncle stalls are getting pushed out by the likes of Scarlett. They simply cannot compete, while huge franchises can afford to take a short term profit hit.\n\nBecause to big international brands, they can play the long game. What is a few dozen non performing outlets in SG compared to their thousands else where. When eventually the competition gets crushed, they achieved market monopoly.",
          "score": 19
        },
        {
          "text": "I think only a small number of them will last. Most Chinese companies are having growth issues within China and sees overseas market as an opportunity. Once they realise they are going to lose money over high rent and increasing competition, I doubt they will renew lease.",
          "score": 14
        },
        {
          "text": "You guys still like char keow teow anot",
          "score": 11
        },
        {
          "text": "Out of curiosity, why do we not feel the flood of Japanese or American eateries should elicit the same response?",
          "score": 10
        },
        {
          "text": "we have always opened our legs for everyone, witness the indian, western, jap, kimchee, honkie, vietnamese eateries amongst so many others found in sinkieland. now the chinkies got money to burn open stores here, let them burn all their black money lor",
          "score": 9
        },
        {
          "text": "Singapore has tons of foreign f&amp;b brands. Why keep picking on the Chinese. You literally have korean, japanese, and western food as staples in every hawker centre.",
          "score": 8
        },
        {
          "text": "I like my wanton noodles, bcm, fishball noodles, laksa, chicken rice",
          "score": 7
        },
        {
          "text": "China food taste bad, it's just overloaded with seasonings to cover up the taste for bad cooking.",
          "score": 7
        },
        {
          "text": "Enjoy your bak chor mee while you still can. In the future it's only that mala rubbish.",
          "score": 7
        },
        {
          "text": "We are losing our rental space for local innovative offerings cause we are getting squeezed out by high rental.",
          "score": 4
        },
        {
          "text": "Because of all the money laundering coming in from Chinese holding cambodian/myanmmar nationality.\n\nThey will report a profit even if they are making a loss. Pay the taxes and the money will be laundered clean.",
          "score": 4
        },
        {
          "text": "i always wonder what are the opinions of the PRC turned new citizens when they heard of Operation Coldstore?",
          "score": 4
        }
      ]
    },
    {
      "id": "t3_1qvmvtj",
      "subreddit": "SingaporeRaw",
      "title": "the classic example of the idiom, 树倒猢狲散 (tree fell, monkeys scattered)? Is Mel Mel finished? Or he will pivot to his BabyHotpot side biz he opened with ... ?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qvmvtj/the_classic_example_of_the_idiom_树倒猢狲散_tree_fell/",
      "score": 45,
      "num_comments": 24,
      "created_at": "2026-02-04T20:10:22",
      "selftext": "",
      "comments": [
        {
          "text": "I will love to see all his businesses destroyed and declared bankrupt with all the debts. Love it",
          "score": 27
        },
        {
          "text": "He just need to disappear for 6 months. Then find a low key event, preferably one that allows him to showcase his repentance and give back to society. \n\nBest still if it is ‘accidentally’ discovered by a member of public. \n\nDo it for 6 months and then return to center stage.",
          "score": 20
        },
        {
          "text": "Who wants to stay there and get burnt for someone else's mistakes? They have their own families and mouths to feed.",
          "score": 12
        },
        {
          "text": "Not stirring the scandal, but genuine question about property business... How did Melvin justify opening KW Singapore to the PLB team?\n\nI understand the pitch to other agents is that KW will allow them to build their own brand etc.\n\nBut what was the pitch to existing PLB agents? KW will be a competitor, and if it's sooo good, why won't all PLB agents jump ship? It's like cannibalising/sabo the old PLB business? The other PLB leaders didn't protest?",
          "score": 10
        },
        {
          "text": "i only saw 2 hes...",
          "score": 9
        },
        {
          "text": "That's a 'she'???\n\nNo wonder Melvin Lim never pursue her lol",
          "score": 8
        },
        {
          "text": "Melvin likely will stay low for a while and use his expertise to work on small scale transactions first.  He will be fine but definitely can't regain the fame and status.\n\nGrayce will on the other hand leverage on this saga to milk more money from it.  That's her only way out to gain fast money to support her business and sidekicks (plus to satisfy her desire to conquer male)",
          "score": 6
        },
        {
          "text": "She's still around\n\nhttps://preview.redd.it/p6y84v8gqhhg1.jpeg?width=499&amp;format=pjpg&amp;auto=webp&amp;s=98baa142d5cc0d7f95540e753a44d6eb526ff651",
          "score": 3
        },
        {
          "text": "whole of Asia knows about them, so are they gonna \"hide\" in Europe?",
          "score": 3
        },
        {
          "text": "the rich will have ways to move past this kind of issues.",
          "score": 3
        },
        {
          "text": "Where got finished. ML is still a millionaire x",
          "score": 2
        },
        {
          "text": "He is a She? Guess not M type ….",
          "score": 2
        },
        {
          "text": "Don't worry Singaporeans have short term memories",
          "score": 2
        },
        {
          "text": "There's a long article about why Rayne joined KW. Many reasons like tech, network, legacy etc. Not because of any person. Yet one sex scandal later, quickly abandon ship...\n\nYes scandal was unexpected, but the personalities (Melvin &amp; Grayce) were already on KW leadership then. Rayne should consider better before joining. But since already joined as a senior director, should stay longer and try to rebuild.\n\nOtherwise, her previous praises about KW sound lame and damage her own credibility/judgement since only 6-months...\n\n[https://www.edgeprop.sg/property-news/millionaire-realtor-trailblazer-rayne-chua%E2%80%99s-leap-keller-williams-singapore](https://www.edgeprop.sg/property-news/millionaire-realtor-trailblazer-rayne-chua%E2%80%99s-leap-keller-williams-singapore)",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1qw8qmp",
      "subreddit": "SingaporeRaw",
      "title": "Sgmustwatchla starting new drama with halal buffet restaurant Permata",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qw8qmp/sgmustwatchla_starting_new_drama_with_halal/",
      "score": 45,
      "num_comments": 26,
      "created_at": "2026-02-05T10:21:36",
      "selftext": "",
      "comments": [
        {
          "text": "lol think the jobless trash was the one who approached the restaurant. Don’t dare to paste his offer rates online but dare to put down the restaurant’s counter offer. \n\nCome got balls paste your initial demand and then we can all laugh at how entitled you are.",
          "score": 87
        },
        {
          "text": "Influencers feel they deserve more. If someone propose a deal that you feel is low, just reject it. No need to be rude about it.",
          "score": 41
        },
        {
          "text": "Can just politely decline, dont understand why need to name and shame.",
          "score": 33
        },
        {
          "text": "This is just unprofessional",
          "score": 19
        },
        {
          "text": "So free food + extra $100. \n\nWhy are these fuckers so greedy?",
          "score": 19
        },
        {
          "text": "Plot twist: Permata self promoting",
          "score": 15
        },
        {
          "text": "Eating halal food for CNY? No thanks LOL",
          "score": 9
        },
        {
          "text": "the only sampah here is you sgmustwatchla bodoh",
          "score": 5
        },
        {
          "text": "lol nowadays 2nd rate influencers all so big balls?\n\nI'm not a buffet fan but probably will go support the restaurant just to spite that stupid influencer.",
          "score": 3
        },
        {
          "text": "“Creators”, lanjiao lah, leeches on society.",
          "score": 2
        },
        {
          "text": "Got free food + $100 angbao still complain\n\nNever ask you to do for exposure  only good liao loh",
          "score": 2
        },
        {
          "text": "Support the halal restaurant. The reply was very polite, also never ask him to take it, just for consideration. \nWhat’s there to shame? Anyway influencers are just entitled useless people who contribute nothing to society. Worst invention of our times",
          "score": 2
        },
        {
          "text": "Influencers think they big fuck?",
          "score": 1
        },
        {
          "text": "His rate is $800 and the restaurant also has to absorb the food cost.",
          "score": 1
        },
        {
          "text": "What is this about? No head no tail...",
          "score": 1
        },
        {
          "text": "Thanks to this story, I’ll be visiting the restaurant. \n\nAlso, this sgmustwatchla reminds me of the shitty person behind Singapore Atrium Sale. 😂",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qw5cbo",
      "subreddit": "SingaporeRaw",
      "title": "I bet she would get a lot of call enquires",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qw5cbo/i_bet_she_would_get_a_lot_of_call_enquires/",
      "score": 37,
      "num_comments": 28,
      "created_at": "2026-02-05T07:55:30",
      "selftext": "",
      "comments": [
        {
          "text": "You just posted an ad. You the agent's agent ah?",
          "score": 97
        },
        {
          "text": "You can also be a sexy hunk/gal and do work like these. I don't think anyone is stopping you.",
          "score": 18
        },
        {
          "text": "I feel Dumbell type flats quite rare leh.",
          "score": 14
        },
        {
          "text": "Anyone can post Melvin picture here?",
          "score": 8
        },
        {
          "text": "Reddit Singaporean is like that one. One case mean all like that, especially PRC agent.",
          "score": 5
        },
        {
          "text": "Real estate people are like aircrew aka the high class waiters. Basically overpaid salesmen.",
          "score": 3
        },
        {
          "text": "Well, sex (appeal) sells.. It's an age-old advertising adage..",
          "score": 2
        },
        {
          "text": "do contact meat  ......",
          "score": 2
        },
        {
          "text": "Not everyone is Xiao San",
          "score": 2
        },
        {
          "text": "Agents with benefits\n\n![gif](giphy|r8jE5TSW38h4VNJzW4|downsized)",
          "score": 2
        },
        {
          "text": "Because of her dress? She looks average or slightly above. If I call her it would be because of the property, not because how she looks or how much skin she shows.",
          "score": 2
        },
        {
          "text": "Another PLB case waiting to come out?",
          "score": 2
        },
        {
          "text": "Is being a chio a pre-req to being an real estate agent in SG?",
          "score": 1
        },
        {
          "text": "To be honest. grayce isn’t successful the properties she is selling. Her cleavage is mainly for attention.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qvghjn",
      "subreddit": "SingaporeRaw",
      "title": "Is inflation their kpi? Now another 10 cent surcharge to bottles and cans.",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qvghjn/is_inflation_their_kpi_now_another_10_cent/",
      "score": 31,
      "num_comments": 87,
      "created_at": "2026-02-04T13:54:47",
      "selftext": "End up companies mark up even more, consumers have to foot the cost.",
      "comments": [
        {
          "text": "Our policymaking as of late has been quite shite, a lot of chasing of pet causes but nothing really significant",
          "score": 22
        },
        {
          "text": "Everything pass on to consumers, but don't worry, Singaporean consumers also gong gong just continue to buy. No such thing as boycott to them.",
          "score": 17
        },
        {
          "text": "For you with you fuck you",
          "score": 12
        },
        {
          "text": "Their KPI is GDP. The more money you spent locally contributes more to the GDP.",
          "score": 11
        },
        {
          "text": "This is a project that has national wide impact. Probably a bunch of scholars given grade A and promoted for this initiative. Too late to roll it back already, and they have a strong mandate from the previous election",
          "score": 9
        },
        {
          "text": "So who's being paid to bring in and maintain those machines? Some family members or friends of the incumbent?",
          "score": 6
        },
        {
          "text": "PAP no.1, whatever they say/do is always right.",
          "score": 4
        },
        {
          "text": "They are spending money on 2000 machine to deploy island wide, manpower to collect and money to return back to public.\n\nIs it really worth it?",
          "score": 3
        },
        {
          "text": "But i thought they are phasing out ezlink and replacing it with simplygo?",
          "score": 3
        },
        {
          "text": "This sort of price inflation will also inflate GDP figures and give contracts for their kaki cronies.\n\nWin-win cooperation for them. Certified by the 65% mandate.\n\nMeanwhile Taxpayers lose all the time because they foot the bill.",
          "score": 3
        },
        {
          "text": "At least you get all the money back. In part some parts of Canada, you only get 50% of the money back.",
          "score": 1
        },
        {
          "text": "And they were just announcing low inflation.\n\nhttps://www.reddit.com/r/SingaporeRaw/s/PwylsxAZiC",
          "score": 1
        },
        {
          "text": "It’s SG Inc for a reason",
          "score": 1
        },
        {
          "text": "Drinks cans and plastic bottles are becoming the main source of trash and pollution around my home and some riverside parks.  So I am hoping this policy might reverse the trend.",
          "score": 1
        },
        {
          "text": "Who is screwing who now?",
          "score": 1
        },
        {
          "text": "Next thing that will cause further inflation will be the distance based ERP…..",
          "score": 1
        },
        {
          "text": "Inflation theoritically contributes to higher gdp",
          "score": 1
        },
        {
          "text": "It is. Almost all countries aim for inflation.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qviemi",
      "subreddit": "singaporefi",
      "title": "Using GLD and \"Gold\" to visualize FOMO in this very sub",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qviemi/using_gld_and_gold_to_visualize_fomo_in_this_very/",
      "score": 55,
      "num_comments": 27,
      "created_at": "2026-02-04T15:44:50",
      "selftext": "I've been intermittently scraping this sub as part of a larger experiment. Using the data I managed to gather, I counted every post with \"Gold\" or \"GLD\" in the title and plotted the cumulative sum against the price of GLD (the blue line).\n\nIn the chart below, each orange vertical line represents a new post.  \n\n\nhttps://preview.redd.it/vbf58b4mjfhg1.png?width=624&amp;format=png&amp;auto=webp&amp;s=c74f2f67e9a44846afaf3560431683442dfa7dcc\n\n  \nThe \"density\" of these orange lines clearly spikes *during* sharp movements or immediately *after* a rally:\n\n* **September 2025:** We see a massive cluster of posts right after a modest \\~12% rally. These are some of the \"recent gold price\" posts and the starting wave of \"how to buy gold\". [\\[1\\]](https://www.reddit.com/r/singaporefi/comments/1nd0vj8/uobams_gold/) [\\[2\\]](https://www.reddit.com/r/singaporefi/comments/1ngls1y/made_a_tiny_site_to_track_uob_physical_gold/) [\\[3\\]](https://www.reddit.com/r/singaporefi/comments/1nhgxax/) [\\[4\\]](https://www.reddit.com/r/singaporefi/comments/1npvq4l/)\n* **October 2025:** Another spike in activity follows the \\~5% drop. This is yet another wave of \"Should I buy Gold\" and \"How to Buy Gold\". [\\[1\\]](https://www.reddit.com/r/singaporefi/comments/1o5etvk) [\\[2\\]](https://www.reddit.com/r/singaporefi/comments/1o5i8go) [\\[3\\]](https://www.reddit.com/r/singaporefi/comments/1oacr74) [\\[4\\]](https://www.reddit.com/r/singaporefi/comments/1odpqot) [\\[5\\]](https://www.reddit.com/r/singaporefi/comments/1ocujbh) [\\[6\\]](https://www.reddit.com/r/singaporefi/comments/1odpqot) [\\[7\\]](https://www.reddit.com/r/singaporefi/comments/1oozdsa)\n* **January 2026 (Now):** Activity has been ramping up significantly since the start of the year, mostly clustering near local tops.\n\nHonestly, the result is ironic. I expected Reddit sentiment to be a leading indicator for Gold prices. Instead, at least for the past year, the price of Gold has been a leading indicator for the number of posts in this sub.\n\nBasically, this graph is a visual representation of FOMO. When the price moves, the posting begins. Is just so funny sometimes hahaha\n\nI hope this doesn't trigger the \"No discussion of a single stock\" rule in this sub :( Because technically, this is about FOMO &amp; mindset, i'm just using gold as an example...",
      "comments": [
        {
          "text": "You mean it surprises you that the people here are dumb money? I literally use SG financial subs as a dumb money indicator, been doing so for years",
          "score": 28
        },
        {
          "text": "remember retail investors lag institutional investors. whatever information you hope that will give you an edge is usually outdated by the time you see it. essentially you have little chance of beating institutional investors. Buy the index.",
          "score": 21
        },
        {
          "text": "No high no buy.\n\nSell low buy high.\n\nGold to 10000, silver to 200.",
          "score": 8
        },
        {
          "text": "Need Pet and ET to come and do a CAPE of why gold is overvalued or w/e.",
          "score": 5
        },
        {
          "text": "Only on this sub? Hahahaha every investing finance sub also fomo on gold as it ran like mad. An easier way is, if gold shop have an endless queue and physical gold literally ran out of stock, its market top.",
          "score": 4
        },
        {
          "text": "Why the hell would u think reddit is ahead of the curve lol",
          "score": 3
        },
        {
          "text": "It’s not a leading indicator because this sub is an echo chamber. alternative and contrarian viewpoints get downvoted or dismissed. Rarely does anyone take contrarian views seriously. \nI remember this one guy whom you replied to in his sub where he has a substantial amount in precious metals and you said that you don’t like that his portfolio is over weighted in precious metals. The advice was generic. This sub is way behind the curve.",
          "score": 3
        },
        {
          "text": "Hahahaha! I appreciate the effort here. \n\nNevertheless, those who FOMO'ed in in early Jan did stand a chance of considerable gains if they hopped out at the right time. You just don't know how many weeks of hype there will be though.",
          "score": 2
        },
        {
          "text": "Sir, we only Buy High and Sell Low here!",
          "score": 2
        },
        {
          "text": "Why would you scrape this sub of all subs?\n\nWsb has the most activity - this sub is peanuts",
          "score": 2
        },
        {
          "text": "Usually too late by then",
          "score": 2
        },
        {
          "text": "Retail is typically poorly capitalised, highly leveraged and the last to participate in a broad macro move and things get stoppy once retail is in.",
          "score": 1
        },
        {
          "text": "As someone who rode the silver wave from $35 to an average exit price of $ 85, I agree. Now do the s&amp;p500.",
          "score": 1
        },
        {
          "text": "sentiment follows price, what's new?",
          "score": 1
        },
        {
          "text": "Sir this is a Wendy's",
          "score": 1
        },
        {
          "text": "Wouldn't this be normal of any other asset? Not even about assets... It's how news travels generally. \n\nPlotting mentions of COVID with death toll over time probably yields the same chart.",
          "score": 1
        },
        {
          "text": "Not surprising after all if there’s no price movement no one will post about it, and there’s a blood frenzy effect w posts which spread and in turn generate more posts.\n\nTho this insight is not reallytranslatable to actionable trading or investing because if say you sold at sept, Oct after a frenzy of retail posting, gold went on to up by another 50%",
          "score": 1
        },
        {
          "text": "People here are against stock picking, hardly a surprise that posts are lagging indicators of price.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qw572w",
      "subreddit": "singaporefi",
      "title": "Worried about parents debt",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qw572w/worried_about_parents_debt/",
      "score": 30,
      "num_comments": 27,
      "created_at": "2026-02-05T07:49:22",
      "selftext": "Basically my parents have been in debt for a while now. recently my parents have been getting lawyer letters from the bank stating if they don’t pay them back etc etc. the amount totalled up to 11k and none of my parents have the financial power to pay the amount. My mom barely scraps through the month with her salary and my dad basically is self employed cab driver that only makes enough to cover up his car rental. Knowing this I don’t think CCS is an option. Moreover, I think we might get a court order after this. Is it too late? Are my items gonna get seized? I’m terrified of what comes next. I own a laptop, an iPad, chair, tables. I’ve heard they can seize these items. Is it true? Also I’m not sure what other options my parents have besides bankruptcy. I also am worried for my younger sibling as he doesn’t know how to digest this situation. Please help, any words of true affirmation would really be appreciated. ",
      "comments": [
        {
          "text": "Who says CCS is not an option?\n\nGet your parents to reach out to CCS and they will arrange an instalment payment with the banks for the repayment \n\nAct now. And all the best.",
          "score": 49
        },
        {
          "text": "Drive cab can only earn enough for rental? I believe he is not trying hard enough. Nowadays grab drivers can easilt earn 4 to 5k per mth (i think)",
          "score": 31
        },
        {
          "text": "Going to sound harsh but your parents are bums if they cannot pay back 11k.\n\n11k is legit like what a partimer can earn in a year working decently hard.\n\nYou can make 11k in a year. A PT is around 11-12. You work Saturday and Sundays. That is 200~. Four weeks a month. 700-800. A year later, 8400? Plus if you work every holidays it is going to boost it up to 11k?\n\nLike if your parents also grinded a bit during weekends the timeline also speeds up isn't it?\n\nSource: I grinded every day working PT and I genuinely made like 3k a month just partiming and doing oddjobs as a student.",
          "score": 22
        },
        {
          "text": "hey, I’m really sorry this is happening. I went through something very similar years ago and it took my family +/- 10 years to get out of it. My parents also had no education, after my dad’s business failed, he’d incurred a LARGE debt and both my parents became Grab drivers. It was long an arduous, and I helped out once I was old enough. It wasn’t easy but we made it. First step is budgeting, figure out how much you do have and what you really need the rest is set aside. Then you create repayment plans with the respective institutions your parents owe money to. In my experience this isn’t something you can handle within yourselves and you’ll probably need help from an external third party. Yes, you’ll end up paying heaps in interests but that’s just how that works. \n\nDon’t be disheartened and also, if I could do it again, I would’ve tried to remind myself more not to take it upon myself. As the oldest daughter, I cared a lot and that caused me grief. My sibling was less bothered and he came through fine lol. Your parents are ultimately responsible for this.",
          "score": 17
        },
        {
          "text": "The banks can seize assets which belong to your parents. They cannot seize hdb flats. \n\nIf debts become too much, bankruptcy may not be a bad option. It is not a death sentence and people do get discharged from bankruptcy",
          "score": 11
        },
        {
          "text": "Tell them about Debt Repayment Scheme (DRS). As long as not Ah Long, can settle one.",
          "score": 11
        },
        {
          "text": "Ur parents sound lazy, rly sorry to say that. \n\nCcs is the way forward\n\nFree meals is also the way forward\n\nCut down expenses \n\nBut most imptly ur parents need to LOCK IN.",
          "score": 10
        },
        {
          "text": "Talk to CCS first, they should be able to help you to come up with an interim plan for now",
          "score": 6
        },
        {
          "text": "*  What kind of debt is it? I.e what's the interest and who is it owed to\n*  11k is not actually that much, I'm sure a repayment plan can be worked out, if not see if any friends or relatives can help with a loan first?\n*  time for everyone to hustle, cut down and try to pay off the debt",
          "score": 5
        },
        {
          "text": "Live on budget. Each person works 2-3 jobs.",
          "score": 5
        },
        {
          "text": "You can ask CCS, and if your dad’s pay is only covering rental please find another job even part time ones he will likely earn much more",
          "score": 4
        },
        {
          "text": "Hi act now and not later will make a lot of difference",
          "score": 4
        },
        {
          "text": "Looking at your current situation it makes sense to self file for bankruptcy if they cannot take the level of stress with the debt collection. \n\nThe amount is not large to the banks and the process they are seeing now is part of the SOP. In truth the banks are hoping that your parents self file for bankruptcy as it is rather costly to do so. \n\nIf I am not wrong the process is going to cost around $5k to apply for self filing of bankruptcy. Once the bankruptcy is approved by the court, the banks will write it down as bad debt and they will move on. Your parents will no longer be hassled as the law states that only IPTO can be contacted with regard to the debt. \n\nTypically would not take it so far as to get a baliff to go and seize the household items but this is not guaranteed.",
          "score": 3
        },
        {
          "text": "Go to CCS. This is exactly why CCS exists, for people such as your parents who do not earn enough to service the monthly debt and to avoid bankruptcy and seizure.\n\nCCS will try to understand your financial situation and to design a realistic payment plan. They will also talk to banks to reduce the interest rate, even to 0, or even reduce the debt amount.",
          "score": 2
        },
        {
          "text": "is your dad medically unfit or how old is he? Drive just to cover rental? Pretty sure drivers can get quite a decent income (above rental of course) if they put in the work. ",
          "score": 2
        },
        {
          "text": "CCS is the way to go. Truth is banks will expect to take a haircut on bad debt. It will be better for them to agree to CCS too, because the legal costs and administrative costs of enforcing that size debt will just make a bad debt worse for them. So CCS is the way to go.\n\nPlease - under no circumstances whatsoever should anybody go to a moneylender.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qvkcif",
      "subreddit": "singaporefi",
      "title": "Expense for young family, baby expecting soon",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qvkcif/expense_for_young_family_baby_expecting_soon/",
      "score": 10,
      "num_comments": 41,
      "created_at": "2026-02-04T17:45:42",
      "selftext": "Hi All,\n\nLooking for calculating my monthly budget expenses. Not aiming to optimise aggressively — more about avoiding mistakes during a major life transition.\n\nWe are married, first child arriving soon, \nBoth of us are PR and might expecting single income if the baby need close taking care by my wife.\n\nRecently purchased a 4-room resale HDB\n\nIncome\n\nCombine take-home: ~8.5k / month\nIf my wife not working take-home: ~6.8k / month\n\nMonthly Outflow (rounded)\nMortgage: ~2,000 (will be paying from OA now)\n\nCurrent Household essentials (groceries, utilities, transport, insurance, excluding baby essential): ~2,500\n\nEach Personal buffer / misc: ~800–1,000, total ~2,000\n\n\nLiquidity / Buffers\nCash on hand: ~50k\n\nCPF OA: empty as just buying the flat burning our CPF\n\nInvestments currently paused to prioritise stability\n\nKey Questions\n\n1. How much will it like for monthly expenses after baby arriving?\n\n2. From experience, is 50k cash a sufficient emergency fund at this stage, or is 80–100k more prudent given a newborn + mortgage?\n\n3. Any commonly underestimated expenses in the first year with a baby that I should plan ahead for?\n\nAppreciate insights from those who’ve gone through a similar phase. Thanks in advance.",
      "comments": [
        {
          "text": "Relatively new-ish dad here. Congrats on the newborn! \n\nOur biggest expense that we didn’t really account for was the delivery. Wife ended up needing emergency c-section and we also had to stay an extra night. \n\nApart from that if baby is on formula then per tub is around 120-ish depending on the brand. Monthly cost for me was 4-500. You can ignore this if purely breastfeeding.\n \nOff the top of my head, other recurring expenses are diapers (50-60 per month), wet wipes (30-50 bucks) &amp; doctor visits (vaccinations, etc. varies but ours was between 1-200).\n\nOne-off costs are strollers, car seat, cot + mattress and sheets, baby chair for when they start sitting. Costs vary but there are products for every budget so just get the one you can afford or get used on Carousell.\n\nMaybe forgetting some things here as the newborn phase was quite a blur 😶‍🌫️ 😆",
          "score": 15
        },
        {
          "text": "I personally found that if the wife can accept and trust the system. Many things can be cheaper.\n\nLike my wife is ok with class C2 for giving birth, we can't choose the doctor and it depends on the expertise of the day shift doctor to bring my daughter to this world. Because we willing to accept C2 class, the entire bill for delivery is only 1.7k. \n\nMy wife also can allow me to rent out 2 rooms to stranger for rent income. That extra 2k + each month.\n\nDaughter got a lot of hand me down clothes from friends. \n\nWe learn to travel with bus and mrt. \n\nBuy 2nd hand stroller. Some good quality one only cost 30 dollar. Original cost 220. \n\nIf baby is healthy and well, does not go doctors often. U do save quite a bit there.\n\nHaving breast milk did boost daughter immunity system but not all can have and do it for long. \n\nWife full time housewife and I the only one working bring less than 5.3k each month home.\n\n\nHence we survived by this lean living.",
          "score": 10
        },
        {
          "text": "Most citizens will not be familiar with costs for PRs. You have no Baby Bonus and face extra costs associated with less subsidised medical bills etc.",
          "score": 3
        },
        {
          "text": "Firstly, congratulations!! Others have covered a good bunch of stuff, but if you’re going to formula feed then you might also buy a milk warmer and sterilised (costs me about $250 in total).\n\nI would recommend buying 8 milk bottles (cost me like $20 per bottle) since newborns drink milk very frequently, and also buying a tabletop dishwasher (cost me like $100 from Carousell) to wash your bottles. When you have 6 bottles or more with 4 different parts to wash per bottle, it can get super time consuming especially when you are sleep deprived.\n\nAlso, idk why people buy milk that is so expensive..I buy the Fairprice brand and it costs me $30 per tin, lasts about 2 weeks each tin for the first 3 months or so. I went through the nutritional information line by line, Fairprice brand is as good as if not better than most brands. HPB also ensures that all formula milk sold here is of a certain standard.\n\nYou probably will also need to give your baby probiotics, costs me like $30 for ~1 month worth.",
          "score": 3
        },
        {
          "text": "not a parent but I think 50k sounds too little. Unexpected expenses for baby can add up (diaper, food, toys, education in future ) or if (touch wood) one of you sick and the baby is sick, quite risky.",
          "score": 3
        },
        {
          "text": "Do not pre buy any baby stuff. U will end up with alot of waste. Trust me",
          "score": 2
        },
        {
          "text": "Any plans to go back to home country for cheaper medical delivery and maybe postpartum support? For example i know some Malaysians going to JB for the postpartum centres. In the unfortunate case of emergencies the cost may be more manageable. There are couples ending up trying to crowdfund when their baby was severely premature.",
          "score": 2
        },
        {
          "text": "A $100k emergency fund will be better. Emergency cases that need more cash are the unexpected medical issue for mother and baby.",
          "score": 1
        },
        {
          "text": "I have a kid, my emergency funds are 30k. Roughly 6 months of expenses. Everything else is invested. Granted our personal buffer is more like 300/person. Apart from delivery (one time cost), monthly most expensive are childcare fees and milk powder. That is if you don’t get a car. ",
          "score": 1
        },
        {
          "text": "Key Questions\n\n&gt; 1. How much will it like for monthly expenses after baby arriving?\n\nMilk powder about 3-4 tins - so $90 to $240/month depends on brand\n\nDiaper change every 3-4 hours - roughly 8 a day, $0.20/piece, about $48.\n\nInfant care (we didn't get) iirc about $350/month\n\nWet wipes and what not ~$100.\n\nSo roughly $750 -$800 minimum\n\n\n&gt; 3. Any commonly underestimated expenses in the first year with a baby that I should plan ahead for\n\nPediatrics is expensive. Very expensive. My wife do have very good company insurance, so we didnt have problem with that . But if you have to, there's pediatrics at polyclinic, though I'm not sure how good they are. \n\nGood luck. Jia you.\n\nEdit: \n\nOh wait sorry missed the point that you're PR. Not sure if you'll get subsidy for infant care. That's about another $300.",
          "score": 1
        },
        {
          "text": "$50k is more than enough.",
          "score": 1
        },
        {
          "text": "Don't buy too much newborn sized diapers at one shot. I've gotten free ones from so many family and friends because they think buy in bulk cheaper but end up newborn outgrew it so fast.\n\nIf feeding formula, also don't buy too many. Try 1 tin first because sometimes not suitable for baby (constipation, gassy etc) and have to try different brands.",
          "score": 1
        },
        {
          "text": "One of our biggest unexpected costs was labour - had to go for induction that lasted overnight (paid one extra night for ward), blood tests, and blood transfusions. \n\nIf your baby has jaundice, you also have to pay for your baby to stay for extra days.\n\nIdk if breastfeeding is something you are considering but based on personal experience it can get very expensive. We spent a lot of money buying different pumps because some just didn’t work well for me. Add on the costs of buying breastfeeding friendly clothes, nipple cream etc.\n\nI also ended up with mastitis (inflamed milk ducts) and had to pay for dr visit, antibiotics etc. Also need to factor in possible urgent engorgement relief massages (each session $100+). And of course buying a deep freezer if excess supply.\n\nWe also had to buy a lot of different bottle brands because baby hated some of them. The costs can really add up. Then add on the fact that you need to replace the teats every 6 months.\n\nDr costs for baby: assuming you visit a PD instead of polyclinic, each visit is easily more than $100. Touchwood la but falling sick is v common in the first year especially if in childcare. We also had urgent visits to KKH for accidents like falling and rolling off.\n\nEdit: you might also end up using a lot more wet wipes than you think. Lol. We never burned through our supply so fast until she started solids and discovered she could spit and throw food.",
          "score": 1
        },
        {
          "text": "Congratulations OP,\n\n\nGiving you some quality of life advice for first 3 months.\n\n\nJust spurge on extra 4oz/120ml small bottles. You have more buffer before you need to wash and sterilise them. My first kid I had 4 bottles, 2nd kid I bought 8. Drastically made my life much easier when it came to making sure there is enough bottles for my wife to use.\n\n\nHave a vacuum bottle with warm water ready for night feeding if you are mixing with formula. \n\n\nIf you are getting pump for your wife, hands free pump does not fully clear the milk, but it allows your wife to do stuff while pumping. Plug in pump has more power.\n\n\nWhen you are trying which formula your baby likes, instead of buying a whole tin, some brands might send you samples if you register on their website.",
          "score": 1
        },
        {
          "text": "Your most expensive expense will be infant care (either provided by a centre or your wife). 50k emergency fund is adequate. You or wife should apply for citizenship, it is the best way forward. Financially, socially and mentally. But of course, you will feel it financially most of all. Child care fees, baby bonus, school fees in future, govt vouchers and subsidies…",
          "score": 1
        },
        {
          "text": "Congrats on the baby! As a fellow new-ish dad, I'll list some of the larger expenses that I faced and hope it will help your planning. \n\n1. Delivery (esp in the case of complications)\n\n2. Pediatrician visits - I severely underestimated how often babies get sick and as first time parents, we panic send to private pediatricians quite a lot. These easily cost more than 200 per visit. \n\n3. Confinement help - costs about 3.5k - 4k per month for a live-in nanny in SG. May be cheaper in Malaysia. \n\n4. Post-partum stuff - e.g. post-partum massage, tonics, better quality groceries etc. \n\n5. Help with household chores - got a robot vacuum to help clean the house, some ppl get full/part-time helper etc. \n\n6. School uniform and down payment of school fees which cannot be paid from CDA. \n\nI recognize that some of these are non-essential, but better to budget higher and have a choice when shit happens. ",
          "score": 1
        },
        {
          "text": "Congrats on the new addition. Honestly, as someone in the medical line, 50k cash is a bit tight for comfort if you're switching to a single income. Aim for that 80-100k range... unexpected hospital visits or pediatric emergencies can be quite a shock to the system.\n​You'll easily spend an extra $1.2k - $1.5k a month once the baby is here between formula, diapers, and the inevitable doctor visits. One thing people always forget is the insurance; get that baby's shield plan sorted the moment they're born. Since you're both PRs, remember you don't get the same subsidies as citizens, so those private pediatric bills hit harder. Focus on the family first, the investments can wait, lah.",
          "score": 1
        },
        {
          "text": "Hi OP, congrats on the new phase of life. \n\n1.\t⁠How much will it like for monthly expenses after baby arriving?\n\nReading your post, you’re from Malaysia. So i guess most of the essentials you can buy from Malaysia like milk powder, diapers - these 2 Little Genius in JB should be able to get better prices. That is if you are not fussy on origin of milk. Some parents prefer from Australia. \n\nWet wipes can compare, sometimes Shopee have promotion to buy in bulk. Probably can save some money here. \n\nDo factor in visits to doctors as well for vaccines and etc. For PR, can’t recall if might need to pay for vaccines in SG. So maybe can consider to do vaccines in Malaysia too. \n\n2.\t⁠From experience, is 50k cash a sufficient emergency fund at this stage, or is 80–100k more prudent given a newborn + mortgage?\n\n50k should be fine, if there are no health condition. Otherwise doctor visits and checks might add up. \n\n3.\t⁠Any commonly underestimated expenses in the first year with a baby that I should plan ahead for?\n\nAre you able to get help? Personally for me we are quite lucky to work remotely sometimes, so we shuttle between SG and Msia (3 days SG 4 days Msia) until baby turns 18 months to send him to PG. MIL helped to take care of BB for us so it saved on infantcare. But of course also depends if you can bear to seperate from BB. \n\nNot sure how much is infantcare but based on my past research is around $1k+ and for PR dont think there is any subsidies as well. So might add up quite abit to the monthly expenses if you intend to send. \n\nTry to get hand me downs if you are not fussy like clothes, toys, strollers, car seats etc. usually friends around will be happy to pass it on. \n\nAll the best to you!",
          "score": 1
        },
        {
          "text": "Don’t spend too much on baby clothing, they outgrow fast\nTry buying bay essentials like diapers in JB, “Little Genius”. You can save a lot",
          "score": 1
        },
        {
          "text": "congratulations on the kiddo coming! words cannot really convey the experience but you'll be experiencing the joys of parenthood soon enough! \n\npersonally i find that it is really about what you bring into the journey - how to choose to spend and what you choose to spend on. formula is a good example, with prices being a huge range! a simple chicken can range from $3 per to close to $20 for those organic free roaming versions too.\n\nalso share - one big thing early on i've found is that breastfeeding is a HUGE topic and a source of a lot of emotional and physical challenge/ considerations especially for mothers. having pop-up msgs on websites taking about how breast milk is best when trying to buy formula does not do wonders for mental health of mothers. and it is undoubtedly a privilege to be able to breast feed. same logic to the lady joining the workforce and house hold income.\n\nanyway, shameless plug but i am from a whatsapp community for dads and you're more than welcome to join us. PM me if you'd like the link to join. you can also search of \"Dads of Singapore\" on whatsapp communities - It's a small but fun group of guys and a mix of new and experienced dads to share wisdom, jokes and the like.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qvf71p",
      "subreddit": "singaporefi",
      "title": "Low spender best credit card?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qvf71p/low_spender_best_credit_card/",
      "score": 9,
      "num_comments": 24,
      "created_at": "2026-02-04T12:48:15",
      "selftext": "I am a single male who spends around $300 on food and $100 on public transport with some miscellaneous costs incurred occasionally.\n\nI have not owned a credit card before and would like one just to start building a credit score (preferably no annual fees)\n\nWhat is suitable for me?",
      "comments": [
        {
          "text": "DCS Ultimate Platinum MasterCard.. 2% cashback on all spend, no min spend..",
          "score": 5
        },
        {
          "text": "MariBank CC 1.5% on all expense \nNo annual fee\nNo FX fee",
          "score": 5
        },
        {
          "text": "Maribank",
          "score": 4
        },
        {
          "text": "Same vibes, low spend no card before lol, just grab any basic no-fee starter card, use for food/transportation only and pay on full every month, easy credit build.",
          "score": 3
        },
        {
          "text": "how old are you? age matters if you have not owned a cc before. my colleague (36M) does not use a cc only debit card and has a lot of difficulty applying for 1. Trust bank allows him to have one provided he opens a savings account of minimum 10k balance with them.",
          "score": 2
        },
        {
          "text": "Depends on your cash balance you willing to put in savings and whether you are a salaried worker. The answer varies from Maribank to brick-and-mortar credit cards to maximize cashback",
          "score": 1
        },
        {
          "text": "If you are a union member, shops at ntuc and eats at kopitiam, trust link card is very good for their points",
          "score": 1
        },
        {
          "text": "I use no min spend credit card like Citi reward for online and Shopback/Fairprice or any app/QR code in store. UOB lady for transport or travel (swap the category when I want to book flight/hotel). Everything else use any 1.6% credit card.",
          "score": 1
        },
        {
          "text": "depends on whether you want to use it to accumulate miles or cash back? If miles maybe get UOB preferred platinum visa. But must use your phone to make payments rather than physically tap the card",
          "score": 1
        },
        {
          "text": "What is your annual income? Most CCs have a minimum. \n\nMaribank cc is a good entry level one with 1.5% cashback, no annual fees, no minimum spend or annual income",
          "score": 1
        },
        {
          "text": "I personally prefer miles over Cashback especially if you do travel. \n\nMainly because most good Cashback card has minimum spend whereas miles card is the opposite, they have maximum spend for the best rewards and any spending afterwards, u get paltry reward.\n\nI actually recommend UOB PPV for you assuming you prefer miles.",
          "score": 1
        },
        {
          "text": "I personally got this one. Minimum annual spending required is 2.5k, the lowest in all of OCBC, but the rewards do seem lackluster compared to other cards\n\n\nhttps://www.ocbc.com/personal-banking/cards/best-denki-rewards-credit-card",
          "score": 1
        },
        {
          "text": "I use both UOB PPV and UOB lady's card. UOB ppv earns points on almost everything (except utilities, healthcare, education) so long as you do contact less payment. only problem is the earning blocks of $5. i pair it with UOB lady's card which I use for travel related expenses so I don't reach the bonus points spending cap in the uob ppv card. since I use both uob cards, I can accumulate uob points together to redeem different items.\n\nannual fee can be waived and no minimum spend per month for both cards",
          "score": 1
        },
        {
          "text": "The food is hawker PayLah?",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qw9pg5",
      "subreddit": "singaporefi",
      "title": "What’s your thoughts on the US tech selloff yesterday?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qw9pg5/whats_your_thoughts_on_the_us_tech_selloff/",
      "score": 6,
      "num_comments": 28,
      "created_at": "2026-02-05T11:04:43",
      "selftext": "Is it a short term risk off rotation out from it or a long term bear market happening? What will be your strategy around it assuming you already have a portfolio of tech stocks?\n\nnote: some comments came in with opinions on the word ‘selloff’ , maybe we all have different definitions of a single day selloff and i agree its nothing major yet for longer time frame and am not encouraging any knee-jerk reactions. Purpose of this post is to drive a discussion on trends and momentum moving forward, not a doomsday or panic post. Chill and cheers.",
      "comments": [
        {
          "text": "Hold.\n\nGoogle isn't going anywhere\nMicrosoft isn't going anywhere\nAWS is doing well\n\n\nSpeculative tech stocks yes maybe abit of risk.\n\nIf you are in, no reason to sell and find the dip to go back in. \n\nAccumulate  cash through others , if dip like crazy buy in. Like Google at 250 is steal if it ever happens",
          "score": 23
        },
        {
          "text": "*sees S&amp;P500 is only 0.5% down yesterday and +0.5% YTD*\n\nIs the sell-off in the room with us?",
          "score": 21
        },
        {
          "text": "It's just rotation.  Most of the money going into energy.\n\nWhen market is at peak valuation, fund managers will cut winners and buy laggards.  Thats why at index level, it didn't move much.",
          "score": 6
        },
        {
          "text": "Hold it out for now if money is not of a concern. Some of the tech stocks are overvalued, have to sniff their fundamentals. The sell-off is due to AI spending where they are big CAPEX and less than optimal guidance. ",
          "score": 4
        },
        {
          "text": "Market does not like uncertainties. \n\nBig techs are fine. It’s the SaaS companies that are in trouble because the market is not sure whether they can sustain their business model with GenAI.",
          "score": 3
        },
        {
          "text": "Sector rotation in generally. Some big tech ain’t expensive at these levels. Happy to scoop up some",
          "score": 2
        },
        {
          "text": "long overdue",
          "score": 2
        },
        {
          "text": "Just another day in the market. It can't go up every single day ",
          "score": 2
        },
        {
          "text": "stock go up, ask for thoughts. Stock goes down, also ask for thoughts. Not everything needs an explanation if you are in for the long run. Don’t need to stress over short term market fluctuations asking for validation. Just stay invested in good quality stocks. Not difficult to understand, no?",
          "score": 2
        },
        {
          "text": "gg saas companies",
          "score": 1
        },
        {
          "text": "zoom out on QQQ, it's not even a significant sell off",
          "score": 1
        },
        {
          "text": "Juz dca on those big tech. Mkt finding excuse to profit take. Given the AI progress of some tech like google  Meta &amp; Msft, this year should see good results",
          "score": 1
        },
        {
          "text": "If youre concerned over a 1.5% decline in qqq then whats going to happen when it falls 25%?",
          "score": 1
        },
        {
          "text": "Another day, another contender for the crown of Pet/ET.",
          "score": 0
        },
        {
          "text": "I’m still up &gt;2x on AMD",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qvuk4n",
      "subreddit": "singaporefi",
      "title": "Starting salary of semicon equipment engineer",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qvuk4n/starting_salary_of_semicon_equipment_engineer/",
      "score": 5,
      "num_comments": 3,
      "created_at": "2026-02-05T01:17:53",
      "selftext": "\nWill be graduating soom from uni with a ME degree and  I’m particularly interested in roles as an equipment engineer in the semicon industry. I’m also curious whether there’s any noticeable pay difference between lithography equipment engineers and other equipment engineers (e.g. etch, diffusion, CVD, CMP, etc.).\n\nI was wondering if anyone here has experience working in companies like UMC, Micron, or similar, and could share what kind of starting salary fresh grads usually get for these roles.\n\n Any advice or personal experiences would be super helpful too, especially about how pay compares across companies.\n\nThanks in advance!",
      "comments": [
        {
          "text": "Back when I worked for Micron several years back, starting pay was in the 4K+ range irrespective of the department. Pay might be higher now but don’t think they will differentiate between teams as the team being shortchanged would raise issue with HR. \n\nIn terms of life though, Litho and dry etch were probably the most stressful ones. I distinctly remember CMP having a lot of nice bosses and generally happier people.",
          "score": 4
        },
        {
          "text": "When applying for semicon company, always read Glassdoor reviews. Particularly do not join ASM because CEO is acting like trump in the company. 🤡",
          "score": 1
        },
        {
          "text": "Company pay by pay grade, so same same. Only difference I see is the career prospects. Think Litho probably worth more as it is needed no matter what semicon process. It is also a high value chain industry. See ASML.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qvmrvu",
      "subreddit": "singaporefi",
      "title": "Resale levy dilemma. Take 50k HDB grant and invest my cash or pay 50k more cash to retain first timer benefit and avoid resale levy?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qvmrvu/resale_levy_dilemma_take_50k_hdb_grant_and_invest/",
      "score": 5,
      "num_comments": 20,
      "created_at": "2026-02-04T20:04:50",
      "selftext": "I just bought a four room resale and am thinking whether to take HDB grant. I have sufficient cash to not take the grant and have not decided whether to BTO or go private for my second property after MOP.\n\nI’m also aware that my future salary may exceed the grant limit or going private will not allow me to be eligible for HDB grant.\n\nSo should I….\n\n(1) take a 50k grant now and invest my cash into index fund. Opportunity cost is lower priority for BTO which may yield better returns\n\n(2) not take the grant, pay 50k more cash and retain first timer benefit for BTO. Opportunity cost is returns from investing 50k cash\n\nEdit: forgot to mentioned that the resale levy would be 60k should I decide to BTO for second property.\n\nAny considerations that I’m missing?",
      "comments": [
        {
          "text": "A bird in the hand is worth two in the bush",
          "score": 15
        },
        {
          "text": "Had almost the same question 5 years ago.\nBut took the grant as I could not afford without the grant.\n\nAfter 5 years Mop alot of things can change.\n\nSome cannot even qualify for BTO or ec anymore.\n\nAnd quitting a job for a year to buy an EC, I dun think I will do it or ask my wife to do it as it feels really risky. \n\nBuying an ec requires a ton of cash due to the 30% MSR and with the lower income, the loan amount might be very little as well.\n\nJust take grant first, anything else is quite unknown as policies can change. Work hard to get pte after 5 years and no resale levy.",
          "score": 5
        },
        {
          "text": "Don’t take the grant. Future u will have more options",
          "score": 4
        },
        {
          "text": "I always thought take first will be better. \n\nDidn’t know can reserve the grant for next time.",
          "score": 3
        },
        {
          "text": "Take the grant first, you got your resale MOP of 5 years to clear first\n\nNext BTO is roughly 2 - 4 years + 5 to 10 years MOP, should you choose the option, that will probably be your 2nd and maybe last property to own for a long time.\n\nCan take it as you have $25k upfront for resale flat and a “future advance” of $25k for next BTO, in a way as well.\n\nThat will bring a yearly average grant of $5k - $10k, which is not a lot to be honest\n\nThe $50k grant is also useful to offset any renovation fees you have for the resale flat as well.",
          "score": 3
        },
        {
          "text": "Do you strive for a combined future salary &lt; bto income ceiling?",
          "score": 2
        },
        {
          "text": "Don't take the grants.",
          "score": 2
        },
        {
          "text": "Bto as a downsize option in future always good to preserve",
          "score": 1
        },
        {
          "text": "Isnt the resale levy 40k for 4rm?",
          "score": 1
        },
        {
          "text": "Take the grant first. \n\nBTO is not guaranteed plus that’s 5yrs MOP + another 3-4yrs to build + another MOP to meet.",
          "score": 1
        },
        {
          "text": "The only reason why i wont take it is to buy an EC. Because the priority there is worth more. If your future plan is BTO, its not worth the less liquidity.\n\n50k in cash can invest alot things. And earn you more than bto that you can only sell 15 years later. 5 year current mop, 5 year building period and 5year mop for BTO.\n\nEdit: did not see full content before commenting",
          "score": 1
        },
        {
          "text": "Fyi if you take the grant now and want to BTO ,on top of the levy you will be considered 2nd timer",
          "score": 1
        },
        {
          "text": "Never take grant unless u not planning to sell. The interest is overwhelming.",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qw6cg6",
      "subreddit": "singaporefi",
      "title": "IBKR liquidation trade despite sufficient funds?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qw6cg6/ibkr_liquidation_trade_despite_sufficient_funds/",
      "score": 1,
      "num_comments": 5,
      "created_at": "2026-02-05T08:37:22",
      "selftext": "Can anyone explain why I was “charged” this liquidation trade when i had sufficient funds of that currency to make the trade? I’m on a cash account so I’m not sure why it says margin violations. \n\nI haven’t faced this only until recently. It happens whenever a trade successfully fills, both for buying and selling. Thanks.",
      "comments": [
        {
          "text": "Currency conversion",
          "score": 10
        }
      ]
    },
    {
      "id": "t3_1qw1oeh",
      "subreddit": "singaporefi",
      "title": "Transfer IBKR position to OCBC?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qw1oeh/transfer_ibkr_position_to_ocbc/",
      "score": 0,
      "num_comments": 7,
      "created_at": "2026-02-05T05:31:59",
      "selftext": "Hi, \n\nI’m considering to transfer my IBKR positions to OCBC Securities. Is it possible? For those who have tried/done this, would appreciate if you can share your experience/tips please? \n\nThank you. ",
      "comments": [
        {
          "text": "But why? \n\nOCBC’s fees are shockingly high. When you do need to sell, you will cry at the minimum commissions of US$20 for US exchanges and US$95 for LSE. Even while you don’t sell, there’s US$2 per ticker per month holding fee!",
          "score": 9
        },
        {
          "text": "Please dont.",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1qvexx1",
      "subreddit": "singaporefi",
      "title": "Is it wise to buy VIX derivatives?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qvexx1/is_it_wise_to_buy_vix_derivatives/",
      "score": 0,
      "num_comments": 18,
      "created_at": "2026-02-04T12:35:47",
      "selftext": "Hi everyone, I have been introduced to VIX recently. \n\nI thought the concept - measuring market volatility - is interesting and wonder the viability of buying derivatives. I understand it is not possible to buy in VIX directly. \n\nCurrently I have most of my investments in VWRA/CSPX/VOO/STI etf + some blue chip stocks. \n\nI have never traded derivatives. \n\nGiven the uncertainty driven largely by Trump, is it feasible to have some holdings in VIX derivatives to hedge volatility until the US mid terms elections at least?\n\nIf it’s viable, which VIX derivatives are more prominent/popular?\n\nPlease correct me if I’m misinformed on any above. Thanks in advance!",
      "comments": [
        {
          "text": "&gt; I have never traded derivatives. \n\nThat's your answer right there",
          "score": 11
        },
        {
          "text": "&gt;I have never traded derivatives.\n\n&gt;Given the uncertainty driven largely by Trump, is it feasible to have some holdings in VIX derivatives to hedge volatility until the US mid terms elections at least?\n\n&gt;If it’s viable, which VIX derivatives are more prominent/popular?\n\nif you need to ask these, you should NOT do anything.\n\nNot to be mean but VWRA + CSPX + VOO combo is... a choice of all time.\n\nPlease don't do it...",
          "score": 5
        },
        {
          "text": "Why do you want to hedge against volatility? If you’re scared of the market tanking then deleverage your portfolio or buy puts as insurance.",
          "score": 5
        },
        {
          "text": "Vix futures and options are actively managed instruments used by fund managers.  No, do not use them unless you have solid experience.  \n\nFutures can clean you out in minutes and options in days.  These are not \"buy and hold as hedge\" instruments for retail.",
          "score": 3
        },
        {
          "text": "ETFs/ETNs tracking VIX futures (eg. VXX) are an easy way to get exposure, but these are almost guaranteed to lose money when held long-term due to negative rolldown in VIX futures, since the VIX futures curve is usually upward sloping.\n\nThe other issue is that longer-dated volatility tends to already trade with a premium, so VIX futures may not move 1-for-1 with the spot VIX index, and so may not function as intended when markets get jittery short term. The market is pretty efficient at pricing S&amp;P500 volatility, so there won't be any \"free hedge\", so to speak.\n\nFor instance, when the tech selloff hit last night, the VIX index went from 16.2 to 20.2 (~4 points), Feb VIX future went from 18 to 20 (~2 points) and Mar VIX future moved even less, from 19.1 to 20.3 (~1.2 points).\n\nOptions on VIX futures also exist, but that's a different ballgame altogether (volatility of volatility).\n\nSo VIX instruments are at best a tool for short-term trading, assuming the conventional correlation holds (stocks down, vol up), but do not function well as a portfolio hedge long-term.",
          "score": 3
        },
        {
          "text": "no",
          "score": 2
        },
        {
          "text": "Short answer: NO\n\nLong answer: NO!!! Don’t play with things you don’t understand",
          "score": 2
        },
        {
          "text": "Dont do it if you dont know what it is.",
          "score": 1
        },
        {
          "text": "VIX sounds cool but it's super tricky for newbies like me... most say it's more for short hedges, bums cash fast if u hold long. Maybe just sit tight with etfs?",
          "score": 1
        },
        {
          "text": "I keep roughly 0.5% of my usd portfolio in vix. When black swan ever came, this small portion tanked and help me to offset some other losses.",
          "score": 1
        }
      ]
    }
  ]
}