{
  "schema_version": "raw_scrape_v1",
  "report_id": "2026-02-03",
  "scraped_at": "2026-02-03T12:29:46.349294",
  "subreddits": [
    "singapore",
    "askSingapore",
    "SingaporeRaw",
    "singaporefi"
  ],
  "total_posts": 40,
  "total_comments": 865,
  "posts": [
    {
      "id": "t3_1qulqle",
      "subreddit": "singapore",
      "title": "This isn't from Woodlands, it's a photo taken from inside a Cambodian scam compound",
      "url": "https://old.reddit.com/r/singapore/comments/1qulqle/this_isnt_from_woodlands_its_a_photo_taken_from/",
      "score": 1446,
      "num_comments": 128,
      "created_at": "2026-02-03T07:37:20",
      "selftext": "More photos hereand anews article here",
      "comments": [
        {
          "text": "Hello Polis?",
          "score": 442
        },
        {
          "text": "I thought they just use background filter. The way they actually spent some budget making an actual glossy background 😭",
          "score": 424
        },
        {
          "text": "Well if they randomly called someone staying near Woodlands East Neighbourhood Police Centre, that someone could do the funniest thing by going to the actual Woodlands East NPC to report",
          "score": 227
        },
        {
          "text": "你好",
          "score": 173
        },
        {
          "text": "这是新加坡警察局",
          "score": 146
        },
        {
          "text": "Turn it into a video call as they walk right in and hand the phone over to the desk officer",
          "score": 111
        },
        {
          "text": "Background filter is really obvious when someone moves around at all.",
          "score": 103
        },
        {
          "text": "你的银行户口有可疑物品。请拨打九九九。eh?",
          "score": 86
        },
        {
          "text": "Translate the joke for our non Chinese speaking brethren because the lingua franca of SG is english When the scam centres scammers call and declare they are from police, usually they'll speak in mandarin instead of standard Eng. The previous comments are rehashing the standard scripts by these scammers, but the latest one went: 'your bank acc has suspicious items (should be transactions), please call 999 i.e. self pwn PS: should not be 物品(item), but 交易(transactions), unless that's part of the hoke.",
          "score": 81
        },
        {
          "text": "Money spent on a glossy backdrop instead of just using a filter. Priorities are wild.",
          "score": 39
        },
        {
          "text": "i transitioned to the mrt announcement \"If you see a suspicious person, object, or activity in an MRT station or train, immediately notify station staff, security personnel, or call 999.\" halfway. i have stupid humour. sorry.",
          "score": 31
        },
        {
          "text": "This costs just a fraction of what they can get from a good victim. KH Scam centers are estimated to have revenue about half of Cambodian foemal GDP",
          "score": 31
        },
        {
          "text": "I also got video call from someone from ‘Ministry of Law’ full background with Acrylic signboard in their conference room. Half tempted to print a CID background to use to reply these calls. “Really ah? I’m under investigation? Come my office level 4 to see me in person”",
          "score": 31
        },
        {
          "text": "这是Patrick。",
          "score": 18
        },
        {
          "text": "Never keep up with the times.",
          "score": 16
        },
        {
          "text": "这是一个bruh的moment。",
          "score": 14
        },
        {
          "text": "They are rich from scamming. Look at Chen Zhi of prince group who was recently caught, dude was worth $60billion USD.",
          "score": 11
        },
        {
          "text": "Yall are picking up video calls from unknown numbers?",
          "score": 5
        },
        {
          "text": "I can assure u they speak perfect English",
          "score": 4
        },
        {
          "text": "同志*",
          "score": 3
        },
        {
          "text": "In this case, the gloss ACTUALLY gives it away, IMO. I'd share, but the last thing I'd want is for a lurking scammer to learn",
          "score": 2
        },
        {
          "text": "DEW IT!!!",
          "score": 1
        },
        {
          "text": "Indonesian here. They use a phone and move the phone around to make it seem convincing.",
          "score": 0
        },
        {
          "text": "Not really video calls, but normal calls that get transferred into video calls if you really wanna waste people time haha",
          "score": 0
        },
        {
          "text": "Haha my friend in ICA legit got called by them before. He just cite this law and that law and ask them which one he break lol.",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qupccv",
      "subreddit": "singapore",
      "title": "Personal mobility scooters to be restricted to those with a medical need or above age 70 from June 2026",
      "url": "https://old.reddit.com/r/singapore/comments/1qupccv/personal_mobility_scooters_to_be_restricted_to/",
      "score": 333,
      "num_comments": 60,
      "created_at": "2026-02-03T11:20:11",
      "selftext": "",
      "comments": [
        {
          "text": "Sounds like a good move. Some of these PMA users are becoming way too entitled.",
          "score": 176
        },
        {
          "text": "There will still be many who will abuse the usage of PMAs until caught and feign ignorance of the new rulings",
          "score": 94
        },
        {
          "text": "It’s ok. At least the first step of official legislation is done The only way things work in Singapore is to fine them. So fine those clowns. Every offence find $10K or jail 1 year You see how fast people become compliant",
          "score": 0
        },
        {
          "text": "- 3 years jail, plus- family income tax 400% over the next 15 years or 2 generations, plus- extended family of up to 3 degrees cannot flip BTO, plus- 200% capital gain tax, plus- 300% insurance premium, plus- 5 strokes of cane, or 3 months of jail in exchange for each stroke of cane and worst of all.. no cdc vouchers forLIFE",
          "score": 0
        },
        {
          "text": "Over here legislators, for you to copy & paste.",
          "score": 0
        },
        {
          "text": "i like this one. actually just need 'no cdc vouchers for LIFE' should be enough to deter people",
          "score": 0
        },
        {
          "text": "They should punish them with corrective work order. Go blow leaves from pavement, pick up litter at HDB common areas, etc.",
          "score": 0
        },
        {
          "text": "Alrd give 4 months heads up, cant feign ignorance mah However...still got people that were not aware of the Circle Line works and got mad about it so its possible",
          "score": 0
        },
        {
          "text": "Ignorance is not an excuse when it comes to the law. They can feign all they want but if the government is serious about a show of force then the offenders will suffer the consequences.",
          "score": 0
        },
        {
          "text": "Waiting to see how the enforcement is going to be conducted.",
          "score": 0
        },
        {
          "text": "True. Things like this are hard to enforce to be fair. Can just slap a $10k fine and hope it will deter people.",
          "score": 0
        },
        {
          "text": "10k dont think so will deter lah. Must be like those litter bug case embarass them in public. If seem no medical condition with leg they will need to do 10 km route march in public.",
          "score": 0
        },
        {
          "text": "Yup. Smoking is banned in many places. But enforcement weak.",
          "score": 0
        },
        {
          "text": "Enforcement was quite successful at getting e-scooter PMDs off footpaths a few years ago. Keep in mind that for PMAs, the situation is so bad because there is currently nothing to enforce. LTA literally has no legal basis to stop families from riding a train of PMAs piled with young and old, or souped up PMAs that can zoom very fast. Must wait for the legislature (delayed since 2024/2025) for there to be something to enforce.",
          "score": 0
        },
        {
          "text": "Not very clear how they are going to enforce the 6km/h. Would speed limiters be installed? Relying on the current occasional and largely ceremonial deterrent enforcement presence is just not going to work.",
          "score": 0
        },
        {
          "text": "Few months ago, the pedestrian-only path also not enforced",
          "score": 0
        },
        {
          "text": "What would you do if a neighbour whose entire family who stays in the same floor as you, park multiple PMA/PMD outside your flat.. and they stayed a few houses away from where they park.. I think they might be afraid it might catch fire so being away from the PMA/PMD is the safest thing they do.. I doubt the entire family has medical condition to own so many PMA/PMD..",
          "score": 0
        },
        {
          "text": "Report to your town Council about bulk rubbish blocking the public corridor. Dangerous rubbish with electronics that might catch fire. Nobody watching over the rubbish at night. You are worried for your life and property. Use one service app to report.",
          "score": 0
        },
        {
          "text": "Take a pic using the OneService app and state that it is a fire hazard and obstructs emergency access. Repeat daily until action is taken.",
          "score": 0
        },
        {
          "text": "[ Removed by Reddit ]",
          "score": 0
        },
        {
          "text": "Start this today man, fuck these bengs/mats/boomers on electric wheelchairs going 60km/hr.",
          "score": 0
        },
        {
          "text": "how will it be enforced which imo is the issue",
          "score": 0
        },
        {
          "text": "I’m imagining a bunch of goons in tactical gear like ICE. Dragging fatties and <70 folks off and crushing the PMA on the spot.",
          "score": 0
        },
        {
          "text": "Oh no …. the older Mat Rockers and Lao AhBengs might qualify…. Old, bad eyesight , slow reflexes with a fucking attitude even worse",
          "score": 0
        },
        {
          "text": "Do step up on the enforcements also please. Every shopping mall and MRT station, neighbourhood shops all at least 2 full time enforcers daily. Deploy full time NSF police if need be. Situation is really getting out of hand.",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qud336",
      "subreddit": "singapore",
      "title": "Rare Malayan tapir spotted in Defu; NParks advises public not to go near or feed animal",
      "url": "https://old.reddit.com/r/singapore/comments/1qud336/rare_malayan_tapir_spotted_in_defu_nparks_advises/",
      "score": 319,
      "num_comments": 48,
      "created_at": "2026-02-03T00:36:05",
      "selftext": "",
      "comments": [
        {
          "text": "Aaaand that's how you get two dozen retirees with camera lenses taller than them descending into Defu Industrial Estate.",
          "score": 142
        },
        {
          "text": "Please leave them alone. Crowding or chasing to take photo of them will increase their stress",
          "score": 112
        },
        {
          "text": "konbakuwa",
          "score": 61
        },
        {
          "text": "There are people of all ages doing that too, including young people.",
          "score": 52
        },
        {
          "text": "Swam across the Johor straits!? Wow",
          "score": 33
        },
        {
          "text": "Even the animals are emigrating from Msia to Spore.",
          "score": 28
        },
        {
          "text": "Uuuuuuu",
          "score": 26
        },
        {
          "text": "Could that be the same Tapir that ran across the Park Connector a few years back that was caught on someone's GoPro early in the morning?",
          "score": 23
        },
        {
          "text": "I can alry hear the machine gun shutters from here",
          "score": 16
        },
        {
          "text": "Acres please save it",
          "score": 15
        },
        {
          "text": "young people usually don’t have money for the big camera /s",
          "score": 14
        },
        {
          "text": "crowding or chasing any species of Bear (except Teddy) , I would love to see you get out of this act alive....",
          "score": 13
        },
        {
          "text": "No need /s, these guys setups are like more than half my annual salary",
          "score": 13
        },
        {
          "text": "The unemployed maybe, but majority would be too busy working",
          "score": 12
        },
        {
          "text": "Well, here's hoping no one FAFOs - a pissed off, full grown Malayan Tapir is more than capable of tearing off a grown adult's arm",
          "score": 12
        },
        {
          "text": "Didn't expect this in my local sub",
          "score": 11
        },
        {
          "text": "Elite ball knowledge",
          "score": 8
        },
        {
          "text": "How is a measurement of area going to help a tapir?",
          "score": 4
        },
        {
          "text": "Acres is the wildlife rehab organisation",
          "score": 4
        },
        {
          "text": "Can you tell my boss that",
          "score": 1
        },
        {
          "text": "Actually not that pricey if you know what you want to get. Can also get second hand. Setup can be anywhere from <1k to insane crazy 20k those kind. Of course the low value setup got some setbacks and disadvantages to contend with.",
          "score": 1
        },
        {
          "text": "This always sounds like Kon Bah Kwa to me",
          "score": 1
        },
        {
          "text": "Lol",
          "score": 1
        },
        {
          "text": "Lel",
          "score": 1
        },
        {
          "text": "I know. After I googled it earlier.",
          "score": -8
        }
      ]
    },
    {
      "id": "t3_1quehym",
      "subreddit": "singapore",
      "title": "With just 48 hours, Singapore game developers made social anxiety in video game form",
      "url": "https://old.reddit.com/r/singapore/comments/1quehym/with_just_48_hours_singapore_game_developers_made/",
      "score": 283,
      "num_comments": 10,
      "created_at": "2026-02-03T01:37:14",
      "selftext": "",
      "comments": [
        {
          "text": "Not so often you get to hear a Singaporean indie game devs making a quick little game for Game Jam. Making a game within 48 hours with a few resource and time constraint is a tough challenge",
          "score": 178
        },
        {
          "text": "For anyone that's interested, another good indie Singaporean game that I'd recommend checking out isAfter School Afterlife It's an exploration game where you play a primary schoolgirl studying for the PSLEs. On the way home, your mock exam gets stolen by a ghostly rabbit and you end up trapped in a haunted house. Sounds a bit like Alice in Wonderland meets Spirited Away, but set in Singapore? It's heavily inspired by Peranakan culture, with very gorgeous art and music.",
          "score": 83
        },
        {
          "text": "Hi! I'm an artist from the game featured in the article, \"i need more friends in my stupid baka life\", you can check out our game here! https://plasmak.itch.io/i-need-more-friends",
          "score": 69
        },
        {
          "text": "There have been local game jam sites for years… people have been doing game jams in groups on-site since at least 2017. Probably even earlier than that",
          "score": 40
        },
        {
          "text": "Sorry i prefer Skull and Bones. Afterall it is an AAAA game ok?! /s",
          "score": 8
        },
        {
          "text": "It’s been a thing for a long time. I even got called to be a guest judge once by a friend haha. I appreciate the new gen of devs, all very creative.",
          "score": 4
        },
        {
          "text": "what a cool concept, can't wait to download and try the game",
          "score": 4
        },
        {
          "text": "Coool!!\nHow long has this been out",
          "score": 2
        },
        {
          "text": "Actually it is a legit question, but I understand why it got downvoted. To be honest, Unreal / Godot has not yet a good integration with LLM within the IDE so you cannot really ask it to build everything directly, but LLM definitely help for debugging etc... AI is also way faster at generating arts, sprites and animations but it can be sloppy sometimes and in general, the indie developers are against it (because it replaces real designers and game artists.)",
          "score": 1
        },
        {
          "text": "Is it faster now with AI or still about the same? For web development it's a lot faster",
          "score": -9
        }
      ]
    },
    {
      "id": "t3_1quh2nu",
      "subreddit": "singapore",
      "title": "S'pore to import Jeju black pork & Hanwoo beef from South Korea",
      "url": "https://old.reddit.com/r/singapore/comments/1quh2nu/spore_to_import_jeju_black_pork_hanwoo_beef_from/",
      "score": 237,
      "num_comments": 31,
      "created_at": "2026-02-03T03:31:03",
      "selftext": "",
      "comments": [
        {
          "text": "More exotic meats for CNY hotpot!",
          "score": 88
        },
        {
          "text": "Its already been in singapore for a month or so now, not sure why there was an \"official\" launch a day or two ago and now this news from Min Fu. The price is like $33/100g for hanwoo though. Cannot afford lol.",
          "score": 56
        },
        {
          "text": "Texture wise its more tender. There’s much lesser gamey/ smelly pork smell compared to msia pork. Black pork u can just cook/grill on its own and its flavorful. Msia pork needs a bit of seasoning to get rid of the gamey smell.",
          "score": 21
        },
        {
          "text": "\"Boiling more healthier\" - my mum and a dozen other relatives",
          "score": 20
        },
        {
          "text": "Madness. Who are you to judge what's a good way to eat wagyu beef?? The japanese themselves use quality cuts of wagyu beef in hotpot, soups and ramen. I like steaks and marbled beef with hotpot equally.",
          "score": 20
        },
        {
          "text": "More expensive as well",
          "score": 19
        },
        {
          "text": "Boils in salted water filled with heavy spices and a thick layer of red oil on top",
          "score": 17
        },
        {
          "text": "I didn't know south Korea was willing to export Hanwoo. I thought they kept it for domestic consumption only",
          "score": 16
        },
        {
          "text": "Once a year!",
          "score": 15
        },
        {
          "text": "this has been old news for like a month or two alr",
          "score": 14
        },
        {
          "text": "Why not? Incredible marbling, rendered by a few seconds dipped in a hotpot Sounds amazing, in a light soup base to bring out the meaty flavours. Agree that it's wasted if you blast it in mala soup or whatnot Expensive but sometimes you just gotta treat yourself",
          "score": 13
        },
        {
          "text": "Why the hell would you waste supposedly good meat in a hotpot",
          "score": 12
        },
        {
          "text": "Some of it is diplomacy I guess. they don't export it to just anywhere",
          "score": 12
        },
        {
          "text": "More expensive than wagyu",
          "score": 11
        },
        {
          "text": "i can't taste the difference between jeju black pork and regular pork tbh, except maybe slightly fattier",
          "score": 11
        },
        {
          "text": "i tried once, i would rate it around a4 wagyu so not very surprised with the price point",
          "score": 10
        },
        {
          "text": "Will try the Jeju Black Pork but I’m not expecting it to beat iberico pork.",
          "score": 6
        },
        {
          "text": "That's what Japanese do in sukiyaki nabe.",
          "score": 5
        },
        {
          "text": "I tried frozen of both versions so shldnt be freshness issue. (Not the korean black pork but still black pork). The msia one really cannot. The smelly pork taste was so obvious and hard to cover over. The iberico black pork cook without using any seasoning and its good.",
          "score": 5
        },
        {
          "text": "You mean you don't want atas hotpot?",
          "score": 4
        },
        {
          "text": "wtf",
          "score": 3
        },
        {
          "text": "Some of it might be due to freshness. Just like Spanish mackerel which taste so good in jeju",
          "score": 3
        },
        {
          "text": "Only if you choose the unhealthy stock.",
          "score": 2
        },
        {
          "text": "Can confirm that",
          "score": 1
        },
        {
          "text": "you might have eaten Australia pork instead. that one is really stinky!",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qtu7mg",
      "subreddit": "singapore",
      "title": "AIA sues former insurance agent Lin Qiren for S$8.45 million linked to sales shortfall",
      "url": "https://old.reddit.com/r/singapore/comments/1qtu7mg/aia_sues_former_insurance_agent_lin_qiren_for/",
      "score": 200,
      "num_comments": 59,
      "created_at": "2026-02-02T12:52:18",
      "selftext": "",
      "comments": [
        {
          "text": "Tampines and Jurong, as well as Woodlands and Jurong. Served him right. He shouldn't have occupied Jurong twice 🥱",
          "score": 123
        },
        {
          "text": "Yes, lots of ads and office space offering lifestyle related stuff which does seem unsustainable given everything in life insurance is largely financed by commissions from cash-value plans/ILPs. Might be a bad thing to say but nice to see this implode in such fashion.",
          "score": 70
        },
        {
          "text": "Isn't this Qiren quite famous in the insurance industry?",
          "score": 67
        },
        {
          "text": "Hope they rekt each other. Insurance agent vs insurance agent",
          "score": 63
        },
        {
          "text": "Qiren closed?!?! Oh no. How are those bouncy castle rental business can survive without it?",
          "score": 57
        },
        {
          "text": "I dislike Qiren but this AIA also very greedy. They get a lot of business from the organisation but still want to squeeze them out even more",
          "score": 50
        },
        {
          "text": "Then don’t sign contract that requires compensation for not meeting sales targets. Nobody ask him to sign contract. He wanted the office space to brag how big his operation is.",
          "score": 35
        },
        {
          "text": "I recall bringing my kid to an Alice in Wonderland theatre production at the AIA Qiren office in Tampines years ago. I fully expected AIA representatives to hard-sell me some insurance products or something... but to my pleasant surprise, there was no mention of AIA whatsoever. Edit to add: yup, it was in 2017. https://tickikids.com/sg/blog/4176-alice-in-wonderland-immersive-theatrical-experience-for-kids/",
          "score": 35
        },
        {
          "text": ":O Is that why the AIA road shows and funfairs seem to have all disappeared???",
          "score": 20
        },
        {
          "text": "The Tampines and Jurong DASEC involved office premises at Asia Green in Tampines and at Vision Exchange in Jurong, while the Woodlands and Jurong DASEC concerned premises at Woodlands Square and Vision Exchange. I legit cannot tell whether they are two separate places in Jurong, or the writer somehow lists the same place twice numerous times",
          "score": 16
        },
        {
          "text": "Under two agreements, AIA granted Mr Lin licences to occupy AIA-leased office premises in Tampines and Jurong, as well as Woodlands and Jurong. In return, Mr Lin was required to achieve commission targets through the sale of insurance and financial products to validate his occupation of the space. Mr Lin failed to meet the required targets for the Tampines premises, recording a commission shortfall of millions. As a result, Mr Lin was purportedly obliged to pay AIA nearly S$2.49 million. Whoa, stress max sia. Imagine working in a job where the penalty for underperformance is to compensate your employer for office space",
          "score": 13
        },
        {
          "text": "?? Qiren basically traded rent with AIA for sales. AIA is just claiming back the rent because Qiren failed his end of the consideration.",
          "score": 13
        },
        {
          "text": "According to the guy’s LinkedIn, he stopped in July 2022. I think covid really battered them/the biz model.",
          "score": 10
        },
        {
          "text": "Insurance corporation vs. Insurance agent (whom is an insurance corporation wannabe) Whomever Lose. We Win.",
          "score": 9
        },
        {
          "text": "Jurong east and Jurong west😂",
          "score": 8
        },
        {
          "text": "I do not recall any kind of follow up of any sort. I was kinda expecting to be herded into a seminar room to watch the 'joy' of insurance with the other parents while the kids watched the show. That didn't happen.",
          "score": 7
        },
        {
          "text": "Wah this guy can go from “Financial Services Director” to a mere “Associate” in his next role… Insurance really just be giving made up titles.",
          "score": 6
        },
        {
          "text": "I’m curious: did they ever follow up? If not, then spending OPEX freely is a dumbfuck biz model.",
          "score": 5
        },
        {
          "text": "No wonder my brain shut down trying to understand it.",
          "score": 4
        },
        {
          "text": "ah no wonder those type of tradeshows are no longer there especially after covid. So its helmed by QR.",
          "score": 1
        },
        {
          "text": "insurance agents by any other names..do we see auch fanciful titles jump in other industry?",
          "score": 1
        },
        {
          "text": "So I've had some insurance agents try to recruit me before. They bragged about how you can become a director once you hit a certain sales amount. That's all you need to do to become a director. So I asked one of them back, so your office is all full of directors ah? She said yes like it's a good thing. Didn't get it lmaoooo",
          "score": 1
        },
        {
          "text": "In fairness, I guess the ranks are a recognition of past sales performance. My quip was that those skills are so non-transferrable, that Qiren had to accept an entry-level role.",
          "score": 1
        },
        {
          "text": "\"Corporate needs you to find extra cash for this quarter\"",
          "score": -7
        }
      ]
    },
    {
      "id": "t3_1qug9j7",
      "subreddit": "singapore",
      "title": "Pritam Singh moved to new seat in Parliament after removal as Leader of the Opposition",
      "url": "https://old.reddit.com/r/singapore/comments/1qug9j7/pritam_singh_moved_to_new_seat_in_parliament/",
      "score": 143,
      "num_comments": 85,
      "created_at": "2026-02-03T02:54:24",
      "selftext": "",
      "comments": [
        {
          "text": "This ST article could have been an email",
          "score": 339
        },
        {
          "text": "These fuckers playing with seats when cost of living is killing us",
          "score": 193
        },
        {
          "text": "Breaking news sia",
          "score": 125
        },
        {
          "text": "I don’t care where he sits. As a majority in Parliament, please fix the cost of housing, the lack of jobs, the influx of “foreign talents”, and our breakdown-prone public transport. Even if Pritam Singh sat on the Speaker’s lap, it’s still not my number one concern. With so few WP MPs in Parliament, they don’t hold the levers of power. So stop spending my hard earned tax money on political theatre and fix out country’s problems, and not the Opposition.",
          "score": 121
        },
        {
          "text": "The last time someone sat on the Speaker's lap, both individuals resigned. Still not our number one concern.",
          "score": 116
        },
        {
          "text": "Man who used to sit in one chair now sits in another chair : read all about it",
          "score": 83
        },
        {
          "text": "I would still junk it",
          "score": 69
        },
        {
          "text": "if LW had not change the seating arrangement immediately, investors will pack bags and leave. praise pap!",
          "score": 56
        },
        {
          "text": "Me when I transfer from the EW line to NS line.",
          "score": 29
        },
        {
          "text": "Exactly. And you know what’s the worse part? The Indranee feel the whole fuss she kicked up is so groundbreakingly important.",
          "score": 23
        },
        {
          "text": "Yea. Fixing opposition more important. But dealing with job loss concerns, job security concerns, country downsizing concerns, off shoring concerns. They just very silent and just use “AI” as an answer to everything when forced to comment.",
          "score": 23
        },
        {
          "text": "best part it wasn't the first speaker who resigned",
          "score": 22
        },
        {
          "text": "Workers’ Party chief Pritam Singh will no longer sit directly opposite Prime Minister Lawrence Wong in Parliament It is aprivilegeto sit opposite to the Prime Minister okay?! /s",
          "score": 15
        },
        {
          "text": "He probably just doesn't want Pritam to stare at him.",
          "score": 14
        },
        {
          "text": "Still need their physical copies for my pet's pee pee.",
          "score": 11
        },
        {
          "text": "Humji Wong.",
          "score": 11
        },
        {
          "text": "It’s always like this. But back then (think prior to 2000), they do take care of the people. Now? I’m sure we are no longer their number one priority. Maybe number 3.",
          "score": 9
        },
        {
          "text": "That person sat on the Speaker's lap for 3 years. But that's none of my business.",
          "score": 7
        },
        {
          "text": "😂",
          "score": 5
        },
        {
          "text": "Appraisal grade A",
          "score": 4
        },
        {
          "text": "Nah it’s just more visible now With social media being a bit more neutral (vs. 159 state media), harder for PAP to pretend Liao",
          "score": 4
        },
        {
          "text": "Is it just me or did politics in sg govt get way more dirty with the new leadership?",
          "score": 3
        },
        {
          "text": "Wrong. You when you shift from one row of seats to opposite row because of morning sun",
          "score": 2
        },
        {
          "text": "Could’ve been a tweet",
          "score": 1
        },
        {
          "text": "I appreciate the point but I think no one (least of all the speaker and PS) would appreciate PS sitting in the speaker’s lap. 😝",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1quh5ua",
      "subreddit": "singapore",
      "title": "LumiHealth programme to end on May 31 after six years",
      "url": "https://old.reddit.com/r/singapore/comments/1quh5ua/lumihealth_programme_to_end_on_may_31_after_six/",
      "score": 98,
      "num_comments": 34,
      "created_at": "2026-02-03T03:35:14",
      "selftext": "",
      "comments": [
        {
          "text": "It was good while it last 😢 despite the complains about the nerf, the interface is much better than healthy365",
          "score": 71
        },
        {
          "text": "There goes my free vouchers 🥲 it was so fun to hit everything every week",
          "score": 56
        },
        {
          "text": "They revised it recently and I’ve been earning $4 a week so not bad. Overall earned $340 🫶🏼",
          "score": 21
        },
        {
          "text": "Was getting so much money from this. One good thing I felt that kept me active 😭",
          "score": 17
        },
        {
          "text": "It was good before they reduced the rewards",
          "score": 15
        },
        {
          "text": "Wonder how much LumiHealth with the 2 revamp. The good news you can double dip both program till end may.",
          "score": 14
        },
        {
          "text": "I wonder why they had to shut down the entire program. So much effort done to develop it over the years, and just to shut it down so abruptly? If it were a matter of not having the budget to sustain the rewards, I would rather they lower the rewards but continue with the program. It was really fun and motivating to complete the various quests, and I would say they are pretty creative about it.",
          "score": 12
        },
        {
          "text": "Not really, like if you clock your steps and sleep it takes a long time to get points. MVPA is the way to go, but low-key annoyed on sat my jog got registered but my jog yesterday didn't.",
          "score": 9
        },
        {
          "text": "a lot. ad agency takes a pie.apple takes a pie.cash prizes take a pie.app developer takes a pie. civil servants, contract or not, has been roped in too.",
          "score": 8
        },
        {
          "text": "Noooo whyyyy",
          "score": 7
        },
        {
          "text": "I think they slowly killed themselves, it was fun to use during the first version, then they slowly made it harder and laggier.\nFinally introduced points expiry which ultimately made ad hoc users quit and delete the app as they have no reason to continue as they can’t earn enough points to redeem anything",
          "score": 7
        },
        {
          "text": "Naooooooo",
          "score": 6
        },
        {
          "text": "No need, can still use Apple Watch with 365",
          "score": 5
        },
        {
          "text": "Been a LumiHealth user since last year … Healthy365 that good ?",
          "score": 4
        },
        {
          "text": "waa that very sad I need the voucher",
          "score": 4
        },
        {
          "text": "I remember seeing somewhere in the app saying it only counts if the increased HR is more than 10(or 20?) minutes but not sure where to see it now. Could that be the issue?",
          "score": 2
        },
        {
          "text": "No leh my jog alone was 12 mins, but oh well maybe wear tighter next time",
          "score": 2
        },
        {
          "text": "6 years, but feels like it has been through many changes and wasn’t it just revamped not too long ago? The first version was the best with no weekly caps and interesting backgrounds referencing other countries. Then I recall the awards got nerfed to like $1 a week and I quitted the app.",
          "score": 2
        },
        {
          "text": "They upped it to $4 a week last year",
          "score": 2
        },
        {
          "text": "The LumiHealth app uses iPhone and Apple Watch capabilities, such as heart rate, activity and sleep tracking to progressively build physical activity levels and improve mental wellness and sleep hygiene. How about 365? Does it work with Apple Watch? Or I must get their free steps tracker which is perpetually out of stock at their machines?",
          "score": 2
        },
        {
          "text": "Yeah most likely there's not enough active users to justify the upkeep of the app itself.",
          "score": 1
        },
        {
          "text": "They revamped some time last year. Very easy to earn $4 a week",
          "score": 1
        },
        {
          "text": "Depends on the user Some demographics easier",
          "score": 1
        },
        {
          "text": "Must you track the sleep to get points? Cos I don’t want to wear my watch when sleeping. Very annoying",
          "score": 0
        },
        {
          "text": "Sadly yes, hmm I would say you get used to it tbh",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1quhdc4",
      "subreddit": "singapore",
      "title": "RSAF upgrades C-130s and other air force hardware",
      "url": "https://old.reddit.com/r/singapore/comments/1quhdc4/rsaf_upgrades_c130s_and_other_air_force_hardware/",
      "score": 80,
      "num_comments": 52,
      "created_at": "2026-02-03T03:45:02",
      "selftext": "The “new” C-130Hs are reportedly ex-Spanish ones which arrived in late Jan, according to various online sources.\n\nhttps://breakingdefense.com/2026/02/singapore-acquires-used-legacy-c-130hs-to-replace-even-older-c-130s/",
      "comments": [
        {
          "text": "we don't this is a prudent move. we just need to be better than our neighbors and upgrades need to be inline with our other capabilities and doctrines no point pay premium for the latest n greatest",
          "score": 52
        },
        {
          "text": "but why do we need brand new cargo planes?",
          "score": 25
        },
        {
          "text": "so we upgrade to the 10 years ago c130 pro max while the ang moh buy new one ?",
          "score": 23
        },
        {
          "text": "I remember boarding a C-130B model at PLAB during my first year in NS.",
          "score": 22
        },
        {
          "text": "Production line tutup lo. Fly where. Fly what Got mrtt for everything else unless U suddenly need to lift a 70 ton MBT somewhere in a hurry",
          "score": 16
        },
        {
          "text": "Wen C17 Globemaster III",
          "score": 11
        },
        {
          "text": "Yup. 4 C130s from Spain. First one arrived on 11 Dec 2025 https://alert5.com/2026/02/03/rsaf-acquiring-4-ex-spanish-c-130s/",
          "score": 10
        },
        {
          "text": "The actual reason they stick to the same model is because changing it will render that army song useless.",
          "score": 9
        },
        {
          "text": "*ONE* MBT. lol. Not sure if that is even worthwhile.",
          "score": 8
        },
        {
          "text": "IIRC, in 2007 ST Aerospace re-winged the Bs and brought the whole Hercules fleet to a common standard. The cockpit avionics was changed to Collins Flight2™ system ATM/CNS glass cockpit. Guess the C-130B fuselages must be clocking close to EOL hours. Now restricted to local and short leg flights only. But still ready for one last burst if things hot up. The Spanish C-130Hs(if not wrong, one of them is the longer -30 variant) is a good strategy to buy time cheap. In effect SAF airborne transport capacity up ~50%, Don't know if the cockpit will be upgraded or not. I would like to read this move as waiting for the KC-390 Millenium(cheaper than a new C-130J?) to mature and hopefully it lives up to their expectations. Next RSAF might be interested I think if C-27J are available to fully replace Fokker 50s.",
          "score": 8
        },
        {
          "text": "somebody makan the new plane depreciation and we get a good deal here. Just like 2nd hand cars prices.",
          "score": 5
        },
        {
          "text": "In terms of tactical transport planes the C130 really has no equal, most of our neighbours are running the “H” models too. Indo and MY run the A400m but it’s not a direct competitor to the C130 anyways and they’re both larger countries that would have more use cases for a larger transport plane. For a small country like us the C130H model is good enough since our C130s are mostly used for humanitarian and commando/SF paradrop, I know there was some speculation that RSAF would buy the C390 especially when Embraer set up shop here but the C390 is a jet-engines aircraft so doesn’t have the STOL and ability to land in rugged terrain like the C130 can, plus the production line is filled for years with multiple European customers.",
          "score": 3
        },
        {
          "text": "Here are the key technical and operational differences between the RSAF'sC-130BandC-130Hbroken down into points: Source: Google Gemini",
          "score": 3
        },
        {
          "text": "Bruh our Fokker 50 MPAs are being replaced with the Poseidon P8… https://www.asianmilitaryreview.com/2025/09/p-8a-acquisition-to-enhance-singapores-maritime-domain-awareness-foc/",
          "score": 3
        },
        {
          "text": "Is it commandos or what did you board it for?",
          "score": 1
        },
        {
          "text": "No, I was in the Air Force. Visited 122 SQN (the ones who operate C-130s) as part of my NS Milestone.",
          "score": 1
        },
        {
          "text": "Laughs in usaf c17 airbridge",
          "score": 1
        },
        {
          "text": "But there's no replacement for the F50 UTA yet.",
          "score": 1
        },
        {
          "text": "Don’t really see a need for the RSAF to have another transport plane though, we’re such a small country anyways plus with manpower shortages in the SAF we’d be stretching resources to support and maintain another aircraft in the fleet.",
          "score": 1
        },
        {
          "text": "The UPA fills a different need than the Charlie.  But yes, manpower needs will ultimately prevail.",
          "score": 1
        },
        {
          "text": "F50 UTA is similar to earlier Shorts Skyvan - whichSTOLperformance is see to believe. RSAF indeed has great experiences with so many platforms for such a small organisation it's just a privilege to watch and hear them fly. EDIT: Of course today you have CH-53K and CH-47F. Think C-27J will have a niche.",
          "score": 1
        },
        {
          "text": "The part about them being from Spain comes from here? https://www.airhistory.net/photo/726467/TL10-01",
          "score": 1
        },
        {
          "text": "A400m rolling down the street... Yea doesnt roll off the tongue well",
          "score": 0
        },
        {
          "text": "I sat it once coming back from Kachananburi as part of the \"cargo\" since they needed umpires for one of the units doing ATEC there. Most comfortable plane ride I ever had. They had those orange cargo netting that you can sit in instead of seats and it was so damn comfortable, like a hammock and since it wasn't really a passenger flight, we had so much space to ourselves. You really have to experience it to believe it. On the way there though, we ended up taking a Fokker 50, I suspect because we were such a small numbered odd group that they ended up throwing us on whatever transport that happened to be going in that direction.",
          "score": 0
        },
        {
          "text": "*US President cries seeing the bill* lol.",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1quhc7l",
      "subreddit": "singapore",
      "title": "About 650 cyclists issued summonses for violating traffic rules in last 6 months of 2025",
      "url": "https://old.reddit.com/r/singapore/comments/1quhc7l/about_650_cyclists_issued_summonses_for_violating/",
      "score": 72,
      "num_comments": 43,
      "created_at": "2026-02-03T03:43:28",
      "selftext": "",
      "comments": [
        {
          "text": "i still see pmd/pma riders driving their families of 3/4 to supermarket",
          "score": 55
        },
        {
          "text": "Too little, but it's a good start. Enforcement needs to continue.",
          "score": 15
        },
        {
          "text": "Can't help but notice that almost all of the comments are about cyclists using pedestrian walkways. Yet reading the article the enforcement was focused on cyclists on the roads. This will just force more cyclists onto the footpaths, which will results in more of the issues that commenters are complaining about. Cyclists and pedestrians are simply incompatible and many other countries have worked out that the solution is to require cyclists to use bike lanes (which are separated from pedestrian paths) or ride on the road. The LTA continues to half-ass its bike paths and ignore the lessons around bike lanes on roads that other countries have worked out. Yet it pretends it has a 'car-lite vision'. Before anyone pretends that 'land scarcity' is the issue, a) Singapore is densely populated but so are cities like New York or Amsterdam and they can work out how to build a bike lane, and b) why does that logic never apply to roads, which are often 8 lanes wide? If they work out how to put bike lanes into ancient European cities that are insanely dense and thousands of years old, the LTA could find a spare metre or two in the CBD.",
          "score": 11
        },
        {
          "text": "That one not road, so LTA don't bother",
          "score": 10
        },
        {
          "text": "They are too used to not being fined.",
          "score": 8
        },
        {
          "text": "LTA has to realize that outside of the CBD, there are areas where public transport is sorely lacking. I live in the west and it’s seriously bad. I ride my e-bike on the roads (seriously hugging the shoulder) because I know how annoying it is to encounter one on the pavement as a pedestrian. But not everybody is willing to make that choice, and understandably so. Why do I do this? Door to door my commute is 30minutes by bus but only 15minutes by bike. No options for MRT. Distance wise it’s only a short 5km. I know people that can run 5K faster than taking the bus can get me to my destination. We are already the most sleep deprived nation in the world by some metrics, so an extra 15min is a godsend. Thats just the commute too. Having a bike gives so much freedom of movement. My life circle, where I can go places in a reasonable amount of time, isn’t confined to my neighborhood anymore. Suddenly, I can eat at more places and try new food; I have more flexibility to meet my old friends who stay 15km away; I can go out any time without worrying about someone else’s (the bus’) schedule; I don’t have to worry about getting an old bus that I can’t sit in the back half of because the ceilings are sloped down (I’m tall); etc. The usual arguments for owning a car basically, but scaled way down. Huge QOL improvement for money spent honestly. So yeah. The gov can wax lyrical about their world class transportation all they want. But from my perspective, it only applies to the southern/eastern part of the country - I didn’t study there, I don’t work there, and outside of novelty things that I do every now and again, I have no reason to go there. This country is not big, it’s only the size of a lake in other countries, we can do a better job with transportation dollars and resources than this.",
          "score": 7
        },
        {
          "text": "sometimes hor.. ring bell also salah. don't ring also salah. on sunday i rode along gbtb east. tried not to ring bell, but cos of my hub, most of the time pedestrians can hear and give way. except for this group of 4 elderly uncles. walked 4 abreast, across the bike pathway (gbtb east has two pathways, one for pedestrians and the other \"shared\"). my bike went zzzzzzzzzzz until i was right behind one uncle who just didn't wanna move, then i rang my bell. got a damn dirty look in return. really no winning.",
          "score": 7
        },
        {
          "text": "Glad to see some cyclists aren't getting away with their violations!! ",
          "score": 6
        },
        {
          "text": "I have neighbours who owned 3 monster truck PMD/PMA, parking at the corridor. The people who drives these are in their 20s.. lol. I recall that PAP is going to issue regulation about these PMA/PMD in 2026, wonder if there are any news about it",
          "score": 4
        },
        {
          "text": "As a pedestrian, I am really fed up encountering cyclists who think they own the paths or walkways.",
          "score": 4
        },
        {
          "text": "I don't understand how our \"bike paths\" have the LOWEST priority for cyclists. They must give way to pedestrians and vehicles at junctions. Pedestrians don't try to use the roads but they sure use bike paths all the time. Most frustrating experience ever as someone cycling for 20 years. It might have been more dangerous but a better commuting experience when bicycles were banned on pavements and bicycles were supposed to be on the road.",
          "score": 3
        },
        {
          "text": "Recently in my area they cut through a hill and made a mini tunnel for cars, but the pedestrian path was on top of the tunnel and exposed to the elements, and to get off the other side you had to take a long convoluted path that increases the distance to the traffic junctions. \nSo people had to climb up a hill and take the stairs down on the other side, or walk down a long slope as the exits were perpendicular to the pathway. Why not just build out another section for non motorised traffic? And that incline exists like why? \nThey bore out the hill to fit the car tunnel right? So it can't be technical limitations, just priority. Makes me wonder what the north south corridor would be like Maximum convenience for cars, scraps for the rest.",
          "score": 3
        },
        {
          "text": "JMeanwhile, every other night YP and Grab delivery PMDs continue to blast their music as they ride by my block even past midnight.",
          "score": 3
        },
        {
          "text": "Same here, I commute by bicycle to and fro work. Really dunno when to ring. Sometimes you ring but they get annoyed, you don't ring they say why never ring. Nb... Also have my fair share of people walking on their right and panicking dunno which side to go when I slowly coast towards them keeping to the left. You never take license also know traffic flows on the left mah... Also, don't get me started on people who walk on bicycle lane. Like bruh there's a pedestrians only path next to it, why die die want to walk on path meant for bicycles, then get pissy when I call them out?",
          "score": 3
        },
        {
          "text": "Jeffrey is busy hiding behind his secondary finance ministry portfolio instead of solving real transportation issues.",
          "score": 2
        },
        {
          "text": "https://mothership.sg/2026/02/speed-limit-for-pmas-in-spore-to-be-set-at-6km-h-from-jun-1-matches-brisk-walking-pace/ Yes, actually. Go ahead and be prepared to report them.",
          "score": 2
        },
        {
          "text": "All the closeted carbrains, not come in yet?",
          "score": 2
        },
        {
          "text": "I was tempted to kick one of them when they rode in a convoy pattern without ringing the bell, on the walkway at Joo chia road there.",
          "score": 2
        },
        {
          "text": "Im sorry to hear about your uncle. I hope he is doing ok. The cyclist should have had more situational awareness about his visibility. I’m not saying cyclists are blameless no matter what. I’m saying we all have a part to play in being safe road/walkway users.",
          "score": 2
        },
        {
          "text": "Based on the news, it seems that you MUST have Certificate of Medical Need to drive PMD/PMA and I doubt that the entire family has it. What would you do if a neighbour who stays in the same floor as you, park multiple PMA/PMD outside your flat.. and they stayed a few houses away from where they park.. I think they might be afraid it might catch fire so being away from the PMA/PMD is the safest thing they do...",
          "score": 1
        },
        {
          "text": "Take photo, inform the authorities, say that you're concerned that these are not up to safety standards and are thus a potential fire hazard. Since it's right outside your house you have every reason to be concerned.",
          "score": 1
        },
        {
          "text": "They’re untouchable coz need their votes",
          "score": 1
        },
        {
          "text": "as someone commuting by bicycle, i see more people stepping on the grass patch more as a protest than actually being practically needed. even when the pavement is wide enough for 2 pedestrians to walk side by side as long as they move in a little. Or even temporarily walking single or 1.5 file. Doesn't matter even if i stop, slow down to a walking pace or whatever. And many people these days walk in the middle and not stick to the sides. As long a cyclist exists on the pavement, some people will just outright feel violated to be in the same space.",
          "score": 1
        },
        {
          "text": "My uncle got knocked down by a oncoming cyclist who rode into him with the sun setting behind the cyclist, blinding us. I only saw the cyclist image and when I told my uncle to move and give way to the cyclist, it was too late.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1quks9p",
      "subreddit": "askSingapore",
      "title": "Any idea why is Novena forever under construction?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1quks9p/any_idea_why_is_novena_forever_under_construction/",
      "score": 212,
      "num_comments": 58,
      "created_at": "2026-02-03T06:41:49",
      "selftext": "Just curious , I long long come one time like it has been under construction since decade ago",
      "comments": [
        {
          "text": "Yio chu kang\nBugis Those areas also since forever construction",
          "score": 184
        },
        {
          "text": "I had my kids at Thomson medical center. 2 kids + primary school age alr - the construction still there when I drove by recently lol",
          "score": 168
        },
        {
          "text": "I work there. TBH it is one of the fastest contract amongst North South Corridor project.. It will only finish somewhere around end 2028 than reinstatement may start.. Sorry for this.. but it will be worth the wait. Edit: If you have any complaints of noise , dust, traffic due to trucks, let the contractor Public relations know. They are quite sensitive and taking action quickly. If cant get a result, you can PM me here, I will try to help .",
          "score": 85
        },
        {
          "text": "the area outside Sim Lim Square also since been under some construction for nearly 6/7 yrs.",
          "score": 75
        },
        {
          "text": "North south corridor. Being surrounded by high rise buildings, they probably have to tunnel deeper, so they need to prepare the land and reroute any underground services first. Then do the prep and tunneling. Same like yio chu kang where they had to relay new roads at the empty patches of land which itself was a huge construction behind yck mrt first before starting on the actual ns highway construction",
          "score": 64
        },
        {
          "text": "Bugis is the end of the “South” of the North-South corridor. Also, Shaw Tower and Guoco Midtown construction.",
          "score": 55
        },
        {
          "text": "Rumor has it Novena was already under construction when Sir Stamford Raffles landed.",
          "score": 55
        },
        {
          "text": "Sir I have been living at buona vista for the past 20 years and it’s always been under construction. Roads, churches, flats, idk",
          "score": 32
        },
        {
          "text": "first was for the downtown line then now is the north south corridor",
          "score": 23
        },
        {
          "text": "nah the extent at BV is nowhere near as bad as Novena or Bugis, those are like perpetual construction that impacts traffic and all, especially when it's already quite dense. BV for the longest time still had a quite a few empty plots of land that was literally just grass",
          "score": 22
        },
        {
          "text": "Junction of Serangoon Road / Selegie Road / Bukit Timah Road has been under construction since the 90s - Refurbishment of the Rochor Canal then North East Line then Downtown Line and now this North South Corridor. God knows what's next they'll do to that junction.",
          "score": 16
        },
        {
          "text": "When I stayed there in 2017, there wasn’t construction, not too bad la 😅🙈",
          "score": 14
        },
        {
          "text": "Nah… since before Sang Nila Utama saw the lion.",
          "score": 11
        },
        {
          "text": "If you dig deep enough, you can still find the bones and tools of the dinosaurs that first worked on Novena.",
          "score": 8
        },
        {
          "text": "Tunneling works",
          "score": 7
        },
        {
          "text": "True to your username",
          "score": 5
        },
        {
          "text": "Marymount has been in construction for over 20yrs.",
          "score": 5
        },
        {
          "text": "Bukit Timah - Rochor Green Corridorsays hi",
          "score": 4
        },
        {
          "text": "🙌🏿🙌🏿🙌🏿",
          "score": 2
        },
        {
          "text": "is marymount part of north south coridoor?",
          "score": 2
        },
        {
          "text": "Why need to be arrogant? Is it because youre behind screen? I and my team trying their best to give something special to you Singaporeans.. Don't behave like that.. Not nice..",
          "score": 0
        },
        {
          "text": "Um... I meant you're true to your username of being nice. Don't read too much into it. Have a nice evening",
          "score": 0
        },
        {
          "text": "If i may add … it is a technical engineering marvel, given how tight and congested the place is. If the ground sinks by more than 5-10cm due to say, boring a hole too quickly, buildings above are at risk of collapsing. So they have to go REALLY SLOWLY. Then again every time i go to that area i am lost because it looks so different.",
          "score": 0
        },
        {
          "text": "Since before the lion was a tiger and haven’t grow his mane.",
          "score": 0
        },
        {
          "text": "Hope by then humans wont get wiped out by some super virus pandemic 😂",
          "score": -11
        }
      ]
    },
    {
      "id": "t3_1quczr5",
      "subreddit": "askSingapore",
      "title": "Anyone intends to resign after annual bonus?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1quczr5/anyone_intends_to_resign_after_annual_bonus/",
      "score": 161,
      "num_comments": 68,
      "created_at": "2026-02-03T00:32:12",
      "selftext": "After receiving my annual bonus, feeling pleased for a weekend and the nightmares (literal) started again at night….every night I dream about works, bosses, colleagues, clients etc….cant find any job to match my current renumeration but the burn out is so real.\n\nBtw forgot to mention: 3 months notice here.",
      "comments": [
        {
          "text": "i resigned to fate",
          "score": 177
        },
        {
          "text": "I know of one ex- dept colleague resigned just 1 month before getting up to 6 months company performance bonus. Being curious, I asked him why.. he mentioned to me that the price of seeing his bosses scrambling and shocked faces upon receiving his resignation letter 1 day before xmas eve was worth it. Now he is now in a better workplace with work life balance even though having a pay cut. What I am trying to say, mental health is more important which money cannot buy.",
          "score": 158
        },
        {
          "text": "There are always people resigning. Do it if you want.",
          "score": 87
        },
        {
          "text": "My brother and I are planning to quit without a job cause we're just tired",
          "score": 67
        },
        {
          "text": "Please do check with HR. Some companies when you get the annual bonus, you have to stay one more month or bonus will be forfeited. Example; bonus in December, you can only quit on 1st Feb.",
          "score": 58
        },
        {
          "text": "To be fair, seems fairly petty and short sighted but you gotta do what makes you happy.  My suggestion is to prioritize yourself and don’t focus on trying to make your bosses scramble, you’ll be much happier in the long run.",
          "score": 47
        },
        {
          "text": "Wanted to resign, but ended up getting pregnant. LOL.",
          "score": 45
        },
        {
          "text": "How abt a slight paycut for better work life balance. I seen colleague do that and they are so much happier",
          "score": 40
        },
        {
          "text": "I remembered clearly that it was a long weekend, Xmas eve on Thur, Xmas on Friday... This guy has really planned very well and I plan to keep him as close work ally. Pettiness at it's peak. The funny thing is that his two ex-bosses keep looking for someone who is better than him and kept promoting the new hire is even better than him. But the new hire just left under 3 months and he cannot handle the existing reduced workload. I was at the side eating popcorn and watching the show..  finally sharing the true story here.",
          "score": 35
        },
        {
          "text": "If you're having nightmares, I think you'll regret not resigning",
          "score": 30
        },
        {
          "text": "Do ur due diligence, Google for past issues the companies faced before, scour thru LinkedIn and look at the staff profiles if u can view them, glassdoor.. I mean they are all not foolproof but may give an idea. Tbh, if u think it's a nightmare currently, why stop urself from changing. Cos it could get worse? But ur already in a worse off position right now.",
          "score": 24
        },
        {
          "text": "I am all for Wlb. But having been on the receiving end of one of my team member resignation letters, I do wonder how disfunctional the relationship with the boss was to pay so much for the gatcha moment. For me, the team member invited me to a conversation, told me how he found something better that aligned with his career expectations, I asked him if it was already decided, he said yes. He emphasized it had nothing to do with the company, I thanked him, reflected on his stay, gave him my appreciation for work done and that was it. People leave. It's part of the employment journey. So no need for shock or drama.",
          "score": 23
        },
        {
          "text": "But how to know before joining, the company provide better work life balance lol",
          "score": 21
        },
        {
          "text": "Bonus.",
          "score": 19
        },
        {
          "text": "I resigned before annual bonus in my old company, couldn’t meet quota",
          "score": 16
        },
        {
          "text": "Haha siblings unite",
          "score": 14
        },
        {
          "text": "thats a norm. i manage people in my organization and normally period after bonus is a headache for me. BUT this year special. till date i did not received any resignation. the job market situation i guess is real. dont move without securing the next job.",
          "score": 14
        },
        {
          "text": "Haha wow.",
          "score": 10
        },
        {
          "text": "Woah can motorbike across SEA",
          "score": 10
        },
        {
          "text": "LOL this is so me. Due very soon",
          "score": 8
        },
        {
          "text": "Was going to throw my resignation letter after my PB is in, but three days ago, I learnt I was pregnant and now I am stuck. Wishing you a safe delivery! Get out of your workplace after your maternity leave 😊",
          "score": 6
        },
        {
          "text": "Will pass the msg to my ex-colleague when I have time to meet up with him.. haha. Btw, it is not me.",
          "score": 3
        },
        {
          "text": "I did the same thing before, but after the New Year celebration when I resigned, I didn't say goodbye and just left suddenly, before when I submitted my resignation letter, my boss didn't want to accept it, and I did it twice because I said that apart from the low salary, I was stressed out by my colleagues at work, so when I had the opportunity to leave, I just didn't say goodbye.",
          "score": 3
        },
        {
          "text": "As long you are happy then that matters. Sometimes a silent goodbye is better because no need to talk to people so much. Usually most people like have one dept farewell lunch or dinner. The funny thing (in a -ve) is that my ex-department colleague had free lunches and dinners during his last month and over spilled to the next month. He is not really sociable kind of guy and quiet but I have to say he is very professional at his work and willingly to help others with no hidden agenda. I am trying to follow his example for my work matters now though.",
          "score": 3
        },
        {
          "text": "HAHAHA SAME",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1quekh6",
      "subreddit": "askSingapore",
      "title": "Does anyone regret their private degree?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1quekh6/does_anyone_regret_their_private_degree/",
      "score": 110,
      "num_comments": 138,
      "created_at": "2026-02-03T01:40:18",
      "selftext": "I know this might have been asked before but fast forward to 2025/2026, does anyone regret taking private degree & has the degree affected their salary/pay? Would be great to let us know which Uni you’ve been",
      "comments": [
        {
          "text": "SIM-UOL grad~ ended up in a govt job so i wouldn't say i regret 😅 anybody that tells you that you can't get a job in govt with a private degree just can't see other people better off :) its definitely possible!",
          "score": 175
        },
        {
          "text": "SIM-UOL grad. Honestly, I don’t think I would have made it into banking without the degree. Pay is decent; can support my family, house and car. Not high-flying luxury, but comfortable and good enough.",
          "score": 103
        },
        {
          "text": "I know brilliant people with private degrees and doing well. Also know many shit people with private degrees and sucking hard.",
          "score": 102
        },
        {
          "text": "So true, I feel like there’s a lot of negativity surrounding private degrees. Happy for you ~",
          "score": 33
        },
        {
          "text": "The job market was the total opposite back then. I started out in a contract role at a bank, then job-hopped across 3–4 banks, staying about 4–5 years at each. Now I’m at around 150k per year.",
          "score": 27
        },
        {
          "text": "yea it's coz they beh kan to enter govt they'd say only 2nd upper honours and above from local uni then can get in... heck I know a 3rd class honours fresh grad easily got in this year... still waiting for them to come up with a new excuse",
          "score": 22
        },
        {
          "text": "converted from part time!",
          "score": 15
        },
        {
          "text": "hmm its not impossible, but when i joined, in a table of ~10 fresh grads, 1 was from private. so its not impossible, but might be a little tougher",
          "score": 14
        },
        {
          "text": "That’s true! Really on what they decided to do with their lives, whether they have the drive to succeed.",
          "score": 12
        },
        {
          "text": "Because it's the truth lol. Not saying that it's game over, you will still do fine but Local Unis especially the big 3 gives you an advantage. But SOME of these Private Uni students can't gain admission so they like to dismiss Local Unis and then become defensive because of envy and jealousy. And just want to give you a heads up, you are just gonna see rare success stories, friend anecdotes, or exceptions here like becoming a banker earning 5 digits a week etc. The average private Uni student won't post here. If everyone can do so well via the Private Uni route NTU/NUS/SMU can close down alrdy. Most importantly this is reddit. I can lie and say whatever i want also. I can tell you I come from private Uni and earn 100k per month lol. Once you have been here long enough you can tell.",
          "score": 11
        },
        {
          "text": "Would you say the discrimination is still true tho? I mean DSTA outrightly said they prefer NUS/NTU grads and some companies will just filter you out if you're not from a reputable university because there's too many people applying.",
          "score": 10
        },
        {
          "text": "it really depends on the role! i would think roles relating to IT probably still have such discrimination going on since the curriculum in big 3 unis are definitely more holistic compared to private unis but other than that, haven't experienced any discrimination actually! because end of the day, no matter from what background, we're all at the same place now haha",
          "score": 10
        },
        {
          "text": "That’s great, hope your success will continue ~",
          "score": 8
        },
        {
          "text": "How did you get a govt job?",
          "score": 8
        },
        {
          "text": "My HR told me that usually private vs local degree, he would consider the private degree holder with working experiences over fresh grads with no experience so still got chance!",
          "score": 8
        },
        {
          "text": "My degree is from UniSIM (the previous SUSS). I submit my resume before to these companies before and the HR reply was they don't accept interviewee from private uni.Or, it could be a politically polite way to reject my application.",
          "score": 8
        },
        {
          "text": "hi there, is it ok if i PM you? Am from SIM-UOL as well.",
          "score": 6
        },
        {
          "text": "Sure 👍",
          "score": 3
        },
        {
          "text": "Can get job, but from what I've seen and heard, progression is much slower unless you are next level. Got more chance to earn more if you join a bank of MNC",
          "score": 3
        },
        {
          "text": "I was talking to this project lead at govtech. She told me she just filters out all those from non reputable universities when she's lazy to read their resume.",
          "score": 2
        },
        {
          "text": "Nah. I landed interviews at DSTA before man. As a private uni grad. Didn’t get the job because I didn’t clear security.",
          "score": 2
        },
        {
          "text": "defo! but i think job security wise i feel govt job is still better 😅",
          "score": 2
        },
        {
          "text": "Damm why \nHow was your interview tho",
          "score": 1
        },
        {
          "text": "Very valid point.",
          "score": 1
        },
        {
          "text": "About how much? Was finding a job tough?",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qukom7",
      "subreddit": "askSingapore",
      "title": "Have you ever met Singaporeans with a really unexpected accent?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qukom7/have_you_ever_met_singaporeans_with_a_really/",
      "score": 63,
      "num_comments": 62,
      "created_at": "2026-02-03T06:36:13",
      "selftext": "Have you ever met someone local whose accent really caught you off guard?\n\nLike race doesn’t match the accent you’d expect at all when speaking english\n\neg Chinese speaking with strong Indian accent, Malay speaking with Japanese accent etc\n\nWonder what their background is like for this to have happened",
      "comments": [
        {
          "text": "Kauboy",
          "score": 194
        },
        {
          "text": "Malay speaking with a Texan accent. My brain froze for a few seconds the first time I heard him talk. He moved there since 11 and came back for NS.",
          "score": 187
        },
        {
          "text": "One Chinese NSF in HQ with mental illness insist he was from like the Deep South, and spoke with comical fake redneck accent. Only got pes E9 sad wouldn’t give him Pes F. apparently he went for 2 week holiday to the USA pre enlistment and then realised he was not Singaporean, reject NS",
          "score": 77
        },
        {
          "text": "Years ago when I was staying in Clementi, met a Chinese aunty wearing Sari and speaking Tamil fluently. I heard she was adopted by Indian family. Also one of my Singaporean Indian coworker speak Mandarin and Hokkien fluently. A lot of customer were surprised when they get her name & email or meet her face to face. She can speak Tamil (mother tongue) and can speak Malay quite well too. We all called her 'True Singaporean'.",
          "score": 69
        },
        {
          "text": "Knew a guy who was half Caucasian half Chinese. Caucasian father was out of the picture from the start. Mom remarried a Chinese guy when he was young. He took his stepdad's sirname. But he looked more Caucasian than Chinese even though he had a Chinese name and seemingly two Chinese parents. Perhaps to overcome insecurities about all this, he developed a really strong singlish accent even more than his fully Chinese half siblings (he was not codeswitching, it was his natural accent).",
          "score": 55
        },
        {
          "text": "LoL met a Indian girl in uni who took Chinese in school and got A for A levels. Meanwhile my full blooded Chinese friends fighting for their lives to get a D",
          "score": 51
        },
        {
          "text": "Indian speaking better mandarin than most Chinese",
          "score": 36
        },
        {
          "text": "I had a classmate in poly (we were all like 18-19) who spoke in a really bad American accent. Turns out, he spent a month visiting relatives in the US when he was 10 and he claims the accent stuck to him.",
          "score": 33
        },
        {
          "text": "i expelled air out of my nose. take my poor man’s gold",
          "score": 28
        },
        {
          "text": "Indian encik, speaks fluent Hokkien, can't speak Tamil.",
          "score": 28
        },
        {
          "text": "I went on a tour to Turkey with a Russian lady with Singapore PR who acted as our Singapore tour chaperon. Blue eyes, blonde hair and speaks English with a strong Singaporean accent. Close your eyes and you'll really think you're speaking to a local auntie.Turns out she learned her English while living here.Took me awhile to get used to it, haha.",
          "score": 27
        },
        {
          "text": "I have a classmate in uni who went for a 3 week exchange to USA and came back with a fake American accent that she claims is from being there for “so long”.",
          "score": 26
        },
        {
          "text": "This one will forever be a classichttps://youtu.be/HylaY5e1awo?si=unB9tPO_bOWWSkdt",
          "score": 24
        },
        {
          "text": "A lot of answers here don’t know the difference between speaking another language and speaking a different accent lol.",
          "score": 18
        },
        {
          "text": "Damn sus. I had a Korean classmate that apparently speaks English with an American accent. She claimed that she visited relatives in US too and after a few months of staying there, she also got stuck in that accent. I find it weird that she got stuck with that accent after living there for a few months but she didn't get stuck with Singaporean accent after living here for a decade. Turns out she just idolises the American culture and moved there after she graduated.",
          "score": 15
        },
        {
          "text": "An Indian from India, working here in Singapore as head of department, in the engineering side, speaks English like crude Singlish, not the usual Indian English. That was interesting. It was due to working in construction sites.",
          "score": 11
        },
        {
          "text": "A clear case of seperti kacang lupakan kulit",
          "score": 8
        },
        {
          "text": "When I lived in Singapore I would speak Mandarin with a Taiwanese accent. I’m Filipino-American and learned my 華語 from Taiwanese and Cantonese speakers, so you can imagine the brain fart some aunties would get speaking to me",
          "score": 8
        },
        {
          "text": "A classic indeed. Still cannot get over the accent and Singlish from such an Ang Mo face.",
          "score": 7
        },
        {
          "text": "One of our national team swimmers has Estonian parents, looks completely east European, but speaks with a local accent cos he was born and raised here.",
          "score": 5
        },
        {
          "text": "more to tak sedar diri",
          "score": 4
        },
        {
          "text": "Many like that",
          "score": 4
        },
        {
          "text": "Like decades ago everyone cringe when Fiona Xie spoke",
          "score": 2
        },
        {
          "text": "LOL i seen q afew",
          "score": 1
        },
        {
          "text": "Relevant https://youtu.be/5PDgTeSeUEI?si=An4JOmuJ6MMVBfxb",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qtu0so",
      "subreddit": "askSingapore",
      "title": "What are some part time jobs post corporate?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qtu0so/what_are_some_part_time_jobs_post_corporate/",
      "score": 43,
      "num_comments": 51,
      "created_at": "2026-02-02T12:43:03",
      "selftext": "31F here. 1 kid. Currently work in full time corporate tech (non sales). I plan to work part time post 40 year old to spend time with kids. Posting here to gain some inspiration on some part time jobs to do. Goal to earn $3-4k a month, 15-20 hours a week. Any ideas other than tuition? :)",
      "comments": [
        {
          "text": "no NORMAL\\REGULAR part-time job pays that much if you’re only working 15–20 hours a week. for example, to make $3,000 at 80 hours, you’d need an hourly rate of $37.50. tutoring rates these days are usually around $30–35 for secondary school subjects, and only go a bit higher if you have strong credentials, and this is excluding cpf and what not",
          "score": 54
        },
        {
          "text": "Post 40? Isn’t that like 9 years later? Kind of hard to predict the job landscape then",
          "score": 28
        },
        {
          "text": "Got, locum doctor.",
          "score": 21
        },
        {
          "text": "Coding/Robotics teacher for kids",
          "score": 17
        },
        {
          "text": "Locum doctor earns more than that. Used to do payroll for them.",
          "score": 13
        },
        {
          "text": "yea everyone here in Reddit are doctors, SWE engineer, quantiative analyst, starting 25k salary.",
          "score": 13
        },
        {
          "text": "it does exist ah, but you think in this context for someone whos in tech has these qualification to be in a locum doctor? you just want to prove to me a point but its not even helping OP in her case.",
          "score": 10
        },
        {
          "text": "a locum doctor isn’t a realistic comparison. you need to be fully qualified, licensed, and experienced to even be eligible. it requires years of medical training and carries significant responsibility. that’s why the pay is high. for the average person looking for part-time work of 15–20 hours a week, roles like tutoring are far more realistic, and those typically pay $30–35 an hour unless you have exceptional credentials.",
          "score": 8
        },
        {
          "text": "Lots of multi-millionaire, 25 year old earning 200k per annum but go SingaporeFi or SgHenry and ask stupid question.",
          "score": 6
        },
        {
          "text": "ya or singer apparently",
          "score": 5
        },
        {
          "text": "Teleconsult. 1 min 1 patient.",
          "score": 5
        },
        {
          "text": "Teleconsult is $10/patient, physical locum pays better Also why ppl do stupid shit like 1 min a patient, cos they think they can see 20-30 an hour which is not practical",
          "score": 5
        },
        {
          "text": "i saw a few on indeed jobs, but im pretty sure you can just search this up on the internet a few job listing might pop out",
          "score": 4
        },
        {
          "text": "okay then i shall edit and say \"no regular part time job pays that much if you're only working 15-20 hours week\" because everyone on reddit is supposedly have a niche skill or is a doctor,lawyer,engineer?? just other one trying to prove a point here, obviously OP here is just a normal singaporean trying to to find for a good paying NORMAL part time job that is not tutoring. there is no need for me to empathise on it at all cause not everyone has some sort of special talent or skill that can land them in good paying part time jobs.",
          "score": 3
        },
        {
          "text": "Tech consulting as an individual pays well, but you’d need to setup the business itself which is the most difficult part.",
          "score": 3
        },
        {
          "text": "Thank you! I’m surprised the rates are so low for tutoring though. I taught a sec 1 kid in university (10 years ago) and was able to charge $50/hr. Maybe there’s just a lot more supply now..",
          "score": 2
        },
        {
          "text": "Got lobang? Or where to find? I have experience and credentials and interested in this",
          "score": 2
        },
        {
          "text": "I know",
          "score": 1
        },
        {
          "text": "Not sure about responsibility",
          "score": 1
        },
        {
          "text": "it requires years Until recently, most guys would locum as PGY3’s during NS lol",
          "score": 1
        },
        {
          "text": "usually if you are a current university student you will get paid more too, my friend is doing a degree in chemistry at NTU currently and she is tutoring secondary 3-4 students at $50++ per hour as well.",
          "score": 1
        },
        {
          "text": "fitness instructors pays 60-80/hr",
          "score": 1
        },
        {
          "text": "ya everyone on reddit now can become a locum doctor, fitness instructor , part time singer what else? president next?",
          "score": 1
        },
        {
          "text": "Yes it's an exception. But just saying these exceptions exist.",
          "score": 0
        },
        {
          "text": "To be able to earn a substantial amount part time would definitely require some sort of niche skill. Another example I could think of is being a bar gig singer. Per gig is easily $300-$400 while only working for 2-3 hours. You’re also not helping by putting out a blanket “no part-time job pays that much if you’re only working 15-20 hours a week” because you’re just inviting people to prove you wrong.",
          "score": -1
        }
      ]
    },
    {
      "id": "t3_1quge2z",
      "subreddit": "askSingapore",
      "title": "Anyone know how to get airtime on CNA?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1quge2z/anyone_know_how_to_get_airtime_on_cna/",
      "score": 33,
      "num_comments": 36,
      "created_at": "2026-02-03T03:00:03",
      "selftext": "Curious what does it take to appear a few mins as the subject matter expert?\n\nA few days ago I saw the founder of a consumer research company talked about the rapid growth of food delivery industry in South East Asia.\n\nCurious what does it take to get these exposures? Like do they have to pay? Or they were simply invited because of their established reputation? Or is it through contacts?\n\nAppreciate any insights, thanks!",
      "comments": [
        {
          "text": "I assume they reach out",
          "score": 54
        },
        {
          "text": "Idk about airtime but there have been local journalists who reached out here on Reddit to ask ppl for a small interview for whatever article they are writing. So I assume they approach the relevant authority depending on the subject",
          "score": 35
        },
        {
          "text": "Either reach out to them, or email them regarding something important.",
          "score": 17
        },
        {
          "text": "It’s either you reach out to them with a proposal of who you are, what you want to talk about then see whether they accept. Or they find you through contacts and get you on to share (Don’t expect to be paid btw, you’re probably paid in exposure)",
          "score": 17
        },
        {
          "text": "my nonprofit got a 10 minute feature on cna in 2024. i emailed them! we weren't paid though",
          "score": 11
        },
        {
          "text": "—you can reach out. there's always a name included in the article. you can search for their email online. it shouldn't be hard to find.—journalists often ask round online or their friends if they know someone like that, that fits the theme or topic they are going to pitch. they often need to find 3 subjects so the angle will be less bias.—paid one. you can write in to buy an advertorial. you might or might not be rejected.—you know someone that knows someone that know someone that works there.—DM on linkedin.",
          "score": 10
        },
        {
          "text": "Same, I was reach out before two or three times for ST article because of some old posts I made on Reddit. And on one occasion, I actually reach out to the journalist when they made a post on a local Facebook interest group, asking for comments or someone to share personal stories. But this is more towards quick comments and brief sharing of personal stories than an actual full featured interview, I usually ask them not to put my full name or any very identifiable details. CNA will occasionally ask people to write in and share their stories to them if they have a topic they want to cover, some of these people will be selected for screening and be interviewed. Quite a few local investigative series and documentaries found their interviewees via that route. I know a couple of acquaintances who was reached by CNA and Mediacorp because they were either recommended by someone else that is authoritive figure or received a notification from journalists who was researching on the topic and found out about their work online (e.g. social media, video content, blog post), over time they became the go to subject matter experts for that specific and niche topic.",
          "score": 9
        },
        {
          "text": "i recall emailing them with a press release about an upcoming event with 4 political office holders. (before that i had been regularly sending all the local media press releases.) my beneficiaries were the ones who spoke, i recall they got a bit of prep time beforehand, i was on hand on make sure everything was fine (have since left that company)",
          "score": 8
        },
        {
          "text": "For doctors im not sure, but I knew a prof who mentioned in class that she was approached to appear on the news multiple times. No mention of payment though.",
          "score": 5
        },
        {
          "text": "https://www.channelnewsasia.com/contact-usi think i emailed the addresses here! maybe you can find the relevant reporters on twitter/linkedin etc and email them",
          "score": 5
        },
        {
          "text": "Would strongly consider you to read more about PR or hire someone who is a practitioner. Saw you mentioned that you are thinking about it and I would suggest you to send journalists of relevant beats your press release early (i.e. if you are in finance, reach out to the people who writes finance). They may ignore you at first, but keep sending them updates about your company so that you remain top of mind. Additionally, reach out to these people to cultivate a relationship with them, it goes a long way. A PR practitioner or an agency can help you with that as well. Executives, especially CEOs, gets interviews when journalists find an interesting newsworthy point, more so if it’s broadcast because airtime is limited and expensive. The guy talking about food delivery is on CNA because it’s a topic that always gets talked about in SG. Iirc there was even a news report on how gig economy workers will see a huge dip in their earnings after the mandatory reduce in speed of their PMA. Honestly, PR is very important and a lot of work is being done just to get into your ST/BT/CNA. So if you do get someone to do the job, please also keep in mind to not expect such results in day 1. Sometimes it could take years to cultivate that relationship.",
          "score": 4
        },
        {
          "text": "It always helps if you are from a reputantional MNC or university. Viewers are more inclined to listen and watch if you are from a big company as compared to an SME. The guests usually appear for free in exchange for media exposure and publicity.",
          "score": 4
        },
        {
          "text": "Yep",
          "score": 3
        },
        {
          "text": "With great confidence (though not 100%), you are never paid for expert opinions.",
          "score": 3
        },
        {
          "text": "But yah, I do realise that with political office holders, it’s much easier to get media to attend an event. Tho it does matter which political figure is going, but generally I get more replies of - we are checking with news desks and will let you know soon - rather than just radio silence",
          "score": 3
        },
        {
          "text": "Oh did you email the main news desk? Mediacorp doesn't (unlike SPH) only publishes general email addresses :(",
          "score": 2
        },
        {
          "text": "A simple email of who you are, what you do, and what you can talk about is fine. Best if it’s as succinct as possible. Your email subject is also important. Journos receive a lot of pitches in a day, they don’t have time to look through a 100-pager deck when they open your email. Get their attention first before going into details. A successful pitch varies - sometimes I add in context on why it is important for journo to speak to me NOW and not tomorrow, sometimes if there is a hot topic trending where you can weigh in an opinion, do it immediately. Don’t wait. News dies out or changes direction very quickly. An issue happens in your industry and you have something to say? Reach out to the journalists or Newsdesk immediately, don’t wait till the next day. Also, AI tools can assist you but don’t get the AI to write your pitch. Journos can smell AI content a mile away.",
          "score": 2
        },
        {
          "text": "PR and Marketing practitioner here - the producers may have their contacts, but if you have an event or a launch and you send a press release to the producers, and the PR caught their attention, you might have a chance to go on air. Presuming if you get more media interviews and the producer likes you, you will be on their roll if there are any queries that require professional expert to opine on air. I am curious - you want to go on air?",
          "score": 2
        },
        {
          "text": "Thanks for this.",
          "score": 1
        },
        {
          "text": "Those doctors and professors are also paid in exposure?",
          "score": 1
        },
        {
          "text": "Good advice, appreciate it! 🙏",
          "score": 1
        },
        {
          "text": "That’s great to know! Just curious what materials were emailed.. is it like a pitch deck of what topics you want to cover and why they are important etc? And after the slot is confirmed did they prep you for the convo or it’s mainly improvised? Thanks!",
          "score": 1
        },
        {
          "text": "lol one of them is always slammed in the singapore subs though",
          "score": 1
        },
        {
          "text": "Thanks for sharing. I thought airtime on a reputable platform is a good way to highlight the work and build credibility especially when you are building something new. So yes I am thinking about it, not so soon though.",
          "score": 1
        },
        {
          "text": "I mean yes, they do but a lot of this is people reach out to them. As for how to do this or get people to do it for you...it's an entire industry. But you can google how to write a media pitch if you want to do it yourself.",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1quf89k",
      "subreddit": "askSingapore",
      "title": "Is owning a property in SG considered a safety asset? Will it be better off to just rent instead and it also makes more financial sense because you can have more free cash instead of it locked up.",
      "url": "https://old.reddit.com/r/askSingapore/comments/1quf89k/is_owning_a_property_in_sg_considered_a_safety/",
      "score": 26,
      "num_comments": 113,
      "created_at": "2026-02-03T02:08:53",
      "selftext": "I would think that having more free cash in my bank account is safer than buying a property but i don't understand why we have an obsession in SG that we need to have a property to feel secure?",
      "comments": [
        {
          "text": "If you are Singaporean with CPF, owning a home is better than renting, as you can use OA to payoff monthly loan instead of cash to rent, which is the one you asking for, more cash at hand",
          "score": 82
        },
        {
          "text": "The main safety is that it gets you on the property ladder and protects you against future price increases. You ‘lock in’ today’s price so if prices go crazy in the future, at least you have a real asset. But I think it depends on your personal circumstances.",
          "score": 29
        },
        {
          "text": "Even better is if one rents out the home, effectively converting CPF into cash that can be used for investments without silly restrictions.",
          "score": 22
        },
        {
          "text": "rent is expensive and you are at the mercy of your landlord.",
          "score": 18
        },
        {
          "text": "Mortgage is half what my rent was… Idk how anyone can think renting is safer or makes any financial sense in 2026 in Singapore if you can get a HDB…",
          "score": 16
        },
        {
          "text": "Rented 2 different homes over 5 & 1/2 years while waiting for our actual home. Being at the mercy of landlords is not fun 🥲Glad to finally have our own place now!",
          "score": 13
        },
        {
          "text": "Agreed but the government controls population through immigration and controls land supply tightly through GLS sales. It’s hard to see an American style 10-20% crash in property prices, maybe it goes flat or loses 5%.",
          "score": 12
        },
        {
          "text": "The concept came from the west and other rental centric countries. Our envt is a bit different so buying is actually cheaper.",
          "score": 10
        },
        {
          "text": "Theres always a risk of property prices dropping too though. Singapore cant keep squeezing more and more people in, which is the main driver of demand. And many companies are retrenching staff and offshoring, plus a lot of supply is coming on the market, supply that was delayed during COVID. \nThere's no guarantee prices will keep going up, in fact it wouldn't surprise me if there's a big downward correction. A lot will depend on what the idiot tangerine in the White House does too and how that affects the global economy.\nMight not happen but my point is, property values always going up is not a given.",
          "score": 8
        },
        {
          "text": "Govt will do its best not to let that big downward correction happen because everyone is buying houses with their CPF. If there is a big crash, everyone loses their CPF and PAP will lose big time at the next GE.",
          "score": 8
        },
        {
          "text": "The gov will never let property prices collapse. At most it will stay flat just above inflation. They control the supply, they control the demand. They can set property prices at whatever levels they want it to be. They have learned during the past financial crisises and surplus supply and they don't repeat the mistakes. It is a given.",
          "score": 6
        },
        {
          "text": "It’s silly to think Singapore is special and it will never happen unlike other countries. Hong Kong been controlling supply and refusing redevelopment to keep property price high after it crash in the 90s. But over the last few years they can no longer keep price from falling as people start leaving Hong Kong combined with Aging population and less foreigners willing to move into Hong Kong. We can’t tell what’s going to happen to any country over the next few decades. Will people start leaving Singapore? Heck in the 80s people said Japan will overtake US to be world largest economy. People were saying Japan govt will never let the stock or property crash or else people will be in trouble for decades. 2030s VERS will likely change the landscape for HDB as well and potentially end speculation for older HDB.",
          "score": 5
        },
        {
          "text": "Comparing apples to oranges my dear. China is far, far different structurally from Singapore. Their supply situation was completely opposite from Singapore's. Just because something happened in other countries doesn't mean it will automatically happen in Singapore. Control is everything and Singapore has fine granular control over all aspects of the property market. No other country in the world even come close to this level of control.",
          "score": 4
        },
        {
          "text": "That's the beauty of a functional asset. You need a place to live. If prices go up, you sell high and buy high. If prices crash down to even 50 cents, sell your place for 50c, buy another one for 60c. You're in the same situation, practically speaking. It's like, exchange rate only matters when you trade internationally (and everyone does). If every part of production is in the same country, you don't need to care. If your cash stays in the property market, you don't need to care. Yes you lose out on have all that spare cash you would have if property becomes free, but that's the same effect as being unaffected if the price goes to the moon. You lock in on both sides. I bring up international trade also because that's the only effect you're not protected from. If you sell here and buy overseas, in a different property market, then you can worry. But no matter what, you still need a place to live. You can always just choose not to move overseas if the market is bad. Similarly you can choose to upgrade when the market is low or downgrade when the market is high and still scrape some profit off the fluctuations while still maintaining one place to live. Your second property is an investment like any other though. Rent is pretty nice, and if you can sell at the same price or even a little lower, it should be a net profit.",
          "score": 3
        },
        {
          "text": "But if there's less foreigners, that's less physical people overall needing accommodation,  even if tbose same jobs are filled by locals instead. Those locals were already here and already needing housing. It would also have a flow-on effect, depending what level jobs they were. Most foreigners in white collar jobs tend to rent or buy condos, rather than HDBs. So the condo market is likely affected more. And this is before considering any flow-on effect to the economy with less foreigners spending their money here. Yes the government can tinker with the rules but they can't artificially properly up the market forever.\nAll speculation of course but an interesting discussion.",
          "score": 2
        },
        {
          "text": "Depends how much cpf you have and how good your investments are. For someone who has to fork out 250k+ cash down payment, the opportunity cost lost to investment gains + interest can be more than rent.",
          "score": 2
        },
        {
          "text": "Not everyone is a couple. And 1mil property is just a regular 3 br hdb resale in a good location in today's market you speak of it as if it's a luxury property lol. Lastly 40k from cpf doesnt mean its free money. Its your own money.",
          "score": 2
        },
        {
          "text": "Property tax on investment property is punitive . The rental income you gain is also taxed as income. Its painful . Much easier if your property appreciates , theres no capital gains tax if you sell and cash out in a few years",
          "score": 1
        },
        {
          "text": "Don’t understand why you’re being downvoted.",
          "score": 1
        },
        {
          "text": "Gov can do a lot to tinker with the prices. If they so much as relax the foreigner quitas by a few thousands- that means few thousands people who work for a discounted salary, but will need to rent - and voila! Rental prices go up, demand for property remains solid. Also can just lower age at which singles can buy property and boom prices go up again.",
          "score": 1
        },
        {
          "text": "Gov got the capital to tank prices, but I don’t think they want to risk it in term of politically ( much of the base already invested in). Also they hate selling their preciously reclaimed land “cheaply” to developers. I think there’s a few times developers bid and it doesn’t hit reserve price so they just won’t sell",
          "score": 1
        },
        {
          "text": "Why someone with 0 CPF needs a $1mn property?",
          "score": 1
        },
        {
          "text": "I bought my property with 0 in my CPF. There are many people without cpf. Especially those that recently returned to sg.",
          "score": 1
        },
        {
          "text": "Doesn’t really address the need for a $1mn property, also if both parties are working and reaching max CPF contributions which seems plausible if they have international experience the remainder of the mortgage can be serviced by CPF freeing up ~40k in cash annually that you’d need to reach at least 16% return to match.",
          "score": 1
        },
        {
          "text": "That’s what people said in Hong Kong, China, Korea, Japan. Hong Kong property collapse 50% in the 90s before recovering but it’s falling again. China cancelled cooling measures but the price is still falling even in major cities like Shanghai and they spin their message as “making home affordable for all”. Taiwan is likely next. 90% homeownership, extremely expensive freehold property, 10-20% vacancy rate, Aging population. If you can tank for decades maybe it will recover but there’s a portion that will get margin call. Heck a small % got margin call in 2020 during that few months of minor dip.",
          "score": -1
        }
      ]
    },
    {
      "id": "t3_1qun6eh",
      "subreddit": "askSingapore",
      "title": "Has anyone had their job offer rescinded after a pre-employment check?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qun6eh/has_anyone_had_their_job_offer_rescinded_after_a/",
      "score": 22,
      "num_comments": 23,
      "created_at": "2026-02-03T09:07:34",
      "selftext": "As part of a job hiring process, I’m required to go for a pre-employment health check up. I was previously diagnosed with a mental illness and was on medication but I have weaned off for more than a year and am now stable. Has anyone who declared their mental illness in a pre-employment health check up had their job offer rescinded? I’ve never had to go for health check ups in my previous jobs so I’m not sure how this might jeopardise me…",
      "comments": [
        {
          "text": "Don’t declare. Your medical info is supposed to be private and let’s be real, mental illness is still extremely stigmatized in Singapore. The odds of you having your offer rescinded is significantly greater than you not declaring and being found out. \nIn fact, most people don’t declare and have been in their roles forever.",
          "score": 51
        },
        {
          "text": "Since you're stable and presumably don't need any concessions, just don't declare.",
          "score": 23
        },
        {
          "text": "Why would you declare lol",
          "score": 22
        },
        {
          "text": "In Singapore, you generally do not need to declare your mental health condition during a pre-employment checkup, as Tripartite Guidelines on Fair Employment Practices (TGFEP) advise against requiring this information unless it is directly relevant to job safety or performance. Employers should not ask for it unless the role involves high-risk, safety-critical tasks. Are you planning to work as Police Officer or other frontline roles instead of office jobs?",
          "score": 17
        },
        {
          "text": "Errr if you’ve bipolar type of mental illness,it is ill advised to wean off the medication yourselfunless it has been approved by your doctor. Still, I think best to declare IF you were asked. There are medical records so if you lie and get caught, you could be seen as dishonest and that is a red flag",
          "score": 11
        },
        {
          "text": "You can declare and gamble they won't withdraw their offer and won't look at you sideways while you're there. Or you can gamble that they won't find out while you're there. Your choice lor.",
          "score": 10
        },
        {
          "text": "Any suppression of info or false declaration in the health check up can render me liable for dismissal or legal proceedings lmao so if they find out after I’m hired it won’t look good either",
          "score": 8
        },
        {
          "text": "Lol youre free not to declare it but dont go surprised pikachu once your insurer informs your employer thr very moment you use your company's medical plan for anything related to mental health .",
          "score": 7
        },
        {
          "text": "My doctor is aware and I still see him every now and then so he can check in on my progress. And no it’s not bipolar type of mental illness lol",
          "score": 4
        },
        {
          "text": "Do not declare since ur cured. It will be used against u in the selection process.",
          "score": 4
        },
        {
          "text": "Naturally if you don’t declare you don’t make any mental health mc / claims either. Keep your story straight.",
          "score": 3
        },
        {
          "text": "Here’s a shorter, clean reply: If it’s semi-public and not safety- or security-sensitive, the risk is generally very low. Health checks in those roles focus on current fitness for work, not past diagnoses. A treated, stable condition on its own usually isn’t an issue. Aren’t  medical information part of personal data act and supposed to be P&C? \nHmm I will say don’t\nDisclose",
          "score": 3
        },
        {
          "text": "just out of curiosity, why is bipolar of being singled out, is it that common nowadays? because last i know, it wasn't that well known",
          "score": 2
        },
        {
          "text": "Legal proceedings? What rubbish. People lie all the time, even our minister lie about trace together to 5 million people and they are still employed.",
          "score": 2
        },
        {
          "text": "This can depend a lot on the role. Can I ask which industry this is in, whether it’s private or public sector, and whether the job is considered safety or security sensitive?",
          "score": 2
        },
        {
          "text": "Semi public sector. Job isn’t safety or security sensitive",
          "score": 2
        },
        {
          "text": "Keep it private. Mental health is still stigmatized here and most people don’t declare it",
          "score": 2
        },
        {
          "text": "Nope, you’re fine. Tricky if you have criminal record 😂",
          "score": 1
        },
        {
          "text": "In a strange way, its not a problem untill its a problem. You can choose not to declare but you can't blame them for dismissing you cause you didnt act in good faith.",
          "score": 1
        },
        {
          "text": "Honestly depends on what the company and job scope is like too.. because rescinding an offer just cos of mental illness is discriminatory. Don't worry too much about it, hope you get what you want :)",
          "score": 1
        },
        {
          "text": "IMO, bipolar type of mental illness (during manic episodes) have a more disruptive effect on the person and his/her surroundings than depression and anxiety. Singapore still lags behind other nations in terms of mental health awareness and support, but there has been progress. People esp Gen Zs are more open to discussing it",
          "score": 0
        },
        {
          "text": "Hi OP. I have had depression and ocd ever since I started work years ago. I have never declared any of my mental illness on a form. I suspect you may be struggling with your internal compass on whether or not to tell the truth and get it out of the way beforehand, rather than hide it and have to worry they might figure out everyday. Its important to remember that whatever advice people can give you here, the choice is ultimately yours. There have been people who declared their conditions and the company is very supportive, even allowing them to claim from company insurance when visiting mental healthcare providers. That said here is my take. I initially also was uncomfortable hiding my condition as I have an unhealthily strict moral compass. But I have learnt that despite the rubbish that our government spews about making it inclusive, I can assure you that you will not be getting that job if you declare. Here is my reasoning. Most of the time, they ask you to fill up this questionnaire declaring your mental conditions even before the first interview. If they really do not stigmatise and hire purely based on ability and knowledge, shouldn't this questionnaire come AFTER you have been offered? Just some food for thought. My advice is, if you can hide it, don't declare. If you can't hide it, then I would suggest not finding a job right now. Focus on a goal. That goal is not to be cured of your mental illness, but reaching a point where you can hide it reliably. Don't worry about the medical checkup. You just have to stick with your lie. According to my psychiatrist, they can't detect your psychiatric medication from a simple blood sample. I would know, as I am on 5 medications and have gone for numerous pre-employment and free health screenings. So yeah. I am sorry that I do not have good news for you, but this is Singapore. You want to declare, be prepared to not only not get the job, but also registered in whatever company's database that you have a mental health condition. And they are surprisingly well linked. Whatever you choose, wishing you all the best, and take care",
          "score": 0
        },
        {
          "text": "Any suppression of info or false declaration in the health check up can render me liable for dismissal or legal proceedings lmao so if they find out after I’m hired it won’t look good either",
          "score": -4
        }
      ]
    },
    {
      "id": "t3_1qtz7hj",
      "subreddit": "askSingapore",
      "title": "Cat thief on the run: How do I enforce a U.S. civil judgment when the defendant has disappeared and may be overseas (Singapore)?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qtz7hj/cat_thief_on_the_run_how_do_i_enforce_a_us_civil/",
      "score": 17,
      "num_comments": 42,
      "created_at": "2026-02-02T16:09:17",
      "selftext": "I won a civil judgment in the United States against a man who stole my cat. The defendant is a Singaporean national.\n\nDuring the case, he actively avoided service and court appearances. Since the judgment, he has disappeared from his last known U.S. address, does not appear to have social media, and cannot currently be located by normal means.\n\nMy goal is to enforce the judgment legally and properly.\n\nI’m trying to figure out…\n\n• What are the best legitimate options for locating a judgment debtor (aka the cat thief) who may have left the U.S.?\n\n• If the defendant has returned to Singapore, is it possible to domesticate or enforce a U.S. civil judgment there?\n\n• Would it be better to consult an international collections attorney or a firm that specializes in cross-border judgment enforcement?\n\nIf anyone has experience with enforcing judgments across borders (especially involving Singapore), I would really appreciate practical guidance on the next steps.\n\nThis is a real case and a real judgment. I am only looking for lawful ways to proceed.\n\nThank you in advance!!",
      "comments": [
        {
          "text": "you should find a real singapore lawyer. this is way above reddit pay grade. hope you find your cat!",
          "score": 127
        },
        {
          "text": "Man which mfker stole your cat 🤬🤬🤬 I would be SO pissed.",
          "score": 64
        },
        {
          "text": "Was the guy Amos Yee by any chance?",
          "score": 52
        },
        {
          "text": "I dont know anything abt this lawyer stuff but I am sorry that one of our people stole your cat.",
          "score": 18
        },
        {
          "text": "You need to locate the defendant or their assets first. If you can't find him you're out of luck.",
          "score": 14
        },
        {
          "text": "How do you know he ran back to Singapore? But cat thief is really a cb.. so many cats why steal someone else cat",
          "score": 14
        },
        {
          "text": "Tryr/Singaporelaw",
          "score": 12
        },
        {
          "text": "🤣🤣🤣🤣🤣",
          "score": 8
        },
        {
          "text": "I don’t know he ran to Singapore, but he has a job that would allow him to work remotely so it’s a big possibility. Even after everything I learned, I still have no clue why he or anyone would steal a cat!",
          "score": 8
        },
        {
          "text": "I don’t think Amos would be interested in cats. Children though…",
          "score": 6
        },
        {
          "text": "I was thinking the exact samesies",
          "score": 5
        },
        {
          "text": "lol 😆",
          "score": 5
        },
        {
          "text": "Did you find them? If you can find them then you can apply for enforcement of the US judgment with the SG court that will convert it into a local SG order, then use the usual means for enforcing an SG order. Depending on how much your judgement is worth (and whether the thief even has money to pay), it may be throwing good money after bad on legal fees etc.",
          "score": 4
        },
        {
          "text": "100%",
          "score": 3
        },
        {
          "text": "Get enough redditors to look out for your cat and they might just find it ;) (not really, you're much better off with a proper lawyer, but if you post a picture I'm sure people will look out for it.)",
          "score": 3
        },
        {
          "text": "Once broken considered sold. Lol",
          "score": 2
        },
        {
          "text": "then I hope the defendant has not returned to SG",
          "score": 2
        },
        {
          "text": "Thank you",
          "score": 2
        },
        {
          "text": "If he returned back to sg, the cat needs to be quarantined. You can probably hire a private investigator to check whether your cat is in quarantine cause there’s only one quarantine centre in Singapore.",
          "score": 2
        },
        {
          "text": "I got my cat back after almost a year and a half, thank God! But now he’s been running to avoid paying the judgement",
          "score": 2
        },
        {
          "text": "Thank you!",
          "score": 1
        },
        {
          "text": "I have my cat, thankfully! Trying to collect the judgment now. But this is really helpful to know in case he stole and absconded with someone else’s cat in the meantime! At this point, I believe anything haha",
          "score": 1
        },
        {
          "text": "Did you get him back already?!? How? What happened?",
          "score": 1
        },
        {
          "text": "I had to hunt the guy down and I saw my cat in the window of his residence. So I tried to go thru the police but then they wouldn’t help and the cops ended up tipping the guy off that I found out where he and my cat were so he wouldn’t even let my cat look out the window of his apartment anymore. Long and short of it, had to take him to court: I won my cat and some money. The judge made the man bring my cat to court again 2 days later and I was able to bring her home. Now I’m trying to collect my judgment because the money was for costs associated with locating her, court fees, and pain and suffering. The guy is a piece of work, I’m probably going to have to write a book or do a documentary or something about this whole thing",
          "score": 1
        },
        {
          "text": "Wait, so did you have to come to Singapore? I'm confused about your original question.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1quhq8a",
      "subreddit": "askSingapore",
      "title": "Has anyone heard of Red Alpha Cybersecurity?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1quhq8a/has_anyone_heard_of_red_alpha_cybersecurity/",
      "score": 17,
      "num_comments": 29,
      "created_at": "2026-02-03T04:01:49",
      "selftext": "They have earn and learn programs although there is a selection process. They guarantee a job placement after the training as well. I would like to know if anyone has heard of them? If yes, what do you know and what are your thoughts?",
      "comments": [
        {
          "text": "They used to only do network security and OSCP cyber security. Now it looks like they have expanded to other disciplines as well. It’s good if you need a foot in the door, as they take care of placements for you. Otherwise if you’re confident of landing something by yourself, you can always opt not to take the bond.",
          "score": 17
        },
        {
          "text": "I’ve explored it before but they couldn’t answer me placement at what salary after the course. It’s like a 3 year bond without in knowing what, where and how much.",
          "score": 12
        },
        {
          "text": "Have a friend in there. They want some basic understanding first, then they will send you for training. Training is by professionals, some flown in from overseas, then get some minimum certs like OSCP. You will be tied under something like a bond as part of the training cost and be sent to work with their clients, or they will apply to roles on the market for you and will take a cut of the salary. Your bond period will not start counting down until you get a role, meaning you can be put on bench and not working off your bond.",
          "score": 6
        },
        {
          "text": "they legit. if u gotten your p200 or web300 already I got employment waiting for u",
          "score": 5
        },
        {
          "text": "I’d say trend carefully with them. I went to their interviews and did their assessments, they are definitely looking for ppl with some IT background, like wireshark and programming. I won’t say their program is for those looking for career switching. Having said that, I’ve heard many bad stories where graduates without any IT background able to get OSCP and GCIH certificates, which are definitely no walk in the park, even with the “intense” training. For reference,https://pauljerimy.com/security-certification-roadmap/, these certs are above beginner level. And these graduates enter the companies unable to perform the work that they are “trained” for. To top it off, the CEO is from Israel cybersecurity industry, so, it’s just sus.",
          "score": 5
        },
        {
          "text": "I went to their interview as well and can confirm, these guys are grepping for unicorn. Suspect they will only accept those who very likely could get hired even without their placement support.",
          "score": 4
        },
        {
          "text": "Yes it is. Although the subcon company can also raise the salary slightly after some time.  Source: 1st hand info.",
          "score": 3
        },
        {
          "text": "heard getting accepted was difficult. went to the interview myself; can confirm i think they were either looking for people who were already cybersec literate or a prodigy. assessments leading up to it are cakewalk because they claim to accept applicants without a cybersec background. in reality i think the students they bring on might be the ones making the school. 🤷‍♀️ if you want to know more about my experience my dms are open!",
          "score": 3
        },
        {
          "text": "You sound like you have the background knowledge. What speciality you trying to go into ?",
          "score": 2
        },
        {
          "text": "Sorry what’s p200 & web300 💀",
          "score": 1
        },
        {
          "text": "Yea I have loads to learn",
          "score": 1
        },
        {
          "text": "But also, it’s not their security program I am looking at. It was their software engineering",
          "score": 1
        },
        {
          "text": "I’m not sure too but they have a support email that’s helpful.",
          "score": 1
        },
        {
          "text": "Did your friend get paid during the trainee period too? Cause that’s what’s stated on the website",
          "score": 1
        },
        {
          "text": "AMA is ask me anything session?",
          "score": 1
        },
        {
          "text": "Alright. Thank you for the info!",
          "score": 1
        },
        {
          "text": "When your under them and not attached to any company yet, your paid few hundreds per month only and have to go training etc Once your sent to other companies, your expected to work at full capacity, knowing your thing... That company can flag you out and return you back to red alpha if you perform poorly.. I personally have no good nor bad experience with them cuz I haven't worked with them closely before and they always come in few mths and surrender go back red alpha, only one was sent straight back cuz bad performance",
          "score": 1
        },
        {
          "text": "You dont need to have cyber background but need to show interest and the ability to understand concepts. Salary depends on the job you get, they can help place you using their connections. They get a cut from your salary. If you are already in IT, its not worth but if its a career switch then maybe its a good idea.",
          "score": 1
        },
        {
          "text": "It’s a career switch and I just graduated part time form Computer Engineering at TP at 29 years so I’m defo considering all my available options while applying for internships / traineeships as well",
          "score": 1
        },
        {
          "text": "I was looking at their Software Engineering program as I’d like to get into anything to do with development / programming. I’m realising my diploma was probably pretty basic and tbh I don’t really know a lot about IT industry and its available roles. Just that I like coding and creating.",
          "score": 1
        },
        {
          "text": "that is the cert from oscp that red alpha trains you to pass. yes the skull icon indeed if you had to ask. you not so ready for this industry",
          "score": 0
        },
        {
          "text": "Just go take it yourself no need RA",
          "score": 0
        },
        {
          "text": "Does a bond mean the salary remains the same for 3 years?",
          "score": 0
        },
        {
          "text": "Thank you for the info :)",
          "score": 0
        },
        {
          "text": "You get an allowance but not very high",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qufm96",
      "subreddit": "SingaporeRaw",
      "title": "Some of the images from a Cambodian scam compound raided by Thai military.",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qufm96/some_of_the_images_from_a_cambodian_scam_compound/",
      "score": 496,
      "num_comments": 92,
      "created_at": "2026-02-03T02:25:46",
      "selftext": "",
      "comments": [
        {
          "text": "Wow the SPF backdrop",
          "score": 281
        },
        {
          "text": "You know why Singapore police got the big backdrop? Coz we are the most profitable targets.",
          "score": 136
        },
        {
          "text": "Looks pretty authentic.",
          "score": 85
        },
        {
          "text": "Fr https://www.straitstimes.com/singapore/scam-victims-in-spore-lost-456m-in-first-half-of-2025-with-almost-20000-cases-reported what happens when you have a wealthy population that are like sheep because too coddled and controlled by authorities",
          "score": 74
        },
        {
          "text": "Lol the scambodian compound owned and run by ah tiongs",
          "score": 69
        },
        {
          "text": "Hun Sen clan and corrupt Cambodian politicians have been profiting from running online scam centers backed by Chinese gangs for many years, which is why online scams continue to spread across Asia. It’s quite baffling that my fellow Cambodians, instead of blaming their own government, blame the victims by saying they “deserve it.” And when Thailand and Vietnam demand that Cambodia clean up the scam problem, Cambodian netizens respond with ridiculous racist remarks and claim that the two neighbor countries are just trying to “violet Cambodia land\".",
          "score": 62
        },
        {
          "text": "Only the uniform not authentic",
          "score": 29
        },
        {
          "text": "There are many videos uploaded to YouTube where the scammer has used this same backdrop. Must be the same compound!",
          "score": 23
        },
        {
          "text": "In some ways, Asian societies seem conditioned from a young age to internalize a kind of Stockholm syndrome. The cultural emphasis on filial piety often extends beyond family, shaping mindsets to tolerate or even justify; corrupt parents or governments.",
          "score": 22
        },
        {
          "text": "How do you even get lions to form the leadership when all you have are sheep 🫠",
          "score": 16
        },
        {
          "text": "Then bring money back to SG buy shopping mall and raise rent @ Arab Street, closing down local F&B LOL",
          "score": 16
        },
        {
          "text": "It's because disposal of police uniform is really hard and improper disposal is a chargeable offence. Nobody is allowed to sell the uniform anywhere.",
          "score": 13
        },
        {
          "text": "Exactly. I genuinely believe that there should be more anti scam education including updating on latest scams via news/TG news (through a nationwide latest scam noticeboard and common scam tactics)  because Singaporeans are targeted by both the Chinese (Chinese language) and the Indian (English) twice the language to get scammed really😂 because Singaporeans offer the highest ROI (gullible x have money x trust of authorities) to these scammers.",
          "score": 12
        },
        {
          "text": "Like crime watch",
          "score": 7
        },
        {
          "text": "Yeah the 对联 and 鸿运聚财 - literally  getting wealth by scamming 😂",
          "score": 6
        },
        {
          "text": "With their money, they want to build the entire police HQ also can.",
          "score": 4
        },
        {
          "text": "When billions of dollars are leaving our shores, that’s when the govt worries",
          "score": 4
        },
        {
          "text": "ICA should interrogate all ah tiongs who deplane from Phnom Penh to Singapore flights. Most of them are scammers.",
          "score": 4
        },
        {
          "text": "I think correct, looks like",
          "score": 3
        },
        {
          "text": "Most of them are living like a millionaires, but the money they spend comes from scams.",
          "score": 3
        },
        {
          "text": "did they managed to get the correct font?",
          "score": 2
        },
        {
          "text": "the \"polis\" tho",
          "score": 2
        },
        {
          "text": "Where the lions at?",
          "score": 2
        },
        {
          "text": "The badge is correct",
          "score": 1
        },
        {
          "text": "now i am curious if there are more other than neighbourhood centres, that are just not captured",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qulii3",
      "subreddit": "SingaporeRaw",
      "title": "Our unbothered king 👑",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qulii3/our_unbothered_king/",
      "score": 317,
      "num_comments": 50,
      "created_at": "2026-02-03T07:23:46",
      "selftext": "",
      "comments": [
        {
          "text": "Kindergarten politics",
          "score": 226
        },
        {
          "text": "Still helping people regardless, all good",
          "score": 89
        },
        {
          "text": "Damn boliao exercise",
          "score": 87
        },
        {
          "text": "Because our leaders all have kindergarten mindset",
          "score": 76
        },
        {
          "text": "Can the government publish - cost of conducting the original COI, all the hearings in court, and the final 2 hours in parliament? I asked an AI chatbot, and they suggested that 2 hours of hearing in court would cost $2 million on its own! The true offense is how callous our government is in spending money for a non-issue.",
          "score": 53
        },
        {
          "text": "finally for PS  - dont need to keep seeing Useless Wong ugly face directly",
          "score": 41
        },
        {
          "text": "Same row, the view is almost the same or maybe even better. It's like sitting on the reserved seat and then shifting to one of the other non-reserved seats beside it when it's available at the next stop. Less stress but still seated.",
          "score": 39
        },
        {
          "text": "<image>",
          "score": 39
        },
        {
          "text": "The whole saga itself makes this pale in comparison",
          "score": 22
        },
        {
          "text": "Imagine all the drama and cost, just to move him 2 seats away",
          "score": 18
        },
        {
          "text": "I DON LIKE U EVEN MORE , u sit further away from me pls! --- PAP",
          "score": 16
        },
        {
          "text": "You say some more. I send you to the back then you know. Call your parents some more",
          "score": 14
        },
        {
          "text": "And if Rayeesa is actually planted.",
          "score": 9
        },
        {
          "text": "Very interesting choice of music from ST. Goes well with the clown show",
          "score": 8
        },
        {
          "text": "Petty",
          "score": 7
        },
        {
          "text": "Not the same, now Pritam Singh is seated at an angle to the PM, easier to shoot staple bullets from the side",
          "score": 6
        },
        {
          "text": "It’s natural for children to behave childishly.",
          "score": 3
        },
        {
          "text": "dont insult our kindergarten kids",
          "score": 3
        },
        {
          "text": "My fellow Singaporeans",
          "score": 3
        },
        {
          "text": "Of course she’s planted, she‘s a plant, a vegetable",
          "score": 2
        },
        {
          "text": "Even ST knows that this is a circus show. But jokes aside, I really hope the govt can seriously wake up and focus on helping the people. Many people I know are struggling and some cannot find job for a long time already.",
          "score": 2
        },
        {
          "text": "Just pap",
          "score": 1
        },
        {
          "text": "More like My fellow fake Singaporeans…",
          "score": 1
        },
        {
          "text": "\"Who who who\" are u taking about huh",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qup403",
      "subreddit": "SingaporeRaw",
      "title": "Got scolded for helping an uncle while in my gym clothes",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qup403/got_scolded_for_helping_an_uncle_while_in_my_gym/",
      "score": 70,
      "num_comments": 36,
      "created_at": "2026-02-03T11:06:50",
      "selftext": "I am shaken and super annoyed so i just need to rant here.\n\nSo i just finished my lower body day at the gym (was literally drenched in sweat lol) and was waiting for the bus home at the stop near novena.\n\ni was wearing my usual gym fit, active cropped tank top and high rise lined shorts. Anyway, this frail uncle comes up to me looking damn lost. He holds up his appointment card and asks me in Chinese how to get to tan tock seng. i could tell he was quite anxious so i spent a few mins checking the bus routes on my phone and explaining to him which stop to alight at.\n\nThen suddenly this middle-aged lady walks past, looks me up and down with the most disgusting face, and literally says out loud: \"Young girls nowadays no shame, dress like this come out and then still want to disturb old man.\"\n\nHUH??? i was literally just helping him? The uncle looked so confused and i was just stunned like vegetable. i didn't even have the energy to fight back cuz my legs were jelly from the workout, so i just ignored her, but she kept tsk-ing until she boarded her bus.\n\nLike i’m literally just existing in my gym clothes and doing a good deed? Since when did wearing a tank top and shorts become disturbing people? i feel bad for the uncle cuz he wasn’t feeling well and couldn’t explain himself and he thought he did something wrong too.\n\nReally upset. Tried to be a helpful person and still get slut-shamed by people. Apparently wearing gym clothes in public and taking to an uncle at same time is a crime now",
      "comments": [
        {
          "text": "You should reply “Old ladies nowadays no shame, don’t know how to keep their mouth shut and only know how to talk.”",
          "score": 115
        },
        {
          "text": "Siao auntie venting her jealousy, thinking she is mina sue from singles inferno",
          "score": 51
        },
        {
          "text": "“Stunned like vegetable” what is this, 2011? 😃",
          "score": 32
        },
        {
          "text": "Ask her kp what? Jealous because her own are sagging?",
          "score": 19
        },
        {
          "text": "Stop bullying us millennials T_T",
          "score": 13
        },
        {
          "text": "Tell her to stfu stand up for yourself",
          "score": 10
        },
        {
          "text": "Just an auntie with issues, nowadays siao lang many many. Don't let her live rent free in her head.",
          "score": 9
        },
        {
          "text": "Personally dont find it that attractive but objectively think cropped tops are revealing if u not exercising or at the beach though.",
          "score": 5
        },
        {
          "text": "She just jealous. You should be proud of your body.",
          "score": 5
        },
        {
          "text": "Forget it. She’s just jealous she’s  can’t even pull old uncles or XDD",
          "score": 5
        },
        {
          "text": "Just ignore the auntie. Please continue to wear what u do i like to enjoy the view",
          "score": 5
        },
        {
          "text": "Kan her back instead of posting here la",
          "score": 4
        },
        {
          "text": "Awh man that sucks, you're a good person don't let these mean aunties change you! It's obvious she has ISSUES.",
          "score": 4
        },
        {
          "text": "Auntie is mad jealous. Sorry you had to go thru this and some of the comments here are not it!",
          "score": 3
        },
        {
          "text": "Nah. Forget about her. However, nowadays the attire people wear getting more open and tighter and smaller. So the older generation has trouble adjusting.",
          "score": 3
        },
        {
          "text": "Auntie jealous lah take it as a compliment bah",
          "score": 3
        },
        {
          "text": "That's not too... wait that was 15 years ago wtf",
          "score": 2
        },
        {
          "text": "That old hag is just salty. Don't give a fk about her.",
          "score": 2
        },
        {
          "text": "Bench her!",
          "score": 2
        },
        {
          "text": "Jfl she think you trying to eat the old man tofu ah",
          "score": 2
        },
        {
          "text": "Just cause she could not even look like you 40 years ago 😂.",
          "score": 2
        },
        {
          "text": "nnp",
          "score": 1
        },
        {
          "text": "Ya la. Gym outfit is called that for a reason, just as people don't walk in the streets their swimwear",
          "score": 1
        },
        {
          "text": "Auntie is simping for uncle lah.",
          "score": 1
        },
        {
          "text": "What is sagging",
          "score": -6
        }
      ]
    },
    {
      "id": "t3_1qtygzb",
      "subreddit": "SingaporeRaw",
      "title": "To those above 50s: Have you regretted your choice regarding children?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qtygzb/to_those_above_50s_have_you_regretted_your_choice/",
      "score": 65,
      "num_comments": 42,
      "created_at": "2026-02-02T15:42:53",
      "selftext": "To those who are childfree: Do you feel lonely now that you’re older? Who helps you with 'life' stuff (tech, medical decisions, scams)? Because I realise even though my parents don’t ask me for help, I still try to assist them in navigating a world that’s moving too fast, advising them against scams, helping with complex digital/life decisions, and ensuring they aren't taken advantage of.\n\n(And the world will only continue to move even faster as we age, no matter how hard we try to keep up with it.)\n\nTo parents: Is the 'biological bond' as vital as people claim? I see some people spending years of their lives on IVF/adoption just to have a child, while others are firmly 'childfree by choice' and don't want them at all.\n\nIt makes me wonder about the long-term reality of both paths.",
      "comments": [
        {
          "text": "No regrets. I am able to take care of myself.\nEven if you have children, they might not take care of you. Life is too hard nowadays and many I know are either struggling to stay afloat or were always sprinting on the treadmill just to maintain where they are.",
          "score": 51
        },
        {
          "text": "Having to navigate the world actually keeps your mind sharp.",
          "score": 49
        },
        {
          "text": "Just curious, but how old are your parents? I am in my 50s, no kids, no regrets. But I do have a god daughter that I spend a bit of time with.Her parents divorced when she was only 1, she is 9 now. I am the defacto father figure in her life. The biological bond is overrated and is not as important as the bond you have with your love ones. My god daughter has no bond with her biological father. He is just the person that donated the sperm.",
          "score": 29
        },
        {
          "text": "Not 50 but i believe this is not the right framework to have kids.",
          "score": 24
        },
        {
          "text": "Yup even if one have children, they might be busy with their own lives or even have their own family to take care off... At most, the children might visit you once a week. Some children can be good or bad when growing up too/ not forgetting one might have physical or mental issues as well...",
          "score": 13
        },
        {
          "text": "This is like me arguing with my kid about \"hey, don't pick that flower\" in the park when they come up on a nice row of flower plants. \"But Daaaddd, we only take one, and there are so many!\". \"Yes, but if every kid takes one, soon, there will be no flower left, so no, you are not getting that flower\" There are choices that makes sense on a personal level, at a specific time, because of the context at the time. When the choice is scaled to a large number of the population and the time changes, the reality is changed in fundamental ways. People have fewer children now, 30 years later, there is a shortfall in aged care nurses to care for old people, which often mean you need to recruit foreign nurses, and all the associated arguments around it. Choices have consequences. My answer is simply: whatever choice I make, I don't regret it. Ever. No matter the outcome. Own your choice. If you choose to have to have or not to have children, don't regret it either way. There's really no point in optimising and \"studying/researching\" the optimal way forward. I've seen people being killed by their children. I've seen people living in miserable poverty or relative comfort because they had no children. I've seen people only escape miserable poverty because they have children. The more you believe or hope that your choice is the optimal one, the greater the disappointment.",
          "score": 12
        },
        {
          "text": "I’ve been thinking a lot lately. As a Singaporean, how do you define the meaning of life if you don’t get married or have kids? Is working your whole life just to pay bills and a mortgage, while only taking 21 days of annual leave a year to travel, really meaningful? I’m not being sarcastic — this is something I’ve genuinely been asking myself. I’m past 35 now, still considering whether to have a child outside of Singapore, and I’ve just finished paying off my mortgage via CPF. My personal view is that everyone defines their own meaning of life. But honestly, it feels especially hard to find one here. I don’t want to end up financially secure yet emotionally empty, living alone in a retirement village. Life has to be more than what the Singapore system offers, and I’m willing to search for it elsewhere.",
          "score": 7
        },
        {
          "text": "Can't quite see why you would frame the problem as Singapore/Singaporean problem. Sure, Singapore is not perfect - it is not cheap, it is small etc. But at the same time, the median Singaporean is financially better off the median person in most countries. And that financial ability gives you options. A lot of people don't have kids and don't get married and still pursue their dreams and chart alternative paths here. There's social norms in every part of the world, perhaps the norm to have kids/married is stronger in Singapore. But you don't have to conform to norms.",
          "score": 5
        },
        {
          "text": "Nowadays those people with no children tend to have cats and dogs instead.",
          "score": 4
        },
        {
          "text": "That’s just an easier route with fur babies, because raising real kids to be good and loving is much harder than pets.",
          "score": 3
        },
        {
          "text": "Yes, it is easier but ultimately having kids is a personal choice.  People who chose to have kids, chose the harder path THEMSELVES, so they shouldn't begrudge those who didn't. Parents who look down on childless couples makes me think that they (the parents) actually regret having kids.",
          "score": 3
        },
        {
          "text": "Haven’t reach that stage yet but can’t be forced, have kids is good but don’t expect too much from them, they have their own problems and issues to tackle from their era as well",
          "score": 3
        },
        {
          "text": "All the more, seniors need to remain active, mentally or physically. Frailness in the body and mind, really starts with inactivity rather than age.",
          "score": 2
        },
        {
          "text": "If you have a kid, it's going to be another routine as well. And btw you'll also be introducing this kid to this grind too. Having no kids at least gives you the freedom to pursue your own passions , drop everything and take a hiatus etc .",
          "score": 2
        },
        {
          "text": "Only to a certain extent, cuz humans can’t live indefinitely",
          "score": 1
        },
        {
          "text": "Yes, but active seniors remain independent longer sometimes beyond expectations.",
          "score": 1
        },
        {
          "text": "I get your point — Singapore does give us stability and options, and I don’t dismiss that. But for me, it’s not just about money. The system here feels very geared towards one path, and even if you don’t follow it, the pressure is hard to escape. End of the day, when I’m on my death bed, the question I’ll be asking myself is whether my life was truly meaningful. At least with kids, I’d know my legacy continues — and that’s something beyond material wealth alone.",
          "score": 1
        },
        {
          "text": "you legacy lives on regardless. in the form of atoms",
          "score": 1
        },
        {
          "text": "LOL. Ya the universal must always remember you in another form",
          "score": 1
        },
        {
          "text": "How selfish, placing pressure on your kids to bring meaning to your life. And when they grow up and realize that they too are stuck in this meaningless rat race, does that make you fulfilled as their parent?",
          "score": 1
        },
        {
          "text": "Read carefully — I didn’t say I want to have kids in Singapore. I understand where you’re coming from, but I’ve also faced the pressure of grinding in the corporate rat race for 10 years just to finish paying off my mortgage. I didn’t enjoy it, and I don’t intend to keep living that way until I’m 50 or 60 like most of my friends. They’re stuck in that cycle because of their own lifestyle choices. Of course it feels like a meaningless rat race when you can’t afford to have kids — your whole life becomes just working to pay bills and the mortgage until old age. I didn’t make that mistake. I married a foreigner and already had the chance to build something for myself abroad, with no commitments in Singapore other than caring for my aging parents. Meaningless rat race? Not for me. If I do have kids, I’ll make sure I have assets and businesses to pass down so they can choose their own path in life — something I feel is harder to do in Singapore.",
          "score": 1
        },
        {
          "text": "I am the lord of my own future, the captain of my own destiny, and the master of my own path!",
          "score": 1
        },
        {
          "text": "But not many people can keep up with it given aging and declining brain capacity",
          "score": 0
        },
        {
          "text": "What is the right framework to have kids in your view?",
          "score": 0
        },
        {
          "text": "Although having pets is as costly as having kids (especially with no subsidies for fur babies), pets satisfy people's maternal and parental instinct. They also reciprocate your affections towards them ALWAYS unlike kids.",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qun5un",
      "subreddit": "SingaporeRaw",
      "title": "Prediction of the upcoming new-norm.",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qun5un/prediction_of_the_upcoming_newnorm/",
      "score": 60,
      "num_comments": 21,
      "created_at": "2026-02-03T09:06:37",
      "selftext": "",
      "comments": [
        {
          "text": "Blardy worse their dirty rag drips water into your other plate of food",
          "score": 18
        },
        {
          "text": "wa i feel a bit peeved while making this meme. alot of folks will be gathering at hawker center trying to get your empty cans like vultures.",
          "score": 13
        },
        {
          "text": "<image>",
          "score": 9
        },
        {
          "text": "If they ask politely sure. If they hover or are rude about it, I'll just keep the can.",
          "score": 7
        },
        {
          "text": "Blardy worse their dirty Rag drips water into your Other plate of food - Downtown-Top-6603 I detect haikus. And sometimes, successfully.Learn more about me. Opt out of replies: \"haikusbot opt out\" | Delete my comment: \"haikusbot delete\"",
          "score": 4
        },
        {
          "text": "What lj?",
          "score": 4
        },
        {
          "text": "all the uncles will be forming CAN DRINK TRIAD!! GIVE ME UR CAN DRINK ! MY TERRITORY!! bLABLA",
          "score": 3
        },
        {
          "text": "Sad af for the 2nd or 3rd richest country in the world doing this for 10 cents",
          "score": 3
        },
        {
          "text": "Fucking worst their armpit actually DRIPS into the fucking drink as a combo to enhance the IncredibleTM taste",
          "score": 2
        },
        {
          "text": "They'll drip it on/in your can to make sure you ain't touching whatever is left. *inspired by that one time a cleaner grabbed the styrofoam plate with her plastic gloved hands while there were still chicken wings on it while asking us if we still wanted it.",
          "score": 2
        },
        {
          "text": "You will see folks hoarding the reverse vending machine like yesteryear. Some people are just too bored.",
          "score": 2
        },
        {
          "text": "bring own water bottle👍💓⭐",
          "score": 2
        },
        {
          "text": "It applies to cans and bottles. So everyone is a target now. Just buy packet drinks.",
          "score": 2
        },
        {
          "text": "Remind me of the usual 喝完 喝完, except it’s elderly asking you.",
          "score": 2
        },
        {
          "text": "Ill tell anyone asking me for mine before I finish drinking to kindly fuck off",
          "score": 2
        },
        {
          "text": "Only scholars can concoct this kind of lanjiao scheme",
          "score": 2
        },
        {
          "text": "Really lousy implementation sia. Knn",
          "score": 1
        },
        {
          "text": "Or some old birds with no real life experience apart outside of government environment.",
          "score": 1
        },
        {
          "text": "I predict there will be fights.",
          "score": 1
        },
        {
          "text": "10 cents leh, dont play play",
          "score": 1
        },
        {
          "text": "Fighting Can championship",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qumslm",
      "subreddit": "SingaporeRaw",
      "title": "Apology level we must all aspire to.. 🤣🤣👏👏",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qumslm/apology_level_we_must_all_aspire_to/",
      "score": 53,
      "num_comments": 19,
      "created_at": "2026-02-03T08:43:19",
      "selftext": "",
      "comments": [
        {
          "text": "<image>",
          "score": 32
        },
        {
          "text": "Chad volleyball player apology vs chao sng  bbfa sinkies apology Which one do you think will be more sincere lol",
          "score": 14
        },
        {
          "text": "Get over it lmao. They have more than paid back via jobs creation for sinkies through FDIs by their MNCs.",
          "score": 6
        },
        {
          "text": "Meanwhile… some puki face in SG does the opposite. Instead of apologizing she doubled down being a pukimak",
          "score": 4
        },
        {
          "text": "And they dated and got married...",
          "score": 4
        },
        {
          "text": "jopon is da bestttttt",
          "score": 4
        },
        {
          "text": "That's their burial ground.",
          "score": 4
        },
        {
          "text": "i mean the japanese bowing etiquette is pretty symbolic by itself but no doubt nishida was being dramatic here",
          "score": 2
        },
        {
          "text": "Olympic level apology. If more Singaporeans like him, less rage issues.",
          "score": 2
        },
        {
          "text": "Apology Olympics you say?https://www.youtube.com/watch?v=XspDkqEtWFE",
          "score": 1
        },
        {
          "text": "🤣🤣🤣🤣🤣",
          "score": 1
        },
        {
          "text": "World Champions at it again",
          "score": 1
        },
        {
          "text": "https://www.youtube.com/watch?v=XspDkqEtWFE",
          "score": 1
        },
        {
          "text": "HELL NOO",
          "score": 1
        },
        {
          "text": "🤣🤣🤣🤣",
          "score": 1
        },
        {
          "text": "Done. Many times.",
          "score": 0
        },
        {
          "text": "continues to enshrine war criminals",
          "score": 0
        },
        {
          "text": "Apologize for 1942😠",
          "score": -1
        },
        {
          "text": "Ya came here to say this",
          "score": -1
        }
      ]
    },
    {
      "id": "t3_1qugo91",
      "subreddit": "SingaporeRaw",
      "title": "Pritam Singh moved to new seat in Parliament after removal as LO",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qugo91/pritam_singh_moved_to_new_seat_in_parliament/",
      "score": 52,
      "num_comments": 47,
      "created_at": "2026-02-03T03:12:28",
      "selftext": "",
      "comments": [
        {
          "text": "All these fuss just to change seats at the end, lol",
          "score": 108
        },
        {
          "text": "If you had worked in civil service you will know its not exactly uncommon. 😅",
          "score": 42
        },
        {
          "text": "This government is a joke lol",
          "score": 36
        },
        {
          "text": "They probably had multiple meetings to discuss too lol",
          "score": 35
        },
        {
          "text": "Probably formed a few committees, task forces and had many rounds of inter-departmental meetings and tabletop exercises first",
          "score": 34
        },
        {
          "text": "“Cher! He change place!”It’s what this feels like…",
          "score": 31
        },
        {
          "text": "Ng Chee Meng sits opp David Neo! 😂",
          "score": 21
        },
        {
          "text": "Base on Westminster system, opposition party leader always sit directly opposite PM. Looks like our politics hasn’t matured",
          "score": 17
        },
        {
          "text": "Genuine question - why are WPs MPs seatings so disbursed ? Even NMPs seatings are clustered.",
          "score": 14
        },
        {
          "text": "Just to be safe, a Feng shui master was invited to offer opinions.",
          "score": 11
        },
        {
          "text": "LTK had no title and he sat directly opposite of Lee Hsien Loong . This is BullSheet.",
          "score": 11
        },
        {
          "text": "So can't sit together and gang up lo",
          "score": 11
        },
        {
          "text": "Answer based on:https://www.straitstimes.com/singapore/politics/singapore-parliament-releases-seating-plan-for-15th-term-find-out-who-is-sitting-where But I guess it's not a bad thing, allow people from different parties to mingle a bit.",
          "score": 8
        },
        {
          "text": "This is what the PAP says - copy the good from Westminster, reject the bad, but in practice it's copy what doesn't weaken it, reject what strengthens the other side. https://www.parliament.uk/about/mps-and-lords/members/partysystem/ \"MPs from the same party tend to sit together in the House of Commons chamber.\"",
          "score": 8
        },
        {
          "text": "Doesn’t matter 80% of the seats are usually empty  anyway",
          "score": 7
        },
        {
          "text": "Bo liao. Who’s in the seating task force?",
          "score": 7
        },
        {
          "text": "<image>",
          "score": 6
        },
        {
          "text": "65% of even bigger jokes and clowns voted for them, unfortunately!",
          "score": 5
        },
        {
          "text": "Do you know if party members in other parliaments (eg. Malaysia) get to sit together?",
          "score": 3
        },
        {
          "text": "Well pap as a party certainly hasn’t matured",
          "score": 2
        },
        {
          "text": "Task force man.. who else lol",
          "score": 2
        },
        {
          "text": "So Christopher de Souza is now LO? Doesn't make sense right",
          "score": 1
        },
        {
          "text": "I don’t make the rules lmao",
          "score": 1
        },
        {
          "text": "No more title so move him lor. Really follow the letter of the law.",
          "score": -3
        }
      ]
    },
    {
      "id": "t3_1quo36a",
      "subreddit": "SingaporeRaw",
      "title": "Yar call out the riders",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1quo36a/yar_call_out_the_riders/",
      "score": 46,
      "num_comments": 23,
      "created_at": "2026-02-03T10:05:43",
      "selftext": "",
      "comments": [
        {
          "text": "so is anybody going to launch an investigation to verify if her story is true?",
          "score": 45
        },
        {
          "text": "Can she backed up her account of her story? Or its jus something she pulled out from thin air? MHA needs to check on all the cctvs to verify her story to prevent another lie being told in court. *I am not a pmd/PMA user. I walk fine. I am totally against the use of mobility devices by able bodied users. I jus want the rules to be applied equally to all parties.",
          "score": 22
        },
        {
          "text": "she not opposition of course won't la.",
          "score": 12
        },
        {
          "text": "Yes please, need enforcement action on such riders. Another group of riders would be delivery riders - whom zoom in and out of traffic at their convenience and at traffic junction.",
          "score": 10
        },
        {
          "text": "Don't need cuz she never accused govt body. If she said she saw LTA officers not bothering them that one will kana",
          "score": 3
        },
        {
          "text": "Eww",
          "score": 2
        },
        {
          "text": "Nope",
          "score": 1
        },
        {
          "text": "Full enforcement only starts in 2029. Good luck. Haha she say it was fortunately the only time but also say witness many instances? Pick one.",
          "score": 1
        },
        {
          "text": "Knn this one many wayang",
          "score": 1
        },
        {
          "text": "Talk in Parliament got use meh? Do something about it, take action.",
          "score": 1
        },
        {
          "text": "I like what is coming out of her mouth.",
          "score": 1
        },
        {
          "text": "They should be banned",
          "score": 1
        },
        {
          "text": "Spent time and effort writing that crap down and i wonder how many times she practised in front of the mirror before. Lame. If only they bother to put actual effort into their MP duties instead of acting using well-rehearsed scripts.",
          "score": 1
        },
        {
          "text": "Next up on the agenda should be tougher drug/traffic laws",
          "score": 1
        },
        {
          "text": "I have also seen people who do not look disabled ride PMDs. Worse when they take their PMDs inside public transport, inconveniencing other commuters including people who are truly disabled.",
          "score": 1
        },
        {
          "text": "😍😍😍😍",
          "score": 1
        },
        {
          "text": "Lol it's true lah.i don't doubt. But what's the big deal of her seeing it \"personally\" or \"chase them down\"? Or the need to \"illustrate\"? She knows it's 1 example. She verified \"able bodied\"?  Don't need to make yourself look good. Don't need to say anything of that. This is not good quality.",
          "score": 1
        },
        {
          "text": "Gosh",
          "score": 1
        },
        {
          "text": "Lol. Well she didn't undermine trust in the law enforcement.",
          "score": 0
        },
        {
          "text": "mdm i stop4u even if i nt ridin pmd💓",
          "score": -1
        },
        {
          "text": "fake story, no cctv meh",
          "score": -1
        },
        {
          "text": "Keep on driving the conflict between the riders/cyclist and pedestrians when the root cause is the government and LTA continually refusing to build proper, seperated and protected bike lanes.",
          "score": -2
        },
        {
          "text": "Hot",
          "score": -5
        }
      ]
    },
    {
      "id": "t3_1qtw46g",
      "subreddit": "SingaporeRaw",
      "title": "Space Force - National Space Agency of Singapore (NSAS) coming 1 April 2026",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qtw46g/space_force_national_space_agency_of_singapore/",
      "score": 41,
      "num_comments": 62,
      "created_at": "2026-02-02T14:12:48",
      "selftext": "",
      "comments": [
        {
          "text": "Hello Yishun, we have a problem… :)",
          "score": 40
        },
        {
          "text": "Is this a joke? ffs",
          "score": 35
        },
        {
          "text": "so many problem never resolve yet rather go and chase the moon",
          "score": 30
        },
        {
          "text": "Knn this guy wayang. Worked with him before, all talk no action",
          "score": 23
        },
        {
          "text": "April Fool's Joke",
          "score": 18
        },
        {
          "text": "Can I do ns in nsas",
          "score": 15
        },
        {
          "text": "lmao, as long as it doesn't affect my CDC vouchers. I see them scrape this within 5 years.",
          "score": 13
        },
        {
          "text": "Since you asked... <image>",
          "score": 9
        },
        {
          "text": "Sounds more like a money pit and total waste of taxpayers money. 65% asked for it, what to do? :)",
          "score": 9
        },
        {
          "text": "Cannot even do well in his current portfolio to ensure jobs for  locals now wanna do space?",
          "score": 8
        },
        {
          "text": "sinkies gg2d🌕👍❤️⭐🚀YEAH!",
          "score": 7
        },
        {
          "text": "Fuck that, can I sign on nsas",
          "score": 6
        },
        {
          "text": "his space agency is plan the \"space\" for 10m pop",
          "score": 4
        },
        {
          "text": "SG shld have SG style - Eh Yishun, dai ji dua tiao la, over",
          "score": 3
        },
        {
          "text": "I say but you don't listen",
          "score": 3
        },
        {
          "text": "Nah sg space agency is way too huge. Remember jteo said we only need a small space ?",
          "score": 1
        },
        {
          "text": "This is for property and car and food prices right?",
          "score": 1
        },
        {
          "text": "wait til ur cdc vouchers stay the same while your grocery prices increase and you pay 12% gst",
          "score": 1
        },
        {
          "text": "Sign on nsas lor. At least can suck on the taxpayer teat.",
          "score": 1
        },
        {
          "text": "Maybe to space those who don't fit into the high net worth or foreigner narrative, put on a one way trip to orbit.",
          "score": 1
        },
        {
          "text": "To have secks in small \"spaces\" T. Josephine Teo",
          "score": 1
        },
        {
          "text": "He's done pretty well, woudnt you say? haha",
          "score": -7
        }
      ]
    },
    {
      "id": "t3_1qtxvr1",
      "subreddit": "SingaporeRaw",
      "title": "Is this racism?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qtxvr1/is_this_racism/",
      "score": 31,
      "num_comments": 72,
      "created_at": "2026-02-02T15:20:50",
      "selftext": "for context, my Indian friend is having a hard time at his intern. he was said to have body odour although it went around as a gossip before he came to knew it, his bosses asked to see birth certificates of his family members to check if they are locals in a unrelated context, and his bosses told him not to shoplift when they went out to buy stuff.\n\nwhen he flagged this verbally they said it’s a joke and he’s sensitive. (they added they would have said this to another minority group too…)\n\nthen he wrote and, his bosses said this isn’t racism. they said it might be insensitive but not racism and warned him to be careful with his words.\n\nto me, it sounds like he’s on the right and they are gaslighting him.\n\nthey even told him that there will be grave consequences if he flags this even higher such as to the ethics line / HR as his case isn’t strong, not enough examples to prove his point. they said by raising it people may sympathise but nothing more.\n\nthey threatened and asked if he wanted to be made a full timer as he’s a trainee.\n\nto add, they said that he should stop pulling the victim and race card. they said his performance is poor and any feedback on his performance is not due to his race, it’s because he’s poor at his job. apparently others were scolded more for their performance and his bosses said they are harsh to everyone, there’s no disparity.\n\nhe was questioned that other Indians are not treated that way so it’s unfair for him to put forth such an allegation. but my friend is still treated badly, he’s not sure why, but he’s the quiet type that doesn’t confront.\n\nso what actually counts as racism?",
      "comments": [
        {
          "text": "his bosses told him not to shoplift when they went out to buy stuff. That's rude af regardless of race.",
          "score": 79
        },
        {
          "text": "Which company and department. Please spill",
          "score": 70
        },
        {
          "text": "He needs to collect all evidence in either writing or recording smartly. Then submit to HR without losing it. E.g. he can record the superior under reason that he is forgetful, as the boss constantly picks on him so he wishes to improve and record the instructions. Report to his school on this matter (not HR).",
          "score": 46
        },
        {
          "text": "This ^ . Nowadays online spilling of tea is the best way to bring about justice for him unfortunately.",
          "score": 37
        },
        {
          "text": "Ppl ask for company name. You don’t want to give. How to help? Just wasting everybody’s time.",
          "score": 17
        },
        {
          "text": "As long as there's no company name, I'll assume it's friction. Because u post here also useless.",
          "score": 14
        },
        {
          "text": "Is this mnc or SME? If mnc, can report to hr/ ethics hotline etc for bullying / microaggression. if SME, shit out of luck. Start finding new job",
          "score": 13
        },
        {
          "text": "What company is this ?",
          "score": 13
        },
        {
          "text": "actually i kena this nonsense before. the key is to have a mobile phone recording voice everyday in office, u bring a charger and just charge it put at ur desk next to you. if u can download those secret video recording even better. its to record all the evidence. if he has evidence he needs to file complaint to hr and cc ceo now. he should file a police complaint also. all the just joking is just an excuse by them, they are actually bullying him, if they want to joke, there are so many unoffensive jokes. they can save the explanations to HR or police and see if they buy it. if this is me today, i would simply walk into a police station and file a complain and cc it to HR and CEO. whether got evidence or not dont matter. i would let them investigate. of course i would be prepared to lose my job.",
          "score": 12
        },
        {
          "text": "HAH typical racists trying to boy someone into submission and compliance. Just whack and whack hard. Burn the bridge. Don't care about becoming full timer. Why you wanna work for racists anyway.",
          "score": 9
        },
        {
          "text": "Should’ve just went with it. “With this pay my boss offered? How not to shoplift bro”",
          "score": 7
        },
        {
          "text": "Agreed",
          "score": 7
        },
        {
          "text": "“Please don’t shoplift” this sounds like a Malaysian stereotype ley. SG since when got this kind of stereotype about Indians",
          "score": 5
        },
        {
          "text": "I don't want Lipton! I want TWG!",
          "score": 4
        },
        {
          "text": "Why just private sector? Public sector also got a lot of this nonsense",
          "score": 4
        },
        {
          "text": "Diam lah slart. Don’t want give then don’t ask.",
          "score": 3
        },
        {
          "text": "Even if it's not specifically racism, it's still bullying since they're singling him out and mocking him.",
          "score": 3
        },
        {
          "text": "Those bosses sound like those old-fashioned unworldly type of folks who like to gossip and play on stereotypes that are already outdated now in the 21st century. Like those uncles aunties old types of people who haven't been around much. It's bullying and micro-aggression even if they don't specifically mention race. He's being singled out and mocked.",
          "score": 2
        },
        {
          "text": "he wrote what was said verbally to his superiors as feeling singled out due to race, and citizenship. they said he needs to be careful with his words, warned him about how serious this is and how it wouldn’t stand before the court or whatever deciding authority it is. and that this warning isn’t to stop him from flagging up but for his own good.",
          "score": 2
        },
        {
          "text": "Oh that's good actually",
          "score": 1
        },
        {
          "text": "I did it many times with companies I despise. Nea. Lonza. Ncs. To name a few.",
          "score": 1
        },
        {
          "text": "his superiors said this isn’t racism, as it doesn’t fall under a few stereotypes they listed which is racism to them",
          "score": 1
        },
        {
          "text": "Go to Glassdoor and review bomb",
          "score": 0
        },
        {
          "text": "If he gives, what will you do with it? Or just wanna kaypo only ?",
          "score": -1
        },
        {
          "text": "why should give you company name? Who are you, police? Where in the post did he ask you for help? The question was \"is this racism\". How much of your time was wasted for you to be this passive aggressive?",
          "score": -12
        }
      ]
    },
    {
      "id": "t3_1qukxwv",
      "subreddit": "singaporefi",
      "title": "Car ownership: How do you guys do it? It's like a mystery to me.",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qukxwv/car_ownership_how_do_you_guys_do_it_its_like_a/",
      "score": 91,
      "num_comments": 200,
      "created_at": "2026-02-03T06:50:40",
      "selftext": "40+m here. My family, we have a car. It's kinda old now, paid most of it in cash (gift from FiL). Bought it at 90k in 2018. We're now shopping around for a replacement. But everywhere I turn, the prices are just ridiculous. After doing some calculations, we simply can't afford it, even though our combined income is at the HDB ceiling already. I thought of doing some of those 0 downpayment, driveaway deals. But the monthly payments are INSANE. We have to pay for ABCDEFG, tuition, bills, etc... There's nothing left to pay for car.\n\nTLDR; How do y'all afford a car in SG on a regular white collar salary?",
      "comments": [
        {
          "text": "alot of people who bought their cars in 2018-2020 pretty much accepted that they won't be getting a new one once coe ends",
          "score": 172
        },
        {
          "text": "Combined income isatHDB income ceiling? So HHI of $14k? Based on the fact that you're paying for tuition you have at least one school-going child (which probably means you've still got to save for their college education). In your 40s so you're quite near your career/earnings peak statistically speaking. Idk, seems kinda tight to me.",
          "score": 51
        },
        {
          "text": "not a very good car if it itches when you sit inside",
          "score": 33
        },
        {
          "text": "sure but it's more of the shock that the price you paid for the entire car back then will be a fraction of the current coe alone. had a good run time to take public transport lol.",
          "score": 28
        },
        {
          "text": "Can extend the COE for another 5-10 years? (Even that is crazy)",
          "score": 22
        },
        {
          "text": "SL_ plater here. We are also entertaining the thought of going carless after coe expiry",
          "score": 13
        },
        {
          "text": "Got 2 kids actually. Yah also have to save for Uni. Very very tight man.",
          "score": 13
        },
        {
          "text": "Unfortunately, at your age that means your HHI is simply not high enough to afford a car anymore. If you were 10 years younger at 14K HHI with future salary progression expected, plus small kids who really need ferrying, long way to go before uni, then the car might make more sense. But if you need to choose between tuition for your kids vs car, you know which one you should drop.",
          "score": 13
        },
        {
          "text": ":(",
          "score": 10
        },
        {
          "text": "Yes imagine my coe was only 25k in 2018/2019.. The down payment was ok ok.  My monthly payments were only about $500. Now the cheapest new car model is about $150k. Downpayment is about 60? And monthly payments $1.2. .. omg",
          "score": 9
        },
        {
          "text": "Model Y is 200+++. The reason why I went to think about it cuz over the weekend we saw car roadshows everywhere lolol... then sit inside those new cars, backside got a bit itchy.",
          "score": 7
        },
        {
          "text": "well, you know the condition. renew for 10 years is the answer. unless you feeling rich and itchy then by all means. but the price is clear and you choose what you want to pay",
          "score": 6
        },
        {
          "text": "Yeah I thought of that also. Our car is actually in very good condition. But dat COE is like... bleargh",
          "score": 4
        },
        {
          "text": "😂😂😂😂",
          "score": 3
        },
        {
          "text": "Yahh... exactly.,,, oh well.",
          "score": 3
        },
        {
          "text": "yah man...",
          "score": 2
        },
        {
          "text": "Yeah, drop your kids\n/s",
          "score": 2
        },
        {
          "text": "Wanted to go in at 2020",
          "score": 1
        },
        {
          "text": "200k for the model y. Slightly cheaper for a model 3",
          "score": 1
        },
        {
          "text": "if its a japanese car, just renew COE. it brings down the overall depreciation by a ton and its like almost a guarantee it will survive the next 10 yrs",
          "score": 1
        },
        {
          "text": "I think no choice liao",
          "score": 1
        },
        {
          "text": "Parent of 3 and your conclusion is the same as mine. It’s certainly a huge luxury to own a car, but one that I simply can’t afford. We live modestly but there is not enough leftover to afford one. And it’s not even close.",
          "score": 1
        },
        {
          "text": "yah sian...",
          "score": 0
        },
        {
          "text": "For someone out of the loop, how much would a new basic Tesla + 10y CoE cost in 2026?",
          "score": -2
        },
        {
          "text": "I have had a Tesla for 6 years (america), no seat issues. I think he forgot to wipe.",
          "score": -6
        }
      ]
    },
    {
      "id": "t3_1qtxukc",
      "subreddit": "singaporefi",
      "title": "Mid-career burnout(?) and thoughts on stepping away from corporate life - seeking perspectives",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qtxukc/midcareer_burnout_and_thoughts_on_stepping_away/",
      "score": 53,
      "num_comments": 38,
      "created_at": "2026-02-02T15:19:37",
      "selftext": "Have been a long-time lurker on Reddit, and it’s oddly comforting to see that many here share similar thoughts around work, burnout, and financial independence.\n\nI graduated from a local uni about 9–10 years ago and have been working full-time since, across several companies. I’m thankful that I’ve not faced unemployment — I always had another offer lined up before tendering, typically taking a short 1–2 month break between roles, clearing my ALs for self love.\n\nOver the past few months though, I’ve been feeling increasingly drained and unmotivated, with a fair bit of anxiety whenever the next day is a working day. It feels like there’s no clear “end point” to corporate life, unlike schooling where timelines were always defined.\n\nLately, I’ve been seriously considering stepping away from the corporate world after a few more years, perhaps take on a few months OR a year or two of break. Thereafter, possibly to pursue something more flexible (“own time, own target” - unfortunately I don’t have a concrete plan yet).\n\nThe main reason for staying on a few more years in the corporate world would be to build a larger buffer and investment portfolio, ideally one that can cover a good portion (or all) of my monthly expenses via passive income. That way, I feel that I will be less anxious about leaving my job at that point of time.\n\nWould appreciate perspectives from those who’ve done something similar:\n\nBefore leaving, did you aim for a specific portfolio size or expense multiple for peace of mind?\n\nHow old were you when you made the move?\n\nDid you eventually return to a full-time corporate role, or transition into something else?\n\nSeeking advice and shared experiences only — not looking to be flamed. 🙏 Thanks in advance.",
      "comments": [
        {
          "text": "IMO if you're spending months on end hating your job, being drained, and being unmotivated, I would say go for it if you can financially afford it. As the other commenter said, do make sure you have your ducks in a row for your financial commitments for the few months that you want to take a break. Set a timeline for yourself, take a break, find out what motivates you beyond the corporate life. After all, we work hard so that we can give ourselves some buffer when we can afford them. The catch though is that we ARE unfortunately in a period where it's difficult to find a job. If possible, try and make sure you have your connections fresh as well for when you need to/are ready to enter the workforce. In the current climate, internal recommendations do go a long way. All the best!",
          "score": 33
        },
        {
          "text": "Me! Mid 30s, I'm currently on a career break since beginning of 2025. Been working for around a decade. Just like you, I was also burnt out. The idea was to take a one year break but I'm still on a break now, extending for another six months. It's been great. My mental health is so much better now. I'll be searching for a new job from mid-2026 when I return to SG. My advice is, go for it since you've been working for a decade as well. But make sure you have enough finances to tide through for a year. If one year sounds scary, try six months and maybe can extend later. Are you staying in your own home? Rent it out. If you're staying with your folks, perhaps can also consider renting out your room for a year for passive income. I didn't have any passive income so I had to make sure my finances were in place. I intend to do career break every 10 years or so to recharge myself. So the next planned career break might be somewhere in 2035. Hopefully by then, I have my own house and already MOP-ed so I can rent it out for passive income for my next career break. If not now, then when? Again I'll say this - keep your finances in check. All the best.",
          "score": 25
        },
        {
          "text": "Early 30s - had nothing much saved when I decide to quit my job. What I’ve come to learn is that the grass is not greener on the other side. When I had a job, I wanted a break. While I was unemployed, I wanted a job. Just know that the pasture on which you lie is equally as comforting as long as we stay still in the present. I wouldn’t say my unemployment was for nothing. I learnt much about myself and now I’m more at ease staying in the now",
          "score": 13
        },
        {
          "text": "In my early 40s, and was in a five figure per month, middle management position before stepping away. I have not held a full time job since June 2025. My take on this is that your mindset can shift through different seasons of your life, and you may want to take an extended break to figure out what you want. I don’t think I will be going back to FT work this year unless I find a unicorn type of job. I have paid off my housing and don’t have any dependents ($ wise), so just bear that in mind for your own forward planning.",
          "score": 9
        },
        {
          "text": "Emergency buffers aside, make sure your mortgage, if any, is not due for renewal during your break. You will need to show income before the renewal so your break will need to end at least 4 months before the time to submit documents.",
          "score": 7
        },
        {
          "text": "apart from aiming for a target investment portfolio, you can also consider aiming to acquire new niche tech skills. these skills are what u rely on if u want to escape the corporate world. then u can start your own thing, become consultant, do short term gigs, basically generate cash without being someone's office slave",
          "score": 6
        },
        {
          "text": "Thanks for the reminder that we work hard so we can give ourselves some buffer when we can afford them. I totally agree with it yet somehow not having the guts to take a leap of faith despite planning my financials! Thanks for the advice too, will focus on building my connections as well. As an introvert, it can be challenging as well maintaining and building connections in the workplace but I am trying!",
          "score": 5
        },
        {
          "text": "Hi! I work in social services sector.",
          "score": 5
        },
        {
          "text": "I was just suggesting. I used \"perhaps can consider.\" You know, there's no need to comment in such a tone. Be nice.",
          "score": 5
        },
        {
          "text": "Thank you for sharing your own experience! I presume you saved and invested regularly in your early 20s and 30s and was able to build a decent portfolio that made you confident to step away? If you don’t mind sharing, how much was your portfolio that gave you the leap of faith? And yes, I am feeling hesitant as I have yet to purchase my own housing and may be looking at doing so with my partner over the next few years.",
          "score": 4
        },
        {
          "text": "Just change job and stay employed. I have seen a lot of mid career break ends badly, and especially in this job or lack of jobs climate and high inflation.",
          "score": 3
        },
        {
          "text": "Out of curiosity, what’s your profession? Not that it matters but just would like to know",
          "score": 2
        },
        {
          "text": "My total is 1 mill with CPF. I don’t intend to keep that locked up until my last day. I’m not ruling out going back to the workforce and am prepared to consider retiring in a LCOL country in south east Asia. Am not a “Singapore is the best place to live in forever” type. Am also expecting some form of inheritance from the parents, sorry to be blunt about that. Going by certain metrics, even retiring with 5 million is not enough for some people. It’s what you want or expect from life that matters.",
          "score": 2
        },
        {
          "text": "Have also thought about the skill sets that I can pick up for freelance work! Not too sure where to start so I have been speaking to ChatGPT daily when I’m free to gain knowledge 😂 any suggestions if you had prior experience?",
          "score": 2
        },
        {
          "text": "Thanks for the advice! Yes this is too what I am afraid of, especially when I do not have a fully paid up housing currently.",
          "score": 2
        },
        {
          "text": "I was 36 before pulling the trigger to FIRE. Enjoyed full FIRE lifestyle for 1+ years. Recently transitioned to Barista-FIRE as I was called to serve in church full-time (am paid a \"salary\", but don't need it). Before FIRE-ing, do your homework and make sure you have enough to cover your monthly expenses (do up a detailed budget). This includes insurance coverage for worse case scenarios. Make conservative assumptions about your expected rate of return and be realistic.",
          "score": 2
        },
        {
          "text": "It really depends of what you value in life. If you were to take a break for years, then you have to consider a. You may not be able to get a new job of the same or higher title and pay because of the disconnection to the industry. Previously you will be able to secure a new job before resigning because there is no year gap. b. You will be depleting into your savings for the time when not working. So ensure that you have enough. c. There will be stop contribution for CPF as well when you stopped working. So have you save enough for the housing years later? Prices of housing are increasing every year. d. In mid 30s, usually should be at least a middle management now. As climbing up the corporate ladder, the higher the position, the openings are more scarce. A break may break the momentum. Another approach will be, forget the gap year, work and retire early. e. You mentioned you have been spending $15k annual travelling. Perhaps you can cut down on it and invest the rest. f. When feeling increasingly drained and unmotivated, is because you have a lack of bigger goal to achieve from work, satisfactionary and financially.",
          "score": 2
        },
        {
          "text": "About 700k in cash and investments + 300k in CPF OA and SA (have reached FRS). This excludes paid-off housing. My expenses are about 30-35k a year for now, with about 10-15k for travelling, which I can reduce. Have been doing some freelance work to provide a bit of income, but I must say it has become more time consuming than I expected.",
          "score": 1
        },
        {
          "text": "do you feel like 700k will be sufficient till your last day? genuinely curious because a lot of people here are talking about buffer, healthcare, inflation, etc. (im also about 35k per year now)",
          "score": 1
        },
        {
          "text": "agree i think mindset is very important. We always want something we don't have. No matter how much i want a break the fear of not having an income is terrifying right? And bills just keep rolling in every month.",
          "score": 1
        },
        {
          "text": "Thanks for highlighting this, will definitely need to take that into account in the next few years!",
          "score": 1
        },
        {
          "text": "ChatGPT is a good start as a general tool, and it has improved by unimaginable levels since 2023. Also, you may find that your career has given you unfair insights on your industry that you can package and productize. It might be workflows, templates, anything you can automate, etc.",
          "score": 1
        },
        {
          "text": "Hang in there. Try to focus on having some defined activities, focus on your personal goal so you will not be drained. The high inflation and volatile climate makes FIRE unstable. Returns on investments may just change overnight on what country leaders do. Especially Donald now.",
          "score": 1
        },
        {
          "text": "Sure, another idea would be to sell their car too! Lol I get it. I’m a foreigner here so I’m mystified by the local culture of staying at your parents at 30+",
          "score": -1
        },
        {
          "text": "You mean renting out the room your parents make a available to you for FREE to get some income? Lol, how entitled",
          "score": -5
        }
      ]
    },
    {
      "id": "t3_1qun9cq",
      "subreddit": "singaporefi",
      "title": "Is 1.3M SGD enough for a Singaporean to semi-retire at 40YO",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qun9cq/is_13m_sgd_enough_for_a_singaporean_to_semiretire/",
      "score": 37,
      "num_comments": 77,
      "created_at": "2026-02-03T09:12:47",
      "selftext": "This year 30, Just thought about retirement from corporate job after 10 years. I should be able to accumulate 1.3m SGD by 2036 if not early.\n\nAt withdrawal rate of 4.6% (60k SGD) yearly to cover expenses while letting the balance to grow at 7-8%. Mathematically it will last for the rest of my life if maintaining the same lifestyle. Did i miss anything here?\n\nI believe many have achieved this 1.3m milestone much earlier than the standard retirement age of 65Y, but not many choose to retire from corporate job as far as I know. Why not? Did I miss any perspective?",
      "comments": [
        {
          "text": "> Did i miss anything here? > letting the balance to grow at 7-8% This is probably the main issue. Are you able to withstand volatility, depending on the risk you take with your portfolio? > Did I miss any perspective? The perspective you are missing is that of the perspective of 'never having enough'",
          "score": 66
        },
        {
          "text": "7-8% is very high to assume. It's safer to assume 4-6% returns with withdrawal rates of 2-3%. This is on assumption that you are going for diversified investment and won't panic in crisis.",
          "score": 35
        },
        {
          "text": "Is 60k SGD enough for your needs in 10 years, time including 10 years of inflation? Assuming 3% p.a. inflation, that's more like 45k SGD in today's money. Do you have property to live in for the rest of your life? Buying property can put a big dent in your plans. Even if you can pay the mortgage entirely from CPF while you are working, once you stop working, the mortgage is going to have to come out of your 60k SGD withdrawal. And if you are renting, I doubt 45k SGD a year is going to be enough for expenses.",
          "score": 18
        },
        {
          "text": "60k today is not 60k in 10 years... You need to account for inflation. In 10 years you might need 80k to live the same way you did with 60k for example. It's not that simple. Also is house paid off or will be by then?",
          "score": 16
        },
        {
          "text": "Does your 1.3m SGD include or exclude a house? If exclude, can you live with the net amount after buying a flat? If you are 30 now, you need not ask the question on whether you can retire with $1.3m when you are 40. Just work hard, save more and invest your savings. Then when you are nearer to 40 e.g. 38-39 and evaluate your situation again.",
          "score": 12
        },
        {
          "text": "2.5%-3% return is the safest rate. I think a few more years working + flexible withdrawal depending on market conditions will make it \"infinite\".",
          "score": 9
        },
        {
          "text": "Correct, it's not enough",
          "score": 8
        },
        {
          "text": "The main problem is sequence of returns risk as your 8% growth probably means all-in at equities. You can probably do it if your expenses are elastic. That is you can go for a much lower withdrawal rate at downturns.",
          "score": 6
        },
        {
          "text": "if you factor 3% inflation rate pa, there is no real return.",
          "score": 6
        },
        {
          "text": "At 3% p.a. inflation, $1.3m in 2036 is worth just under $1m in today's terms, which sounds too little to sustain even a 40k p.a. lifestyle in today's terms.",
          "score": 5
        },
        {
          "text": "Don't be too anal about plans for the future because nothing about the future is guaranteed including reaching the future. I have a couple of peers that have large nest eggs because of their high paying jobs. Where are they now? Dead because of cardiac arrests before they can retire and enjoy their savings. My suggestion, enjoy what you have now, do what you can about the future without sacrificing your loved ones and your health, and sing Que sera sera.",
          "score": 4
        },
        {
          "text": "You also need to include emergencies in your plan.",
          "score": 3
        },
        {
          "text": "The $1.3M purely in cash/cash equivalent or have property element in it? Assuming it’s pure cash/cash equivalent, how’s your housing situation? Fully paid up, parents’ or still on loan? Medical insurance? How confidential to consistently getting returns between 7% and 8%?",
          "score": 3
        },
        {
          "text": "\"Taking sp500 average annualised returns\" - not wise words",
          "score": 2
        },
        {
          "text": "Yup plan to all in equities and withdraw by selling at time. I see, good consideration 👍🏻",
          "score": 2
        },
        {
          "text": "Might as well say zero. Noob. 3% returns from vwra?",
          "score": 2
        },
        {
          "text": "2.5% to 3% returns is too conservative. That's basically assuming you only put cash in FDs, which is a wasted opportunity Even if you have a conservative 60-40 portfolio, you should easily earn more than 3% nominal returns on average",
          "score": 2
        },
        {
          "text": "All in equity and liquidate by selling as needed. House mortgage 1-1.5k will cover by the withdrawal. 7-8% is reference to sp500 historical annualised return",
          "score": 2
        },
        {
          "text": "Yes, it is better to be conservative when it comes to estimates.",
          "score": 1
        },
        {
          "text": "exclude house, yup I have been and will be continue doing. likely will change mind at 40?",
          "score": 1
        },
        {
          "text": "Don’t even know how f’ed you are with your plan",
          "score": 1
        },
        {
          "text": "true, thank you!",
          "score": 1
        },
        {
          "text": "Then I see two areas that you will need to keep a close watch on1. Medical bills - some form of insurance is advisable, but nothing beats living a healthy lifestyle.",
          "score": 1
        },
        {
          "text": "then will not enough, need a bit more time until it can self sustain",
          "score": -15
        },
        {
          "text": "I’m taking sp500 average annualised return as reference. Wise words 👍🏻",
          "score": -53
        }
      ]
    },
    {
      "id": "t3_1qudhij",
      "subreddit": "singaporefi",
      "title": "Best HYSA for around 100k of funds?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qudhij/best_hysa_for_around_100k_of_funds/",
      "score": 13,
      "num_comments": 9,
      "created_at": "2026-02-03T00:53:29",
      "selftext": "With most banks having slashed interest rates, what’s the best fuss free place to park around somewhere between 75k-125k SGD cash? I can meet the salary/credit card spend criteria if required. Currently on UOB One but losing dollars there as they nerfed interest rates. Meanwhile also read up on other banks - their EIR is so different from advertised rates.\n\nHave a home renovation coming up so cannot invest this money in any funds and prefer to keep it cash/extremely low risk MM funds.",
      "comments": [
        {
          "text": "At 100k with only salary credit and spend, OCBC is better",
          "score": 7
        },
        {
          "text": "DBS Invest-Saver G3B / MBH / A35. But this is within my regular investment portfolio; if it's not in yours, then it might not be worth.",
          "score": 4
        },
        {
          "text": "You're not \"losing dollars\" -- we don't have negative interest rates in Singapore. Unfortunately everywhere is getting hit right now. I have DBS Multiplier for 4.1% on $100K but I fulfill salary + invest + insure + spend criteria.  If you only have salary + spend can consider SCB Bonus$aver.",
          "score": 3
        },
        {
          "text": "I put 80k in OCBC 360 and 50k in UOB stash",
          "score": 2
        },
        {
          "text": "Can I ask what do you invest in dbs? The fees are so high that I'm not sure what makes sense 😕",
          "score": 2
        },
        {
          "text": "ocbc 360",
          "score": 1
        },
        {
          "text": "UOB one for no fuss",
          "score": 1
        },
        {
          "text": "Lowering of interest rates is a signal for you to buy stocks. Why go against the grain?",
          "score": 1
        },
        {
          "text": "Google",
          "score": -12
        }
      ]
    },
    {
      "id": "t3_1qtuq9r",
      "subreddit": "singaporefi",
      "title": "Template/Spreadsheet for investment tracking",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qtuq9r/templatespreadsheet_for_investment_tracking/",
      "score": 12,
      "num_comments": 5,
      "created_at": "2026-02-02T13:15:22",
      "selftext": "Hello. I am looking for google / excel spreadsheet template for investment tracking. I use IBKR, and it is quite confusing with all the fees and commissions with different currencies, any advise?\n\nI am currently working on one for myself but I am not good at this and would appreciate examples of how one tracks their investments. It should account for fees, and FXs and so on. Often time it is easy to see the greens but at the end of the day due to FX it may be a loss overall.",
      "comments": [
        {
          "text": "I used to use spreadsheet but it was hard to track multiple brokerages. Now I'm using open source software called Portfolio Performance:https://www.portfolio-performance.info/en/ There's option to export the IBKR file and import into the software. It will auto pull latest share prices + FX rate, etc when you open the software.",
          "score": 5
        },
        {
          "text": "You may refer to this post:Free Online Investment Stock Portfolio Tracker Spreadsheet – Investment Moats It is by far the best free online spreadsheets I have used. You can also tweak the spreadsheets to suit you. You will need a google account to use this. I make your life easier by providing the link to the spreadsheets here:https://docs.google.com/spreadsheets/d/15JjGr4FCYk_DSS51zal4H20AH_aLz9St_STs-T0N3NA/copy",
          "score": 2
        },
        {
          "text": "Thank you, checking it out",
          "score": 1
        },
        {
          "text": "Thank you, giving it a try. What kind of file export from IBKR side?",
          "score": 1
        },
        {
          "text": "IBKR provides various exports. You can try CSV or activity flex query.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1quh52f",
      "subreddit": "singaporefi",
      "title": "Best alternative platforms for diversification of platform risk?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1quh52f/best_alternative_platforms_for_diversification_of/",
      "score": 7,
      "num_comments": 5,
      "created_at": "2026-02-03T03:34:13",
      "selftext": "What are the good alternative platforms I can use to diversify placing all my money into one platform.\n\nCurrently I have a good amount I'm IBKR which I intend to continue growing, but I also want to diversify platforms to reduce putting all my eggs in one basket, metaphorically speaking.\n\nMy current top pick would be POEMS, but does anyone else have opinions on this?\n\nI know there are mobile friendly apps such as endowus, syfe, stashaway, webull and moomoo, but I would prefer another low cost/fees brokerage like IBKR instead.",
      "comments": [
        {
          "text": "Platform risk is really not important at all, for MAS-approved platforms in Singapore. You will get your assets back somehow as the platform is only a custodian. For stocks and unit trusts, there will be an opportunity to transfer them out to another platform if it's an \"orderly\" shutdown (e.g. Moneyowl -> iFast) or leaving the SG market (e.g. TD Ameritrade closing non-accredited investor SG accounts). If it's a sudden catastrophic bankruptcy, then it might take longer to get the units out to another platform (e.g. MF Global). Actual fraud by the company would be a problem though. But you have to consider whether you think a big company like IBKR can actually defraud investors at a scale large enough to affect you, with all their professional risk management and protocols. Or maybe you can put your buy-and-hold investments in IBKR, then use another platform for scratching your degenerate trading itch. Another way is, if your holdings are substantial, transfer some stocks from IBKR to Stanchart and just hold in Stanchart while doing your buying and selling at IBKR. Fees at Stanchart are a bit higher, and exchange rate won't be so favourable, but there's no custodian fee or inactivity fee. So just hold there what you don't need. What to do at retirement is a problem to be solved another day, or you just eat the higher fees when that comes.",
          "score": 7
        },
        {
          "text": "Unpopular choice.. But i am a fan and 10+ year user of POEMS..",
          "score": 2
        },
        {
          "text": "Honestly, if you're fine with low fee stuff like IBKR, just throw some cash into 1-2 other solid brokers. Don't bother with flashy apps, focus on cheap trades and actual market access.",
          "score": 1
        },
        {
          "text": "It also depends what you want to buy. Some brokers do not offer certain markets so you may run into such issues. Can also consider FSM besides all you listed.",
          "score": 1
        },
        {
          "text": "95% of my portfolio are in local entities.  The 5% in IBKR is for trading, used to be TDAmeritrade. I will not put a single cent into Chinese owned entities. If you want to diversify, consider this - if shit goes south and you need to bang table, where exactly is the table.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1quidv6",
      "subreddit": "singaporefi",
      "title": "Taking max car loan with low interest rate",
      "url": "https://old.reddit.com/r/singaporefi/comments/1quidv6/taking_max_car_loan_with_low_interest_rate/",
      "score": 7,
      "num_comments": 18,
      "created_at": "2026-02-03T04:34:19",
      "selftext": "Car loans are typically seen as a bad type of loan to be avoided as much as possible, mainly because a car is a depreciating asset, and effective interest rates are higher than what they seem. The case studies / examples I’ve come across use interest rates of 2.5-3%, translating to EIR of 5+%, and in these cases I agree that the interest rates are high enough that I’d want to take a smaller loan.\n\nHowever, in my recent car shopping journey, I am coming across lower interest rates (as low as 1.5%, and EIR <3%) due to the current low interest environment. So I’m wondering if the usual advice still applies, or if I should consider taking max loan amt and tenure, since opportunity cost should be higher (estimating 4-6% returns if invested).\n\nAs a first time car buyer, I would like to hear how this community thinks about this. Not sure if I missed any calculations or considerations, all advice is welcomed!",
      "comments": [
        {
          "text": "Pay in cash as much as possible and avoid taking a loan. Many clause like early repayment fees, processing fees if you intend to sell the car after a few years. I just encountered this a few months back when I was trying to sell my car. As mine was in-house loan, there was early repayment fee of 1% of loan amount, additional 1% because it was less than 12 months, another 2% processing fee. Sibeh dulan. Had to call the dealer to F them hard and they agreed to drop the total 4% fee to just 1% if I purchase my car insurance for next car with them. So I didnt take a loan for my next car(another dealer) and just paid in cash, + insurance from previous dealer, which was actually cheaper than I was quoted outside.",
          "score": 9
        },
        {
          "text": "This is so true. I thought i could game the dealer loan rebate by redeeming early since they offered a 5k discount if I took up their loan. In the end the bank still took a huge chunk of the saved interest amount through early redemption charge. Bank and salesman commission sure win, not me.",
          "score": 5
        },
        {
          "text": "4-6% returns if invested is something I see many people throwing around, but do remember that we're in an unprecedented bull market – who knows how long this run can last? Also, your car loan will count towards the assessment of your financial situation should you take up any other loan (e.g. housing) in the future.",
          "score": 4
        },
        {
          "text": "Check early repayment. You dont wanna take the loan and be stuck when u wanna sell ur car.",
          "score": 3
        },
        {
          "text": "Eeks! If you don’t mind sharing, what was the reason for selling your car early and buying another? Our current plan is to drive the car for the full 10 years (unless we are forced to sell for unexpected reasons), so early repayment isn’t a huge consideration for us",
          "score": 2
        },
        {
          "text": "Felt \"bored\" of my precious car since it was just a BnB Korean car with no Turbo. Reliable workhorse, but i wanted something \"faster\". Decided to sell the car instead of trading in to dealer since the price is usually better. If you really plan to drive for 10 years, then yeah no need to worry about early repayment fees. But what car are you currently looking at? Btw Tesla SG probably has one of the lowest loan for brand new car at only 1.28%, EIR 2.46%.",
          "score": 2
        },
        {
          "text": "Ah, I don’t think I will be changing car for funsies, not that much of a car person :) yes was looking at the Tesla rates! I was offered 1.5% only, they dropped the rate after I put my deposit 🥲",
          "score": 2
        },
        {
          "text": "Have you secured a coe? Deposit means nothing to tesla, you still have to secure a coe before applying for a loan. You can always re-negotiate with the banks that tesla works with.",
          "score": 2
        },
        {
          "text": "I can see your perspective, peace of mind is hard to quantify in numbers and would have a different value for everyone :) thanks for the advice!",
          "score": 2
        },
        {
          "text": "Might want to check the admin fees for early repayment of car loan, the low interest rate is just 1 part of the story",
          "score": 2
        },
        {
          "text": "Yep, we got a COE in Jan but because order was placed last year, we did not qualify for the current loan rate. Do you think it’s still possible to negotiate with the bank? The advisor told us no when we checked with Tesla",
          "score": 1
        },
        {
          "text": "We have a hdb loan that is pretty manageable, and are tempted to take more loan for the car considering EIR is just slightly higher than hdb’s rate, so against this benchmark it doesn’t sound that bad?",
          "score": 1
        },
        {
          "text": "I hear you. Personally, I lean the other way around – my partner and I took the lowest 60% loan, and squeezed it down to 5 years, just to have less uncertainty. On paper I think it looks fine; as long as you have sufficient buffer, I think neither option will make/break you in the long term.",
          "score": 1
        },
        {
          "text": "Not expecting to sell unless forced by circumstances! Good advice still, I will double check 👍🏻",
          "score": 1
        },
        {
          "text": "Yup keep the options open and evaluate carefully !",
          "score": 1
        },
        {
          "text": "When we bought our car, my husband and I decided on a 40/60 split. I don't like car loans so I decided to make the down-payment in cash while he services the loan for next 7 years. 3+ years into the loan, his home mortgage is due for refinancing. We realise the ppty value has grown about 50% which allowed him to take out an equity loan on the ppty at low mortgage rates. I suggested he take out extra to pay off the car loan as well, only to realise that prepayment fees essentially no different from paying the rest of the loan according to schedule. Tldr, it's the loss of flexibility with a car loan. You can't pay back early if circumstances changes and make it more beneficial to do so.",
          "score": 0
        },
        {
          "text": "Read “Rich dad poor dad” again. I can easily pay in full without loans but I choose not to get it.",
          "score": -1
        },
        {
          "text": "Not planning to sell unless something unexpected happens (eg extended employment), although it’s definitely still a possibility. But yes good point to still be aware of the potential penalty even if likelihood of paying it is low 👍🏻👍🏻",
          "score": -2
        }
      ]
    },
    {
      "id": "t3_1qud7ve",
      "subreddit": "singaporefi",
      "title": "Fullerton SGD Cash Fund vs Endowus Cash Smart Secure for Emergency Fund?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qud7ve/fullerton_sgd_cash_fund_vs_endowus_cash_smart/",
      "score": 6,
      "num_comments": 13,
      "created_at": "2026-02-03T00:41:49",
      "selftext": "Hi everyone,\n\nI currently have 1 year of expenses in a bank deposit account and want to move it to a Money Market Fund for better interest. I'm deciding between:\n\nFullerton SGD Cash Fund (100% allocation)\n\nEndowus Cash Smart Secure\n\nQuestions:\n\nWhich of these is safer/lower risk?\n\nIf I go with the Fullerton SGD Cash Fund, is it better to buy it on Endowus or FSMOne in terms of fees/spread?\n\nThanks!",
      "comments": [
        {
          "text": "Essentially equivalent in risk. Endowus Cash Smart Secure is 50% Fullerton SGD, 50% Lionglobal Enhanced Liquidity. Do not use either Endowus if you buy Fullerton SGD. Endowus charges 0.15% platform fee and only rebates 0.08% cashback, so it’s not worth it. FSMOne has no sales charge no platform fee for MMFs (but it does have platform fee for other unit trusts so watch out).",
          "score": 4
        },
        {
          "text": "thanks for sharing this. im fully in Fullerton SGD on Endowus 😅 edit: Mixed up the fund names lol. im in Lionglobal MMF",
          "score": 3
        },
        {
          "text": "With Endowus you should always check whether the trailer fee rebate exceeds the platform fee for the particular fund you are interested in. Otherwise you can go with Poems, Dollardex, even Moomoo or Tiger for 0% sales charge 0% platform fee (but no trailer fee rebate).",
          "score": 2
        },
        {
          "text": "just go for the fullerton one, lower fees overall as endowus one is made up of 2 seper8 funds",
          "score": 2
        },
        {
          "text": "Not the best idea. Look at 2022.",
          "score": 2
        },
        {
          "text": "12 months’ emergency? Lol at the cash drag",
          "score": 1
        },
        {
          "text": "Btc best store of value",
          "score": 1
        },
        {
          "text": "Hmmm ok. Then I guess buffer etfs are still the better choice than bonds for emergency fund, with low risk medium reward. Even YTD, DMAX/SGDUSD is down only 0.91%. Last year when USD massively depreciated, DMAX/SGDUSD ended up +0.05%. So in a year where SGDUSD is flat and S&P is green which is most of the time, the chances of buffer etfs beating hysa and mmf is extremely high.",
          "score": 1
        },
        {
          "text": "Bro, emergency fund is not for min-maxing. The week where USD suddenly devalues to 1.1 might also be the week you get sacked from your job. And meanwhile there’s no liquidity for DMAX or whatever.",
          "score": 1
        },
        {
          "text": "I don’t think so",
          "score": 1
        },
        {
          "text": "If you want lower risk, maybe can try SSB? Most emergencies can be paid for using a credit card then you redeem SSB in the current window for next month payout",
          "score": 0
        },
        {
          "text": "Just curious does anyone put their emergency fund in pimco income fund?",
          "score": 0
        },
        {
          "text": "Max out my SSB 😅",
          "score": -2
        }
      ]
    },
    {
      "id": "t3_1quelrm",
      "subreddit": "singaporefi",
      "title": "How would you invest your next $100K? Looking go non-US equity ETF recommendations",
      "url": "https://old.reddit.com/r/singaporefi/comments/1quelrm/how_would_you_invest_your_next_100k_looking_go/",
      "score": 5,
      "num_comments": 23,
      "created_at": "2026-02-03T01:41:57",
      "selftext": "I’ve traditionally been parking most of my excess capital in S&P500 funds. But am trying to think about how to diversify away; also with the exchange rate my returns last year were subpar.\n\nWanting to get some ideas on how you would the experts here would think about further investments this year.\n\nI also heard vanguard is not good for Singapore for tax reasons is this true?\n\nI’m 34M and have a healthy risk tolerance.\n\nWould love to hear your thoughts!",
      "comments": [
        {
          "text": "EXUS and EIMI?",
          "score": 11
        },
        {
          "text": "I also heard vanguard is not good for Singapore for tax reasons is this true? Yes and no. Vanguard is just a fund house, their most popular funds are US-domiciled, that's not good for Singapore (30% tax on dividends). We want funds domiciled in Ireland (15% tax on dividends instead), Vanguard do offer funds that are domiciled here. Anyway, if you want to diversify away from S&P500, you can look at EXUS or even VXUS. The domicile of these fundsshouldn'tmatter too much as the companies aren't based in the US. Do let me know if i'm wrong here... edit: The domiciledomatter, so EXUS and XUSE and maybe WEXE. Stay away from VXUS.",
          "score": 6
        },
        {
          "text": "updoot for EIMI.",
          "score": 4
        },
        {
          "text": "The domicile does matter. If the ETF is US-domiciled, what would normally not have any US dividends withholding tax, due to the holdings being non-US, gets converted into being subject to 30% US dividends withholding tax. It's the worst combo. https://www.bogleheads.org/wiki/Nonresident_alien_taxation US withholding tax applies regardless of the actual assets that a US domiciled ETF itself holds. Even if all of the ETF's assets are non-US stocks, the US will still take 30% or lower treaty rate in dividend tax. Holding the same assets in a non-US domiciled ETF eliminates this US tax overhead.",
          "score": 3
        },
        {
          "text": "I'm putting 11% in EIMI,for Singaporeans it's Irish docimiled and low cost covers emerging markets and covers Large Mid and even small cap stocks with TER of 0.18% In terms of concentration t's mostly in Taiwan TSMC and Korea Samsung. do your own research tho",
          "score": 3
        },
        {
          "text": "Thanks !",
          "score": 2
        },
        {
          "text": "Or VEU or IXUS.",
          "score": 2
        },
        {
          "text": "If you are all in on S&P500, maybe spread a bit.. emerging markets, bonds, REITs, gold. Taxes are a thing, but mostly just worry abt allocation and low fees.",
          "score": 2
        },
        {
          "text": "SGD probably ranks as one of the safest, strongest and most stable currency after the Swiss franc. So don't need to look far.",
          "score": 2
        },
        {
          "text": "VWRA is domiciled in Ireland so you won’t be hit with US taxes on your dividends. You can also invest in the STI here and an S-REITs ETF.",
          "score": 2
        },
        {
          "text": "Vanguard has nothing to do with tax. Buying an ETF listed on a US stock exchange makes us in Singapore liable for 30% US dividends withholding tax. Buying an ETF that is Ireland-domiciled (typically listed on London Stock Exchange but also other European exchanges) reduces that effect to 15% US dividends withholding tax. Vanguard has both US-domiciled (e.g. VOO) and Ireland-domiciled ETFs (e.g. VWRA) ETFs.",
          "score": 2
        },
        {
          "text": "Dive deeper to look at S&P 500, you will realize most companies are global. I would just deploy in SGD market if forex is what i want to avoid.",
          "score": 2
        },
        {
          "text": "+1 EIMI",
          "score": 1
        },
        {
          "text": "imo, getting us domiciled funds for the s&p 500 doesn't matter since main focus is growth. the additional 15% dividend tax on a 1% dividend yield is near negligible compared to overall value of the stock",
          "score": 1
        },
        {
          "text": "This is super helpful thank you!",
          "score": 1
        },
        {
          "text": "I have SCHF and SCHE as my non US ETF",
          "score": 1
        },
        {
          "text": "AVDV and DFIV",
          "score": 1
        },
        {
          "text": "I mean if you agree with a market cap weighted allocation can just transition your existing investments and additional $100k into a global fund like VWRA.",
          "score": 1
        },
        {
          "text": "If you are planning to retire in SG, you can even put a small percentage in STI",
          "score": 1
        },
        {
          "text": "A simple solution is to wwitch out your S&P 500 funds into a world index fund/etf (e.g. VWRA). Then invest your future funds into the world index fund/etf.",
          "score": 1
        },
        {
          "text": "Wth is a “healthy risk tolerance”? Like that I would say my risk tolerance is obese please.",
          "score": 0
        },
        {
          "text": "Chyna",
          "score": 0
        },
        {
          "text": "Healthy risk tolerance but want better returns? Look at the fundamentals. High risk high rewards. Low risk low rewards. I do options and stocks. Sell puts and selling cover calls. If you want to pay extra for cross region stock. Why don't try penny stocks in the US. Not safe but high reward. Short term only please",
          "score": -6
        }
      ]
    },
    {
      "id": "t3_1qtyx3t",
      "subreddit": "singaporefi",
      "title": "Tax and CPF treatment for income to a joint account",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qtyx3t/tax_and_cpf_treatment_for_income_to_a_joint/",
      "score": 3,
      "num_comments": 3,
      "created_at": "2026-02-02T15:59:16",
      "selftext": "Any home based business / freelancing gigs that are run jointly by a couple? So income comes into a joint account, and let’s say the biz is small and not enough to qualify for GST. In this case, how is tax and CPF managed - can both do 50-50, or one does 100%?\n\nI know property is based on legal share of property but this one a bit different I think. Obligatory not me, but I was wondering what happens in this scenario.",
      "comments": [
        {
          "text": "if it's run jointly you need to establish a company",
          "score": 3
        },
        {
          "text": "Depends on structure of the business (company or partnership?). Depends on nature of remuneration (salaries, dividends or share of partnership profits?).",
          "score": 1
        },
        {
          "text": "If it is a Pte Ltd company, both of you draw salaries and diviends if any. Shareholder % also need to be decided. If Sole Proprietor partnership, then whatever left, split. The % can depends of own perference. You have to wait the pro and cons for 50-50 (Usually a 49-51) or 100%. If split - The income tax will be lower. If 100%, the income tax will reach a higher tier tax rate. And may exceed CPF monthly income ceiling for Pte Ltd, no need to contribute CPF for sole prop but need to contribute MA based on age and net trade income.",
          "score": 1
        }
      ]
    }
  ]
}