{
  "schema_version": "raw_scrape_v1",
  "report_id": "2026-01-29",
  "scraped_at": "2026-01-29T09:41:24.463840",
  "subreddits": [
    "singapore",
    "askSingapore",
    "SingaporeRaw",
    "singaporefi"
  ],
  "total_posts": 40,
  "total_comments": 859,
  "posts": [
    {
      "id": "t3_1qp3f02",
      "subreddit": "singapore",
      "title": "Singaporean boy who recreated ISIS attacks, executions in Roblox and Gorebox gets restriction order",
      "url": "https://old.reddit.com/r/singapore/comments/1qp3f02/singaporean_boy_who_recreated_isis_attacks/",
      "score": 634,
      "num_comments": 105,
      "created_at": "2026-01-28T14:11:15",
      "selftext": "",
      "comments": [
        {
          "text": "While his family members and friends were aware of his extremist views and support for ISIS, none of them reported him to authorities, said ISD.",
          "score": 482
        },
        {
          "text": "His whole family are on our watch",
          "score": 421
        },
        {
          "text": "Will he serve National Service under the Restriction Order? If not GGWP",
          "score": 292
        },
        {
          "text": "To prepare, he practised close-quarter battle simulations at home for up to two hours daily with a toy AK-47 rifle, role-playing as an ISIS fighter attacking the United States Army or Israel Defense Forces, whom he considered enemies of the group. The parents should be getting restriction orders instead.",
          "score": 237
        },
        {
          "text": "He will, but prolly limited to desk jobs in low key unit with minimal security clearance.",
          "score": 163
        },
        {
          "text": "Social media for kids a fking mistake...algos just out there trying to maximise your screen time on the platform...omg we are so fking screwed",
          "score": 160
        },
        {
          "text": "SCDF enters the chat",
          "score": 118
        },
        {
          "text": "Put all his frends and family on watch now.\nThose that knew but did nothing.",
          "score": 108
        },
        {
          "text": "Parents never step in to restrict access to Roblox or even limit social media usage? Sad to see someone getting exposed to stuff when he was 12",
          "score": 100
        },
        {
          "text": "Yea the family and prolly the next 2 generations are on the watch list",
          "score": 82
        },
        {
          "text": "I remember back in primary school, we could easily access liveleak.com and other gore sites in the school computer lab. During lesson time, we (primary school students) would sometimes be playing Y8 or miniclip. But sometimes, we’ll be randomly watching public execution videos, people getting run over by trains, soliders burning people alive in some third-world country, etc. And as 9-year-olds, we didn’t know better and we’ll just crowd around one computer screen and laugh at those unhinged videos. When the teacher walked past, we’ll just close that window. What an absolutely crazy timeline to live in. There were no content restrictions at all 20 years ago. There’s definitely a lot more restrictions in schools these days, but it’ll never be foolproof.",
          "score": 81
        },
        {
          "text": "Username checks out.",
          "score": 80
        },
        {
          "text": "Put the entire fucking family on watch also",
          "score": 78
        },
        {
          "text": "MINDEF has said that such persons will be posted in vocations that limit their access to arms and fighting gear.",
          "score": 47
        },
        {
          "text": "I got introduced to Happy Tree Friends during Primary 1. Yes there was warning no kids but our teachers said we aren't kids anymore (speaking maturity from kindergarten).",
          "score": 46
        },
        {
          "text": "Little bro is gonna inspire dozen others to do the same to Keng",
          "score": 36
        },
        {
          "text": "One person do treason 3 generations get punished",
          "score": 26
        },
        {
          "text": "To be honest, it taught me how crazy the world is from a very young age. And I became desensitised after all that exposure. For better or worse, when I see a dead body in a car accident now, I can register the reality without being freaked out by it. Still, I understand how such gore can be a traumatic experience for some children (especially when they chance upon it alone on social media).",
          "score": 18
        },
        {
          "text": "hopefully not transport vocation as well.",
          "score": 14
        },
        {
          "text": "Maybe that was his plan to siam frontline /s",
          "score": 9
        },
        {
          "text": "Singapore very small Scully everyone also on watch... From the aunty down the street to the cleaning uncle to the McDonald's uncle server.",
          "score": 9
        },
        {
          "text": "They should be restricted from having any children",
          "score": 9
        },
        {
          "text": "Why do people keep forgetting that SCDF exists",
          "score": 8
        },
        {
          "text": "Not to condone his family's and friends' condonation, but given the enemy countries he used in his games and LARP, his family and friends probably felt it's better to keep things under wraps than to risk social ostracism from their community",
          "score": 5
        },
        {
          "text": "U think all parents will micromanage every detail of their children's life meh",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qozqs8",
      "subreddit": "singapore",
      "title": "Woman charged with spitting water while on a train, remanded at IMH",
      "url": "https://old.reddit.com/r/singapore/comments/1qozqs8/woman_charged_with_spitting_water_while_on_a/",
      "score": 502,
      "num_comments": 161,
      "created_at": "2026-01-28T11:13:00",
      "selftext": "",
      "comments": [
        {
          "text": "She’s fucking 37????!!!!",
          "score": 493
        },
        {
          "text": "Life have not been kind to her lol",
          "score": 173
        },
        {
          "text": "Good grief. If I looked like that at 37 I too would be mad!",
          "score": 141
        },
        {
          "text": "I’m 40, and I thought she’s my mother generation",
          "score": 114
        },
        {
          "text": "1937…",
          "score": 48
        },
        {
          "text": "I am 37.. and she looks like she can be my mother. WHAT??!!! ",
          "score": 33
        },
        {
          "text": "Hate ages people up badly. Also meth...",
          "score": 33
        },
        {
          "text": "Looks like 59.",
          "score": 29
        },
        {
          "text": "Im in my 40s and if I have to greet her, I will call her auntie assuming she is my senior....",
          "score": 23
        },
        {
          "text": "She’s 37?!",
          "score": 21
        },
        {
          "text": "broooooooooooooooooooooooo she looks 50",
          "score": 18
        },
        {
          "text": "Apparently. Looked 60 to me.",
          "score": 17
        },
        {
          "text": "Mental stress can do that to you.",
          "score": 16
        },
        {
          "text": "obviously people who have mental issues, and I mean real mental issues normally looks a bit different.",
          "score": 9
        },
        {
          "text": "Meth wont end up so round. \nSo just pure hate.",
          "score": 7
        },
        {
          "text": "The only reason I went to read the article was cause of the age... Like, I'm 44 and she looks waaaaaay older than me.",
          "score": 7
        },
        {
          "text": "Harlow IMH",
          "score": 6
        },
        {
          "text": "Is that a typo?If it said 73, it'd be plausible.",
          "score": 6
        },
        {
          "text": "Omg I thought she is 60s",
          "score": 5
        },
        {
          "text": "Some people's children.",
          "score": 4
        },
        {
          "text": "Looks like 73 lol",
          "score": 3
        },
        {
          "text": "Who are the unlucky 37 people???? Must they be tested for any viruses???!",
          "score": 1
        },
        {
          "text": "What happens when you let yourself go.",
          "score": 1
        },
        {
          "text": "Yes, what in the Liang Si Mei 37.",
          "score": 1
        },
        {
          "text": "No cooking equipment or energy to cook meal in kitchen, cooked food are expensive outside now, eat tibits from value shops for 3 meals everyday.",
          "score": -6
        }
      ]
    },
    {
      "id": "t3_1qp8ozg",
      "subreddit": "singapore",
      "title": "PropertyLimBrothers CEO Melvin Lim, vice-president Grayce Tan resign; Marc Chan appointed interim CEO",
      "url": "https://old.reddit.com/r/singapore/comments/1qp8ozg/propertylimbrothers_ceo_melvin_lim_vicepresident/",
      "score": 497,
      "num_comments": 216,
      "created_at": "2026-01-28T19:20:16",
      "selftext": "",
      "comments": [
        {
          "text": "She can join as intern again. Shouldn’t take more than ⅔ years to be VP again. Imagine getting layoff 3 times in a row for fking someone else.",
          "score": 668
        },
        {
          "text": "Wah that’s a lot of sucking again bruh",
          "score": 142
        },
        {
          "text": "Wasn't a virgin for a decade lmaoooo",
          "score": 40
        },
        {
          "text": "She can be an intern again but never a virgin again",
          "score": 33
        },
        {
          "text": "Unverified but read a comment somewhere saying it was the real reason she broke her MOE scholarship bond.",
          "score": 27
        },
        {
          "text": "For 200k, i can be whatever you want. 200k buys alot of types of surgery",
          "score": 21
        },
        {
          "text": "Unless her new boss: ",
          "score": 18
        },
        {
          "text": "Why does she need to get hired anw? She owns businesses thanks to using company funds to buy or by using Melvin's money anw",
          "score": 17
        },
        {
          "text": "Like that the company name will change to just \"Property Pte Ltd\"",
          "score": 14
        },
        {
          "text": "Now that’s the spirit",
          "score": 13
        },
        {
          "text": "Affair is affair. But does MOE even have a morality clause?",
          "score": 13
        },
        {
          "text": "Sorry, 3 times? R u saying this is a 2nd time for her?",
          "score": 12
        },
        {
          "text": "wdym 3 times?",
          "score": 11
        },
        {
          "text": "No idea. But if she broke the bond and paid it off then morality clause is irrelevant.",
          "score": 11
        },
        {
          "text": "Just call it Property Brothers Pte Ltd and only have male employees for the new brother culture No more cheating scandal (?)",
          "score": 9
        },
        {
          "text": "The number of \"bro!\" u use in your day to day convo is one of the KPIs",
          "score": 5
        },
        {
          "text": "Wah its meowvin.",
          "score": 4
        },
        {
          "text": "✂️ 👯‍♀️",
          "score": 3
        },
        {
          "text": "Ya sure.. Ya can actually have surgery to have the hymen attached back",
          "score": 3
        },
        {
          "text": "Ahh",
          "score": 2
        },
        {
          "text": "/r/retiredgif",
          "score": 1
        },
        {
          "text": "Erm. Licking works too?",
          "score": 1
        },
        {
          "text": "This person gets it",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qp74kx",
      "subreddit": "singapore",
      "title": "Nipah virus: Singapore to conduct temperature screening at airport for flights from affected areas",
      "url": "https://old.reddit.com/r/singapore/comments/1qp74kx/nipah_virus_singapore_to_conduct_temperature/",
      "score": 235,
      "num_comments": 57,
      "created_at": "2026-01-28T17:50:32",
      "selftext": "",
      "comments": [
        {
          "text": "Here we go again",
          "score": 153
        },
        {
          "text": "Mortality rate has an inverse relationship with transmission rate thankfully, this wouldn’t spread on a level like covid",
          "score": 152
        },
        {
          "text": "This virus wont spread the mortality rate is too high it will kill all its hosts before they even have a chance to infect others, if youve played plague inc youll know to always never upgrade lethal symptoms before you max all your skills to spread your virus",
          "score": 138
        },
        {
          "text": "Mortality rate is 40-75%. Transmission is either through contaminated food, bodily fluids, respiratory droplets, or contaminated materials.",
          "score": 134
        },
        {
          "text": "The mortality rate makes Covid looks like nothing. We should threat this outbreak much more seriously tbh",
          "score": 121
        },
        {
          "text": "This is very true. SARS died out pretty fast because it was killing infected people too quickly. Covid was more pervasive because it kept the infected alive longer to propagate the virus.",
          "score": 105
        },
        {
          "text": "it is true though. the faster it kills someone, the less it actually spreads enough to be on the endemic level. We’ve seen it in precdences such as SARs and Ebola. We’re not saying not to be vigilant, but call a spade a spade.",
          "score": 46
        },
        {
          "text": "The virus isn’t new. It’s been in Singapore and Malaysia in the past and disappear after a while. Every decade or so u get such news. There’s no point overreacting over something like this without proper evidence or science. There’s only 2 confirmed cases in India despite the population size and hygiene level. China killed more people through zero covid policy and suffer economically. Can you imagine banning all poultry just because avian influenza mortality rate is 60%. Not worth it.",
          "score": 36
        },
        {
          "text": "I've heard that they added an airport to Greenland? That place was hard to infect",
          "score": 31
        },
        {
          "text": "Thisnot our first redeo with Nipah Virus outbreak. Like what other commenters mentioned, is very lucky for us that a lot of human infectious diseases, are either deadly but not very transmissible (e.g. hantuvirus, MERS) or we can take actions to prevent them spread further (e.g. ebola, HIV), or very transmissible but not that deadly (e.g. seasonal flu, measles). But we kinda screwed if a disease that optimal combo of traits of being very transmissible, deadly enough, we don't have effective treatment options, and maybe short incubation period when a person becomes infectious. Something like smallpox, the 1918 flu would fit the bill.",
          "score": 23
        },
        {
          "text": "this guy Plague Incs 👌",
          "score": 16
        },
        {
          "text": "This virus pops up in the news every few years and you can see thelist of past outbreakson Wikipedia. Doesn't seem like a pandemic level threat so just let the systems do what they need to do and carry on with your life.",
          "score": 15
        },
        {
          "text": "Judging by the number of ppl who still cough without covering their mouth and refuse to mask up when sick--nope, nada.",
          "score": 13
        },
        {
          "text": "The tactic I used is the opposite. Start by having medium lethality viruses to test the speed of kills. Just nice first, then upgrade the spread. If a random mutation to upgrade lethality comes along, can watch drama liao",
          "score": 12
        },
        {
          "text": "Nipah virus outbreaks have been reported in Malaysia,Singapore, Bangladesh and India. The area is known as the Nipah Belt. TIL I learnt about this Nipah Belt and Singapore is part of it!",
          "score": 10
        },
        {
          "text": "r/Nipahvirus",
          "score": 6
        },
        {
          "text": "It’s true, yes incubation period is quite long i think, up to two weeks. Which does make it dangerous as it allows spreading. But at least it’s much more contained as a very large proportion of people will “die off” and cant spread far beyond that period",
          "score": 5
        },
        {
          "text": "Touche",
          "score": 4
        },
        {
          "text": "Ikr. It’s so irresponsible…",
          "score": 4
        },
        {
          "text": "Uh and COVID? COVID was just that combination (more optimal that influenza). I'd actually say the impact of COVID in history is even bigger than 1918 flu. Biggest difference between 1918 and 2020 is an universe of knowledge in viruses, DNA, and vaccines",
          "score": 4
        },
        {
          "text": "the only thing we learnt is how easy it is to scare Singaporeans to make them overreact to everything",
          "score": 1
        },
        {
          "text": "The lesson from COVID is almost everyone opened up too late. And that the vaccines are useless in preventing or slowing the spread.",
          "score": 1
        },
        {
          "text": "treat*",
          "score": 1
        },
        {
          "text": "Don’t underestimate. Have we not learn anything from Covid?",
          "score": -41
        }
      ]
    },
    {
      "id": "t3_1qp1un6",
      "subreddit": "singapore",
      "title": "Seeking dashcam footage / witnesses – AYE (Tuas-bound), 29 Dec 2025, 5:30–5:45pm",
      "url": "https://old.reddit.com/r/singapore/comments/1qp1un6/seeking_dashcam_footage_witnesses_aye_tuasbound/",
      "score": 238,
      "num_comments": 5,
      "created_at": "2026-01-28T12:51:08",
      "selftext": "Hey\n\nI’m seeking help from anyone who may have travelled along AYE (Tuas-bound) on 29 December 2025 between 5:30–5:45pm.\n\nMy father was involved in a fatal road accident during this time. We are hoping someone may have dashcam footage, even if it is blurred or partial.\n\nWe are not seeking to assign blame or fault. We are only trying to understand how the accident happened, so our family can have clarity and closure.\n\nAs a gesture of appreciation, our family is prepared to offer a goodwill reward solely to thank anyone whose footage helps clarify the sequence of events. Anonymity can be respected.\n\nIf you or someone you know regularly drives this route, please consider sharing.\n\nThe Straits Times article for context:\n\n\\[https://www.straitstimes.com/singapore/family-of-61-year-old-motorcyclist-killed-in-hit-and-run-on-aye-seeks-eyewitnesses-dashcam-footage?utm\\\\\\\\\\\\\\_campaign=stfb&utm\\\\\\\\\\\\\\_medium=social&utm\\\\\\\\\\\\\\_source=facebook&fbclid=IwZnRzaAPj851leHRuA2FlbQIxMQBzcnRjBmFwcF9pZAo2NjI4NTY4Mzc5AAEe2tsRolk-3SyHUAbOrgzmVDOI7pq89w3SmDLCFAgEy2GZMHt3y7akAEm6etg\\\\\\\\\\\\\\_aem\\\\\\\\\\\\\\_xAGtJhg6Ue9oMJCHjYYdQw\\](https://www.straitstimes.com/singapore/family-of-61-year-old-motorcyclist-killed-in-hit-and-run-on-aye-seeks-eyewitnesses-dashcam-footage?utm\\\\\\_campaign=stfb&utm\\\\\\_medium=social&utm\\\\\\_source=facebook&fbclid=IwZnRzaAPj851leHRuA2FlbQIxMQBzcnRjBmFwcF9pZAo2NjI4NTY4Mzc5AAEe2tsRolk-3SyHUAbOrgzmVDOI7pq89w3SmDLCFAgEy2GZMHt3y7akAEm6etg\\\\\\_aem\\\\\\_xAGtJhg6Ue9oMJCHjYYdQw)\n\nMothership article:\n\n\\[https://mothership.sg/2026/01/man-aye-accident-family-witnesses/?fbclid=IwZnRzaAPmcIdleHRuA2FlbQIxMQBzcnRjBmFwcF9pZAo2NjI4NTY4Mzc5AAEeMsn3ZI4A2-WzZ\\\\\\\\\\\\\\_agWpUXLEHVvbImLPretOFrhE0A7egyfNjjtr\\\\\\\\\\\\\\_jVhHoIT8\\\\\\\\\\\\\\_aem\\\\\\\\\\\\\\_-ZwYUgF4MzuQf\\\\\\\\\\\\\\_r50M\\\\\\\\\\\\\\_6QQ\\](https://mothership.sg/2026/01/man-aye-accident-family-witnesses/?fbclid=IwZnRzaAPmcIdleHRuA2FlbQIxMQBzcnRjBmFwcF9pZAo2NjI4NTY4Mzc5AAEeMsn3ZI4A2-WzZ\\\\\\_agWpUXLEHVvbImLPretOFrhE0A7egyfNjjtr\\\\\\_jVhHoIT8\\\\\\_aem\\\\\\_-ZwYUgF4MzuQf\\\\\\_r50M\\\\\\_6QQ)\n\nThe Asia one:\n\n\\[https://www.asiaone.com/singapore/eyewitness-father-dies-fatal-aye-crash?fbclid=IwdGRjcAPmcKxleHRuA2FlbQIxMQBzcnRjBmFwcF9pZAo2NjI4NTY4Mzc5AAEeyIzDb8caEDskE16ndVWzYrgVuKW8DtxKj5UxfOW7bPU\\\\\\\\\\\\\\_SZMf8izqbUbEPMk\\\\\\\\\\\\\\_aem\\\\\\\\\\\\\\_W8ScFEUjaqUnjkLF0aylKQ\\](https://www.asiaone.com/singapore/eyewitness-father-dies-fatal-aye-crash?fbclid=IwdGRjcAPmcKxleHRuA2FlbQIxMQBzcnRjBmFwcF9pZAo2NjI4NTY4Mzc5AAEeyIzDb8caEDskE16ndVWzYrgVuKW8DtxKj5UxfOW7bPU\\\\\\_SZMf8izqbUbEPMk\\\\\\_aem\\\\\\_W8ScFEUjaqUnjkLF0aylKQ)",
      "comments": [
        {
          "text": "Sorry for your loss. Hope they catch the hit and run scum",
          "score": 58
        },
        {
          "text": "> Ms Kaur said: “At this point, investigations are ongoing, and the police have indicated that there is insufficient conclusive evidence to establish exactly how the accident occurred. As far as I know, it is a criminal offense in Singapore to drive off after an accident, regardless of who is at fault. Even if there is insufficient evidence on how the accident occurred, shouldn't the person that drove off be arrested and bring in to police custody for interview regardless?",
          "score": 51
        },
        {
          "text": "That’s precisely what the investigations are meant to establish…",
          "score": 20
        },
        {
          "text": "What I meant was, the guy drove away after an accident, that is a criminal offense so shouldn't the driver be arrested already even without any other investigations?",
          "score": 11
        },
        {
          "text": "So long already, any dashcam footage would have been over written. Wish u best of luck.",
          "score": 7
        }
      ]
    },
    {
      "id": "t3_1qp2xuu",
      "subreddit": "singapore",
      "title": "Japanese woman loses passport on S'pore-bound flight, only finds out 1 day later",
      "url": "https://old.reddit.com/r/singapore/comments/1qp2xuu/japanese_woman_loses_passport_on_sporebound/",
      "score": 182,
      "num_comments": 18,
      "created_at": "2026-01-28T13:46:04",
      "selftext": "",
      "comments": [
        {
          "text": "Can understand. Japan and Singapore are very convenient countries for her case where in both countries your identify is not tied to the passport or any card. But if you travel to Europe or other parts of Asia, Middle East, she better take care of her passport",
          "score": 137
        },
        {
          "text": "She wondered how they got her email… Other than her passport she forgot that she filled in the SG arrival card",
          "score": 103
        },
        {
          "text": "I think likely SQ supplied it to SATS since they found it on the plane and can easily search their manifest to find the email used to book the flight, rather than a government agency giving it to them.",
          "score": 69
        },
        {
          "text": "I've always been afraid of this. Documents that you always need are constantly checked and you won't go an hour without taking them out. Documents you never need can be locked up at home. It's only when you need it sometimes that this can happen. I'm paranoid so I check it every 10 minutes anyway so I'm not even at risk but it always felt like this could happen. Like what if I forget? It's not like I take note of every check I do. I can't say, \"well I know I definitely showed it to the officer even if I don't remember, so I must have lost it after that.\"",
          "score": 52
        },
        {
          "text": "She is based in Singapore as a resident. Also whats your source about \"fails facial recognition another half of the time\"? Trust me bro? If thats your source then my counter source is that Ive had 100% success whenever I pass thru changi, and I'm travel thru changi twice a month. People with problems tend to be those who did not fill in the sac.",
          "score": 41
        },
        {
          "text": "If you're a returning traveller from certain countries you don't need passport. Also never had or seen any issues with the biometric scanners when returning home. Less than 30 seconds and I'm through.",
          "score": 18
        },
        {
          "text": "Indeed. Whenever I travel, my passport and loose cash are always kept in some sort of flat pack close to me where I can pat it and know it's there. Yeah everyone especially pickpockets will know where my valuables are, but I dare them to try when my pack is slung across my chest and hidden under a zipped jacket.",
          "score": 14
        },
        {
          "text": "Reminds me of these few!https://static.mothership.sg/1/2018/02/Screen-Shot-2018-02-07-at-11.11.57-AM-e1517979220723.png",
          "score": 11
        },
        {
          "text": "Just so you know, its different for the JB land checkpoints compared to Changi",
          "score": 11
        },
        {
          "text": "You must not travel much.",
          "score": 10
        },
        {
          "text": "She's PR/dependent I think? So has face registered in Ica/singpass",
          "score": 6
        },
        {
          "text": "if the system is having trouble detecting your face you should check in with ICA and have your biometrics rescanned or something",
          "score": 6
        },
        {
          "text": "Look for the lanes with blinking blue light on the machine. Those are the ones that allow you go passportless",
          "score": 5
        },
        {
          "text": "Literally the second line from the headline. You never click and read?",
          "score": 3
        },
        {
          "text": "Huh? I came back from Thailand twice just last year and 1 was OK passportless, the more recent one I needed my passport...",
          "score": 1
        },
        {
          "text": "From the once a month I go in and out of Changi. I don't know what's so heng suay about my travel schedule that what CAG/ICA claims about the passport-less system never matches up with my experience. When an article came out celebrating that the system had rolled out to all terminals since 1 week before, I had just flown back a day before and it wasn't running. Since then, I've legit only seen the system active half the time I pass through the airport no matter which terminal it is, and of the other half of the time I've had the privilege to use it, it's slower than scanning passport and contributes to congestion, especially at T1 departure which is slow to begin with. The most annoying is when I'm let through the first gate and then it tells me to wait for a secondary check from the one officer doing the same thing for the other 20 gates, which wasn't a thing with passports. Surely you've encountered similar issues since you've used it so much. My experiencehasn't changedsincea full year agoand I don't know why it seems to be a me thing.",
          "score": -2
        },
        {
          "text": "Isn't she a PR actually? I know her husband is Singaporean. I don't follow her but she keeps showing up in my recommended posts on Instagram",
          "score": -4
        },
        {
          "text": "Since when could foreigners do passport-less clearance? The system isn't even active for citizens half the time, and fails facial recognition another half of the time when it's in use.",
          "score": -75
        }
      ]
    },
    {
      "id": "t3_1qp4zb9",
      "subreddit": "singapore",
      "title": "Singapore CEO’s family gains $1.5 billion fortune from blockbuster IPO",
      "url": "https://old.reddit.com/r/singapore/comments/1qp4zb9/singapore_ceos_family_gains_15_billion_fortune/",
      "score": 145,
      "num_comments": 29,
      "created_at": "2026-01-28T15:40:30",
      "selftext": "",
      "comments": [
        {
          "text": "Always heartwarming to see the mega rich get richer. You love to see plucky underdog stories like this.",
          "score": 176
        },
        {
          "text": "Dude I thought he was reviving the movie store",
          "score": 116
        },
        {
          "text": "Today, UltraGreen holds an 85 per cent market share in the US, Mr Sajwan said. This is despite the company raising the average cost of its dye vials in the market by 60 per cent and 30 per cent in 2023 and 2024, respectively, according to its IPO prospectus. Scum business practice, basically same style as Eli Lilly's insulin.",
          "score": 105
        },
        {
          "text": "“While Mr Sajwan runs the company, he has no direct stakes in it, according to filings. Instead, his sister Indu Rawat and her husband, Mahipal Singh Rawat, are the ultimate beneficiaries of the windfall through a little-known entity called The Saul Trust, the filings show. That entity invests globally in a variety of assets via Singapore-based Renew, of which Mr Sajwan is CEO.\nIndu and Mahipal run a Hindu monastery, or ashram, in India called Hanslok that was founded by Mahipal’s father. Entities linked to the two have registered addresses in Singapore, as does Indu, who holds a permanent resident status in Singapore, according to filings. “ Sister>trust>Renew> ultragreen \nSo many layers before reaching him, yea, signs of a major scum",
          "score": 75
        },
        {
          "text": "blew through his US$3,000 (S$3,800) monthly credit card limit every two days hustling on a series of tech start-ups. \"We had no money\" Damn.",
          "score": 67
        },
        {
          "text": "At one point, I had 65 credit cards doing just this. The fact that he can apply for 65 is sus.",
          "score": 46
        },
        {
          "text": "People are so used to ridiculous amounts of money being reported that they don't really comprehend how much 1 billion dollars is, If you put 1 billion dollars in a bank, with an interest rate of 0.1% p.a., it is still earning 1 million dollars a year which is still more than most singaporeans can save in their lifetime. Even with interest rate of 0.01%, (100k per year), it is still more than most singaporeans' annual income.",
          "score": 43
        },
        {
          "text": "Today, UltraGreen holds an 85 per cent market share in the US, Mr Sajwan said. This is despite the company raising the average cost of its dye vials in the market by 60 per cent and 30 per cent in 2023 and 2024, respectively, according to its IPO prospectus. Not doing a Russell Brand, is the healthcare industry the new Silicon Valley? Like, is it breaking bad? ",
          "score": 22
        },
        {
          "text": "Ah this ultra green. I discussed this with some doctor community months back and many don't even know what they are doing or heard of it. Even if you check the website, you wouldn't know what they are doing. It is very vague and how would the dye help in surgery? Tumor margins? It's weird. To me this is a red flag",
          "score": 17
        },
        {
          "text": "Goddamn… $1.5 billion can buy a lot of cai png",
          "score": 17
        },
        {
          "text": "Now we learned, when you deal with legal establishment, borrower is king",
          "score": 12
        },
        {
          "text": "With fish",
          "score": 12
        },
        {
          "text": "Like the saying all billionaires are bad/bald.  /s",
          "score": 10
        },
        {
          "text": "1.5bil straight away is Nasi padang liao, simi caipng.",
          "score": 10
        },
        {
          "text": "Fish + premium drumstick + 2 veg -> ultimate flex",
          "score": 9
        },
        {
          "text": "money makes money🖨️💵🖨️💵🖨️💵🖨️💵🖨️💵🖨️💵",
          "score": 8
        },
        {
          "text": "Grayce next target.",
          "score": 7
        },
        {
          "text": "Rich guy gets richer ! Hallelujah !!",
          "score": 7
        },
        {
          "text": "Burning through that much that fast just to end up with “we had no money” hits hard😬",
          "score": 5
        },
        {
          "text": "Not surprised. In the US, there are people making $100k a year with credit limits over $1 million. While not exactly commonplace, the system does not place limits on one’s total credit limit as a proportion to income. There’s a reason why big time credit card debt is actually a thing.",
          "score": 4
        },
        {
          "text": "4 meat no veg every day",
          "score": 4
        },
        {
          "text": "I read that as Milo Shock",
          "score": 2
        },
        {
          "text": "Eat crap processed food then jab yourself with this.",
          "score": 1
        },
        {
          "text": "So stunning and brave, was worried how they would survive in this economy!",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qpae6h",
      "subreddit": "singapore",
      "title": "'It raised 3 generations': Hup Chong Yong Tau Foo closes after 40 years in Toa Payoh",
      "url": "https://old.reddit.com/r/singapore/comments/1qpae6h/it_raised_3_generations_hup_chong_yong_tau_foo/",
      "score": 142,
      "num_comments": 23,
      "created_at": "2026-01-28T20:45:59",
      "selftext": "",
      "comments": [
        {
          "text": "Gone. No need to be insult by the like of stomp editor anymore.",
          "score": 106
        },
        {
          "text": "Have a good retirement auntie!!! So sad the stomp review saga ended things on such a bad note",
          "score": 58
        },
        {
          "text": "The whole stomp saga teaches a valuable lesson, if you got nothing of value to say just stfu",
          "score": 50
        },
        {
          "text": "The cowardly STOMP writer has been silent ever since her shitty article. Hope she got taken off the writing team permanently.",
          "score": 48
        },
        {
          "text": "I lived in this neighborhood for over 30 years and have seen the evolution of the 2 coffeeshops in Blk 203 (there are 2) and the many stalls that came and left. I remember most of them cuz I mean all of them fed me from when I was a kid to almost starting my own family now. This Hup Chong has got to be one of my top favorites who came and went (only this Hup Chong, the other at lorong 1 is mehh imo) and my family absolutely adores it as well. My mum loves their yam rice. When I saw that article from Stomp, I was legit fuming. Of all things the author chose to pick on, she picked the price point which in all sense unless you are blind, you would have seen the big price tag beside each premium item (usually about $1.20). Either that or she needs to retake her primary school math. By the way, as a regular who exclusively picks a minimum of 3 premium items cuz I’m a sucker for fried food, my orders have NEVER exceeded $8 even with takeaway containers. I wouldn’t be this mad if the article was about taste cuz it’s subjective but cmon playing with numbers? I mean with all due respect it might not be the author’s own idea to write something like this so whoever’s take on this needs to do some self reflection. Food quality at THIS price point? If anything, I’m sure the residents and regulars will tell you it’s a steal in the current economy.",
          "score": 33
        },
        {
          "text": "Cherylnn shaking again at the mention of hup Chong ytf.. prob never gonna eat ytf again",
          "score": 30
        },
        {
          "text": "They were already closing when the article came out. Writer bitch wanted to twist the knife.",
          "score": 13
        },
        {
          "text": "Hup Chong is gone. So is the post office. Now Dr Koh and the mama shop are the last ones standing. Man we are growing old, neighbor 🥲",
          "score": 11
        },
        {
          "text": "I guess I am out of the loop, anyone have the link to the stomp article?",
          "score": 7
        },
        {
          "text": "Went to try. It's not bad leh. And the price point is quite decent for the amt.",
          "score": 6
        },
        {
          "text": "Was it the stomp writer who wrote a terrible article????? Aiyo, the writer must be happy now that it has achieved the objective….sad! Sad for that family. The writer surely got promoted",
          "score": 4
        },
        {
          "text": "The other YTF w similar at TPY is it related to this shop? Sigh. Love their yam cheese.",
          "score": 3
        },
        {
          "text": "I feel like some food reviewers are trying to distinguish themselves from the competition and it makes them try and come up with more creative ways to review the food which can end up like this. Sometimes it's okay to just say the food doesn't taste good and go.",
          "score": 3
        },
        {
          "text": "sobs. my fav shop",
          "score": 3
        },
        {
          "text": "I love this place man! So sad to see it go 😭😭😭",
          "score": 1
        },
        {
          "text": "That article was modified already. Basically the author bought $x worth of y ingredients and complained that it's expensive at $x and other criticism. The modified version says instead that she expected it to cost $x.",
          "score": 0
        },
        {
          "text": "Suspect the owner probably pissed her off or something",
          "score": 0
        },
        {
          "text": "If the article was anything to go by, she upset that she paid 8.80 for her meal.",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qp3d83",
      "subreddit": "singapore",
      "title": "Man jailed after fatal PMD fire in New Upper Changi Rd flat",
      "url": "https://old.reddit.com/r/singapore/comments/1qp3d83/man_jailed_after_fatal_pmd_fire_in_new_upper/",
      "score": 132,
      "num_comments": 63,
      "created_at": "2026-01-28T14:08:32",
      "selftext": "",
      "comments": [
        {
          "text": "Putra Nur Iman Muhammad Danial Zhang, a Singaporean",
          "score": 129
        },
        {
          "text": "Wow, the incident killed his uncle's fiancee. How does one even live with that?",
          "score": 90
        },
        {
          "text": "pmd fire hazard la. Save a couple of dollars on transport, burn down whole house😭😭",
          "score": 74
        },
        {
          "text": "Racial harmony ambassador",
          "score": 69
        },
        {
          "text": "The judge highlighted the need for user education, noting Putra's \"indifference to the safety risks.\" That is the general attitude of these PMD/PMA/AMD/PAB users. User education will be a waste of time on the ignorant.",
          "score": 51
        },
        {
          "text": "Too tired to pedal, then buy illegal battery end up burning down the house and end up killing the uncles fiancee...the family should go no contact with this idiot",
          "score": 43
        },
        {
          "text": "Burn your own house is one thing, burning down your neighbours' houses is another",
          "score": 36
        },
        {
          "text": "Noting that at no point did Putra conduct basic safety checks or make inquiries into the compatibility of the battery charger, the judge said: “Such conduct reflects a persistent indifference to the safety risks and welfare of others.” Believe it or not, there are people like that who simply can't be bothered about electrical safety, because they think it won't happen to them, or that they will react fast enough if a fire broke out. And many of these people are living amongst us.",
          "score": 35
        },
        {
          "text": "Obviously to everyone here, if you want to ride an eBike or a PMD, please just go to an actual shop and get them to do repairs or buy from them. It's going to cost more than some random dodgy seller online but it's going to be much safer. Legal vehicles mandate a BMS which specifically mitigates fire risks like these along with other fail saves. Had he used a legal PMD, this fire wouldn't have happened. When you cheap out on the battery to buy the cheapest, the BMS usually sucks but a good battery? Expensive and might not have as much capacity but won't explode.",
          "score": 30
        },
        {
          "text": "Ram Mohammed Thomas",
          "score": 28
        },
        {
          "text": "Nur Sarah Tam d/o Saravanan",
          "score": 25
        },
        {
          "text": "This is just sad",
          "score": 23
        },
        {
          "text": "Honestly should just ban pmd in hdb/condo considering there’s others living there also, or build a pmd room or sth at void deck",
          "score": 23
        },
        {
          "text": "A lot of these PMD riders ignore road rules, do we really think they're going to take the time to research battery and charger safety? The authorities need to start going after importers and sellers of non-compliant equipment as well as the end user.",
          "score": 14
        },
        {
          "text": "You save few dollar cents a month but risk burning your house. This kind of risk to reward still don’t make sense",
          "score": 12
        },
        {
          "text": "I remember as a kid back in 2000s my parents told us with serious tone that you do NOT overcharge the phone overnight or even daylight because it will spoilt the phone. I never did until smartphone era because the phone battery is safe to overcharge but it can be degrade overtime. I think these guys thought that charging overnight is safe like smartphone. That and don't bother to do research or don't care to read the news of PMA/PMD fires lately until it hit them. Honestly, fk these guys. I fkin hate those people who don't bother to do a simple research",
          "score": 11
        },
        {
          "text": "Simple, it was just a \"silly\" mistake, he was \"young\" then.. small problem to him only.. part of growing up la /s",
          "score": 10
        },
        {
          "text": "Not going to give names but that's why just go to shops regardless. Even if they do third party or offer alternatives, it won't some cheap shit.",
          "score": 10
        },
        {
          "text": "They will avoid the PMD if they have brain..",
          "score": 9
        },
        {
          "text": "I think this could be a reasonable way forward if more and more cases pop up. in my company , we have a battery storage rooms where all lithium batteries are disconnected and stored there until use. there's also a rule that u can't leave the charging overnight (someone must be present). similarly, you dont park your motorcycle in your house flat also. this means dedicated parking spots, insurance, registration, regular battery inspections/check. if we are to take pmd as a legitimate mobility option, then these things have to kick in.and the costs have to be kept low too if not the users, who are typically low income gig workers, will just go for the unregulated option",
          "score": 5
        },
        {
          "text": "Did a world tour and came back",
          "score": 2
        },
        {
          "text": "Are electrical appliances from Taobao safe to use? How do you determine?",
          "score": 1
        },
        {
          "text": "Use a meter that goes in between the device and the charger, and measure how the wattage throttles (or not) as the batt gets full.",
          "score": 1
        },
        {
          "text": "or if you die die want to go 3rd party for a fatter battery pack, then go to someone reputable. they exist, their stuff is more expensive but people trust themfor good reason.",
          "score": 0
        },
        {
          "text": "Exactly, i even know of some friends who are young and actually still uses Android based phones on a daily basis. And two of them just complained that their social accounts got hacked. People will just keep on doing what they do, and will never ever link the bad events to what have occured to them to hat they have consciously chose to do as part of their daily lives. Never. They'll just think it'll never happen to them or that the concerns are overblown out of proportion.",
          "score": -2
        }
      ]
    },
    {
      "id": "t3_1qp3u6f",
      "subreddit": "singapore",
      "title": "13 taken to hospital after accident involving lorry and car in Orchard Road",
      "url": "https://old.reddit.com/r/singapore/comments/1qp3u6f/13_taken_to_hospital_after_accident_involving/",
      "score": 76,
      "num_comments": 39,
      "created_at": "2026-01-28T14:34:30",
      "selftext": "",
      "comments": [
        {
          "text": "Government really really waiting for shit to happen before doing anything. I'm really getting quite sick of it. Must someone die first? Migrant workers deserve better. Imagine leaving your family to come here to work then being subjected to mostly substandard conditions. Even a child who sees them sitting on the back of lorries also can tell you it doesn't look safe. All just because companies want to save more money. Don't tell me they can't afford it, i don't and wont buy it.",
          "score": 95
        },
        {
          "text": "The 13 people taken conscious to hospital comprised a 64-year-old male car driver and 12 male lorry passengers aged between 30 and 51. The lorry passengers are foreign workers. ",
          "score": 82
        },
        {
          "text": "There HAVE been several deaths in the past few years so clearly even the loss of lives won’t push them to make changes. https://www.straitstimes.com/singapore/courts-crime/pie-accident-second-migrant-worker-dies https://mothership.sg/2024/12/tuas-accident-lorry/ https://www.channelnewsasia.com/singapore/driver-car-crash-lorry-migrant-workers-fracture-skull-spine-brain-injury-5672721(no deaths but the list of injuries makes me wonder what quality of life they even have, and if they were able to continue working) Bonus: Chee Hong Tat’s statement on this https://www.mot.gov.sg/news-resources/newsroom/written-reply-to-parliamentary-question-on-response-to-recommendations-in-report-on-transportation-of-migrant-workers-on-lorries/",
          "score": 32
        },
        {
          "text": "Proper transport for the foreign workers please! Sitting at the back of the truck like that is so dangerous!",
          "score": 26
        },
        {
          "text": "Tells you how the govt and the populace perceives the value of the lives of migrant workers. The solution is so simple and doesn't even cost that much, and the fact that that regulation has not passed just shows how the govt is actively taking a stance that their lives don't matter.",
          "score": 20
        },
        {
          "text": "It’s not only Chee Hong Tat. Here’sAmy Khor’s reply. Banning the practice of transporting workers in the back of lorries is “not practical”, as doing so may spell the end for some micro, small and medium-sized enterprises (SMEs), Senior Minister of State for Transport and Sustainability and the Environment Amy Khor told Parliament on Feb 26. We should transport these politicians in the back of lorries.",
          "score": 19
        },
        {
          "text": "Wtf kind of reply is that “it is not operationally possible to ban the transportation of workers on the back of lorries. Doing so will have a serious impact on many Small and Medium-sized Enterprises who may have to cease operations, leading to job losses for workers, project delays, and higher costs for Singaporeans.” Still continuing to monitor LOL",
          "score": 16
        },
        {
          "text": "Always remember this horrible accident in 1994 when a cable roller crushed the workers seated at the back of the pickup.https://eresources.nlb.gov.sg/newspapers/digitised/article/newpaper19940702-1.2.8 Seriously when will things change?",
          "score": 12
        },
        {
          "text": "The drivers were jailed right? Damn man, month into 2026, with all the smarts in parliament, we can only tell Pritam to step aside.",
          "score": 9
        },
        {
          "text": "I suspect companies see this as an opportunity cost. Even if seeing clear evidence that accidents like these costs way more and the time lost, as it doesn’t occur on a daily basis, easily can be seen as unnatural in daily operations. Buying additional bus with all the heavy costs of COE, maintenance, parking and hiring another driver for one specific yet more important role in keeping staff safe and alive. Outsourcing is probably better but from their POV, will the costs be absorbed by their clients? It is so obvious that safety in transportation is a necessity for them as manpower is crucial for them to operate 24/7 but unfortunately cutting costs is always the highest priority. Maybe public transport can help with all the discontinued bus services but lack of captains also means money comes into the equation. Blood on their hands but remember there’s cash in their pockets",
          "score": 8
        },
        {
          "text": "Don’t get me wrong I’m all for safety as well! Just that it’s hard for govt to do something when both outcome also they kena that’s why keep say monitoring.",
          "score": 5
        },
        {
          "text": "Yeah it's a simple calculation for them. Getting proper transport buses + drivers + safety costs more than a few people dying every year and when you take morality and value for life out of the equation, they are right.....it costs less. The only way this type of thing gets solved is by regulation. If we didn't have regulation, we would have companies spewing toxic fumes into the waters and the air and using slaves and child labour and what not. We made a decision to have regulation for all those things, including road safety for all other residents of singapore, but for some reason, the govt sees migrant workers as less than human and doesn't offer them the same protections. It's quite inhuman and shows how the govt actually sees the status quo rather than the lip service they give it. Ministers or their buddies probably have financial ties to a lot of these operations and don't wanna drive up operating costs. Keeping everyone in the club happy.",
          "score": 4
        },
        {
          "text": "Can do it one. But in the end who bears the cost? If these workers are say building HDBs or some housing project, the cost will be passed on to citizens. Then citizens gonna complain why so expensive etc etc.",
          "score": 3
        },
        {
          "text": "If they want to use these kind of excuses then fine, at least research and implement some kind of safety harness cum seating rig for people in the back. If you can do it for a 5tonner troop lift, you can do it for a lorry. Classic no action talk only.",
          "score": 2
        },
        {
          "text": "They are definitely shifting the goalposts here, but TBF a complete ban is really not worth it if not impossible. Around 4/5 people limit is perfectly ok with equipment stored securely, proper seating, and speed regulators installed, and won’t really hurt small businesses, but packing 12 people in the back of a van definitely should be banned. Yet such practices continue, coz if there are any such regulations instead of “recommendations” they are not enforced or tacitly tolerated. It is also at the same time true that NSFs endure worse conditions, so it’s impossible to convince people this of all things should be illegal…",
          "score": 2
        },
        {
          "text": "Don't necessarily need to buy bus. Rent. Cost may be higher but cheaper than paying hospital fees. Also, there are insurance implications that can help with the rental e.g. renting busses, lower payment to insurers to offset bus rental. All these coordination between companies need gahmen to initiate.",
          "score": 2
        },
        {
          "text": "It really depends on who the passengers are. If tomorrow the headline is ‘12 CEOs Injured While Sitting In A Lorry’ I’m quite reforms will be forthcoming soon enough. Or just substitute with ministers, teachers, lawyers etc.",
          "score": 2
        },
        {
          "text": "I’m aware of that but costs have always been going up regardless. Countless reasons have been given for less. I’m sure citizens would also feel better knowing the people that built them their home have some sort of minimum care given.",
          "score": 2
        },
        {
          "text": "That's the point. It probably is cheaper to let a few accidents happen and let a few people die every year than to pay for better conditions for them. There is no cost for human life. So if it isn't enforced at a govt level and left up to the \"poor\" starving small business owners, this will remain the status quo for the foreseeable future.",
          "score": 1
        },
        {
          "text": "Yeah exactly, look at ST’s headline, they were careful to not mention that almost all of them were migrant workers",
          "score": 1
        },
        {
          "text": "Yeah but injured workers = delays. Singaporeans also complain alot about BTO delays, how come cannot do faster better cheaper. Have to frame the answer in the right way for the people to accept it. Don’t say it’s adding costs for worker safety, say that it’s preventing accidents from delaying building projects then people are okay.",
          "score": 1
        },
        {
          "text": "Ppl in Gov are not people of ideas, can someone do like an idea competition to solve this issue? Like, uber/grab for construction workers?",
          "score": 0
        },
        {
          "text": "I assure you the cost is not gonna be exorbitant and Singaporeans surely can afford to pay it.",
          "score": 0
        },
        {
          "text": "frankly, NSmen sitting in 3tonner is similar situation. except we have to wear helmets",
          "score": 0
        },
        {
          "text": "Yeah i always felt it was rather dangerous, especially the ones sitting at the edge.",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qp3zur",
      "subreddit": "askSingapore",
      "title": "final year of uni and i feel like i’m going to end up alone",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qp3zur/final_year_of_uni_and_i_feel_like_im_going_to_end/",
      "score": 126,
      "num_comments": 37,
      "created_at": "2026-01-28T14:43:28",
      "selftext": "i’ve been feeling really lonely lately and i don’t know where else to put this\n\ni’ve never really had close friends, even growing up. i’ve never had someone i feel actually comfortable sharing my personal thoughts or feelings with. i have maybe one or two people i text sometimes, but we don’t talk about anything deep, and honestly i feel like we’re going to drift apart eventually. when i see other people with close friends or friend groups, i get so jealous it actually hurts. it makes me feel like such a loser.\n\nthe thing is, i don’t think i’m a bad person. i’m not mean or toxic or anything. i just can’t seem to make real connections with people. and now i’m in my final year of uni, which makes it feel even worse. everyone says uni is the easiest place to make friends, but i didn’t make a single real one. just hi-bye people in lectures and tutorials. it honestly feels like i wasted this whole phase of my life.\n\nrecently it’s gotten really bad. every time i see people hanging out together on campus, studying, eating, laughing. I feel so sick, like i might actually throw up. it didn’t used to affect me this much, but now it’s overwhelming and i can’t stop thinking about what i’m missing.\n\ni’m also really scared about the future. once i graduate and start working, how am i even supposed to make friends then? if i couldn’t do it in uni, how will i do it later? i keep thinking am i just going to die alone?\n\ni’ve also never been in a situationship or a relationship. no one’s ever liked me that way. i really want to experience romance at least once in my life, but i feel like my lack of friends is probably a huge red flag and a turn-off anyway\n\ni don’t really know what i’m looking for by posting this. i guess i just want to know if anyone else feels like this, or if anyone felt this way and things eventually got better. right now it just feels really lonely and permanent.",
      "comments": [
        {
          "text": "Making friends is about being proactive I made plenty of friends via various online platforms over the years, some became close friends over the years. It's really all about getting your butt off and really joining various communities out there or even setting up your own and be involved with activities. I will teach you one very important concept in life. Learn to be of service to others. I have made countless friendships over the years with that mindset",
          "score": 50
        },
        {
          "text": "What you said is p relatable, I only managed to find a friend group as of like end of last year, and most of the time in school I’ve been on my own. If you like we can be friends! Though to put it across I’m not looking for anything more atm ( life is not in a good place) but if you’re looking for a sincere friendship with a random on the internet, feel free to drop a dm.",
          "score": 37
        },
        {
          "text": "Its okay dude, I also didn't make a single friend in Uni. Now a bbfa living with parents. But it's a pretty comfortable life.",
          "score": 21
        },
        {
          "text": "I had a similar experience than you! I tried really hard to make friends in uni but felt like I couldn't really bond with anyone there. For me, I realised I was just trying too hard to be likeable and not being very authentic so it would've been very hard for anyone to actually get to know me or open up with me (and vice versa). It was only when I started working that I had a stronger sense of self, stopped worrying as much about whether people liked me or not, that I befriended more people! I'm sure you're on a different journey from me - as you are from everyone else, so don't worry too much. You still have so much life ahead of you!",
          "score": 19
        },
        {
          "text": "In terms of platform, given my age, I have made friends via IRC, various online games, forums, reddit, telegram, whatsapp. I have never bother to use meetup much though. Being of service is simply about looking at how you can be of help to others. Everyone has skills and knowledge, or even just time and energy that can be used to make someone else's lives better. If you know how to utilise that well, people in general will be attracted to you. I am at present running 3 different online communities (of completely different domains) and all 3 are less than 2 years old each and I have met and gotten to know plenty of new folks through each community. I'm also part of a few other communities. I'm also friends with a fair number of my ex-colleagues from previous workplaces. Still meet them every now and then for meals and chats. Heck, even my ex-interns continue to meet up with me for meals",
          "score": 19
        },
        {
          "text": "It is easier in work place than uni as you work with the same people for 8 hours a day. You will be like dont find me.\"",
          "score": 17
        },
        {
          "text": "For the part “I’ve never had someone I feel actually comfortable sharing my personal thoughts or feeling with”, sometimes the person might be there already. However if you keep everyone at arm length, people will feel distant from you and decide you are not interested in a relationship more than being acquaintance.",
          "score": 11
        },
        {
          "text": "Work pple are only friends when u quit.",
          "score": 10
        },
        {
          "text": "Oh wow. Which platforms u use to meet ppl, other than meetup be of service How",
          "score": 8
        },
        {
          "text": "It just means that you didn’t find a click during Uni. We find friends at different stages and making friends happens by nature, you can’t really force a friendship. You might not even find friends tbh. Just like not everyone finds their other half. Accept what comes, you can’t force it. Unless u have some hobby then maybe can start with finding common hobbyists online and meet in real life that’s about as good as it can be.",
          "score": 6
        },
        {
          "text": "you wont. after 5 years you would laugh that u posted this. dont give up",
          "score": 6
        },
        {
          "text": "I share similar experience as you except that i met my now wife during poly days. She is the only person i could talk to. Didn’t contact with all other poly mates already. I have few friends from sec school but honestly quite surface. Nothing deep and meaningful. I dont really enjoy hanging out, mostly just for the sake of it. Sometimes i do wonder if i dont meet my wife, would i still be single. 1 year ago i started tennis, i played regularly with strangers. So that’s one way i meet new people nowadays. Maybe just continue working on yourself and if the right person comes, it comes..",
          "score": 4
        },
        {
          "text": "I always watched tennis highlights but didn’t thought of playing. When Vivo city opened the wilson store, i impulse bought a racket cuz i liked the colour. I put up a listing on carousell looking for tennis partner. Surprisingly people enquired and that’s how i started. Subsequently i found this app called ROVO, mostly for hosting and searching for tennis games. From then i regularly host and find games there, self learning tennis from YouTube and playing with strangers. Thinking back, it could be because i want to do something with my time, learn new things, meet new people etc that i decided to just start playing tennis. I’m glad i started and wish i’ve started much earlier.",
          "score": 4
        },
        {
          "text": "You are too comfortable in your our skin. Make yourself uncomfortable and make friends. Force yourself to do it like a job.",
          "score": 4
        },
        {
          "text": "there are times i feel my friends only ask me to play with them because i can hard carry them",
          "score": 3
        },
        {
          "text": "Hey don't worry! I didn't had friends during my pt degree either (everyone is just working their butt's off). As someone who doesn't have close friends or partner during my school times, I know how u feel. You mentioned wanting to throw up when seeing others.\nI think the key is accept the thoughts and don't let it control you. Let it past. It's not easy to make close friends and much harder to maintain. I'm a current postgrad student studying too, if you like to be friends, just pm me.",
          "score": 3
        },
        {
          "text": "Had a hard time making friends in uni as I couldnt bring myself to trust them. Given how I see my other uni peers had their uni friends going MIA on them after graduating, I made the right decision. I always feel uni friendship is very transactional. I ended up making friends through social platform and hung out with them occasionally to eat together or just talk cock.",
          "score": 3
        },
        {
          "text": "This is pretty relatable to me. I ended up finding a partner within a few months of working. Although she has a pretty big friend group, the only person I hang out with is her and it’s fine by me because I actually don’t mind hanging out by myself. On the days she is with her friends, I make my own plans. Occasionally, she will bring me along to meet her friends. I think part of growing up is also about being able to accept being alone and enjoy time alone with yourself. I travelled alone multiple times too! For context, I have pretty loner hobbies so it’s hard to have friends. I don’t club, don’t drink so I’m probably the only one who doesn’t have friends outside of work at my workplace. But I think it’s fine as long as you are happy with where you are",
          "score": 3
        },
        {
          "text": "I'm gonna be pretty Honest, you are cooked, it is already very difficult to socialise in Singapore most people have low social skills here no offense to them and making quality friends out of a schooling environment here is very difficult. Here's how can fix this though. The trick to making friends is three things. 1. Showing up at the same place again and again where you meet someone. (Can even be league of legends) 2. Asking them questions and doing their activity and seeing if they reciprocate. 3. Being vulnerable, showing your true self, and telling them something sensitive. Make plans and initiate, and keep repeating until something forms. it is a numbers game. I am an ambiverted person but even for me it's very difficult to socialise in Singapore. For eg I made the same number of friends I have in Singapore in Malaysia in 5 days. That's how conserved we are. Do not care if they are men or women or anything accept them and be respectful and try to have fun with them. People love when you allow space for them to exist in your world and then shown your world. Not the other way around. You have already made one step of being vulnerable about this, if i can help would love that :)",
          "score": 3
        },
        {
          "text": "You are not alone, just follow through and graduate first, find your new friends from other places like networking sessions, online platforms etc. Do be more pro-active in group activities and it will be better naturally",
          "score": 2
        },
        {
          "text": "Im in my penultimate year. Did not make much friends too in uni. Spent my time either doing internships or running my business outside of schoolwork. You will be closer to your work mates when you start working imo. Work friends are easier to make than uni friends at our stage atp. Everyone in uni got their friend groups already so its hard to insert ourselves in there too.",
          "score": 2
        },
        {
          "text": "I used to have a bestie in secondary school. Graduated and we drifted apart. Got a second best friend in my part-time work. He got married and drifted apart. My third and current best friend is also from the same part-time job. We are not so close anymore but bestie since 2016 so 10 years now. The common thing among my besties are that we have the exact same interests so we could click. I know it's very difficult. If I lose my current bestie, I don't think I'll have anymore bestie. Keep exploring and keep making friends. Don't give up!",
          "score": 2
        },
        {
          "text": "I got to know my closest friends as a working adult through joining hobby communities and volunteering. They are the ones whose friendships I see lasting long-term since we share similar values and everyone is emotionally mature. On the other hand, my uni friends were either proximity friends or people whose paths diverged too greatly from mine. For the proximity friends, we drifted apart once it no longer became convenient to meet and effort became one-sided. Your life is just beginning after university. Don't lose hope, OP!",
          "score": 2
        },
        {
          "text": "How do you start tennis as a adult newbie interested to know wanna try too",
          "score": 1
        },
        {
          "text": "did you try joining clubs?",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qp6a77",
      "subreddit": "askSingapore",
      "title": "How’d you define “having made it in Singapore” by 40?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qp6a77/howd_you_define_having_made_it_in_singapore_by_40/",
      "score": 84,
      "num_comments": 105,
      "created_at": "2026-01-28T16:58:01",
      "selftext": "Late 30s person here. Been feeling like I cannot breathe in Singapore lately. Housing prices are going insane, it’s getting so crowded and competitive. Kind of feeling like I’ve lost the rat race here. 🥲\n\nHaven’t gotten a house, not invested, not yet married, no kids, with a career and skill sets that’s somewhat challenged by AI (gonna need to unlearn and learn everything again, against the kids who are native in this & can spend all their energy on going all in on this), and last but not least, also no inheritance to await (unlike many others according to the news).\n\nWondering how everyone else is taking this! & their future in this place.\n\nSorry if this is kind of random and maybe pessimistic. Kind of, maybe having a panic attack now…\n\nEdit: To clarify, I’m not comparing with others per se. Those are my goals and I thought I could have achieved them earlier. In the process, I feel like I had to keep putting things aside to keep up with earning more, and now everything feels quite out of reach.",
      "comments": [
        {
          "text": "Comparison is the thief of joy. Set your own goals.",
          "score": 138
        },
        {
          "text": "You said you are not comparing but your thread speaks otherwise. Take a day to self-reflect:\n1) List down what you have\n2) List down what you want\n3) List down actions to achieve what you want\n4) Have a timeline [short term (1-3m check-in), mid term (1 year achievable), 5 years goal] The most important part comes next. Doing it. You dont have to be right. You just have to do it and see where your actions lead to. All changes start from self. If you dont do shit, nothing will happen. Change one day at a time.",
          "score": 74
        },
        {
          "text": "Im a 40yo sole breadwinner with a kid and no loans (fully paid my house). I'm a diploma grad with a failed GPA. I would say I have done a great job already. There is no need to compare with others.",
          "score": 71
        },
        {
          "text": "Perspective is important. You have a job when others don't.\nNo house means no pressure to pay off a debt/mortgage each month.\nNo wife/kids means no liabilities or responsibilities. You spend your time and money in a way that makes YOU happy.\nNo investments means no emotional roller coaster -- trust me I've invested in stocks but am down now because the orange USA president keeps threatening tariffs.\nYou are relatively young -- you're not a lady with a biological clock, which means you can still start a family if you want. How you look at your situation is up to you. Many would kill to be in your situation.\nThe jobless will envy you.\nThose stuck in a bad marriage will envy you.\nThose older than you will envy you.\nThose in debt will envy you. Take control of your perspective!",
          "score": 43
        },
        {
          "text": "Tbh some of the things you listed isn’t within your control… housing here is pretty much dictated by govt rules. If you aren’t married, chances are you don’t have a house until you reach 35. Unless you are rich then sure… Investment you can always change that but start investing. There’s plenty of guidance inr/singaporefi Relationship wise, cant be rushed. Marrying the wrong person can be the biggest mistake of your life. So… take your time and find the right partner. Financially doesn’t matter imo, the personality and mindset is more important.",
          "score": 19
        },
        {
          "text": "By 40 I’d like to have developed an inner peace/assurance and have developed a self confidence that I am enough. I am on my own journey and am ahead and behind in some areas and that’s ok!",
          "score": 16
        },
        {
          "text": "This is a fellow 85 saying good job and if you can,  share this confidence with friends and family :) made me smile today.",
          "score": 15
        },
        {
          "text": "At least you are healthy, some don't even make it past 35 even though they had wealth career family kids",
          "score": 15
        },
        {
          "text": "\"Health is a crown that only the ill can see.\" -Imam al-Shafi'i-",
          "score": 14
        },
        {
          "text": "My parents divorced when im in poly, and none of them is willing to pay my school fees. So I have to work part-time and study during poly (thus the bad gpa). So I make very sure in life, my own family is not like my parents' one.",
          "score": 13
        },
        {
          "text": "Sounds like you need to start penning down your goals and get started... taking one step is better than none, and one step at a time will get you closer to what you want. No one's path is the same.",
          "score": 12
        },
        {
          "text": "That’s great! I think being able to get to where you are mentally and emotionally is winning",
          "score": 4
        },
        {
          "text": "Empathy will be nice :)",
          "score": 4
        },
        {
          "text": "Ya lor people climb the ladder from intern 3years become VP earning 230k... How to get on the knees I mean their level?",
          "score": 4
        },
        {
          "text": "U forgot those younger than u who dun have adult money",
          "score": 3
        },
        {
          "text": "I replied to others in this thread . if u want a ladder , I will tell u I know country CFOs, an MP by 40, fund management leaders , heck don’t need to look far, see Shou Zi Chew , or any ex-Big Consulting person now C suite before 40. How to calibrate/re-calibrate to their level ?",
          "score": 3
        },
        {
          "text": "To me, someone who has made it in their 40s is someone with a lot of self-awareness and realistic perspective of the world. Meaning, they are able to reflect on their life choices and adjust to changes. They adapt and grow stronger. They put effort into working on what they want to improve on. If they don't own a place and they want a place, they will find a way to get rental or 2 room minimally. They won't look at others who live in prime areas with Instagram interiors and start to envy. If they want to travel, they will adapt their travels to their circumstances and be at peace. It does not matter how much money they have but they have self-respect. They have a mindset full of dignity. They have MY respect. Warning: incoming harsh words. But you're late 30s, so what the point of gentle words? Maybe you're in this mindset because people have been too gentle to you all along. You're in denial, claiming you're not comparing with others. But you use the word \"competitive\" in your post. You feel the pressure, and it's entirely self-inflicted and mental. Stop blaming the environment. The fact that you're complaining that you have no inheritance and then comparing with what the news reported is frankly pathetic. Basically, your post shows that you are bitter and stressed....about not being handed enough money on a platter. You have internalized certain Asian expectations without thinking for yourself despite all those years of education. Secretly, because of this mindset, you judge others according to these milestones and are now turning to judge yourself needlessly. You need therapy. Not a \"life coach\" or whatever social media nonsense. You need to talk to a professional to shift your thinking.",
          "score": 2
        },
        {
          "text": "Great list",
          "score": 1
        },
        {
          "text": "This. Time to make those changes, no matter how small a step, it's still one step taken towards your goals. Little things add up to become big things, so just get going",
          "score": 1
        },
        {
          "text": "Here's a sneak peek of/r/singaporefiusing thetop postsof the year! #1:DINK couple (50M, 48F) finally fired with S$3m#2:A semi-detailed 2025 Guide to Financial Independence (Repost)#3:My FIRE Journey: Year 10 Update - Turning 40 and reaching $4M net worth I'mabot,beepboop|Downvotetoremove|Contact|Info|Opt-out|GitHub",
          "score": 1
        },
        {
          "text": "stress from the constant comparing? or failure to reach goals.",
          "score": 1
        },
        {
          "text": "Your comment has been automatically removed because your account is relatively new or you have negative karma. I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns.",
          "score": 1
        },
        {
          "text": "Yeah I guess we want what we don’t have. I’m grateful for a healthy body (I think), though I was at the Chinese doc earlier & one pulse reading and her immediate response was… “You seem VERY stressed” and mind you I was very calm in the way I was talking to her! Sleepy in fact.",
          "score": -5
        },
        {
          "text": "I’ve always had my goals written out - and it’s why I feel like maybe I need to accept that I’ve made some mistakes in my choices in the past x years… missed the bull market run, for example, many have doubled their money in the 5 years, making a lot of people richer, and decent housing just seems so out of reach now",
          "score": -5
        },
        {
          "text": "To clarify, I’m not comparing with others per se. Those are my goals and I thought I could have achieved them earlier. But with the process, I feel like I had to keep putting things aside to keep up with earning more, and now everything feels quite out of reach.",
          "score": -16
        }
      ]
    },
    {
      "id": "t3_1qpbytm",
      "subreddit": "askSingapore",
      "title": "What is the average height of Singaporeans?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qpbytm/what_is_the_average_height_of_singaporeans/",
      "score": 82,
      "num_comments": 66,
      "created_at": "2026-01-28T21:54:21",
      "selftext": "I saw a recent thread on SGExam where youths were discussing whether Singaporeans are getting taller. Many comments claimed that 170 cm is considered short nowadays. One of the more upvoted comments even said that the average height of the younger generation is at least 180 cm.\n\nIf this were true, it would mean Singaporeans are now among the tallest populations worldwide, at about 10 cm above the global average, surpassing many developed Western countries such as the US and Canada, and almost comparable to the Netherlands people who are considered the tallest in the world.\n\nHow are Singaporean kids getting so tall?",
      "comments": [
        {
          "text": "4 things people tend to exaggerate on the internet. The average Redditor has 7 inch dick/ D cup breasts, 185cm and makes 30k/month.",
          "score": 278
        },
        {
          "text": "Last updated official average heights: Male: 173cm Female: 161cm But yeah younger generation kids are getting taller, some lower sec boys are already close to my height (178cm), some are taller than me.",
          "score": 140
        },
        {
          "text": "12M 3.2m, my classmates are about 2.7-3m average",
          "score": 126
        },
        {
          "text": "Don't forget they also hit FIRE at age 35 according to /sgfi.",
          "score": 94
        },
        {
          "text": "Bro, you born in pandora?",
          "score": 67
        },
        {
          "text": "As a guy I always understate my breast size. 😭",
          "score": 59
        },
        {
          "text": "I think there are multiple research papers on how advances in food tech and just the dense amount of cals nutrients and junk food they are consuming is actually increasing their heights, and lowering their age to reach puberty as well. And I think there was some research on how the average length of sausages is also increasing in length on average over the decades which is not exactly a good thing.",
          "score": 45
        },
        {
          "text": "it would mean Singaporeans are now among the tallest populations worldwide, at about 10 cm above the global average, surpassing many developed Western countries This is the wrong conclusion. You are comparing only tall Singaporeans to the average height of another country. The younger generation of almost every country is taller than their previous generation. Singapore is nowhere near the tallest population in the world.",
          "score": 41
        },
        {
          "text": "One of my New Year's Resolutions is to reduce my breast size.  It looks borderline obscene when I wear my army running singlet.",
          "score": 24
        },
        {
          "text": "If overall sg male average 173.5cm as per statistics, than the breakdown is: Older gen: 170cm Millennial: 173/174cm Gen Z: 176/177cm ??? But it’s true kids are getting taller because they are shifting towards western style diet ( more protein intake). Last time older gen always like to eat hawker food that are high in carbs Heresay meat these days are overly processed and packed with growth hormones too",
          "score": 24
        },
        {
          "text": "Yeah I saw a research article on Korean’s avg height since the Korean War. They have become much taller as the country modernise and food is abundant after the war, particularly people became more wealthy and able to afford meats.",
          "score": 15
        },
        {
          "text": "Lol. I like that u say average is 30k/mth. The old exaggeration was 20k/mth. Even exaggeration has inflated now",
          "score": 14
        },
        {
          "text": "Lmao",
          "score": 13
        },
        {
          "text": "All the kids nowadays are taller than me",
          "score": 11
        },
        {
          "text": "This lol",
          "score": 9
        },
        {
          "text": "I am below average in everything other than point 1 – and I'm a guy!",
          "score": 6
        },
        {
          "text": "No la bro average redditor salary is 10k a month",
          "score": 5
        },
        {
          "text": "Knn Slenderman must take psle also ah",
          "score": 5
        },
        {
          "text": "Kurt Tay, is that you?",
          "score": 3
        },
        {
          "text": "Yeah tallest avg would prob be Netherlands or Germany, 1.8m still can be considered short for a guy there.",
          "score": 2
        },
        {
          "text": "Add in millionaire investors",
          "score": 1
        },
        {
          "text": "From what i know, in general junk food, platic leads to hormonal issues and low test, etc Increased protein intake in childhood will lead to taller indoviduals.since most of the previous generations were malnourished future generations will get taller when their diet is more nutrient rich and protein rich. Although in the case of korea its the use of growth hormones not food tech. Its famously one of the biggest importers of growth hormone.  So i wouldnt take them as a great example.",
          "score": 1
        },
        {
          "text": "3.2m refers to height or something else?",
          "score": 1
        },
        {
          "text": "3 years old but already with a 12 metre dick?",
          "score": 1
        },
        {
          "text": "So you are like 10 feet! Or you are poor at math?",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qp8njy",
      "subreddit": "askSingapore",
      "title": "Are more drivers not stopping or slowing down at zebra crossing these days?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qp8njy/are_more_drivers_not_stopping_or_slowing_down_at/",
      "score": 81,
      "num_comments": 34,
      "created_at": "2026-01-28T19:18:08",
      "selftext": "A few times I have experienced while crossing the zebra crossing where the first car would stop but the car at the back will aggressively honk (experienced this three times in three different places in a month when I go out and I rarely do go out).\n\nIn some cases drivers just don’t bother to stop for people to cross even when there are people at the zebra crossing but speed up instead. That could have gone so wrong so fast.",
      "comments": [
        {
          "text": "I had a horrible experience at a junction in Bugis before. The driver was turning left but he has to wait for me to cross the zebra first and he was so annoyed because I was walking really slow. He was reving and reving his car to show his disgust and right after I passed he sped up so fast that I almost lost my balance. I was 4 months pregnant at that time. To this day, I still remember his yellow sports car. So rude!",
          "score": 47
        },
        {
          "text": "today i was crossing the road and the driver saw me and kept pushing forward. I had to stop and gesture what the for him to finally realise he shouldn't keep moving, sg drivers are like dogshit, no offense as someone carrying a license myself lol...",
          "score": 39
        },
        {
          "text": "This is why I always make eye contact with the driver and wait for them to slow down before crossing. There were a few times where the driver mistook me slowing down as permission for them to go? So they just go instead of stopping. But it's whatever, let them chiong then. But yes, in general I find that drivers are getting more and more impatient these days. I had to take Grab a few times last month, and so many of the drivers were speeding, driving recklessly, and honking at cars that don't immediately shoot off when the traffic light turns green. I remember telling one driver to slow down and lied that I wasn't feeling well, and he just told me if I'm sick than better for him to rush me to my destination then. I reported every one of those drivers to Grab and left bad reviews.",
          "score": 35
        },
        {
          "text": "Drivers here are dogshit. As a driver, I get horned by the car behind when I stop for pedestrians to cross at a zebra crossing. As a pedestrian, I’ve noticed drivers gunning the turn at traffic lights ahead of pedestrians the moment the light goes green, and speeding past zebra crossings. So I’ve learnt to wait for them to stop.",
          "score": 30
        },
        {
          "text": "Yes very common and enforcement is lack. Once I stepped onto the zebra crossing I had to step back because the driver has no intention of stopping, he overshot the zebra and made a gesture before speeding off. Young p-player punk driving a hot hatch.",
          "score": 16
        },
        {
          "text": "Honestly I feel like drivers or even bus drivers are like this, they are rushing everywhere, I legit had times where when I was crossing, a car just didn’t stop and go past me like trying to squeeze through or smt, thank fuck I wasn’t walking fast otherwise I would confirm get hit, I had another case where someone was looking at their phone not even looking at the road properly, idk if it’s me but the amount of times I have seen in my place, it’s mostly Mercedes drivers",
          "score": 12
        },
        {
          "text": "Now I will hold a fake brick",
          "score": 11
        },
        {
          "text": "Carry a brick next time",
          "score": 10
        },
        {
          "text": "IDK if the rules or laws change... cars no longer stop at zebra crossing unless you stop at wait for them to stop ... if they even stop at all! quite a few times, they no longer stop, and the cars just keep on going.",
          "score": 8
        },
        {
          "text": "I have seen this also. Recently I got a video of a driver who just drove through the zebra crossing even though a guy was already beginning to cross. So I just submitted a report to traffic police against the driver.",
          "score": 7
        },
        {
          "text": "I cycle, and slow down around zebra crossings and I can't tell you the number of times drivers will make eye contact with me and speed up and drive on. Had one honk at me when I was slowing down, then sped up and crossed 🫥 they do not give a fuckkk",
          "score": 6
        },
        {
          "text": "I always check blindspot when approaching zebra crossing because cyclists. Have always slowed then stopped (that's what a fucking zebra corssing is for). And then you have people who, tbf I do understand them, stand under the shelter at the zebra crossing but don't have the intention to cross until the traffic light turns in their favour. Stand further away from the edge of road, it helps.",
          "score": 6
        },
        {
          "text": "Unfortunately yes. Not only that but also when pedestrians are crossing the road where there’s a traffic light - one time I encountered a driver who was turning in but it seems like he’s really impatient and almost bumped into me when I was crossing (green man light is on)… its a zebra crossing and a pedestrian crossing for a reason and now it’s my responsibility to be alert at all times 😅",
          "score": 5
        },
        {
          "text": "Remember the car plate! If you get bang, you know who to sue for your life if you still live.. The criminal case dont help.. always must do civil suit.",
          "score": 3
        },
        {
          "text": "I always tell myself nvm, they are doomed to get into an accident soon with that attitude but please don't let me be collateral damage",
          "score": 3
        },
        {
          "text": "Not these days but always. They're rushing to hell. Also quite a few times the car behind will honk even during green man crossing. And I walk at a normal speed; not glancing at phone or anything.",
          "score": 3
        },
        {
          "text": "I see some drivers do that elderly too, especially with some elderly where you can tell that they have difficulty walking. It’s disgusting that they acted that way!",
          "score": 2
        },
        {
          "text": "Yes, motorists are definitely less considerate now when it comes to stopping at zebra crossings and also more are beating amber / red lights. Speaking as a motorist for the past 12+ years and also doing deliveries island wide when necessary.",
          "score": 2
        },
        {
          "text": "Tbh most times by now I just anticipate driver will not stop. I wait at the crossing and make eye contact w driver until i am sure they are slowing down, then cross. Too many times drivers just go straight over without stopping. I give them the stink eye.",
          "score": 2
        },
        {
          "text": "Yes, it’s very common. I don’t drive and walk around a lot. Have encountered many times at pedestrian crossing drivers would straight up drive through quickly even though there are obviously people on the lookout wanting to cross. \nOn few occasions maybe driver had a bad day, would even honk and give the finger… \nThankfully most people will still look left and right and not take it the zebra crossing for granted.",
          "score": 2
        },
        {
          "text": "Yes for they are kings of the roads. AI-enabled LPRS CCTVs or autonomous drones solve the enforcement constraint if implemented nationwide.",
          "score": 1
        },
        {
          "text": "Yes because there can't be enforcement cams everywhere. Sure the cars have 70mai dashcams but of course they wouldn't implicate themselves. But with technology, we now have Meta Ray bans or any other glasses that can record video. Start recording before you reach the zebra crossing. Export to phone and upload. TP,https://www.police.gov.sg/E-Services/Submit-Feedback-on-Road-Users-Committing-Traffic-Violations Or onemotoring. Even the odds. Assymetry in recording hardware isn't forever. Also more convenient and inconspicuous than whipping out a phone and pointing it at them.",
          "score": 1
        },
        {
          "text": "Definitely. I am always surprised when I stop at zebra crossing and people have to rush across, put up their hand, or even say sorry. Almost as if the norm is not to stop. For me, if I am crossing, I will always wait for the car to stop first.",
          "score": 1
        },
        {
          "text": "Agreed, dogshit cause too much variation in driving ethics. I wont horn but it really depends on personal competence level. How wide your vision, movement tracking capabilities and projection, and the reaction time. Can speed through zebra crossing if you have a sufficient margin of error. Example, pedestrian looking at phone 7-8 steps away from zebra crossing = stop. If they already about to stop and looking at you = go. Pedestrian alr stopped and waiting to cross = jolly well let the fella pass Actually driving a lot of similarities to cycling and even running. The world is slow when you’re on the move, just gotta learn to extrapolate people’s movement and the necessary margin of error to weave through crowds without bumping into someone else",
          "score": -1
        },
        {
          "text": "Yes, they waste everyone's time to stop and wait for them. Confusing all drivers.",
          "score": -3
        }
      ]
    },
    {
      "id": "t3_1qp2no9",
      "subreddit": "askSingapore",
      "title": "Possibly getting laid off, what are some things I can do for my mental health while applying for jobs in the meantime?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qp2no9/possibly_getting_laid_off_what_are_some_things_i/",
      "score": 71,
      "num_comments": 72,
      "created_at": "2026-01-28T13:31:14",
      "selftext": "Getting laid off because company made poor business decisions and lost so much money, they can't pay our salary on time.\n\nWhat's something I can do during my unemployment period as I find another job? It's btter if it's free as well. I'm trying to get outside more as it's better for my mental health, because if I coop up all day at home it is not good.\n\nIm curious to see what people do in their time that isn't just shopping or gym or playing games\n\nEdit: thanks so much guys for the various inputs! I really appreciate it",
      "comments": [
        {
          "text": "Exercise exercise exercise .",
          "score": 76
        },
        {
          "text": "Use Culture Pass! I went painting & Murder Mystery at National Gallery. It was fun~",
          "score": 46
        },
        {
          "text": "The whole point is not to tire one out but to clear the mind a bit, then continue job search It really matters for my case back then.",
          "score": 30
        },
        {
          "text": "Go for daily walks, 2 times a day, morning and night",
          "score": 27
        },
        {
          "text": "I have Gallery Insider, I loved the Into The Modern exhibition, I think I might go again. I really love French impressionism artwork",
          "score": 17
        },
        {
          "text": "A few things! Do the math. Calculate how much money you have, figure out how long you can live off of it without any income. Knowing how long you can live without income is going to make you feel better, even if it's just a couple of months. Find some structure. You had a structure while working, so it's good to keep up with that. Exercise in the morning, do some reading before lunch, meet friends for lunch, etc. It could be productive or unproductive things, but as long as you mix it up and stick to the schedule, it is good for your mental health. Figure out what you want to do next. Do you want to keep to the same industry? Or do something else? Either way, you can take the time to brush up your CV, look for courses to take, skill up, and slowly apply for jobs you want. This part works well with #2 because these also give structure to your everyday. Don't forget to do things you enjoy. Just because you've been retrenched doesn't mean you can't also do something fun in the meantime. If you like to play video games, you can still play. There's a difference between allocating two hours every day and 10 hours every day.",
          "score": 17
        },
        {
          "text": "My sister got laid off in December. Now doing part-time retail job 3 days a week while looking for work. Seriously, get some part-time retail/FnB/gig job to occupy yourself and earn some kopi money or your self-esteem is gonna fall into some black hole the longer you don't have any work.",
          "score": 12
        },
        {
          "text": "Got laid off in April 2025, these are the things I did: 1) Went on a pre planned holiday in the same month, yolo\n2) Did all the things I couldn’t do on regular weekdays whilst working, like a mid week afternoon trip to Ubin, weekday rides into JB\n3) Re-evaluated my current industry and try to identify if my current experience and role is going to be long term or swallowed by AI\n4) Took some time to wallow in self pity \n5) Went on another holiday, yolo_v2\n6) Started a side business with some friends\n7) Completed point 3, and enrolled in some courses \n8) Currently applying for jobs whilst completing said courses\n9) Wallow in more self pity from getting ghosted/rejected non stop\n10) More JB trips",
          "score": 12
        },
        {
          "text": "Does walking do anything? Legit question. Feel like it's not tiring at all.",
          "score": 7
        },
        {
          "text": "Maybe just walk faster, or more rounds, bring up the cardio to a certain level At least it is scalable to be strenuous if needed to",
          "score": 5
        },
        {
          "text": "Explore and find zen, appreciate scenary and people watching etc Can heal mentally for some",
          "score": 5
        },
        {
          "text": "Really agree with this one. I think as a society we're hyperfocused on optimisation, and everything is structured around direct quantifiable benefits. Sometimes without looking at things from a holistic view, it's easy to miss the unquantifiable and indirect things that benefit us.",
          "score": 4
        },
        {
          "text": "Ah ok. Don't deny the mental health benefits, I'm just wondering if it does anything for physical health. Personally feels not strenuous enough to be considered cardio.",
          "score": 3
        },
        {
          "text": "Physically, a leisurely walk won't feel like it has the benefits of a full workout of course, but there are still benefits such as looking away from screens for a while, breathing fresh (presumably) air, changing your posture, etc. I find the biggest benefit to be just the change in pace and having something else to focus on for a while though. Sometimes I use it to catch up on an audio book, but other times it's nice to just walk and think. Some people have shower thoughts, and I have walk thoughts.",
          "score": 3
        },
        {
          "text": "Keep strong bro/sis. Get some part-time FnB/retail job first.",
          "score": 3
        },
        {
          "text": "Thanks for the indepth answer! I've actually been planning the first 3 points for a while now, as my company was already shaky in giving salary on time. I think now is the best time for me to really throughly plan it through.",
          "score": 2
        },
        {
          "text": "Hang in there bro",
          "score": 2
        },
        {
          "text": "it's not about the intensiveness, walking itself is cardio at your own pace.. I think it's more beneficial internally (like your heart and lung) than externally (so you don't actually see muscle growing etc)",
          "score": 1
        },
        {
          "text": "Totally agree with the metrics involved for direct actions, it can be a different form that is intangible.",
          "score": 1
        },
        {
          "text": "Loads Cardio workout.. take the stairs!\nAnd as the someone else mentioned its a great way to clear your head! And get some vitamin D at the same time.",
          "score": 1
        },
        {
          "text": "Do 20km walking distance, you will feel alot. Trust me.",
          "score": 1
        },
        {
          "text": "Sorry for what happened. Maybe during the meantime, exercise to make yourself better. Perhaps find a temporary job to do (be it intern  part time), try to do something to occupy yourself",
          "score": 1
        },
        {
          "text": "Good time to start planning !",
          "score": 1
        },
        {
          "text": "Yea, I'm going to do online freelance gigs, better than nothing",
          "score": 1
        },
        {
          "text": "Thanks! I’m doing fine since I’m lucky to have savings to tide me through, plus the business keeps me busy for now even if it’s not profitable yet",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qp1dg4",
      "subreddit": "askSingapore",
      "title": "What happens when a foreigner dies in SG?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qp1dg4/what_happens_when_a_foreigner_dies_in_sg/",
      "score": 71,
      "num_comments": 38,
      "created_at": "2026-01-28T12:27:53",
      "selftext": "Hello! Im currently single and working in SG under E pass. And Im just wondering, what if sth happens to me, where all my assets and savings will go? My family of course doesnt know what banks I use in SG. So when a foreigner dies in SG, what steps would his/her family need to take to inherit those? For context, I dont own a house or car here. Just my checking account for my salary and IBKR for my investments.\n\nAnd btw everything’s fine for me right now, its just a thought you know LOL",
      "comments": [
        {
          "text": "Do a will under singapore law to prevent things from getting messy for your love ones and let them know of its existence?",
          "score": 63
        },
        {
          "text": "I think there would be a death reported with ICA and the cancellation of the pass would be triggered.. the embassy of the foreigner will be informed if there is no next of kin here.. I guess the embassy would then do what they need to do to get the information to the kin and all that",
          "score": 48
        },
        {
          "text": "When a foreigner dies, Govt agencies will informed the country's embassy. The Embassy will then forward the information to the revenant agencies in their country and will inform the next of kin of the Deceased.",
          "score": 29
        },
        {
          "text": "I had a friend, 63 years old pass away last year. His GF contacted me and while the police was aware of his death, the Turkish embassy started the process to repatriate his body back to Turkiye. In the meantime, as it was a weekend, getting clearance to contact his family officially was harder from the embassy side and therefore I assisted in finding family members through his social media. We managed to get a few people in contact and his nephew came down to settle the case. For the house tenancy agreement, cause of death was part of the agreement so half of the deposit was forfeited and half was refunded by his landlord. Salary: Was paid till the day he passed away with a small bonus. Deposited to his bank account. Bank account: Had more than 5 figures inside and hence a lawyer was needed due to the banks Terms and Conditions. It took around 8 months and around 9k SGD of lawyer fees to get the amount transferred to my friends siblings accounts. Singapore based online investments: Only after the phone was unlocked, they found a few hundred thousand $ worth of investments. After using Turkish lawyers to talk to the companies, funds were transferred to his Singapore bank account which was bounced back, and then with another court order it was transferred to Turkiye with high costs due to the official process. Body transfer to Turkiye from Singapore had cost around 9k SGD including post mortem and Singapore Muslim Casket assistance. Most of the basic stuff took 3 days to complete but the most difficult ones were the bank and investment payouts. My friend didnt have a will, didnt have any marriages or kids. Therefore it was harder to get his work done. But may he rest in peace and know that it has all been settled.",
          "score": 24
        },
        {
          "text": "Your assets would be frozen until someone applies for a letter of administration. But if no one does........ you know...",
          "score": 23
        },
        {
          "text": "Trick is when you have no loved ones. Was discussing this recently. I have no kids, no parents, no siblings, not close with immediate family. Suggestion I got was to designate somebody as next of kin in your home country and make sure they understand what will be entailed if something happens to you. That or some combination of choosing a charity, but still need somebody to execute the will.",
          "score": 15
        },
        {
          "text": "It's a bunch of work for the executor/administrator (e.g. one of your parents or siblings) to do all the paperwork to claim your assets and savings. First they will apply for a grant of probate or letter of administration (depending on whether your wrote a will) that gives them the legal authority to \"settle your affairs\". Then they might do some detective work. Look at the cards in your wallet, your letters and emails, to figure out which banks to contact. They submit the legal document and they will have access to your account. Or they might end up writing to every bank and insurance company to find out if you had dealings with them. Or, you can just give these details to your family members to make it easier for them in case anything happens? Whether you're a foreigner or not doesn't make that much difference. Just more of a hassle if your family member needs to fly over here to collect your belongings and settle papers, in addition to the first task of deciding what to do with your remains.",
          "score": 15
        },
        {
          "text": "Legally it goes to whoever you will it to, or else your next of kin (children / spouse). If your will is legally recognized back home then our government will probably follow its instructions. If you have no will, and no next of kin, then it’s going to be very difficult to figure out who has the rights to your assets. I assume they will leave it frozen until someone claims it, and after some time if nobody shows up then it gets added to the state coffers.",
          "score": 10
        },
        {
          "text": "I believe can get a professional executor? The issue is just to avoid the trouble of having to go through an even longer process if one dies interstate.",
          "score": 4
        },
        {
          "text": "You can add a “trusted contact” on IBKR.",
          "score": 4
        },
        {
          "text": "Write a will and make sure it, as well as a copy of essential information, is with your loved ones.",
          "score": 3
        },
        {
          "text": "Your company HR will liaise with your next-of-kin.",
          "score": 3
        },
        {
          "text": "Why worry? I be more worried if i have to split my assets to different loved ones. In your case i rather use the money to donate to a charity i believe in.",
          "score": 2
        },
        {
          "text": "You can always do it yourself to get probate, but most people don’t know or don’t want to do it themselves. Hence they will hire a lawyer to help them with it. For local, typically cost 2-4k. But for foreigners, most firm charges higher due to more work and complexity needed.",
          "score": 2
        },
        {
          "text": "But thats only for employment related issues, final pay, staff insurance payouts etc.\nThe company isn't going to help deal with anything once those payments have hit the bank account, or help with any other personal assets/liabilities.",
          "score": 2
        },
        {
          "text": "Crowdfund can help with things like funeral costs, bringing the body back to the home country or legal fees. But the next of kin will still have to do most of the groundwork in getting the legal affairs in order. Your company won't have access to your bank details or investment accounts to help with that.",
          "score": 2
        },
        {
          "text": "always update your Embassy on your latest Particulars , ie, place of work, contact, housing..",
          "score": 2
        },
        {
          "text": "The relevant governments and embassies will take care of informing your next of kin. If you end up getting a PR and a CPF account, then your CPF will be withdrawn and given to whoever your next of kin is based on your nomination or inheritance laws of there is no nomination. But all the individual things like assets and investments will be up to them to sort out. Which is why it's so important to have a will or at the very list a set of instructions for your next your kin to make it easier for them. Otherwise their only option would be to call up every bank and investment broker in Singapore to ask if you have an account with them. And before you say \"I'm too young to make a will\". You're never too young to make one. Like you said, anything can happen at anytime. And last thing you want is for your family to have to play detective to hunt down your assets when they're busy mourning you. And a will doesn't have to be complicated. You can simply say you want everything split equally between family and call it a day.",
          "score": 2
        },
        {
          "text": "The person was a foreigner (Turkish national) that a lawyer was required. and the next of kin was his nephew who had to go back to Turkiye to get paperwork to show proof that he was extended family. This is OCBC bank. As there was no local executor it took a while to do it.",
          "score": 1
        },
        {
          "text": "A \"trusted contact\" wouldn't be enough for IBKR to release the assets to the estate.",
          "score": 1
        },
        {
          "text": "Of course not. But it’s the first port of call for IBKR to be informed of their client’s passing and to start the process of identifying the inheritors.",
          "score": 1
        },
        {
          "text": "If it's a mnc, they will go beyond. Even crowdfund for the family. My company did it for a few of my corlicks who passed away.",
          "score": 1
        },
        {
          "text": "They still wouldn't have the legal right to access, or close and remit funds, from their employees bank account  though. Or do anythingvwith their existing other assets though, that would still have to be managed by their estate.\nAnd crowdfunding would probably paid to their family, but it doesn't solve OPs question about what happens to their bank account or other assets if they die.",
          "score": 1
        },
        {
          "text": "Do you know whats the process for a foreigner to create a will in SG? Do we have to engage a lawyer?",
          "score": 1
        },
        {
          "text": "Bank account: Had more than 5 figures inside and hence a lawyer was needed due to the banks Terms and Conditions. It took around 8 months and around 9k SGD of lawyer fees to get the amount transferred to my friends siblings accounts. This part sounds crazy. Was it because the person was a foreigner that a lawyer was required? Which bank is this? I think any local executor should be able to get access to a deceased's bank account with letters of probate/administration, and without having to hire costly lawyers. Singapore based online investments: Only after the phone was unlocked, they found a few hundred thousand $ worth of investments. After using Turkish lawyers to talk to the companies, funds were transferred to his Singapore bank account which was bounced back, and then with another court order it was transferred to Turkiye with high costs due to the official process. And this too, urgh.",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qp4ynv",
      "subreddit": "askSingapore",
      "title": "What are the Do’s and Don’ts at SG workplace?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qp4ynv/what_are_the_dos_and_donts_at_sg_workplace/",
      "score": 62,
      "num_comments": 75,
      "created_at": "2026-01-28T15:39:26",
      "selftext": "Including all the unspoken/unwritten rules in Singapore.",
      "comments": [
        {
          "text": "yeah... now isn't a good time to ask this question if u want serious answers.",
          "score": 353
        },
        {
          "text": "Don't... hmm.. let me think.. moan loudly if you're banging your boss in the office. It's just proper etiquette. You know.. you might disturb the adjacent office from working on their Woodlands Transformation Plan.",
          "score": 264
        },
        {
          "text": "Also, if you hear such noises.... Exercise noise discipline on your part. Silence your phone. Leopard crawling is only for shits and giggles. Just walk. Have a cover story, like a discussion on Woodlands transformation and the upcoming BTOs there.",
          "score": 95
        },
        {
          "text": "Do learn how to leopard crawl in case you are tasked to sight evidence",
          "score": 81
        },
        {
          "text": "Here for the comments lol",
          "score": 65
        },
        {
          "text": "https://www.asiaone.com/singapore/propertylimbrothers-melvin-lim-removed-website-amid-allegations-affair its all over reddit and social media, happy digging what was supposedly \"just\" a case of cheating turned out to be drama filled with the boss using company funds on his mistress, creating a toxic workplace with accusations of favouritism and everyone feeling a sense karma relief",
          "score": 59
        },
        {
          "text": "Get soundproof door",
          "score": 56
        },
        {
          "text": "Cc people as your proof.",
          "score": 41
        },
        {
          "text": "Do... hmmm... always stick close to your boss if you want to promote fast from intern to VP.",
          "score": 39
        },
        {
          "text": "Even LHL could not promote to BG within 3 years",
          "score": 29
        },
        {
          "text": "Because he can’t moan as well as Grayce",
          "score": 23
        },
        {
          "text": "and silence your phone!",
          "score": 18
        },
        {
          "text": "Remember to put phone to silent mode when doing stealth operation.",
          "score": 18
        },
        {
          "text": "What happened? Can someone explain",
          "score": 12
        },
        {
          "text": "I think you meant let the boss stick IN you 👀",
          "score": 8
        },
        {
          "text": "That’s really crude of you to make such comments. I believe the proper term is “have close proximity to management”.",
          "score": 8
        },
        {
          "text": "Google \"Property Lim Brothers Saga\".",
          "score": 7
        },
        {
          "text": "I think have to let boss stick you eh then can ley.",
          "score": 7
        },
        {
          "text": "When you hear random moaning noise. \"CONTACTED!\"",
          "score": 5
        },
        {
          "text": "Smelled the comments a mile away",
          "score": 4
        },
        {
          "text": "Don't pull out",
          "score": 4
        },
        {
          "text": "I know this is going to be the first comment",
          "score": 3
        },
        {
          "text": "Ah there are people living under the rock I see",
          "score": 1
        },
        {
          "text": "I have never heard LHL moan",
          "score": 1
        },
        {
          "text": "also how highly paid property agents are.",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qp4na4",
      "subreddit": "askSingapore",
      "title": "Are raw eggs safe for consumption in Singapore?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qp4na4/are_raw_eggs_safe_for_consumption_in_singapore/",
      "score": 51,
      "num_comments": 52,
      "created_at": "2026-01-28T15:20:34",
      "selftext": "Planning to make tiramisu, and the recipes i found uses raw egg. Wondering if it is safe to consume raw eggs in Singapore. Will using pasteurized eggs make it safer?\n\nThanks guys. Pasteurized eggs it is.",
      "comments": [
        {
          "text": "Pasteurized eggs for sure. If you want to be extra safe you can get the donki ones meant for eating raw.",
          "score": 121
        },
        {
          "text": "Singapore farms are certified free of salmonella and have strict safety standard. The eggs here are safe to eat raw if you want to.",
          "score": 62
        },
        {
          "text": "Singapore doesn't have third world food safety standards like the US",
          "score": 50
        },
        {
          "text": "No. Eggs are the only food item that can pass the 30 by 30 target set by the government. As in >30% of eggs bought in Singapore are produced in Singapore. Seng Choon farm is in the Lim Chu Kang area. There's also like one cow dairy farm and one goat dairy farm.",
          "score": 41
        },
        {
          "text": "This is probably the best choice, although more expensive they are just nicer tasting eggs and much safer. Pasteurising eggs kills more than just Salmonella.",
          "score": 34
        },
        {
          "text": "Yes, in fact eggs were one of those that exceeded the 30by30 target. SG farms meet about a third of local demand. Also, not everything from msia, especially post covid. Malaysia suddenly declaring \"no more chickens for singapore\" made it clear that their nonsense isn't limited to just water.",
          "score": 27
        },
        {
          "text": "US poultry market is fucked man. Their chickens are raised in horrible conditions that increase the risks of death by diseases through the roof, so they vaccinate them pretty hard. And all that vaccination resulted in them creating a kind of superbug salmonella. No other country on the planet has this level of risk with regards to poultry, so much so that there's an actual freaking debate about washing chicken being a real risk to your life.",
          "score": 27
        },
        {
          "text": "How do I tell the eggs that I'm purchasing is pasteurized?",
          "score": 22
        },
        {
          "text": "“Omg the Japanese dip their meat into raw egg? How utterly unhygienic and gross!!!” - some US defaultist probably",
          "score": 15
        },
        {
          "text": "No, you got the vaccination part mixed up. It's Europe that pushed salmonella vaccination for chickens, and SG vaccinates too. And it's the US that is resistant to vaccinating chickens, preferring to wash the eggs instead. https://www.npr.org/sections/thesalt/2014/09/11/336330502/why-the-u-s-chills-its-eggs-and-most-of-the-world-doesnt https://apnews.com/article/europe-business-health-227bd4b3176a498c9e77d2c3c8fe5210 And there is a particular piece of idiocy in America that discouraged vaccination, which was only removed in 2024. Which was that when they were doing Salmonella checks, they were counting the vaccine strains as well, which discouraged farmers from using the live attenuated vaccine. https://www.food-safety.com/articles/9289-usda-fsis-to-exclude-salmonella-vaccine-strains-from-performance-categorization",
          "score": 14
        },
        {
          "text": "ya man... we eat softboil eggs like nothing sia.. they so gross about it and always mentioned Salmonella. Make me paranoid and always hot wash my sink after handling the raw chicken.",
          "score": 11
        },
        {
          "text": "Maybe it's just me but I honestly can't stand fully cooked eggs. I see the way Americans cook their omelette and scrambled eggs until it's all dry and rubbery and it just looks so unappetising to me.",
          "score": 9
        },
        {
          "text": "Mostly those in the fridge. If you go fairprice finest or cold storage they are always in the fridge",
          "score": 8
        },
        {
          "text": "I usually buy eggs from fairprice. Eggs from Singapore they usually got label with a red stamp.",
          "score": 6
        },
        {
          "text": "Nope, most of eggs not pasteurized cos no need.",
          "score": 6
        },
        {
          "text": "Go to any travel vlog video about Singapore and you would inadvertently come across a \"wtf raw egg?\" or \"is the egg safe?\" comments whenever the vlogger is seen trying soft boiled eggs and toast.",
          "score": 6
        },
        {
          "text": "they see the omurice omlette and say \"ew it's raw 🤢\" like okay... just because the eggs in your country are unsafe to eat raw doesn't mean other countries are too",
          "score": 5
        },
        {
          "text": "Seng choon and Chew's are local farms.",
          "score": 2
        },
        {
          "text": "Almost all are pasteurized, iirc. No way, the process will make eggs a lot more expensive.",
          "score": 2
        },
        {
          "text": "Ya man.. even before I open the comments, I already predict to see the Salmonella risk replies. lol",
          "score": 2
        },
        {
          "text": "Probably the only thing that can 30by30.",
          "score": 1
        },
        {
          "text": "Chew is Singapore brand and they have a factory around Mandai/lim Chu Kang",
          "score": 1
        },
        {
          "text": "I think when i bought some was written in the packaging.Also, i think they were in the refrigerated section.",
          "score": 1
        },
        {
          "text": "Almost all are pasteurized, iirc. But to be sure, you may check the packaging",
          "score": -4
        },
        {
          "text": "Are there farms here in Singapore? I thought basically everything came from Malaysia including eggs",
          "score": -57
        }
      ]
    },
    {
      "id": "t3_1qp0mwh",
      "subreddit": "askSingapore",
      "title": "Those in university right now, how's your dating life ?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qp0mwh/those_in_university_right_now_hows_your_dating/",
      "score": 48,
      "num_comments": 46,
      "created_at": "2026-01-28T11:53:44",
      "selftext": "i.e. are you serious already, or still dating around ? Do you think you've already found \"the one\" ? And do you plan to get married shortly after graduation ? Any plans for your future family yet, in general ?",
      "comments": [
        {
          "text": "I don't necessarily believe in the \"one\". I advocate for the \"two\". One I met in uni to marry and buy a house with, and another from work to be my sugar daddy.",
          "score": 104
        },
        {
          "text": "As a 30 year old single older sister, let me tell you that the best time to find your partner is during uni. Try hard! I wish I dated more intentionally when I was younger",
          "score": 101
        },
        {
          "text": "Nil",
          "score": 99
        },
        {
          "text": "Yesterday I muttered 'excuse me' while passing by a girl, it's almost like we're married.",
          "score": 75
        },
        {
          "text": "Grayce and Melvin approve this message",
          "score": 70
        },
        {
          "text": "Thats cute.. Wait till you start your working life..",
          "score": 66
        },
        {
          "text": "i was also single at 30 and dated in uni, so i think i can see both POVs. it's a lot easier to meet people when you're younger/in uni and guys especially don't have baggage related to their exes yet, but the biggest issue is that usually people (both parties) don't know what they want. i knew since i started dating at 19 that i was dating intentionally aka every bf of mine i could have married - i was that serious. the guys i dated from uni age till mid 20s did not have marriage as a concrete goal in mind, and it ended being a waste of time for me.",
          "score": 29
        },
        {
          "text": "Actually where got time? Got assignments; project; lectures and tutorial. But the time your rush all these stuffs - you should be quite exhausted.",
          "score": 28
        },
        {
          "text": "Can confirm it is worse during working life, enjoy Uni while you can.",
          "score": 17
        },
        {
          "text": "Serious but cannot find anything serious gg",
          "score": 14
        },
        {
          "text": "it was a waste of time because i could have dated someone who also wanted the same thing as me: marriage. that way, we could have built something together from the beginning. but i do agree that it's not a complete waste of time because if i didn't date my exes, i wouldn't have learnt and gone through what has made memetoday. and it means i wouldn't end up with my fiance, so yes, everything always works out in the end :)",
          "score": 9
        },
        {
          "text": "Non existent, id probably stay single for life as i need lots of alone time, and treasure the freedom to do whatever i want and dont want children.",
          "score": 9
        },
        {
          "text": "Wouldn't say waste of time right... Didn't you and bf enjoy your time together...? Didn't turn into marriage but I guess there are still many enjoyable moments together right?",
          "score": 8
        },
        {
          "text": "Dating with apps. Not people. There's a difference.",
          "score": 7
        },
        {
          "text": "Make sure you don't moan loudly or if you do go somewhere else not in office..",
          "score": 6
        },
        {
          "text": "Too soon haha",
          "score": 5
        },
        {
          "text": "Lmao. Sweet naive summer child.",
          "score": 5
        },
        {
          "text": "“There is no other One, for I am the One for myself as the wholesome One. Be One with Zen at peace.”",
          "score": 5
        },
        {
          "text": "the baggage line hit a bit hard for me...",
          "score": 2
        },
        {
          "text": "I agree with you! Dating someone who wants to just faff  around while you’re looking for someone to settle down with is exhausting.",
          "score": 1
        },
        {
          "text": "A lot of uni couples also break up after starting work though. Not saying it's futile to date in uni, but it doesn't always end well",
          "score": 1
        },
        {
          "text": "Two soon",
          "score": 1
        },
        {
          "text": "Study = pay to get fked\nWork = get paid to be fked, choose the right person you get 250k",
          "score": 1
        },
        {
          "text": "Frfr typing this on another chill Wednesday afternoon.",
          "score": 0
        },
        {
          "text": "Working life more chill than uni life, unless u are the kind not studying",
          "score": -11
        }
      ]
    },
    {
      "id": "t3_1qoylxb",
      "subreddit": "askSingapore",
      "title": "How do you choose your insurance agent? They keep leaving the company",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qoylxb/how_do_you_choose_your_insurance_agent_they_keep/",
      "score": 34,
      "num_comments": 32,
      "created_at": "2026-01-28T10:24:20",
      "selftext": "How do you choose your insurance agent? I thought I did a good job as this agent does not sell me what I do not need or want, and is not pushy, and offers to share and educate me in certain terms that I don't understand. But shockingly he just left the company after a few years, without even informing me. The new agent took over and whatsapped me about this. Not the first time my insurance agent had left the company or industry. Some were friends, some where known through word of mouth.\n\nIs choosing an agent as important as choosing the plan itself? Any tips for my future purchases? Not sure if I still want to buy from the new agent, although I'm considering some plans from them. Perhaps this is a non-issue as long as my plan is still valid regardless of who my agent is?",
      "comments": [
        {
          "text": "Your agents keep leaving cuz you are choosing those who are not pushy. This means they don't earn much money so they will quit after finding out this job isn't for them.",
          "score": 73
        },
        {
          "text": "I don’t even envision myself staying in one company for my whole life, much less anyone else. I expect my FA to leave at one point also, hopefully either to a higher calling in the same industry or switch to different industry. If move to different broker firm, i expect him to at least let me know, which he did 3 years ago. So far my experience of 7 years with him, all’s okay.",
          "score": 13
        },
        {
          "text": "Facts haha. The most recent one said he's been in the industry for 20 over years so I trusted that he'd stay, and well, at least give a courtesy goodbye if he is leaving, but no he just poof. I only got wind when the new agent came onboard today.",
          "score": 12
        },
        {
          "text": "ah yes terrible times. i changed a couple agents for multiple reasons. but my current one is just from the great eastern site - just picked a friendly face, talked to one and felt shes right. so far so good! i feel choosing an agent is impt esp if you cant be bothered to read every word on the  lengthy contract. so you rly need a helpful and smart guy to tell you things based on his knowledge and experience. tips for future purchases - meet up with a couple of agents! maybe 2, 3. whichever makes you feel at ease. you can cross check things this way too. i do know some people who are just very good at insurance things (but hes not an agent), they can just buy the products themselves; their agent is just to add on with their 'onsite knowledge' (?) :) ps: for a particular other company, all their agents ive met were bad. so i just call in to their service center when i need something!",
          "score": 7
        },
        {
          "text": "Get an independent agent that is not part of any company. They will be able to freely advise any policy from any insurance company.",
          "score": 5
        },
        {
          "text": "You need to know that your previous agent is a good agent, bad salesman. And these type wont last long in the industry. Sad truth",
          "score": 4
        },
        {
          "text": "Agents are just a sales force for insurance company. Comings and goings does not affect your existing plans. To be honest, your previous agent might be a bit too soft to last long in the industry, where a bit of sales pressure is needed. I was an agent before, so I don't really need one to bring me through financial planning. But for most people, gaining some rough knowledge from one is certainly a good idea. One of my current agents is my uni mate who has been in the industry for ages. Another one is my secondary school mate who joined a few years back only. I go to them when I feel like I need to top up some protection. I'm not really concerned about them leaving the industry. They will probably inform me anyway, more as a friend than as a client. Lol.",
          "score": 4
        },
        {
          "text": "industry 20 years… either he’s lying or perhaps he passed",
          "score": 3
        },
        {
          "text": "Met my agent more than 20 years ago. I was just out of uni, started working, shit pay. Walked from Tampines Mall to Century Square, this lady approached me. She is chio, so I entertained her, ended up purchased my 1st insurance from her.  She stopped and transferred me to her husband for a few years after her children were born. Then took back my account under her when she came back to work full time. She has been very responsible, never pushy, and always consider based on our situation. After communicating with her, my wife like her and has since consolidated all insurances under her. Both my children’s insurance are from her as well.",
          "score": 3
        },
        {
          "text": "i will source from online insurers like fwd, budget, Direct Asia that has an attentive hotline to call and speak to someone easily without being hardsell anything",
          "score": 3
        },
        {
          "text": "do you mind sharing which is the particular other company?",
          "score": 2
        },
        {
          "text": "I chose the sgt that treated me well during my NSF days.",
          "score": 2
        },
        {
          "text": "lol i chose a friend who lasted a solid 4 years without targeting his friends then 1 year after buying he kenna kicked out T_T",
          "score": 2
        },
        {
          "text": "Would say that the plan is more important, unless it is related to investments. Nowadays, even claims can be done through their app so you don't need the agents' assistance for submission. So far the agents I worked with are still around, with one being promoted to lead a team (met from a roadshow) and another still serving in the same brand (high school friend). Both have been for >10 years now. What I checked for when buying from them was whether they will stay in the company, whether they enjoy working for their boss or head of agency. While I still buy or optimize from one of them, the other is just renewals...",
          "score": 2
        },
        {
          "text": "Choose a agent that work for more than 7 years. I have realized friends that have joined insurance but cannot make it usually quit within 1-3 years. On rare cases 4-5 years.",
          "score": 2
        },
        {
          "text": "Choose those older ones instead of those pretty xiao mei meis?",
          "score": 2
        },
        {
          "text": "My agent is a 40 year old uncle lol. The new one taking over is a XMM which I don't think I'll buy from her.",
          "score": 1
        },
        {
          "text": "Perhaps this is a non-issue as long as my plan is still valid regardless of who my agent is? Yes, claims can file online or via phone, bypass the agent totally after signing the plan. Just ask those people who bought their insurance at banks, they never see any agent at all only the bank staff.",
          "score": 1
        },
        {
          "text": "My primary agent still with the first company. I just got lucky. Don't think you can game this",
          "score": 1
        },
        {
          "text": "If turnover high and service is inconsistent and constantly disappointing and not meeting your needs, shouldnt that be a sign not to continue with this insurance company?",
          "score": 1
        },
        {
          "text": "I consider myself lucky have insurance agent since young till now",
          "score": 1
        },
        {
          "text": "I got mine thru a FA and not from a specific insurance company. So it's easier to buy policy from various insurance companies all handled by one person. When he left his company to join another one and as expected all my policies got reassigned to a new guy. But my fa asked if I wanted to stick with him. which I did. Known the guy for 18 years and not pushy so I agreed the transfer and it was seamless.",
          "score": 1
        },
        {
          "text": "I have two family friends who are aunties who are insurance agent. One is with AIA and the other prudential. AIA aunty is not pushy at all. You ask her things she will tell you pros and cons and you can decide yourself. She will follow up but just to ask my decision. if I decline she says it’s ok and leaves me alone. Both of them have good attitude but I’m closer to AIA aunty.",
          "score": 1
        },
        {
          "text": "One is that old but not too old like 50s , been in this industry for over 10years. So many clients that pass on to her/his child to take over. I will never choose an agent to ask me to buy investment-linked insurance if I never ask for it.",
          "score": 1
        },
        {
          "text": "A lot of it comes down to chance, but I chose mine after asking her about her own values, why she went into insurance, and how she views insurance. I have been with her for the last 15 or so years and I have seen her getting promoted and recognised in her company. I also see her car change from a small one to a big one, and have seen her kid from birth to growing up. She's not pushy, she gives advice, but as the buyer, I still need to make sure I know what I'm getting.",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qp66xw",
      "subreddit": "SingaporeRaw",
      "title": "I know what to dress up as with my wife for this year Halloween party",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qp66xw/i_know_what_to_dress_up_as_with_my_wife_for_this/",
      "score": 598,
      "num_comments": 43,
      "created_at": "2026-01-28T16:52:50",
      "selftext": "",
      "comments": [
        {
          "text": "You guys are way ahead",
          "score": 117
        },
        {
          "text": "where is the first part?",
          "score": 78
        },
        {
          "text": "Oh god, this killed me 😭",
          "score": 71
        },
        {
          "text": "Need a few more extras to leopard crawl and discuss about woodland transformation",
          "score": 69
        },
        {
          "text": "Where is the moaning?",
          "score": 36
        },
        {
          "text": "Where's the ah ah ah sound?",
          "score": 27
        },
        {
          "text": "This saga really becoming SG's equivalent of the \"Hong-Jie\" Miss Red saga",
          "score": 12
        },
        {
          "text": "The package comes with post-coital guilty walk.",
          "score": 10
        },
        {
          "text": "this is good bro! where to buy the costumes from?🤔",
          "score": 9
        },
        {
          "text": "LMAO",
          "score": 9
        },
        {
          "text": "Haha",
          "score": 8
        },
        {
          "text": "Slayed",
          "score": 8
        },
        {
          "text": "About to give people flashbacks 9 months later",
          "score": 8
        },
        {
          "text": "Steady la bro",
          "score": 7
        },
        {
          "text": "Bro🤣🤣🤣🤣",
          "score": 6
        },
        {
          "text": "fake video, wheres the \"OH BABY\"",
          "score": 6
        },
        {
          "text": "Where's the fire extinguisher?",
          "score": 6
        },
        {
          "text": "Where can I buy the black glass door? I hear it's really great for privacy.",
          "score": 5
        },
        {
          "text": "Who's gonna be the uwu bird",
          "score": 5
        },
        {
          "text": "Missing cast and props. Need to at least feature the leopard crawl.",
          "score": 5
        },
        {
          "text": "Lmao this is really blowing up more than any previous scandal dramas",
          "score": 5
        },
        {
          "text": "Roleplay and kink just say lah, what dress up for Halloween party.",
          "score": 4
        },
        {
          "text": "Your jeans are not tight enough. Need to cuff your pants too!",
          "score": 4
        },
        {
          "text": "where's the first part of this scene?",
          "score": 3
        },
        {
          "text": "This girl actually looks significantly better than Grayce, so not a parody",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1qozanw",
      "subreddit": "SingaporeRaw",
      "title": "PropertyLimBrothers as an ex intern",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qozanw/propertylimbrothers_as_an_ex_intern/",
      "score": 503,
      "num_comments": 181,
      "created_at": "2026-01-28T10:53:30",
      "selftext": "(rant) I used to intern in the company for a while when our school assigned us. Their work culture was like a “family” as they call it, with christian quotes written on some boards. Didnt enjoy it as an introvert due to the environment which prioritised socialising>work quality, but that’s just me. We had to attend weekly meetings, which was often hosted by Melvin Lim, and got paid $800 per month as mentioned by the redditor who disclosed everyone’s salaries. Late fee of $10 applicable to interns as well if late for meetings, money requested by events team which goes to pantry supplies. The best thing from this scandal is Marc filling in as Interim CEO. He was a genuinely nice person who gave good feedback and listened to our presentations when our mentor would be sick/apply for leave on our presentation days. Can’t say the same for anyone else there though. Could tell that Carrie the HR person didn’t like interacting with interns as well\n\n(edit: adding on that every week required by mentor to interview 2 agents on their closed cases which was ridiculously hard since theyre too busy to show up/will ghost u online, have to text like 30 of them for example at once to get 2 to reply to u within that wee…waste of time since all information is already recorded previously)",
      "comments": [
        {
          "text": "The HR person is a joke la. Just go on linkedin, lots of title inflation and no credible experiences in the company. Red flag.",
          "score": 291
        },
        {
          "text": "Her LinkedIn is very unremarkable. 1 year at Forest City, then from Manager to a $150K Vice President. A bit slower trajectory than Grayce, but I won’t be surprised if there was hanky panky there too.",
          "score": 180
        },
        {
          "text": "Ex-staff here. Carrie is a hardworking Malaysian with nothing much going for looks. She is fiercely loyal to Melvin out of the fact that SGD is bigger than Ringgit and not only does she not question her master, she also helps him “bury the bodies”, and act as the Gestapo to spy and rat on people.",
          "score": 159
        },
        {
          "text": "she wasnt helpful at all.. when talking to her she seems impatient and she would relay her message to mentor instead of replying to me when i was in office which was weird as hell, shows a lot abt character if u act like youre above us",
          "score": 116
        },
        {
          "text": "Potential hot take: many HR personnel used to be secondary school mean girls who thrive on toxicity.",
          "score": 105
        },
        {
          "text": "She's too old. Bloody jhk",
          "score": 73
        },
        {
          "text": "A person's real character is presented when dealing with someone that has nothing to offer in return.",
          "score": 56
        },
        {
          "text": "https://www.propertylimbrothers.com/teams/carrie-teoh/ Carrie is the “mother” of PropertyLimBrothers. Simply put, she plans, directs, and coordinate the administrative and financial functions of PropertyLimBrothers. Additionaly, she oversees the recruiting, interviewing, and hiring of new team members. Despite her heavy workload, she finds time to attend the daily BFT, because health is priority! As our “mother”, you can also find Carrie cooking some healthy and delicious meals in our office kitchen that’s named after her.",
          "score": 50
        },
        {
          "text": "Also a bit surprise how with her background she went from HR to HR+ Finance. It’s common for finance people to undertake HR (comparatively a more administrative and generalist function), but not the other way round.",
          "score": 41
        },
        {
          "text": "It’s a SME la. The “finance” is basically bookkeeping. Then maybe help Melvin siphon and hide monies for the side ventures + gatekeep from other management team - apparently they only found out much later that coy funds were used to fund the side ventures. And her cooperation was greatly rewarded lor. The narrative fits.",
          "score": 27
        },
        {
          "text": "ure not her level. Royalty doesn't talk to peasants, you know.",
          "score": 19
        },
        {
          "text": "Typical mudlander",
          "score": 19
        },
        {
          "text": "Book keeping also need skills. Not generalist admin/ hr auntie can do one",
          "score": 10
        },
        {
          "text": "Can’t agree more. Which intelligent, well-adjusted person wants to manage employee performance as their dream job?",
          "score": 8
        },
        {
          "text": "Milf kink maybe",
          "score": 5
        },
        {
          "text": "Many people who are incapable and have no substance do that. Because they have nothing to show for. So they can only show anger, impatience and crap.",
          "score": 5
        },
        {
          "text": "Similar age leh",
          "score": 3
        },
        {
          "text": "Look chaolao can Liao",
          "score": 3
        },
        {
          "text": "My hypothesis (with absolutely zero academic basis) is Low barriers to entry, ideal for people who peaked in high school. School based politicking to workplace politicking seems like a natural progression. Mean girls likely had some influence and power in school just by virtue of being mean. To be in a similar position of influence as an adult, one needs to be proficient and competent, qualities that most mean girls lack. The easiest way to have some semblance of influence, power and control, in the absence of competency, is likely in HR.",
          "score": 3
        },
        {
          "text": "Moneyshot",
          "score": 2
        },
        {
          "text": "Now that you mentioned it… how come ah? What draws them to that function/role??",
          "score": 2
        },
        {
          "text": "how is low entry barrier correlated with peaking in hs??",
          "score": 2
        },
        {
          "text": "Peak in high school is a colloquialism for ‘no achievements, no results, only can talk about the old glory days from secondary school’. These people usually have poor academic results and can only make it to courses with low entry requirements.",
          "score": 2
        },
        {
          "text": "Great quote.",
          "score": 1
        },
        {
          "text": "Colbie not bad leh if got ig can pm thx!",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qoz5xx",
      "subreddit": "SingaporeRaw",
      "title": "Couple Goals ❤️❤️",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qoz5xx/couple_goals/",
      "score": 409,
      "num_comments": 175,
      "created_at": "2026-01-28T10:47:47",
      "selftext": "I aspire to be like them! Being so romantic and lovey-dovey, living together with a cat, buying and putting on necklace for each other. It is really the dream couple goals everyone wants ❤️❤️ So happy for them! Hope to see what the future brings them.",
      "comments": [
        {
          "text": "No matter what, the husband will never be the same person after this..",
          "score": 250
        },
        {
          "text": "Shows that the more lovey a couple is on socials, the higher the chance that it's just for show.",
          "score": 225
        },
        {
          "text": "Shows that the morelovey a coupleanyone is active on socials, the higher the chance that it's just for show.",
          "score": 99
        },
        {
          "text": "he should write a book like our bro chok tong - standing tall or something",
          "score": 70
        },
        {
          "text": "<image> M knowing he is gonna get that pussy after the video",
          "score": 70
        },
        {
          "text": "you know all this \"lovey dovey\" stuff is 99% scripted beforehand right? \neven for other famous couple influencers in SG\nits all scripted just for audience views only we wont know their attitude behind the scenes but yes ...the girl needs to brush her teeth more after so many sessions",
          "score": 66
        },
        {
          "text": "Everything on socials is for show (not real). That's why it's a horrible place to spend time and it causes mental health issues for normal people",
          "score": 47
        },
        {
          "text": "<image>",
          "score": 21
        },
        {
          "text": "Imagine him use her toothbrush (interchangeably) which means he also bj Melvin 😆",
          "score": 18
        },
        {
          "text": "Notice how she doesn't kiss him back? He confirm knows whats happening",
          "score": 17
        },
        {
          "text": "nah he should create another PlayBoy empire like Hugh hefner did .Hugh Hefner suffered the same as this guy",
          "score": 14
        },
        {
          "text": "The show \"Naked Director\" on Netflix is based on this premise. The main character found his wife cheating on him and it motivated him to start a porn empire.",
          "score": 13
        },
        {
          "text": "It's OK. Just one look at him I can tell he's a grade A simp. All the extrovert loudmouth girls like to target these kind of nerdy guys. Easy to prey on and get into their clutches while they go fuck other men in the meantime while gaslighting the guy about 'trust'",
          "score": 12
        },
        {
          "text": "thats how villain created.",
          "score": 11
        },
        {
          "text": "Ewww... So pai kua.. 🥴",
          "score": 8
        },
        {
          "text": "Ikr. Time to hit the gym, or maybe he's already there.",
          "score": 6
        },
        {
          "text": "Not really eh, I don't care one. I just post IG stories full of vulgarities and racist memes. It's like my outlet sia.",
          "score": 6
        },
        {
          "text": "There's actually a study that validates this. Couples who hardly or never posts about themselves together in social media tend to have much more truer and faithful relationships for some reason. Probably because they dont need to project out their insecurity everyday to others",
          "score": 6
        },
        {
          "text": "Book? A Singapore Netflix series",
          "score": 5
        },
        {
          "text": "Agreed",
          "score": 2
        },
        {
          "text": "Thats how villains are made..",
          "score": 2
        },
        {
          "text": "Harlo polis? :D",
          "score": 2
        },
        {
          "text": "Tbh, feels like she’s the one that always wants to parade his chest. You notice him looking a bit uncomfortable at the start and  immediately wearing shirts after. Same with him “hanging her craft” also man was topless.",
          "score": 2
        },
        {
          "text": "Gotta love the Indian street food videos hehe",
          "score": 1
        },
        {
          "text": "need to make it up",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qp6app",
      "subreddit": "SingaporeRaw",
      "title": "Mediacorp is truly ahead of its time",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qp6app/mediacorp_is_truly_ahead_of_its_time/",
      "score": 388,
      "num_comments": 51,
      "created_at": "2026-01-28T16:58:51",
      "selftext": "",
      "comments": [
        {
          "text": "<image>",
          "score": 193
        },
        {
          "text": "“CONFIRM SEX!”",
          "score": 71
        },
        {
          "text": "WTF where is this from LOL",
          "score": 63
        },
        {
          "text": "Wow MediaCorp knew",
          "score": 52
        },
        {
          "text": "There is a certain resemblance too...",
          "score": 40
        },
        {
          "text": "God no, HYY is soooo much better.",
          "score": 39
        },
        {
          "text": "kudos to Mediacorp. :D",
          "score": 31
        },
        {
          "text": "The grind How did they know grayce was grinding on Melvin?",
          "score": 31
        },
        {
          "text": "is this the hidden untold secret behind the curtain vid?🤔",
          "score": 29
        },
        {
          "text": "The source is from trust me bro 🤗",
          "score": 25
        },
        {
          "text": "These two celebrities are hot leh G and ML are at most hot pot",
          "score": 20
        },
        {
          "text": "It’s not they knew, it’s been happening everywhere",
          "score": 14
        },
        {
          "text": "Now airing, this one maybe 1-2 ep ago? about office drama",
          "score": 14
        },
        {
          "text": "One male and one female, confirmed. Over.",
          "score": 13
        },
        {
          "text": "Seems like the actor and actress also enjoying!",
          "score": 13
        },
        {
          "text": "OMG is exactly the same lmao even the ringtone.",
          "score": 13
        },
        {
          "text": "This bugger also never silence phone ah",
          "score": 13
        },
        {
          "text": "When was this show",
          "score": 12
        },
        {
          "text": "Yess cannot compare that one with HYY!!",
          "score": 11
        },
        {
          "text": "Fwah…MediaCorp improve a lot ..going to watch this show today!",
          "score": 10
        },
        {
          "text": "OH BABY",
          "score": 6
        },
        {
          "text": "The blasphemy",
          "score": 6
        },
        {
          "text": "Definitely not AI🤣",
          "score": 5
        },
        {
          "text": "Im not singaporean, whats the post about lol just curious",
          "score": 3
        },
        {
          "text": "Yaa",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1qp6pql",
      "subreddit": "SingaporeRaw",
      "title": "Who say serve NS is a waste of time?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qp6pql/who_say_serve_ns_is_a_waste_of_time/",
      "score": 350,
      "num_comments": 44,
      "created_at": "2026-01-28T17:24:47",
      "selftext": "God bless this absolute legend and patriot. Applying NS skills to real life scenarios.\n\n2026 Halloween costume anyone?",
      "comments": [
        {
          "text": "Leopard crawl better than commando. Steady la 💪",
          "score": 77
        },
        {
          "text": "<image>",
          "score": 44
        },
        {
          "text": "And only he knows the enemy exact location 😂",
          "score": 30
        },
        {
          "text": "It’s left there with the filled up card, so the next joker who comes into the grave can reference it to know the angle/arc of fire and wont killsteal or friendly fire another soldier. Also can note down and orientate where some claymores or tripflares are placed to not get the newcomer killed.",
          "score": 20
        },
        {
          "text": "Tonight i'm gg down on a PRC woman, might try this",
          "score": 20
        },
        {
          "text": "Somemore wear sinkie's uniform called uniqlo",
          "score": 20
        },
        {
          "text": "Really need that POV hahah",
          "score": 19
        },
        {
          "text": "It is the official sinkie uniform outside of NS.",
          "score": 14
        },
        {
          "text": "Unrelated but I never understood the point of using firesticks. (Only used them in bmt)",
          "score": 13
        },
        {
          "text": "U serve ns get some allowance, she intern also get allowance. But the difference is she can promote very fast but u finish ns still 1 chao coporal.",
          "score": 13
        },
        {
          "text": "bro acing that leopard crawl better than all the other fake leopard crawl gurus online🤣🤣",
          "score": 12
        },
        {
          "text": "No. It’s ww1 tactics. Don’t disrespect.",
          "score": 11
        },
        {
          "text": "Haha I should type better and sof or navy seals 🤣",
          "score": 8
        },
        {
          "text": "Downfall is NEVER SILENT PHONE BEOFORE COMMENCING OPS!",
          "score": 8
        },
        {
          "text": "Their full name is arc of fire sticks, which demarcates the area between the sticks as \"shoot gun between sticks\" They have this glow in the dark strip that helps to show where to shoot even in the dark Basically to aim at enemy general direction and avoid shooting friendlies",
          "score": 7
        },
        {
          "text": "Myanmar/Thailand is fighting more like jungle warfare. AOF Sticks (arc markers in uk) is more for proper trenches where you are holding ground for bigger attacks with other weapons. As for Ukraine, their situation is dynamic they are not there to just defend, they want to gain ground.",
          "score": 6
        },
        {
          "text": "Crawling with 🩴 is legendary 🤣👏🏻👏🏻👏🏻",
          "score": 6
        },
        {
          "text": "Peter Peeker, the Amazing Spyder Man.",
          "score": 5
        },
        {
          "text": "Ya lo still not technical enough. If not will be more power",
          "score": 4
        },
        {
          "text": "Enemy straight ahead 50m behind the glass door",
          "score": 4
        },
        {
          "text": "蛮hungry的,蛮thirsty的🤣",
          "score": 4
        },
        {
          "text": "Lack of SOFUN thats why not so fun",
          "score": 2
        },
        {
          "text": "Opsec mah",
          "score": 2
        },
        {
          "text": "you dont see anyone doing this in ukraine/myanmar/thailand etc",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qpax68",
      "subreddit": "SingaporeRaw",
      "title": "I didn't know COMMUNISTS can hold event in Singapore",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qpax68/i_didnt_know_communists_can_hold_event_in/",
      "score": 340,
      "num_comments": 37,
      "created_at": "2026-01-28T21:10:12",
      "selftext": "at scape last week",
      "comments": [
        {
          "text": "apparently he is the event organiser: <image>",
          "score": 40
        },
        {
          "text": "<image> they were selling merch some more",
          "score": 33
        },
        {
          "text": "Save the fact that those ideas are not communist in the strict sense, but marxist. And Marx  was not a communist to begin with. Historically and politically, communisim has never materialized, despite the labels, and if the people holding that event label themselves as communists, they sure have little idea of what they are talking about.",
          "score": 22
        },
        {
          "text": "<image> this sinkie paria with the beer in his hand is the one who held this event. he is a communist, socialist, anti-capitalist sinkie. he is destroying sg with his drinking habits and all these delulu events",
          "score": 16
        },
        {
          "text": "Exactly, like what has “Free Palestine” got to do with the labour movement",
          "score": 11
        },
        {
          "text": "Fuck capitalism! Hope that makes you super mad :)",
          "score": 10
        },
        {
          "text": "Looks more like a labour movement than communist event. It's one of the things a proper trade union would organize to let people know more about workers' rights.",
          "score": 10
        },
        {
          "text": "Sooooo communist.../s",
          "score": 10
        },
        {
          "text": "This is what NTUC should be doing. Glad someone in Singapore is at least trying to stand with workers.",
          "score": 8
        },
        {
          "text": "Yeah, and it is a funny conflation of ideas all over the place.",
          "score": 7
        },
        {
          "text": "Should have called them out for supporting capitalism!",
          "score": 5
        },
        {
          "text": "Well if you want to go down this route, democracy has never existed either. Just like communism, it is an ideal and real life implementations are approximations.",
          "score": 4
        },
        {
          "text": "If they seized production, who will produce their merch 🤯",
          "score": 4
        },
        {
          "text": "hello police",
          "score": 4
        },
        {
          "text": "Down with capitalism!!!takes out iphone, scrolls tiktok while sipping a fucking beer, decked out in full h&m",
          "score": 3
        },
        {
          "text": "Who said otherwise? Perfectly agree with you.",
          "score": 2
        },
        {
          "text": "Like cool leh, what’s their @, if there are more upcoming events like that I wanna check it out",
          "score": 2
        },
        {
          "text": "I mean... seems more like an actual labour union than NTUC. Which we synonymise with groceries 🤣🤣",
          "score": 2
        },
        {
          "text": "Why OP account only 1 day old? 🤔",
          "score": 2
        },
        {
          "text": "Cool beard",
          "score": 1
        },
        {
          "text": "Buddy, \"seize\" is not the same as \"cease\". They are not ceasing production 🤣",
          "score": 1
        },
        {
          "text": "Actually the prices not bad",
          "score": 1
        },
        {
          "text": "Tried in 50 countries. Failed in 50 countries. And in almost every continent as well. 1st year uni students with A level economics at best be like ; \" this time.. this time it will work, I promise..\"",
          "score": 1
        },
        {
          "text": "i dont see the word communist tho... and unlike passive \"status quo\" NTUC, at least someone is actually taking the side of workers and saying smth about labour rights... who are these ppl anyone knows?",
          "score": 1
        },
        {
          "text": "Communism is just a school of thought if not taken politically. We are over the cold war, so it's not a big deal anymore.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qp8mlu",
      "subreddit": "SingaporeRaw",
      "title": "Why are we all so entertained by Melvin-Grayce-PropertyLimBros saga?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qp8mlu/why_are_we_all_so_entertained_by/",
      "score": 312,
      "num_comments": 77,
      "created_at": "2026-01-28T19:16:45",
      "selftext": "I go first: it's the orbigood of watching some Christian hypocrite and girl bossinfluencer get karma.\n\nAlso, damn funny to watch the uniquely Singaporean response: first responder leopard crawls in post NS uniqlo uniform, the uwu bird.\n\nAlso, this shit keeps going because these people have such a big digital footprint.. Or wet spot, if you want to call it. This is the channel 8 equivalent of a Taiwanese drama in terms of materials. The school principal, Tan Chuan Jin, all have nothing on this.\n\nOK, some kind reddit oru/friedikanbilismade thiszoom background for PLB door",
      "comments": [
        {
          "text": "Because both are pretentious people who got their hypocrisy exposed. One claimed that God is his boss while the other acted like she was a self-made entrepreneur. Turns out that he was likely committing adultery in breach of the Ten Commandments while she was not self-made but rather, likely, sponsored.",
          "score": 329
        },
        {
          "text": "<image> I especially enjoyed people making the zoom wallpaper.",
          "score": 185
        },
        {
          "text": "let's not mince words She whored herself out. For $230k/annum, but still a whore",
          "score": 140
        },
        {
          "text": "it could be so entertaining because of how it shows the ugliness of human nature, to what extent one will do for fame and money and the other side, rich af, and do whatever the heck he wants. it's like a horror or gory film.",
          "score": 78
        },
        {
          "text": "1) Property Agents\n2) Social Media Influencers \n3) Virtue signalling hypocrites Mix all these together and you got a grade A scandal",
          "score": 69
        },
        {
          "text": "i got nothing else in life bro, dont take this away from me",
          "score": 61
        },
        {
          "text": "We all whore ourselves out for much less.I would whore myself for 230k too.I think it's less of the whoring but more of the influencer talking",
          "score": 54
        },
        {
          "text": "Because Singapore don't have much news. I find such scandal entertaining tbh. The memes people posts are funny. I rather such news than slashing and murder etc.",
          "score": 54
        },
        {
          "text": "I am definitely using this as my teams call background. Thanks",
          "score": 47
        },
        {
          "text": "I doubt it's about orbigood, or snark, as the overwhelming sentiment seems to frown upon adjucating whose fault was it for the affair. It's just that there's so much material that the girl has, due to the intertwining of her online identity and her actual employment shenanigans. Coupled with the fact that we are confronted with the shattering of the myth of \"\"\"meritocracy\"\"\" in extra double quotes; how a lousy bond breaking intern leapfrogged in salary over people with more consequential responsibilities and yet lower compensation. If there were to be an even more perfect storm, it would have to be something along the lines of her religion, or the company (female/ male) she used to keep in school or in the workplace",
          "score": 37
        },
        {
          "text": "The audacity of people dishing out advice online when they haven’t been through shit / have the credentials to give advice. LOL, sorry but the schadenfreude is real",
          "score": 26
        },
        {
          "text": "$700 per day for 28 days of favour. Kinda worth tho the 20k salary",
          "score": 19
        },
        {
          "text": "Only if you got 230k a year",
          "score": 13
        },
        {
          "text": "<image>",
          "score": 11
        },
        {
          "text": "nah, zoom background, don't say good things don't share.",
          "score": 10
        },
        {
          "text": "Rich people doing what they want is nothing refreshing. This one pretends to be a servant of God, and is unabashedly open about his deep faith.",
          "score": 10
        },
        {
          "text": "Can I sent this as a hint to poteinal sugar babe?",
          "score": 8
        },
        {
          "text": "Expensive whore indeed",
          "score": 7
        },
        {
          "text": "Very expensive Prostitute",
          "score": 7
        },
        {
          "text": "90k fast deal",
          "score": 5
        },
        {
          "text": "Because Singapore don't have much news. *",
          "score": 5
        },
        {
          "text": "There's an imgur link out there in this forum",
          "score": 3
        },
        {
          "text": "Where can I find this for my new zoom wallpaper? 😂",
          "score": 3
        },
        {
          "text": "Up",
          "score": 2
        },
        {
          "text": "Have you heard of the gospel of Jesus Christ? /s",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1qp8y03",
      "subreddit": "SingaporeRaw",
      "title": "This didn't age well",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qp8y03/this_didnt_age_well/",
      "score": 288,
      "num_comments": 76,
      "created_at": "2026-01-28T19:34:05",
      "selftext": "",
      "comments": [
        {
          "text": "<image> But healthy relationship here.",
          "score": 161
        },
        {
          "text": "<image> no time for wife & 4 kids but can allocate so much time and soul with grayce. Disgrayceful",
          "score": 133
        },
        {
          "text": "Same Christian training lor. Buzzwords. Servant. Leadership. TCJ. Lawrence Wong. No actual meaning or substance.",
          "score": 102
        },
        {
          "text": "He was physically with grayce.",
          "score": 76
        },
        {
          "text": "The kids really sad. On top of all these, they're home schooled (likely cause of all the religious bs), with no external support system nor friends.",
          "score": 64
        },
        {
          "text": "At least they have no friends who will ridicule them because of their dad 🙌🏻",
          "score": 64
        },
        {
          "text": "Physically inside grayce*",
          "score": 43
        },
        {
          "text": "Dude baby trapped his wife, so she become so busy at home whilst hes free to do his bachelor activities",
          "score": 37
        },
        {
          "text": "That thing isn’t going to suck itself, you know?",
          "score": 33
        },
        {
          "text": "Usually those families or couple always post lovingly online are just great actors only .",
          "score": 26
        },
        {
          "text": "Notice how hypocrites like to address themselves as ”servants”, “servant leadership” etc Lording over peasants but pretending to be humble",
          "score": 22
        },
        {
          "text": "If they go to school the wife is free leh... Cant have that.",
          "score": 20
        },
        {
          "text": "“Im doing this for my family” ohh..you mean too busy fking your 29 yr old subordinate ??",
          "score": 16
        },
        {
          "text": "Wholesome",
          "score": 14
        },
        {
          "text": "Yea the same crowd does a lot of therapy speak, talk to them really like talking to ChatGPT.",
          "score": 13
        },
        {
          "text": "Wah is this photoshopped?",
          "score": 12
        },
        {
          "text": "Homeschooled? Are they trying to make em missionaries or pastors etc",
          "score": 10
        },
        {
          "text": "Over, sideways and under\nOn a magic carpet ride",
          "score": 5
        },
        {
          "text": "The sacks got happening like SDJS-139?",
          "score": 3
        },
        {
          "text": "Fluff lor. Many words but no meaning one.",
          "score": 2
        },
        {
          "text": "Remember. Moans speak louder than words",
          "score": 2
        },
        {
          "text": "Their ah pa missionary position with amazing Grayce in office",
          "score": 2
        },
        {
          "text": "I thought homeschool only allowed for primary school? How old are they?",
          "score": 1
        },
        {
          "text": "I was curious about this - didn’t know it’s legal in sg.",
          "score": 0
        },
        {
          "text": "Bro, please stop gooning",
          "score": -1
        }
      ]
    },
    {
      "id": "t3_1qp8b7n",
      "subreddit": "SingaporeRaw",
      "title": "Why is no one talking about Melvin?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qp8b7n/why_is_no_one_talking_about_melvin/",
      "score": 229,
      "num_comments": 64,
      "created_at": "2026-01-28T18:59:41",
      "selftext": "Why is everyone talking about Grayce and digging up her past?\n\nThere are two cheaters in this story. Yet somehow, ít seems all attention is being placed on her.\n\nWhat about Melvin? He sure has a lot of work to do to repair the damage he caused - not just with his wife, but with his 4 children as well. I genuinely feel sorry for what they’re all going through.\n\nOliver is still young and can move on and find someone else. His wife, on the other hand, sacrificed her youth and devoted herself to raising 4 kids for a man who cheated on her, all while preaching Christian values. That level of hypocrisy is hard to ignore here…",
      "comments": [
        {
          "text": "Because she cosplayed as a self-made entrepreneur, forever busy with her hustles and hermultiple businesses, broadcasting the corniest, most generic life advice to her retarded followers ad nauseam. In a society where you have genuinely kind, hard-working, honest people trying to make a living and make ends meet for their families amidst an unstable economy — underpaid, under-appreciated, over-worked people including nurses, teachers, frontline workers, blue collars, doing seriously critical work to keep the country going — and then this bitch comes along and rubs her ill-gotten wealth in their faces, suggesting that they haven’t worked hard enough, that they just need to hustle a little more to maybe one day be as successful as she is. And she did so knowing full well that her “_businesses_” were funded by the cunt of a man she was whoring herself out to. It really takes a special breed of narcissist to behave this way. Anyway they are both parasitic, life-destroying leeches and should be treated as such. Now their company is likely screwed — I only feel sorry for the other team members caught in this whirlwind of stupidity. M & G however, they can go fuck themselves.",
          "score": 283
        },
        {
          "text": "The reason why everyone is focused on Grayce is because she just got married a few months ago, and the affair likely started before that. She literally marriage trapped her husband when she had the chance to end either the relationship or the affair instead.",
          "score": 188
        },
        {
          "text": "Melvin is the hypocrite of the year. What a disgrace he is to his church and loved ones while appearing to promote his Christian faith. Matthew 7:23 \"Then I will tell them plainly, ‘I never knew you. Away from me, you evildoers!’\"",
          "score": 81
        },
        {
          "text": "You can also say that Melvin is a scum bag for betraying his wife of many years. And they have kids. I think the fixation with Grayce is somewhat unfair. I think it seems be that the commenters think that betrayal in a new marriage js worse than in a much longer one.",
          "score": 67
        },
        {
          "text": "This kind of scandals, always the girls get whacked the hardest. Even past scandals everyone forget who the guy was, but remembers the girls.",
          "score": 54
        },
        {
          "text": "Agree with this totally. In my opinion, the biggest casualty here is definitely the wife, followed by the children. Don’t need to talk about women’s charter- no amount of money can bring back your youth, your time, your career sacrifice, to name a few. All of these, plus the hurt from this ultimate betrayal. Confirm got PTSD for life. If I’m the parent of M’s wife, I would be livid.",
          "score": 50
        },
        {
          "text": "Yes agree. Remember M & G, fuck yourselves ah. Not each other 🥰",
          "score": 40
        },
        {
          "text": "Don't get me wrong, both are scumbags. The thing is that Melvin's wife will very likely be taken care of no matter what. On the other hand, Oliver wouldn't. At the end of the day, both are assholes, and one is bigger for holding their wedding ceremony recently, even after knowing that they're cheating. If Melvin held a ceremony to renew his marriage vows in Sept 2025 and then this came out, I bet people will fixate on that too (if not, fixate more actually).",
          "score": 32
        },
        {
          "text": "I don't think it's just that, also the implication that she slept her way up to VP. Also her influencer posts as a \" self-made high flyer and entrepreneur\". \nMelvin has also issued an apology while i dont think Grayce has done the same. In this case both are wrong but Grayce just garners more hate from the community.",
          "score": 28
        },
        {
          "text": "Cause God is shielding Melvin… I m just joking folks. My honest view is that Grayce was what could be dubbed as a gainfully employed personal escort for her then boss Melvin while masquerading in public as a “legitimate” hardworking and successful youth. In contrast, her peers are probably slogging it out doing an honest days work looking in envy of her perceived “legitimate” success. Then lo and behold, her success was a sham. At the end of the day, I think the lawyers are the real winners when all parties proceed with divorce proceedings.",
          "score": 27
        },
        {
          "text": "If it helps, I’m not talking about either.",
          "score": 27
        },
        {
          "text": "Interesting, and yet she can smile so happily in 2025 in the wedding dinner photos, in front of all her closest families, friends and the husband she cheated on 🤡",
          "score": 24
        },
        {
          "text": "<image>",
          "score": 24
        },
        {
          "text": "Everyone is talking about ML, just that people are talking more about G because of how much BS she is spewing on social media. The amount of hypocritical dirt on her is off the charts.",
          "score": 20
        },
        {
          "text": "M & G however, they can go fuck themselves. Sir, that’s what they have been doing",
          "score": 19
        },
        {
          "text": "Grayce was legally married Sep'23",
          "score": 15
        },
        {
          "text": "any idea what church he attends?",
          "score": 11
        },
        {
          "text": "Agree with you. Only her mouth and p worked hard. Everything else didn’t.",
          "score": 10
        },
        {
          "text": "And may divorce be with them",
          "score": 4
        },
        {
          "text": "Actually you can tell from someone if they indeed have the capability to get to where they are. Gong gong daidai but tell you do this do that, usually open leg is one option 😂😂 we all know how hard it is to run a business in Singapore.",
          "score": 2
        },
        {
          "text": "And was Melvin at the wedding?",
          "score": 2
        },
        {
          "text": "Yup that too. I think it's mostly the fact that I got married a few months before her that made me really confused on how she can cheat/continue cheating on Oliver like that. Overall, she's just a narcissistic little devil with her horns fully exposed now.",
          "score": 1
        },
        {
          "text": "Don't know, didn't zoom into the photos to see. Most likely yes la, they even have a casual all-in-one photo with both of them + the victims.",
          "score": 1
        },
        {
          "text": "This is important information that should be found out. Let his pastor deal with him. It is clear he does not feel conviction for his actions and continues to sin.",
          "score": 0
        },
        {
          "text": "This is some intense oolahlah words being flung around here… May the force be with you…",
          "score": -22
        }
      ]
    },
    {
      "id": "t3_1qp7scw",
      "subreddit": "SingaporeRaw",
      "title": "Almost spilled my tea oh Grayce",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qp7scw/almost_spilled_my_tea_oh_grayce/",
      "score": 197,
      "num_comments": 35,
      "created_at": "2026-01-28T18:29:21",
      "selftext": "",
      "comments": [
        {
          "text": "I’m new to this whole nation. So glad I found this story. This is Singapore’s Coldplay concert. I’m all for it. Fuck these people.",
          "score": 75
        },
        {
          "text": "100% I saw someone on TikTok saying the whistleblower shouldn’t have made it a national scandal. This dude had the fucking audacity to blame the whistleblower for ruining their families by blowing it out of proportion. The fuck?? This is nobody’s fault but the two adulterers’.",
          "score": 23
        },
        {
          "text": "It’s more akin The Try Guy’s Ned + Alex.",
          "score": 22
        },
        {
          "text": "<image>",
          "score": 22
        },
        {
          "text": "dun think dey play s&m since so cheapskate, dun wana get proper soundproof private rm🤣🤣",
          "score": 21
        },
        {
          "text": "Yup. Exactly. These phony \"influencer\" sold their souls to social media for attention and clout to get rich? They face the consequences for their bad actions then. No privacy for these fuckers. Live by the sword, die by the sword.",
          "score": 14
        },
        {
          "text": "Is g&m not s&m",
          "score": 14
        },
        {
          "text": "You need to work harder in order to fuck Grayce🤭🤭",
          "score": 10
        },
        {
          "text": "Hmm...more like 50 Posts of disGrace.",
          "score": 9
        },
        {
          "text": "Low-key should've used this as the face.",
          "score": 8
        },
        {
          "text": "Applying to be property agent right now!!!",
          "score": 7
        },
        {
          "text": "I’m a guy. I want my dick ridden.",
          "score": 6
        },
        {
          "text": "Are you rich and devoted like M the Christian?",
          "score": 6
        },
        {
          "text": "No need, just find the right d to ride on then 230k will be in your pocket per year",
          "score": 5
        },
        {
          "text": "aiteeeeee nao do a titanic coverrrrrrrrrrr",
          "score": 4
        },
        {
          "text": "Steady la . Melvin lim 💪",
          "score": 4
        },
        {
          "text": "Cannot. Can you open your back hole?",
          "score": 3
        },
        {
          "text": "Noooooo. I want to remain an ass virgin.",
          "score": 3
        },
        {
          "text": "I am so happy i clipped this shot. Please let this spread like fire.",
          "score": 3
        },
        {
          "text": "No 230k for you then",
          "score": 2
        },
        {
          "text": "need to work hard",
          "score": 2
        },
        {
          "text": "What do you call this expression? Nervous/hysterical/dumbfounded/enthusiastic?",
          "score": 2
        },
        {
          "text": "The expression when you see your VP of Strategy.",
          "score": 2
        },
        {
          "text": "Straddle-gy",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1qp1cw1",
      "subreddit": "singaporefi",
      "title": "Want to generate income from SGD 1 million in cash - help!",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qp1cw1/want_to_generate_income_from_sgd_1_million_in/",
      "score": 140,
      "num_comments": 120,
      "created_at": "2026-01-28T12:27:09",
      "selftext": "So, I have around SGD 1,500,000 sitting in a current account in a local bank. I am 51. No debts. No mortgage. I have not financially literate as many on this sub are.\n\nI plan to keep SGD 500,000 set aside in cash and to invest the rest for the purpose of generating around SGD 6,000 to SGD 8,000 per month right now in income, whilst preserving the capital (growth in line with inflation is fine). Focus is on income, as opposed to capital growth, and on liquidity.\n\nSpoke to a RM from one of the major banks here a few months ago who, knowing what I was looking for, pushed me to sign up to a ILP on the whole amount, with no liquidity, no monthly returns and high surrender fees. Although I am not financially literate, I can smell BS from a mile off. I actually walked out of the room.\n\nI looked through the Newbie section of this sub, which is great. Whoever spent days writing that deserves a medal.\n\nI am not financially literate. I am not looking for predictions. Rather, I am looking for passive low risk income such as the above, with liquidity. Is it wise to put it all in bonds e.g., PIMCO, or a bond-focus fund, a money market fund, or should I include equities? Or should I just speak with an IFA?\n\nFor me, going to a bank is a chore and I have no interest in bank perks such as dining offers and airport lounge access. Should I go with platforms such as Endowus or interactive brokers or should I just stick with a bank?\n\nThank you.",
      "comments": [
        {
          "text": "Since you are not financially as you say, let me put it plainly to you. Your desire for 6-8k per month from 1m while preserving/slowly growing the capital is unrealistic. The only way to potentially achieve such high yields is to take a risk that is not compatible with what you are looking for. It would be very high risk and don’t fall for any bs about some magical solution that promises it’s possible at low risk. We can discuss further here after you reflect on this fundamental point.",
          "score": 190
        },
        {
          "text": "Earning $6,000 to $8,000 a month means a yield of 7.2% to 9.6% annually. Anyone promising returns at that level while fully preserving capital is BSing you. Achieving such returns would typically require investing in higher risk assets, such as global equities, which come with greater volatility. Capital preserving options like T-bills and SSBs yield closer to 2% annually, so you would need to either accept higher risk or lower your return expectations.",
          "score": 129
        },
        {
          "text": "6K per month means 72k a year which implies a yield of 7.2% , almost impossible without giving up some capital returns . \nWant to buy bonds only junk grade bonds are giving that kind of yields Most junk’s bonds are not available for purchase unless you are an Accredited investor in Singapore",
          "score": 49
        },
        {
          "text": "Good job walking out on the RM. Do not invest through banks as they are just over-priced middlemen. With 1.5M, it can be “worth it” to speak to a few-based advisor. Or at least it isn’t a complete waste of money compared to if you had less. IFAs are often not fee-based, they just sell multiple insurance company products and earn commission, so make sure you don’t use this type. Endowus is a very decent mix of user-friendly with acceptable fees. IBKR is cheapest for many things (including Pimco GIS Income Fund) but not so easy to use. The Pimco GIS Income Fund is a ”bond-focus fund”. The bonds inside are a bit more risky and somehow they use some leverage, so the payouts are higher. There are slightly different “flavours” as well, like Pimco GIS Diversified Income Fund. Money market fund is very safe, but the returns are under 1.5% p.a. now so it won’t help you meet your goal of ~5% p.a. in “dividends”. And don’t get tricked into USD mmf with higher interest because the FX risk will just get you instead. Other products that I think could help you are 1) Allianz Income and Growth (can get thru Endowus for lower fees). This is about 1/3 US equities and 2/3 bonds, but the bonds are the riskier type and half perform more like equities. Read this for a more thorough explanation of pros and cons: https://investmentmoats.com/fund/allianz-income-growth-good-returns-for-past-3-years-sustain-7-income-yield/ 2) Amova Singapore Dividend Equity Fund (can’t  buy directly from Endowus, but you can buy from Poems or Dollardex then transfer to Endowus, and Endowus will let you buy more after that).  This is composed of Singapore stocks and gives out 5% p.a. dividends monthly while doing a pretty good job of maintaining or growing capital. A bit less bank-heavy than the Straits Times Index, and you pay higher fees but they solve the monthly payout problem for you. S-REITs also inside, so it’s good for “dummies”. People will probably tell you to invest in exchange-traded funds (ETFs) for the lowest fees, but then you need to sell to create your “dividend”, and it requires more financial literacy. ETA: Your target is too high. But $6k per month from the full 1.5M being invested is possible.",
          "score": 30
        },
        {
          "text": "I don't mean this as an insult or to come across in an abrasive manner but your advice on the funds are very typical RM centric. I'll share why the two funds (pimco gis income and allianz I&G) probably aren't the best rn Pimco gis income sells itself on two main factors: yield and large aum/prestige. Yield is high for all classes but is also because it doesn't take into account hedging cost. USDSGD hedging cost now, with how volatile the USD is, probably is >2% p.a., this will come out of your NAV. On yields, well lots of nations now are looking at USD in a different light, even if they do have more rate cuts it's likely the yields won't move much at all, hence it's duration position won't offer much upside. Long story short, NAV likely to erode, your 6% dividend net of fees and hedging cost, is typically closer to 3%, assuming spreads stay tight and yields are constant On AIG the dividend yield stated is not an organic yield. The organic yield of the fund is closer to 2+ 3%, due to its mix of HY bonds, convertibles and equities that are ALL US centric. Stated dividend yield 5+%, natural yield 2.5%, definitely will have erosion if bull run fades. All in all, not suitable for OP",
          "score": 13
        },
        {
          "text": "OP clearly can meet the requirement for Accredited Investor. 1M liquid can already. Not that I’m saying he should go for junk bonds.",
          "score": 12
        },
        {
          "text": "You'd also need to only take out gains above 4% or you will draw down",
          "score": 9
        },
        {
          "text": "I mean, these are mass market products that are easily accessible to OP. But at least he doesn’t need to pay RMs a cut, right? OP said focus is on income and liquidity, not capital growth. Something’s got to give, so some erosion of capital must be accepted when times are not so good.",
          "score": 4
        },
        {
          "text": "2022 was a massive shock across all bond holdings due to Fed raising rates from 0 to 5%+.  Bonds have stabilize since 2023 (go look at the flat NAV across almost all bond funds).  When Fed cut, then bond NAV reverses.  No, I'm not gunning for capital gains as I'm happy to keep receiving my 6.5%. Sure, there will always be tail risks like Lehman Brothers.  It's the price we pay for owning any asset class.",
          "score": 4
        },
        {
          "text": "Not junk bonds only, you can look at investment grade Emerging Markets government bonds which pay 6-7% in aggregate, and benefit from currency appreciation in Dollar weakening environment…",
          "score": 2
        },
        {
          "text": "The point is for the currencies in the bonds ETF not to devalue meaningfully together with the Dollar, and possibly appreciate against the SGD",
          "score": 2
        },
        {
          "text": "Basically you want to time the market between the cyclical bank vs REITs. When it’s time to get out of REITs, will you be there to tell OP? Will you even get it right? I think he would prefer to let the Amova fund manager handle the ratio.",
          "score": 2
        },
        {
          "text": "Singapore’s interest rates sucks. A good middle ground would be to buy US treasuries. SGOV is a short term treasury fund that mostly eliminates duration risk of longer duration bonds. You can generally get a yield of around 4% on these instruments. USD/SGD is at 1.26 now which is the lowest it’s been in years, so could be an opportunity to get in cheap as well.",
          "score": 1
        },
        {
          "text": "Don’t fall for it. What’s low can always get lower. Some day, 1:1 very possible. I remember when it was 1.8. Only change to ISD to invest in equities with the expectation that gains greatly outweighs FX erosion.",
          "score": 1
        },
        {
          "text": "and benefit from currency appreciation in Dollar weakening environment… Not sure what the point here since he likely wants to spend Singapore dollars not US dollars.",
          "score": 1
        },
        {
          "text": "Have to say I agreed with strangetidings. Even for the safest AMOVA dividend fund, the price is at all time high, and exposure 20% to the Singapore banks. If going for mass market solutions, I would argue CFA.si and CLR.si might be better options right now at the current price level and in anticipation of possible further rate cut, with the caveat that growth would be very limited - so more dividend/income play which is what OP is looking for. That's said, still not capital guarantee",
          "score": 1
        },
        {
          "text": "Given his current age + average life expectancy, in my opinion he should look to lower his expectations at least for now in terms of passive income Market wise it's not looking great either, valuations high, geopolitical risk high, earnings growth slowing, consumer confidence declining. Not a good time to go heavily into something that feature NAV erosion and has relatively high concentration/beta",
          "score": 1
        },
        {
          "text": "Totally agree that all this funds are rubbish with high fees.",
          "score": 1
        },
        {
          "text": "Tbh I don't think pimco is rubbish, especially vs peers. If you can get into the insti shareclass or admin shareclass then the fee drag becomes a lot more manageable. The issue with the fund at the retail SGD shareclass level is that a large portion of it's returns will be consumed by all sorts of fees. If you purchase with low to zero sales charge for an insti class using USD then sure it's a lot more attractive.",
          "score": 1
        },
        {
          "text": "I am not certain which shareclass of pimco income you purchased. The most commonly distributed in SG would be pimco income class E sgd-h. If you reference the 3Y NaV or NAV in 2023, you would see that there was only a period of perhaps 1 month max where the NAV is lower than it is right now (hence allowing you to make a profit on cap appreciation). So unless you bought during this dip, in which case you managed to catch the nav low (good for you) or maybe got lucky. In all other 11 months your NAV would be underwater vs current Fed fund rate has dropped since 2023 but yields are pretty much stagnant since then. Given the crisis of confidence in the US,  I don't think it will be good for the future If you don't believe what I mentioned about the structural issue etc, no worries you can do what you please with your money. Food for thought tho, hedging isn't free right ? You investing in USD assets with SGD, you want to protect the capital yea? Do you believe this insurance or hedge comes free ? Fund managers all need to be paid, distributors also might want a cut of the fees. Lots of people need to be paid Again, check the price chart of the pimco income fund, if you bought the e shareclass it's quite obvious",
          "score": 1
        },
        {
          "text": "I’m looking at the chart, and since the final Fed rate hike on 26 Jul 2023, the NAV has largely ranged between 8.30 and 8.50, which is roughly a 2% band. I don’t see evidence of the NAV destruction you’re describing. You’re making several conjectures about how PIMCO manages hedging and costs, but ultimately there are only two observable outcomes that matter to an investor: (1) the distributions paid, and (2) the NAV trend. To date, neither supports the claim of structural erosion. I agree there are legitimate concerns around U.S. economic and policy risks. That said, if those risks materialise, equities would almost certainly reprice first. Bonds sit higher in the capital structure, and that seniority matters.",
          "score": 1
        },
        {
          "text": "Two words - Lehman Brothers. Low risk does not mean no risk. And you could take a look at the NAV trend since inception. 2023 was the year whereby NAV hit at times low. That said I do think this risk is extremely remote... But again low risk does not mean no risk.",
          "score": 1
        },
        {
          "text": "Given that MAS has a policy of \"gradual appreciation of the Singapore dollar\" I wouldn't count too much on any emerging market currency to appreciate against it (though that's certainly possible). I agree that the USD is more likely to devaluate though and is best avoided.",
          "score": 0
        },
        {
          "text": "Well, it's rather strange for you to make such claims since I have owned Pimco Income Fund since 2023, enjoyed 6.5% dividends and a modest NAV increase.  All while enjoying my SGD hedge with total impunity from the USD depreciation. If what you are saying is true, shouldn't I be suffering a NAV loss by now?  Note that the NAV is mark-to-market daily. Seriously, I would like more SG people who aren't aware of such bond funds to enjoy the benefits.  If the structural erosion you describe were present, it should already be visible in NAV and it isn’t. That suggests either the assumptions are wrong or the magnitude is overstated.",
          "score": -2
        },
        {
          "text": "But my mama say I can all in black and flip, is that risk free?",
          "score": -10
        }
      ]
    },
    {
      "id": "t3_1qpdj6g",
      "subreddit": "singaporefi",
      "title": "RIP Trust cashback 1% foreign spend",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qpdj6g/rip_trust_cashback_1_foreign_spend/",
      "score": 53,
      "num_comments": 14,
      "created_at": "2026-01-28T22:55:36",
      "selftext": "From 1 March, Trust cashback for foreign spend is dropping to 0.5%. It was it great while it lasted. Which credit card are you redditors going to use for overseas now?",
      "comments": [
        {
          "text": "Maribank credit card",
          "score": 30
        },
        {
          "text": "No more Trust",
          "score": 12
        },
        {
          "text": "Their exchange rates are still competitive albeit compared to youtrip.",
          "score": 5
        },
        {
          "text": "Wait, on top of reducing FX to 0.5%, they’re also removing the $1000 category? Seriously? When I’m not overseas, I just keep to the $1000. What a shame. I’m cancelling this card. I’m going all in on Mari Credit Card.",
          "score": 4
        },
        {
          "text": "I thought they gonna up their game to compete with MariBank's offer, end up they gave up on the competition.",
          "score": 3
        },
        {
          "text": "when I went to bkk better than google ROFL google 24.63 Mari 24.74 but one day only la, the rest is like almost google eg yesterday google 24.68 Mari 24.63",
          "score": 2
        },
        {
          "text": "Mari here I come",
          "score": 2
        },
        {
          "text": "What are the FX rates like?",
          "score": 1
        },
        {
          "text": "Damn i love the cashback when i spend in jb",
          "score": 1
        },
        {
          "text": "Is mari better? For a general foreign spending card now",
          "score": 1
        },
        {
          "text": "Yes since it's 1.5% Cashback (first 1.5k spend monthly) + no fx fees compared to trust. (Up",
          "score": 1
        },
        {
          "text": "Time to Mari kita",
          "score": 1
        },
        {
          "text": "Strictly no referral links. No solicitation of business of any sort (via comments/PM/alternative platforms). This is not a place to exploit users for your financial gain. Links of external sources(podcasts/blogs) must be unbiased, factual and must not be monetised and contain any referral/affiliate links. External links must also not be associated with any businesses/products/apps etc.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qpakbs",
      "subreddit": "singaporefi",
      "title": "What is your current and target allocation to gold as a % of your portfolio",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qpakbs/what_is_your_current_and_target_allocation_to/",
      "score": 11,
      "num_comments": 45,
      "created_at": "2026-01-28T20:54:10",
      "selftext": "I have been a 100% equity guy\n\nAs I get closer to 40 and portfolio keeps growing I have been having thoughts about having long term asset allocation\n\nIn recent past months I have in allocation to about 5% in Gold and I plan to increase it further to ~10-15%.\n\nFellow FIRE path travellers what are your thoughts on the % allocation to Gold in current portfolio and what is your target % allocation",
      "comments": [
        {
          "text": "0.0 When people get greedy, I get scared. Tear is a lack of doomsayers currently.",
          "score": 25
        },
        {
          "text": "25% of my portfolio. Nothing to be scared of when the de dollarization is occurring and trump is a lunatic",
          "score": 13
        },
        {
          "text": "According to Morgan Stanley’s CIO, 20% https://www.reuters.com/markets/wealth/morgan-stanley-cio-favors-602020-portfolio-strategy-with-gold-inflation-hedge-2025-09-16/ For me personally I don’t like a crowded trade because that’s not where the value is captured. If mainstream FI are finally recommending gold, it’s going to get crowded. But to hedge against currency debasement you’ll need gold. Holding just equities is not enough. Because there is a regime change. Understand what the US is trying to do. The US debt  and the interest on their debt is unsustainable. They need to lower interest rates. The fed can cut rates but that will only influence rates on the short end of the bond yield. They can’t control the long end. One idea that’s been floated is to allow the USD to devalue. But devalue against what?  They can allow it to devalue against gold. At the US treasury, gold has a statutory price of $42+. This was set in the 1970s and they have not revalued this. What treasury could do is to revalue gold, mark it to market and suddenly the treasury has “free” money, which they can sell to the Fed. Fed prints the dollars. This is just accounting to give the US treasury new “money”. In addition to this, the Genius act which allow private companies to issue stable coins that are backed by treasuries is a natural buyer of short duration bonds and bills. This helps keep the short term borrowing cost down. But the clarity act allows these stables coins to generate yield. companies like Tether are taking these yields and buying gold. Tether has one of the largest non-nation entity holding gold. Guess what the US government could do? They could ask Tether to back (buy) US long duration treasuries with their gold thus making US treasuries gold-backed. This would massively devalue the US currency but allow them to control yield at the long end, meaning they can borrow at a lower rate. In the end bond holders suffer and a massive transfer of purchasing power go to holders to gold Central banks were already sniffing this eventuality out years ago. Even Singapore has started increasing our gold reserves. 100% equity is not it anymore. That worked well 25-30 years ago. The regime has changed. How you invest must also adapt.",
          "score": 9
        },
        {
          "text": "Rise in precious metals prices actually require me to lower it. Was 7-8%. Now 17%. To be clear, the 7-8% refer to precious metals mining stocks.",
          "score": 6
        },
        {
          "text": "Guys, the time to buy is before the massive run up, not after 😵",
          "score": 4
        },
        {
          "text": "Do you have any gold or silver etf recommendations for IBKR? Been looking to move away from dollar heavy stocks.",
          "score": 3
        },
        {
          "text": "IAUM is probably the most cost effective way to own a gold ETF in IBKR. The expense ratio is 0.09%.",
          "score": 3
        },
        {
          "text": "Not if you believe further inflation and USD weakness is coming. Imv not yet fully priced in My gold holdings have risen from abt 5 to now nearly 20% of portfolio. Comfortable with this as a hedge against dedollarisation and further geopolitical turmoil. Another asset to watch is BTC",
          "score": 3
        },
        {
          "text": "Gdxj for gold - silver junior mix Alternatively try searching for junior miners- need to read up. I have invested in Skeena resources and b2g. Need to understand the risks for both and have an understanding of how mining companies work. It’s good to use AI to help you understand how mining sector works. Interestingly Ray Dalio also recommended gold related ETFs in his latest review. Shows you this is backed by thought leadership. Key is to minimize your loss",
          "score": 2
        },
        {
          "text": "Currently I have about 12% in my overall portfolio thanks to the recent 2 months of setting higher highs. I might want to reduce down to about 7-8% and allocate the funds elsewhere. IMO if I do that I may miss the bull run further but I can always wait for a retrace and re-enter again.",
          "score": 2
        },
        {
          "text": "20%... placed back in oct. Should put more but oh well",
          "score": 2
        },
        {
          "text": "Is there a reason for buying gold at all time high? Is it because you think the SGD will fall ? Or maybe you think there is going to be a run on the banks, so you buy gold? Smart move.",
          "score": 2
        },
        {
          "text": "Zero. I don’t fomo",
          "score": 2
        },
        {
          "text": "Retired, so wealth preservation has been my focus. Currently 40% in precious metals spread out as follows: 25% gold, 15% silver, 1% platinum. Still buying small amounts when prices dip. Buying some silver miners ETF for speculation. Target allocation of 50% precious metals and mining stocks. A year ago, people here would always down-vote me for recommending gold. I found it useful to follow what central banks are doing. MAS increased gold holdings overall in the past 3 years. Poland's national bank announced that it will be buying more gold. These are public information, facts, not hype.",
          "score": 2
        },
        {
          "text": "I thought gldm?",
          "score": 1
        },
        {
          "text": "GLDM’s expense ratio is 0.1%. Its advantage over IAUM is that it has lower spread and bigger fund size. For the typical buy and hold passive investor, IAUM is cheaper simply due to the expense ratio of 0.09%. If you are an active trader, then GLDM will be cheaper due to the lower spread.",
          "score": 1
        },
        {
          "text": "The massive run up can only be ascertained after the fact though, not during. For all you know current price is just the start 🤷🏻‍♂️ or maybe the peak who knows",
          "score": 1
        },
        {
          "text": "Only peak if you think confidence returns to fiat. I do not see that anytime soon.  If given a choice would central banks rather hold US treasuries, UK gilts, Japanese Government Bonds, etc or gold and silver (Russia and Saudi Arabia)",
          "score": 1
        },
        {
          "text": "How does one know if the run up is already done As the Geo-political conflicts increase gold demand should continue to rise. Looking at the current scenario it is likely that conflicts are going to rise. Some commentators have also said Trump in office is good for gold. Don’t know how true that is but surely the conflicts and US actions to try to devalue USD is helping gold. The other surprising thing I have noticed is BitCoin has been falling, it was supposed to protect purchasing power but doesn’t seem to be doing that very well compared to Gold.",
          "score": 1
        },
        {
          "text": "Because the monetary regime is changing and has been in the process of change for years. The central banks know this and have been adding gold to their reserves for years. \nWe are returning to a world of neutral reserve asset.",
          "score": 1
        },
        {
          "text": "So how does that affect us in singapore ? I repeat my question: Is it because you think the SGD will fall ? Or maybe you think there is going to be a run on the banks. If the answer is no, then are you just buying it for investment ?",
          "score": 1
        },
        {
          "text": "The SGD will likely maintain it strength relative to the USD but the MAS cannot allow the SGD to become over valued in relation to the USD. Over the long run, the SGD will also have to devalue against the USD. It’s two currencies falling at the same time. But what we see is only the relative value to each other. When they both fall, they fall against something. The question is, what are our currencies (both USD and SGD) devaluing against? It’s devaluing against hard assets. Real world physical assets. How does it affect us?  You have to think in terms of fiat vs real assets. If you are thinking in terms of fiat your equities gains will also look like it’s gaining in value. But what it can purchase when you eventually liquidate your holdings will buy you less. This is the illusion of an increasing portfolio. You’re not building real wealth. You need something to preserve your wealth. You have to stop measuring wealth in terms of currencies and interms of what it can afford you. This is not investment. It doesn’t generate yield. It’s a pet rock. But it’s a unit of account. A unit of account that was ignored but is gaining attention from central banks. As a unit of account of wealth, you’ll want to have as much as you can to preserve your purchasing power. There’s also the possibility of the US revaluing the statutory price of gold, which sits at $42.222 per ounce. Look this up. Too much to explain.",
          "score": 1
        },
        {
          "text": "Got some negligible ones like jewelry. The rest all in stock.",
          "score": 1
        },
        {
          "text": "5%, and will keep it at 5%",
          "score": 1
        },
        {
          "text": "None 😞",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qpbe6y",
      "subreddit": "singaporefi",
      "title": "Advice needed…",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qpbe6y/advice_needed/",
      "score": 6,
      "num_comments": 4,
      "created_at": "2026-01-28T21:30:24",
      "selftext": "Hi All, I wanted to ask for some advice. I’m in my late twenties and I feel very behind in my FIRE journey. I’ve been working for less than a year, as I was studying overseas for the past couple of years. I’ve got about $50k in savings and $5k in investments (mainly ETFs and DBS/UOB). I see posts here about people much younger than myself having $200k + in savings which makes me feel broke… (I know comparison is the thief of joy but I think I come from a ‘better to do’ family so I’m wondering how people can have saved so much at such a young age? Im not jealous, I’m happy for them but just wondering what the source of money is and how I’m so behind? Is it purely because I’ve only started working recently?)\n\nInstead of letting the $50k just sit there I was looking for some advice on what to invest in. I want to DCA into ETFs but I feel like the market is at its peak and will crash soon, (yes I know time spent in the market beats timing it), but I can’t bring myself to buy any more stocks / ETFs seeing the peak we’re at and also seeing what trump is doing, I think the market will correct soon as investor confidence gets shaken?\n\nThank you so much and any advice is appreciated (-: I hope everyone has a lovely rest of the week!",
      "comments": [
        {
          "text": "Believe it or not, here’s the secret why late 20s people can earn so much: (1) They started working earlier than you, with some doing part-time or skip NS, so they got more money (2) Their base salaries and bonuses are much higher than their median peers, so they got more money (3) They invest their money, have a high saving rate, and don’t hang flower, so they got more money I will tell you that everyone starts at very different trajectories in life and really, all you need is either some good consistent habits or one lucky windfall to be on the other side of the spectrum. And besides, I’m in my late 20s (same as you) and I will tell you right now that money isn’t everything yet becausethe greatest investment you can make is in yourselfat this stage of life. You aren’t even earning in your prime yet 🤣 It is perfectly okay to spend money to invest in yourself if you can reap the rewards in the future. For me, I used to work in a good $6.5k job and I decided to blow 50k to get myself a local postgrad. Was the money wasted in the sense that I set myself back on this milestone? Yeah, I agree with that and the content I learnt in my postgrad can be learnt online, but nobody told me that by investing in myself this early, people will see me as a postgrad for the rest of my working life and will offer me a $11k job upon graduation Don’t think so much about whatever that orange buffoon is doing and just focus on yourself. Control the things you can and you’ll find yourself surprised to be sitting in the shade you have planted years ago. I buy index and save a good portion of my salary in it because I don’t like to think too much and just want my money to grow decently while I focus on myself and my subsequent milestones in life That, or you can go all in for tomorrow’s $10M TOTO draw. Huat ah",
          "score": 5
        },
        {
          "text": "You've already touched on the emotional aspect, so I won't comment too much further about that. https://www.youtube.com/watch?v=KwR3nxojS0g Check this video out, there's lots of finance research that indicate that lump sum beats DCA even knowing a market crash is coming. As for which ETFs to invest into, the standard for this sub is VWRA for irish domiciled + large sum + world index. However, for myself I do a mix of SWRD (89%) + EIMI (11%) as EIMI should add additional small cap exposure which should do better over a long term, but honestly the difference compared to VWRA is so minimal, and you really need >5-10 years to really see the difference and you do need to rebalance the percentage of developed market to emerging market. Others have suggested  ACWD for a kind of one fund and forget type but incurs lower TER as compared to VWRA. But honestly, all the numbers are meaningless as compared to actually just investing. You need to not experience paralysis by choice and pick one strategy and stick with it.",
          "score": 4
        },
        {
          "text": "I just want to say, people will always find reasons to not invest especially when youre new. When the market does well: \"oh itll go down soon, I dont want to invest at the high\". When the market does badly: \"oh I dont want to invest when the market is going down, i lose money how?\". The easiest and most recent example is April 2025. The market crash almost 20%. People want to sell, people want to avoid investing. End up what, they miss the best time to buy, the market quickly recovered and these same people missed out on ALOT of gains. Here these finance people simulated, the best market timer, the worst market timer and the DCA person. https://youtu.be/9dgYvLoUWIQ?si=loMmhOjKv1r4JkaV I wont spoil it, but do give it a watch. For the thing about feeling behind, sorry cannot help you. You have rationalised it already, but you have yet to accept it.",
          "score": 3
        },
        {
          "text": "They have 200k+ in savings from years (3-5) of work and being frugal/thrifty. You just started. Age is not a good benchmark - years of work (and savings rate) is Since you just started out, depending on your expected annual income, you could park your $ in CPF (MA) instead. No need to worry about investment performance, it's 4% that can help to defray the cost of your Medishield Life + IP premiums",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qoyfea",
      "subreddit": "singaporefi",
      "title": "Thought exercise",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qoyfea/thought_exercise/",
      "score": 5,
      "num_comments": 48,
      "created_at": "2026-01-28T10:16:30",
      "selftext": "Here's a thought exercise actually 2 that I hope my fellow Redditors will entertain, would love to know how you all think and operate.\n\nExercise 1: If you have a $1m port, and tomorrow you got a windfall of $1m cash, what would you do?\n\nExercise 2: If you have a $2m port, and tomorrow you wake up and see your port divebomb to $1m because whatever, just pretend Trump declared war on NATO or some heavy news, triggering a worldwide selloff while you were asleep. What would you do?",
      "comments": [
        {
          "text": "Moi would tell my dad to jiak his medicine",
          "score": 29
        },
        {
          "text": "It is a good thought exercise actually.Scenario 1: I will buy use the 1m to buy dividend generating stocks and increase my passive income.Scenario 2: I will do nothing, because I understand the stock price doesn't reflect the actual value of the company, nor does it affect my passive income. And if I'm invested in div. yielding stocks, I will not be forced to sell. If Scenario 2 makes you sweat, you might want to relook your risk tolerance.",
          "score": 13
        },
        {
          "text": "Moi would tell my dad to jiak his medicine",
          "score": 11
        },
        {
          "text": "Moi would tell my dad to jiak his medicine",
          "score": 10
        },
        {
          "text": "Moi would tell my dad to jiak his medicine",
          "score": 9
        },
        {
          "text": "1) throw into market and go back to sleep/work. Be happy that FIRE accelerated greatly.\n2) cry and go back to sleep/work. If can, buy the dip",
          "score": 6
        },
        {
          "text": "Yes I prefer to accumulate div. yielding stocks and instruments. It is considered by many to be very conservative investing, but it helps me manage myself, i.e. self-management. No I will not sell just because the passive income slows or stops. That is a symptom that the company is not doing well. But I will want to double confirm with other indicators before liquidating. And deciding where to park the resulting funds.",
          "score": 4
        },
        {
          "text": "slow day on edmw?",
          "score": 2
        },
        {
          "text": "At 4%, that's 80k a year or about 6.6k a month. Singles can definitely FIRE on that. It'll be comfortable but as you mentioned, if you want more, it won't be enough. If you're married, You'll also want to FIRE with your spouse if your spouse wants to as well and 6k a month is again sufficient for 2, but in this case, it'll be just comfortable or modest.  Add kids and it'll be risky. Especially if you're on the younger side and have commitments. But in any case, it's likely still good to sit on that sudden windfall. Go about life normally for awhile and think through before you take that step of FIRE.",
          "score": 2
        },
        {
          "text": "If you're willing to uproot to other cheaper countries, then yeah it's even easier. Then you should already have FIRE when you had the $1 million before this event.",
          "score": 2
        },
        {
          "text": "1) 1 to 2 m isn't going to change the life style that much. 2) honestly do not know",
          "score": 2
        },
        {
          "text": "I think you should focus on improving your current life.",
          "score": 2
        },
        {
          "text": "1mio cash at this point in my life I will deploy it into the market lump sum in accordance with my preferred asset allocation. My portfolio did dive and did not recover for more than ten years - I bought a variant of the S n P 500 with my first pot of gold. I decided that I don’t want to take the geographical risk and exited when it broke even. No regrets. Moved into a more diversified etf. I have an European mutual fund that feeds into VEURX that I am keeping it for diversification purposes. The growth is very slow. I still have positions deep in the red. One was dairy farm. I exited that when the ceo did nothing to improve biz 5 years and sold some assets eventually to make the position look better. Another is a China etf bought to increase exposure to China for a better diversification. Still holding it.",
          "score": 2
        },
        {
          "text": "Yea, i will do the similar thing, but with a few difference Since i already have $1m port, they should be generating dividends/passive income for me. And then if i kena extra $1m, i quite my job. Enjoy life for a while, not recklessly. And then use the excess and invest again. Keep calm, analyze the situation. By right, i should have done my due diligence. If they are ok. Then go downstairs and order iced tea and chill. If situation is really that bad, i start looking for job.",
          "score": 1
        },
        {
          "text": "Moi would tell my dad to jiak his medicine",
          "score": 1
        },
        {
          "text": "I would FIRE alrdy lol. If you still need to work with 2M you either have super high living standards/spending habits, actually love working or are the sole breadwinner for your spouse and kids",
          "score": 1
        },
        {
          "text": "Depends on one’s retirement location as well. Personally i likely wont retire in SG so i could easily (and comfortably) retire alone on 2-3k/month in SEA or even taiwan and non tier 1 cities in China. Greed will never be satisfied but one’s lifespan and time is limited.",
          "score": 1
        },
        {
          "text": "I find DCA'ing downwards to be a daunting exercise, due to 'catch the falling knife' fear.",
          "score": 1
        },
        {
          "text": "Are you buying purely on price action?",
          "score": 1
        },
        {
          "text": "Moi would tell my dad to jiak his medicine",
          "score": 0
        },
        {
          "text": "You didn't consider to take the loss now and move to another asset that can recover from the position quicker than the loss asset? Analogous to jumping to a faster train.",
          "score": 0
        },
        {
          "text": "Moi would tell my dad not to stay at home at 50",
          "score": -2
        },
        {
          "text": "Hence the thought exercise. I think it's easy when everyone's in a bull market, green candles everywhere. It's when it's all red and bigly red...",
          "score": -4
        },
        {
          "text": "Thanks for sharing your insights!",
          "score": -5
        },
        {
          "text": "Thanks for the reply. Seems like most inr/singaporefiare not serious people. So your investment philosophy is to accumulate dividends and grow your port until your dividends pay for your lifestyle then FIRE? And you will sell only when the passive income flow somehow slows or even stops?",
          "score": -12
        }
      ]
    },
    {
      "id": "t3_1qoyalk",
      "subreddit": "singaporefi",
      "title": "Should I pay off all my debts in one shot?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qoyalk/should_i_pay_off_all_my_debts_in_one_shot/",
      "score": 4,
      "num_comments": 18,
      "created_at": "2026-01-28T10:10:50",
      "selftext": "i was doing some financial audit for myself and i realised that my savings now are more than the amount of debts i owe especially for student loans,, should i pay it off one shot? or continue to pay off monthly for the liquidity?\n\nany thoughts would be appreciated!",
      "comments": [
        {
          "text": "List out the interest rate of each loans. Pay off the highest interest rate one.If after paying off all your debts, how much savings will you have left. Keep savings at least 3 months emergency use or $10k whichever is lower. The rest allocate for debts repayment and investment.",
          "score": 21
        },
        {
          "text": "General strategy is your investment interest versus your debt interest. If greater don't pay off. If lesser pay off or invest better.",
          "score": 9
        },
        {
          "text": "Do check your contracts carefully for any early pre-payment penalty. Then likeu/BelovedInvestorsaid, pay off the highest interest ones first.",
          "score": 4
        },
        {
          "text": "Pay off your debt. Paying off debt is effectively a risk-free return equal to the loan interest. Any attempt to ‘beat’ that through investing requires taking additional risk. If you’re comfortable with that risk, fine — but it’s not a free lunch",
          "score": 2
        },
        {
          "text": "Way to little info. - would you have enough liquidity for emergencies (this can be quite little if living with parents and a huge sum if you have your own place and kids) - what is the interest rate on the debt Generally, I would ensure I have enough liquid cash to cover six month of my expenses, and then make the decision as if I were putting the money into a fixed deposit with interest rates commensurate to your loan",
          "score": 2
        },
        {
          "text": "Aren't student loans 4-5% EIR? That's kind of high and quite different from mortgage EIR of 1-2%.",
          "score": 2
        },
        {
          "text": "This is the only correct answer. Opportunity cost.",
          "score": 1
        },
        {
          "text": "100% agreed. There is a psychological benefit to being debt free that can't be valued in money. It's worth it.",
          "score": 1
        },
        {
          "text": "I did that.",
          "score": 1
        },
        {
          "text": "Student loans interest so low, pay off for what. Invest",
          "score": 1
        },
        {
          "text": "New loans are 3M SORA +1.5%. Cheaper than margin.",
          "score": 1
        },
        {
          "text": "I’m a student who just graduated and my loans are 4.5% PA. Edit: New SORA rates only applicable to new loans signed after October 2025.",
          "score": 1
        },
        {
          "text": "My bad. Those who signed the new loans haven't graduated yet.",
          "score": 1
        },
        {
          "text": "List down the loans and the amount, pay off those smaller amounts first For bigger amounts, pay X amount first then re-plan with a clearer picture of your monthly cashflow",
          "score": 1
        },
        {
          "text": "If I can , I will . but always got people advise using the money for investment thinking that it will outpace the interest for loans. You got to do some maths and decide",
          "score": 1
        },
        {
          "text": "If it is good debt (e.g. property), I will prefer to be in debt and use the cash that can generate better return. For example, during the height of interest rate,  my mortgage rate reaches as high as 3.6%, but a no risk HYSA account like OCBC 360 or UOB One earns 4-5% rate, money market or bond fund earns much more. Now, mortgage is around 1-1.5%, and the HYSA rate is about 2-2.5%.",
          "score": 1
        },
        {
          "text": "It depends on what your money is doing for you. If you are investing and confident you can generate returns higher than your loan interest (~5%+ per annum), then keeping the loan and paying monthly makes the most sense. That said, being debt-free early in your career is massively underrated, both mentally and financially. So it comes down to what YOU value. There is no right or wrong answer (assuming you are no gambling it under the guise of \"investing\"). Personally, I only had ~10k in savings with ~37k in student loans. I paid 2k/month, kept minimal cash (1-2k), invested the rest, and then one shot cleared the remaining loan. All of this is done in a year. It was uncomfortable, but intentional. Probably a bad financial decision living pay check to pay check but I was confident in my job security and that I will get by just alright. If you choose to pay monthly, I recommend stretching yourself a little. This means paying more than the minimum. It helps prevent lifestyle inflation and forces better budgeting habits.",
          "score": 1
        },
        {
          "text": "The shortest answer is if your returns on cash are higher or lower to borrow that money and pay interest to service. If cheaper to borrow, don't redeem.",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qp2dq9",
      "subreddit": "singaporefi",
      "title": "Insurance Planning",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qp2dq9/insurance_planning/",
      "score": 1,
      "num_comments": 4,
      "created_at": "2026-01-28T13:17:19",
      "selftext": "M31 this year. Annual is about 60k per year before bonus and CPF deductions. 80k per year after bonus.\n\nWill be selecting my BTO flat this year with my partner. BTO price can be assumed to be around 600k. Will be taking a 25 years HDB loan.\n\nMy current insurance plan is as follow:\n\nSinglife Termlife 300k, TPD 200k, and Advanced CI 200k. Premium is about 630 annually.\n\nSinglife MINDEF Group Insurance, 200k Term, 200k Accident, Group Living Care 200k, and Group Living Care Plus 150k, Premium is about 20+ monthly.\n\nCareshield Life Plus with 2 ADLs Payout, 5k monthly payout. Premium is about 1.8k cash annually.\n\nPlans\n\nSinglife MINDEF Group Insurance, 500k Term, 500k Accident, Group Living Care 500k, and Group Living Care Plus 350k, Premium will be 60+ per month.\n\nI am upgrading my coverage mainly due to future commitments like mortgage, and I'm afraid of contracting CI (which is my biggest fear tbh).\n\nMy agent is the one who recommended me to upgrade my MINDEF Group Insurance to get a higher CI coverage, and then a single payout CI plan to mitigate cost. However, as I'm still abit paranoid, I'm not sure if I should get the multi pay plan instead.\n\nDoes my insurance plan seems good?",
      "comments": [
        {
          "text": "Oh my bad. Yup. I have an ISP. Forgotten about it.",
          "score": 1
        },
        {
          "text": "If you wanna get singlife mutlipay CI, assuming till age 75. It should be a little over 2.6k. PA., if it helps you with planning your finances.",
          "score": 1
        },
        {
          "text": "Hello Op, agent here. For singlife group term living care plus rider only covers 10 eci conditions, living care & living care plus rider premiums will increase in your 40s. I also buy singlife group term, max life insurance and upgrade the ci and eci rider. The conditions to claim CI is harder and recovery from a CI claim is longer if you are lucky. For example, Eci definition for liver is liver surgery while CI is end stage liver failure. What CI are you concerned about? Cancer? Stroke? Heart attack? Getting a 200k eci multipay rider would be quite pricy compared to a single claim eci plan. But whichever help you sleep better at night. Do compare other companies before committing to a long term contract.",
          "score": 0
        },
        {
          "text": "Hello FA and Trader here [33m] Okay, let me summarize a little for both from my understanding Death: 300k+200k to 300k+500k TPD: 200k Stays the same CI: 200k+200k to 200k+500k ECI: 150k to 350k PA: 200k to 500k Careshield done ISP? Overall looks good to me! I personally do think that the additional CI 200k plan (totalling of 550k if you do upgrade your mindef group one too!) should make it more than adequate, because usually people will use the lumpsum as an income replacement for the next few years. Multipay only pay multiple times if you sway sway kena different ECI/CI. So ultimately, it still comes down to you on how you feel about it, how much do you think is needed etc and at most FAs are there to advice and sell you the plans.",
          "score": -1
        }
      ]
    },
    {
      "id": "t3_1qpbwji",
      "subreddit": "singaporefi",
      "title": "question on Webull",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qpbwji/question_on_webull/",
      "score": 0,
      "num_comments": 1,
      "created_at": "2026-01-28T21:51:44",
      "selftext": "Been trying to sell a stock on Webull using\n\nGTC pricing but I can do it, anyone faced this ‘Limit Price too passive’ thing before?",
      "comments": [
        {
          "text": "what illiquid thing you trying to sell?",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qp63ph",
      "subreddit": "singaporefi",
      "title": "Cut my losses now or stick with a 3% savings insurance plan for 25 years?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qp63ph/cut_my_losses_now_or_stick_with_a_3_savings/",
      "score": 0,
      "num_comments": 30,
      "created_at": "2026-01-28T16:47:31",
      "selftext": "Hey everyone, looking for some perspective on whether I should \"rage quit\" my current savings insurance policy or if I’m just being impatient.\n\nEdit: When I was 19, an agent talked me into signing up for a Prudential PruActive Cash plan.\n\nI'm 21 years old now and still a university student, and I'm realizing I didn't think this through at all.\n\nCurrent Investment: I’ve put in $5,000 so far.\n\nAnnual Commitment: $2,500/year.\n\nIt’s a 25-year plan with a projected ~3% interest rate at the end.\n\nIt includes a premium waiver if I’m diagnosed with a critical illness (basically they’ll keep saving that $2,500/year for me if I get sick).\n\nThe Dilemma:\n\nI’m starting to feel like 3% is a joke. With inflation where it is, I feel like my money is actually losing purchasing power over such a long horizon. I’m thinking about terminating the plan, but if I do, I lose the entire $5,000 I’ve already put in (surrender value is basically zero right now).\n\nThe Plan B:\n\nI want to redirect that $2,500/year into Gold (or maybe a low-cost index fund). I’m okay with the short-term $5k hit if it means I’m not \"trapped\" in a low-yield product for the next two decades.\n\nQuestion for the sub:\n\nWould love to hear from anyone who has surrendered a policy early or decided to stick it out. Thanks!",
      "comments": [
        {
          "text": "Apart from ILP advice given by Due and Ceyenne... want to redirect that $2,500/year into Gold (or maybe a low-cost index fund). Can dont fomo into Gold? Gold might be a good investment but you're definitely buying it because you recently saw it go up alot right. Dont lie to me >:(",
          "score": 27
        },
        {
          "text": "just let OP chase. You won’t learn until you burn your hands. It is necessary evil.",
          "score": 11
        },
        {
          "text": "How is 3% a joke when it includes CI? \nYou are saying it’s a joke because market is very bullish, what happen when market turns against you? \n3% is already more than the fixed deposit and singapore bonds.",
          "score": 6
        },
        {
          "text": "Surrender unless there is a defined purpose for this policy, such that the certainty of being able to fund that purpose is more important than gains. Example would be your child's university fund, where even if you get CI or TPD or die or whatever, your child's uni fees are assured. Consider the $5k to be your tuition fee. Are you quite young and maybe not even working yet? Nevermind, it's just 1-2 months salary when you're working full time.",
          "score": 5
        },
        {
          "text": "Canon event.",
          "score": 3
        },
        {
          "text": "You know the answer. Why use a burner account just to poke at the anti-ILP sub?",
          "score": 3
        },
        {
          "text": "Thank you so much for this. Mentioning the sunk cost fallacy and ILP threads really gave me the clear sense of direction I was looking for. I realized I’d rather take the $5k hit now than be trapped for another 23 years. This has definitely secured my decision to end the policy and move toward a more flexible strategy. Really appreciate you taking the time to help!",
          "score": 3
        },
        {
          "text": "Yea. But im not saying its a bad investment hahaha. Im saying that OP should understand why gold instead of other vehicles haha",
          "score": 2
        },
        {
          "text": "2 years can cut losses",
          "score": 2
        },
        {
          "text": "This is not at ILP. ILP is worse than this savings/endowment plan.",
          "score": 2
        },
        {
          "text": "Is the 3% guaranteed? If so, you're comparing a capital guaranteed product to risky investments (Gold, index funds) - they're different financial tools. I'm not advocating for keeping this plan by any means, but you'll need to look at it from a different perspective on whether you want to keep this plan.",
          "score": 2
        },
        {
          "text": "Yea this pump is kinda gg insane, no way theres no correction",
          "score": 1
        },
        {
          "text": "It’s like DBS all over again. Run up then buy",
          "score": 1
        },
        {
          "text": "Would still not be better than take a term life insurance?",
          "score": 1
        },
        {
          "text": "Huh? Need more words to understand your question. What are you comparing vs term life insurance?",
          "score": 1
        },
        {
          "text": "If you want secure the university fund of your children in case you die… Would likely be a better deal a life insurance that pay out if you die?",
          "score": 1
        },
        {
          "text": "Then in the high likelihood that you don’t die, how are you going to pay the fees? If you invest ETF it could crash just when your kid is going to start uni. The endowment plan is just a simple solution for layman that combines CPF OA to SA level of gains with a smidge of insurance enough to secure just the uni fees.",
          "score": 1
        },
        {
          "text": "Projected =/= Actual returns If he gets 3% per annum, why zero surrender value after 2 years…",
          "score": 1
        },
        {
          "text": "Why do people even use a burner account actually",
          "score": 1
        },
        {
          "text": "Hi, this is my first time actually posting on Reddit. I’m using reddit because I’m honestly really embarrassed about this situation and didn't know where else to turn. I don’t have anyone in my real life I can talk to about money without feeling judged, so I’m hoping to get some objective advice here. When I was 19, I was talked into signing up for a savings/insurance plan. At the time, I didn't think it through and just saw it as a safe way to save.\nI’ve paid in $5,000 so far. I’ve realized 3% interest is basically losing money to inflation over 25 years. I’d much rather redirect that $2,500/year into Gold or ETFs, but if I terminate now, the surrender value is $0. I’d be losing my entire $5,000",
          "score": 1
        },
        {
          "text": "Hi, look up the sunk cost fallacy and you may also want to search for ILP threads on this subreddit. The $5000 is painful but it's the future that is important. Suppose you put your money into index ETFs yielding 6% over 25 years. Calculate that using any compound interest calculator and you can compare that with the returns from your ILP. Frankly, ILP has so many terms that it's hard for anyone to give you specific advice. It's up to you to figure it out eventually. For the CI waiver, would it better to just get more coverage with an actual CI plan instead? Don't forget that it's also very hard to take money out of ILP before maturity compared to investing yourself.",
          "score": 1
        },
        {
          "text": "I see, ILP is so commonly marketed as savings plan that I automatically assumed it was an ILP",
          "score": 1
        },
        {
          "text": "Yeah, it’s confusing and savings/endowment plan is still investment linked to insurance. But technically ILP are those where you choose funds to invest in and if they don’t perform well that’s your problem. The savings/endowment plan are those where the insurance company is pooling all the money from the participating policies (including life insurance) to invest together, mostly in bonds. And when they declare a bonus each year, it becomes yours and they cannot take it back even if next year the market crashes. Often there is a capital guarantee upon maturity but not OP’s.",
          "score": 1
        },
        {
          "text": "It's actually not even capital guaranteed, apparently, much less guaranteed 3% p.a. gains.",
          "score": 1
        },
        {
          "text": "That is true if we are using volatility to define risk. But if we define risk as the risk of losing money to inflation, too safe instruments may have a higher chance of losing money to inflation in the long run.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qptldv",
      "subreddit": "singaporefi",
      "title": "Investment advice",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qptldv/investment_advice/",
      "score": 0,
      "num_comments": 9,
      "created_at": "2026-01-29T08:45:35",
      "selftext": "Hi all, I'm new to IBKR and VWRA. I have 1950 free cash flow per month. Am thinking to invest 0.1oz of gold around (current price $700) per month and 2oz of silver (paper) ($300) month via OCBC. And also want to start buying 1-3 vwra on monthly basis dca using the remaining balance. But the commission fee is high per trade using ibkr lite, about 4.36~\n\nIf invest monthly via ibkr - vwra for one year, the commission fee is around 4.36*12= 52.32 am thinking the commission fee was pricey.\n\nI would like to heard from your opinion.",
      "comments": [
        {
          "text": "Just something to think about regarding gold abd silver. Gold also became safe haven in the late 1970s and peaked in 1980. Then it tanked and if adjusted to inflation, it recovered just last year. Just something to think about if you're planning to buy gold today. You may end up waiting 44 years to see real gains. Gold doesn't pay dividends. But at the same time, the s&p500 is up over 3000%  from 1980 and that is inflation adjusted.",
          "score": 11
        },
        {
          "text": "Don't use IBKR Lite if your primary purpose is to buy VWRA or any other London Stock Exchange Fund. Lite is for those who only want to trade on US exchanges. Use IBKR Pro, Tiered pricing. Minimum commission will be US$1.70 + GST instead.",
          "score": 8
        },
        {
          "text": "Ibkr pro, tiered account. Per trade will be reduced to ~2 USD at your price. Also, can dont fomo into Gold and silver just because they went up. Be sure to know their place and what they bring to your portfolio other than \"it go up hurr durr\"",
          "score": 7
        },
        {
          "text": "Gold and silver euphoria",
          "score": 3
        },
        {
          "text": "In app settings > all account settings > account management > account configuration > IBKR pricing plan , all change from there",
          "score": 2
        },
        {
          "text": "How do I get to IBKR pro, tiered account??",
          "score": 1
        },
        {
          "text": "Account setting--> pricing plan. Once changed, give 1 - 2 days for the change to take effect.",
          "score": 1
        },
        {
          "text": "I’m on PRO tier but I’m still getting charged 4.36 commission :o Edit: it’s pro tier but tiered pricing not toggled on☠️",
          "score": 1
        },
        {
          "text": "Hi , where can I get what the pricing tiers are ? And how to toggle on tiered pricing ?",
          "score": 1
        }
      ]
    }
  ]
}