{
  "schema_version": "raw_scrape_v1",
  "report_id": "2026-02-16",
  "scraped_at": "2026-02-16T13:55:25.687212",
  "subreddits": [
    "singapore",
    "askSingapore",
    "SingaporeRaw",
    "singaporefi"
  ],
  "total_posts": 40,
  "total_comments": 531,
  "posts": [
    {
      "id": "t3_1r5cbhl",
      "subreddit": "singapore",
      "title": "Wonder if I can lowball this shop",
      "url": "https://old.reddit.com/r/singapore/comments/1r5cbhl/wonder_if_i_can_lowball_this_shop/",
      "score": 1606,
      "num_comments": 122,
      "created_at": "2026-02-15T19:25:00",
      "selftext": "",
      "comments": [
        {
          "text": "bro can meetup at mrt gantry? fast deal",
          "score": 875
        },
        {
          "text": "Just say Hi and stand there for 10 minutes before walking away.",
          "score": 362
        },
        {
          "text": "I wanna take an item to the cashier, ask \"I'm interested! Still Available?\" then just walk out the store.",
          "score": 168
        },
        {
          "text": "Can you deliver to my house?",
          "score": 148
        },
        {
          "text": "What’s the lowest you can go? 😂",
          "score": 127
        },
        {
          "text": "“If self collect can cheaper?”",
          "score": 118
        },
        {
          "text": "Student price available? ",
          "score": 54
        },
        {
          "text": "*makes offer* \n\nDisappears",
          "score": 48
        },
        {
          "text": "Heavily used but like new",
          "score": 42
        },
        {
          "text": "They lowballed the sellers to acquire their stock…",
          "score": 37
        },
        {
          "text": "It's an insult to the shop if you don't do it.",
          "score": 36
        },
        {
          "text": "Offer half the price of any item then call them a cheapskate for saying no",
          "score": 21
        },
        {
          "text": "can meet at mrt station?",
          "score": 15
        }
      ]
    },
    {
      "id": "t3_1r5hkn0",
      "subreddit": "singapore",
      "title": "Singapore is officially the least flirtatious city in Southeast Asia",
      "url": "https://old.reddit.com/r/singapore/comments/1r5hkn0/singapore_is_officially_the_least_flirtatious/",
      "score": 467,
      "num_comments": 116,
      "created_at": "2026-02-15T23:36:44",
      "selftext": "",
      "comments": [
        {
          "text": "Is true. \n\nIf an attractive girl comes up to me, the first thing on my mind is 'what insurance package/MLM is she trying to sell to me\".",
          "score": 875
        },
        {
          "text": "&gt;In Singapore, respondents say they see someone attractive an average of 7.8 times a month – that's basically twice a week.\n\nWhere are all these people going",
          "score": 352
        },
        {
          "text": "Office scene is super vibrant here.",
          "score": 141
        },
        {
          "text": "&gt;_Singaporeans report flirting just over three times a month. We're not giving ourselves the chance to meet potential partners, either, clocking just 1.9 nights out that might lead to romance each month – the lowest of any city in Southeast Asia._\n\nProbably people are having challenges finding time for romance when work takes up so much time/effort/energy.",
          "score": 129
        },
        {
          "text": "“In Singapore, respondents say they see someone attractive an average of 7.8 times a month – that's basically twice a week.”\n\nOk uncle chiong Dome 3 and KTV to boost those numbers",
          "score": 111
        },
        {
          "text": "Here we work only \n\nIf fact we should outsource pregnancy and parenting",
          "score": 96
        },
        {
          "text": "If I approach someone,they’ll probably call police ):",
          "score": 82
        },
        {
          "text": "Whaddaya mean least flirtatious?\n\nU mean \"Ai steady mai?\" wasn't working??",
          "score": 56
        },
        {
          "text": "Because you're gonna end up on TikTok as the \"dirty old man/disgusting guy that tried to hit on me\"",
          "score": 56
        },
        {
          "text": "Reminds me of the vice principal havin affair with some kid’s mom",
          "score": 49
        }
      ]
    },
    {
      "id": "t3_1r5n7sy",
      "subreddit": "singapore",
      "title": "Realising that even when you migrate overseas, sometimes your prejudices within you doesn't leave you - it is amplified.",
      "url": "https://old.reddit.com/r/singapore/comments/1r5n7sy/realising_that_even_when_you_migrate_overseas/",
      "score": 320,
      "num_comments": 96,
      "created_at": "2026-02-16T03:15:20",
      "selftext": "I migrated to San Fran, US over 2 years ago and met a fellow Sporean here. As we got to know each other, they actually said that they hv no minority friends in Singapore. Like throughout their whole adult life, they hv had no friends outside her socio-demo group and race. This disappointed and shocked me because we are from a multi racial and religious society. As someone from a minority racial group i have met people with such a mindset and preferences when I was in spore but they r very closed minded, hv a lot of group think and r ignorntt so I can't click with them very well. It's disappointing that to a certain degree that I'm starting to feel the same way towards them.\n\nI thought that is fine but I realised after talking to them that they prefer to mix arnd with ang moh ppl. Like white locals when there r so many diverse races in San Fran. They would actually put it on insta to show that these ppl r their friends. It's absolutely SO cringe. In convos, they wld make passing remarks that makes me feel that they prioritise befriending ang moh white ppl. Like they would ask oh is your friend white? N that is quite disappointing because my friend is a human. So I know what they r trying to do by displaying those pics on insta story. \n\nWe are all racist to a certain degree. I know I am and try to be mindful and not generalise but damn I won't wanna display it for the whole world to see. I just came to a realisation that it doesn't matter if we come from a multi racial and multi religious society and this whole facade of displaying diversity, even if we have that environment back home, we cannot force people to integrate and befriend other races even if we are conditioned to appreciate it through education. If they wanna shun or idolise a specific race, it is actually on them.\n\nI'm not looking for any advice because it is what it is but fellow sporeans overseas, have you met other sporeans like this? Is it a thing?. I just wanted to express my disappointment that I thought by living overseas, we should open our minds and not 110% act on our prejudices overseas like how we did back home (for those who do). I know for sure though, if we had met in Spore, we wldnt ever be friends because I don't fit into that specific socio demo grp. Oh and I am someone this person defo cannot benefit from even though they have denied that they make friends just to benefit themselves.",
      "comments": [
        {
          "text": "I'm not Chinese, I studied overseas and Chinese Singaporeans stared at me in uni because they couldn't believe a non-Chinese could afford an overseas education. But they wanted me to cook curry for them because they missed it so much. When the dinner was over, they avoided me again. Jerks, so I avoided them. Met wonderful and not-so wonderful Americans and foreigners and had good conversations with them.",
          "score": 150
        },
        {
          "text": "Hi, fellow Singaporean in SF! I think most Singaporeans who move to SF are Chinese, from a privileged background, and like you say, may not have minority friends for the above-mentioned reasons. \n\nThere’s also the aspect of (someone else here mentioned this) of Chinese Singaporeans being somewhat absorbed quickly into the East Asian / AAPI model minority thing, even if we didn’t consciously participate in it. We are put in a box of ‘somewhere between a Chinese person from China and a Chinese American person’. Goes without saying that people perceive us as Chinese rather than Singaporean. And if you work in tech, it is absolutely a class thing. \n\nSF as a city is also overwhelmingly white and Chinese or other East Asian due to demographics and gentrification. Chinese Singaporeans also tend to bring our weird vibes about race here (I try not to ask many folks here I know about what they think about Black people.. coz I know the answer)\n\nIf you’re someone who never interrogated your own race / friendships back home, you probably won’t be someone who does that elsewhere. \n\nI think there are two broad groups of Singaporeans in SF: people who only hang out with other Singaporeans and can’t wait to get home, and these folks tend to be meet the profile you described, and everyone else. \n\nThe only joy I’ve had in the community has been through food networks and groups that are joint SG/Malaysian events or communities. They tend to be more diverse and open. Most of my friends are other immigrants from all countries, because I find that I connect more easily on that one large part of my life. \n\nAlso, ‘San Fran’ will earn you bad vibes here! \n\nI think over time that evens out a bit. My Singaporean friends who have been here more than a decade are very different people from who they are back home. Especially if they have kids and they are participating in more everyday life things, like school. Otherwise, if you’re working here in tech and that’s your entire life, then yeah, it is very white and other Asian. ",
          "score": 139
        },
        {
          "text": "I might be the odd one out but in my pri , sec , army unit and right now office. Theres a certain race that is not included in these environments of my life. That's more than 10 years of minimal interaction. Sg is multi racial but not really also",
          "score": 127
        },
        {
          "text": "(I have been living in the US for almost 15 years)\n\nI think I get what you're saying; I think there are a few parts to your post...\n\nPart 1, being disappointed by the lack of your friend's exposure to other groups growing up. Sad but true common experience. I am Chinese SGean, not religious, went to Chinese schools, so everyone I had significant social interaction with (i.e. people at school) was also Chinese. Certainly all my close friends were, except for one Chinese-Indian friend who transferred schools because she was having a shitty time there (e.g. being forced to enroll in Higher Chinese when she didn't even use the language at home. I hope as mixed families become more common in SG and Chinese standards fall that nobody else has that particular experience nowadays.) Do I now as an adult realize how cloistered my upbringing was? Sure. But anyway, I cannot change my past experiences, and neither can your friend.\n\nPart 2, your friend chasing angmoh. Remember the term sarong party girl? I think it's kind of odd behavior honestly that your friend is so obsessed with specifically befriending them to the extent of asking \"is your friend white\". ESPECIALLY in the Bay Area which like you said is so diverse. I don't agree with the other commenter that this is just a matter of seeking out other perspectives if your friend is both exclusively seeking out white friends AND avoiding Americans of other races.\n\n(A slightly kinder perspective: maybe something about your friend's angmoh friends is more comforting or welcoming or familiar? maybe they are running away from something? or seeking a specific community that happens to be white-dominated?)\n\nPart 3, have I met other overseas Singaporeans who are like your friend? Yes and no. People are different obviously, and people move overseas looking for different things. My hunch is that my specific history and personality have made me value diversity/openness much more than most other overseas Chinese Singaporeans I have met. Most. Not all. \n\nMaybe over time living in the US and becoming a minority will help develop your friend's empathy. The only thing you can do is stay true to your own values and try to seek out likeminded people.",
          "score": 78
        },
        {
          "text": " I used to live in SF back in 2010-2015, and personally found it easier to make friends with people of similar cultural identity (all asians - Indian, Chinese, Korean, Japanese, etc.). Maybe this person is trying to branch out and meet more non-asians rather than stick with people from the same culture (I’m making an assumption that this person is of asian heritage and ethnicity)?\n\nI now live in Sydney, and find it challenging to make friends with Singaporeans because they are quite a close knit group and hang amongst those with same chinese background, which i am not. That being said, I haven’t actively pursued friendships with Singaporeans so this view could be a bit biased. \n\nI know you’re not looking for it, but a simple piece of advice - just do your own thing man. Your life would be much happier if you focused on what you want, rather than concerned with what others want.",
          "score": 55
        },
        {
          "text": "Being a fail chinese student and my parents can barely speak mandarin and really don't speak it at all and even my grandparents speak English to me.\n\n\nMy parents have alot of minority friends. \n\n\nSo naturally in school, I had alot of minority friends my best friend in primary school was malay. Her parents are good friends with my parents. So her parents often fetch me and her from school to their place for dinner before sending me home to my parents. This was a pretty affluent malay family. \n\n\nMy best friend in secondary school was Indian. \n\n\nI actually don't get along with Singaporean chinese that much unless they came from English speaking families like me. Otherwise they are pretty openly hostile towards you. See you as some kind of race traitor for not speaking Mandarin. \n\n\nMy parents also somehow idolise Indians and will only use Indian lawyers and doctors. And always tell me to be like them. I got to admit my Indian bestie from secondary school lives in Big House in bukit timah, and she is the smart and rich Indian stereotype my parents believes in. She got first in school for o levels.\n\n\nMy grandpa is actually fluent in tamil and malay too, and he easily converses with Indians and malays. He is pure Chinese but a genius in all languages. He speaks English like LKY.\n\n\nSo maybe it's my friend group but Malays and Indians are never excluded and we always had a multi racial clique in school.\n\n\nI can't relate to all these posts claiming they never had a minority friend. Not my experience growing up in Singapore.\n\n\nEven now at work, many of my besties are Indians. ",
          "score": 51
        },
        {
          "text": "I might be the minority here. I lived in London for 30 years and for those 30 years, i actively tried to avoid local Singaporean. \n\nI will not attend any Singaporean functions organised by the high commission. Many Singaporean families in London like to form groups and socialise together. I avoided them. \n\nWhy? The convo and the attitude just does not flow with me. Often they like to complain about Europe and everything is better back in Singapore. Then why are you here in London?",
          "score": 25
        },
        {
          "text": "I live in Australia. I don't go out of my way to chase white people, but I go out of my way to avoid insular groups. Not people who banded together for familiarity, but people who, one reason or another, do not intend to assimilate or even participate in Australian life and values. Like um, the Singapore society (read: club, CCA) when I was at uni. They don't intend to stay in Australia (most of them are bonded to govt), and are not interested in learning about Australia further than a tourist's perspective.\n\nI do get together with people who love to learn more about the Aussie way of life, and the people who are delighted in teaching us tend to be white, because half the country is white now, and a lot more are white back in the dark days of the white Australia policy.",
          "score": 25
        },
        {
          "text": "Colonisation never ended for them, it lives rent free in their 2 brain cells.\n\nThey might also not be people who are good friends, given they have the self reflexivity of a rat turd, never asking \"Why\". Stay away from NPC people, it never ends well when you are outside their programmed cartoon script of \"good\" and \"bad\".",
          "score": 25
        },
        {
          "text": "omg, OP I was just ranting about this after reading an SGer/US transplant use the term \"ethnically homogeneous\" i.e mostly white. I assume your friend is Chinese and well-off - it's a class + race thing to think that one is white-adjacent. I've spent the last 12 years living as a minority in a minority city which is low-income/perceived as high crime.\n\nAs Asians and non-whites, we are persons of color, like it or not. I love how a friend once reminded me that \"we are not one of them\". I like how I can go to places where it's gonna be impossible for a white person and how I can pass for Hispanic or Asian, depending on which neighborhood I'm in (gotta do better in Spanish too). Ethnically ambiguous! Back in SEA, I didn't get pegged as a Singaporean, which helped.\n\nEdit: Here in the US, one gets to experience the entire world! Eastern-European, African, South American... I bet your friend is afraid of dark-skinned people. They'd be terrified to step into my neighborhood for sure....",
          "score": 24
        },
        {
          "text": "Please. It’s San Francisco or SF. 2 years into living there you haven’t learnt it’s a no no to call it San Fran. You can’t control your friend’s narcissism, biases or ignorance but you can control your own experiences in the city. Start by learning about the history of our black and latino friends in SF whose neighborhoods got gentrified by tech transplants. Make friends with them and you’ll learn we have so much in common. They are the most friendly people in the city. Be part of events in SF during Black History month and Cinco de Mayo or Carnaval San Francisco.",
          "score": 22
        },
        {
          "text": "I think due to their upbringing, type of schools (especially for non neighbourhood schools) and personal preferences, they can end up with a social circle like that. Not saying there's anything wrong as it's their personal choice, just that living overseas may not necessarily change that. \n\nSome go overseas to advance education or careers and do networking. So they may not prioritize broadening their social circles or stepping out of their comfort zones, especially if there's no real practical benefit to do so.",
          "score": 21
        },
        {
          "text": "Malay here, most of my friends are Chinese and all my exes have been Chinese as well. Racial harmony in SG is a farce, it's racial tolerance at best. But it's how humans are wired, we're tribalists after all.",
          "score": 17
        },
        {
          "text": "I remember there was an article a couple of years back by the ST that most Chinese Singaporeans don’t have a single friend from the minority race.",
          "score": 13
        },
        {
          "text": "I had the opposite experience in Singapore. I have always had a few Malay friends in primary &amp; secondary school but I was avoided instead as they said their parents said that they should not be friends with me and to stay within their own race. I’m not sure why but most didn’t maintain that friendship with me. I also dated a Malay guy but he said it has to be a secret because his parents cannot know. \n\nNow I’m in US and my friend group is very diverse with my main group of friends from Vietnam, China, Peru, SG, and Europe. \n\nThe Singaporeans I have met here also have very diverse friends. So I didn’t have the same experiences.",
          "score": 12
        },
        {
          "text": "I know Singaporeans who spent their entire life never eating any food except their own ethnic group’s food. It is incredible when you think of how much variety is in SG but your whole life, never even tried.\n\nWhile what we wrote is both true, let us consider that the interracial marriage rate in SG is 21%.\n\nThis is higher than the USA.",
          "score": 8
        },
        {
          "text": "I must be one of those Chinese who has friends of other races, and I like it. It's the beauty of living in Singapore!",
          "score": 4
        }
      ]
    },
    {
      "id": "t3_1r5x9to",
      "subreddit": "singapore",
      "title": "Man, 46, borrows friend's PMA to deliver food, charges it 1st time, burns Punggol flat down",
      "url": "https://old.reddit.com/r/singapore/comments/1r5x9to/man_46_borrows_friends_pma_to_deliver_food/",
      "score": 296,
      "num_comments": 80,
      "created_at": "2026-02-16T10:20:38",
      "selftext": "",
      "comments": [
        {
          "text": "&gt; Hu said his friend only told him that the used battery was faulty and should not be charged in the aftermath of the fire.\n\nKena sabo by the friend",
          "score": 302
        },
        {
          "text": "Hu said he previously used his own personal mobility device (PMD) to deliver food, but it was impounded by the authorities a few days before the fire.\n\n😏 illegal modifications or his not one of those that suppose to use PMD/PMA?",
          "score": 143
        },
        {
          "text": "Year of the fire horse ",
          "score": 99
        },
        {
          "text": "At the rate of hse being burnt down due to PMD battery charging, maybe it's about time to just install a community charging station at the ground floor for people who really need to have PMA - just like charging stations for EV cars.",
          "score": 80
        },
        {
          "text": "At least his friend doesn’t need to visit him during CNY.",
          "score": 55
        },
        {
          "text": "fuckin single use PMD meh. vape also lose",
          "score": 25
        },
        {
          "text": "This dumbass had his own modified PMD confiscated, used another likely faulty and illegally modified one, then tried to put out an electrical fire with water. Confirmed Darwin Award winner.",
          "score": 19
        },
        {
          "text": "Why do PMDs battery catch fire but not electric vehicles?",
          "score": 9
        },
        {
          "text": "Why cannot use bicycles for deliveries huh",
          "score": 8
        }
      ]
    },
    {
      "id": "t3_1r58a9x",
      "subreddit": "singapore",
      "title": "Scammy Places Targeting Elderly in Heartland Areas",
      "url": "https://old.reddit.com/r/singapore/comments/1r58a9x/scammy_places_targeting_elderly_in_heartland_areas/",
      "score": 207,
      "num_comments": 60,
      "created_at": "2026-02-15T15:15:32",
      "selftext": "I live in Toa Payoh, an area known to have a lot of old people and retirees. I’ve noticed so many skincare places popping up in the central area in the past 5 years, and what’s more they only target/talk to the elderly when they’re alone. \n\nMy mum is 70 and she gets approached by them a lot when she’s alone but when I’m with her they don’t talk to her. I loathe them so much I start talking loudly to my mum whenever we pass to “never trust these scammers who only target elderly”\n\nI’ve also looked into a few of these shops before and see young good looking people talking to the elderly, offering them free gifts, tea, etc. \n\nUpon further observation and research, I see them offering not just 1-off treatments but large packages. \n\nThese places are preying on the elderly, as they know the people who have money to spend aren’t the working population, but the ones that are retired. \n\nI’ve sat at a McDonalds opposite such a business and watched them for a couple of hours and they ONLY talk to the elderly. \n\nWith the recent cases about pressuring elderly into buying packages and the whole hoo-haa about it, is there anything one can do about it? I assume reporting them will not work since they’re technically not doing anything illegal, just unethical. \n\nI once thought about putting it on social media and inviting all the youths to put such places in their area on social media as well, starting a trend to call out such unethical practices and the respective shops that do this but I worry about getting sued for slander. \n\nAny ideas? ",
      "comments": [
        {
          "text": "There’s one shop outside Amk hub which does this too. Everytime I walk past, i see them talking only to unaccompanied uncles and aunties. \nI think need to educate your parents and elderly in the house. \n\nBut I do feel sorry reading about the deaf elderly who was pressured to spend $9k at some beauty shop in Bedok. Deaf elderly also want to cheat. Unfortunately seems like nothing the authorities can do? They can always just shut down and open again under a new name",
          "score": 85
        },
        {
          "text": "You could consider sending a tip off to CNA's Talking Point or Channel 8's Frontline. This seems like something they might be interested to cover on their programmes.",
          "score": 49
        },
        {
          "text": "Late Stage Capitalism 🤑🤑🤑",
          "score": 19
        },
        {
          "text": "It's ridiculous how many of these scam shops have popped up enmass. My old neighbourhood Serangoon had a few hardware shops, eateries and even clinics close down only for these scam shops to take over.\n\nAlways the same modus operandi, offer a cheap $3 haircut or $10 massage to bait the elderly in and scam them into buying expensive packages.\n\nThey're operating in bright day light in Serangoon Central, beside the police NPC and even in areas where the MP frequently walks the ground at. But no one is taking any action and just keeping an eye closed.",
          "score": 14
        },
        {
          "text": "Got one at clementi also. When i walk w my mum they only target her lol. Check google reviews n they also mention hardselling of such packages",
          "score": 10
        },
        {
          "text": "I also see they hire Caucasians to lure people in",
          "score": 5
        },
        {
          "text": "Well, I mean insurance agents have been doing this for decades, and yet we don't see any change in the industry for that.",
          "score": 4
        },
        {
          "text": "These places are everywhere and this has been their modus operandi for years, with CASE being generally toothless. If 1 of these shops goes down, 2 more will pop up. I think we can only keep telling our elderly to treat them like pests and do not stop or engage them.",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1r5cg9d",
      "subreddit": "singapore",
      "title": "How This Singaporean Became A Global Feng Shui Sensation | Singapore Hour",
      "url": "https://old.reddit.com/r/singapore/comments/1r5cg9d/how_this_singaporean_became_a_global_feng_shui/",
      "score": 195,
      "num_comments": 30,
      "created_at": "2026-02-15T19:32:53",
      "selftext": "",
      "comments": [
        {
          "text": "He's an architect by training",
          "score": 106
        },
        {
          "text": "It's probably because of this guy, people start paying attention to how they place their furniture in their homes. He pays a lot of attention to little details that others don't. It's definitely an eye-opener! ",
          "score": 89
        },
        {
          "text": "I've been a big fan of Cliff since he started becoming famous. I even bought the paper version of his book (highly recommend) although I already had the ebook version also.\n\nIts a joy to see his content in all formats.\n\nI hope he can move back to Singapore sometime in the future,\n\n",
          "score": 75
        },
        {
          "text": "His content is great, and I don't even listen to the fengshui bits.",
          "score": 69
        },
        {
          "text": "I really like his videos! It's fun and informative and entertaining. Even if you don't believe in fengshui, his skills proves that he's still a very good designer. ",
          "score": 62
        },
        {
          "text": "I booked him for my apartment, highly experienced guy and 1000% recommend if you are not rushing (I waited 4 months for my appointment). He really has the same energy as the videos, super authentic and creative. As a Singaporean designer overseas I also find him incredibly inspiring as well. Big fan.",
          "score": 55
        },
        {
          "text": "So now you know!",
          "score": 36
        },
        {
          "text": "my primary school classmate bahahaha, dude wasn’t so animated and high energy back then but definitely one of the nicer guy in class. Happy to see him doing well now.",
          "score": 21
        },
        {
          "text": "i see his videos being recommended to me all the time;   \n\nhe hit jackpot with the algorithm picking his content frequently.   ",
          "score": 10
        },
        {
          "text": "lol I thought his catchphrase was amazing something like ‘Don’t blame yourself, don’t blame others, blame the furniture’",
          "score": 5
        },
        {
          "text": "He is good.",
          "score": 2
        },
        {
          "text": "Knew of this guy back when we were illustrating skyscrapers on skyscraperpage.com. Great to see him so successful now!",
          "score": 2
        },
        {
          "text": "Who says SG has no talents? Lol",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r5a6xe",
      "subreddit": "singapore",
      "title": "No quiet at home: The reality of living with Singapore's traffic noise",
      "url": "https://old.reddit.com/r/singapore/comments/1r5a6xe/no_quiet_at_home_the_reality_of_living_with/",
      "score": 174,
      "num_comments": 68,
      "created_at": "2026-02-15T17:13:18",
      "selftext": "",
      "comments": [
        {
          "text": "I'm okay with some noise but screw those driver/riders who rev their engine and speed down neighborhood estate just to stop at traffic light.",
          "score": 133
        },
        {
          "text": "I wonder how much switching to largely electric cars would mitigate roadway noise.\n\n\nOf course, many of the examples in the article - airplane noise, MRTs and construction noise - won't change even after the switch, but at least it'll be better for some.",
          "score": 89
        },
        {
          "text": "We need to crack down hard on those selfish people who illegally modify their vehicles.\n\n\nThey enjoy revving their engines to feel good but make life miserable for everyone else.",
          "score": 48
        },
        {
          "text": "regarding mrts, did they ever fix the noise issue on certain parts of the tel...have been actively avoiding that line like the plague, remembered using noise cancelling earphone but they barely made a difference",
          "score": 44
        },
        {
          "text": "Was half expecting this to be a landing page for insulated window lol",
          "score": 30
        },
        {
          "text": "I’ve heard this sentiment around Singapore often, and wondering why double-glazed windows aren’t more common.\n\nLiving in Europe, double-glazed windows are very common (necessary for heat insulation), and realised how significantly quieter the outside sounds when these windows are closed, compared to when they’re open. It really is almost like opening a portal to the outside world when you open a window, sound that was blocked flows in, and you realise how loud the outside world truly is.",
          "score": 26
        },
        {
          "text": "That’s a good looking article",
          "score": 17
        },
        {
          "text": "Not only this. Sometimes, there are some mfs parking their lorry in the unloading area while keeping the engine on. The low rumble can be heard all the way to the top level, even if I close the window.\n\nAnd the aircon condenser unit vibration. Some mfs would let it go unserviced for years or won't change it out when its fucking due for replacement. The vibration and low hum will drive those who are easily triggered by noise crazy.\n\nAlso, sometimes there would be some mfs that would come out of their units to smoke at the staircases and blast their boomer tiktok videos until I can hear inside the house.\n\nAnd, the fucking water hammering noise that could be coming from other units but they dont care.\n\nAlso, those 'music prodigy' that play instruments like piano or recorder until the next block can also hear. Good job.\n\nImagine you spend 700k and buy a resale then get all these shits.",
          "score": 16
        },
        {
          "text": "If normal motorcycles occupy the top 3 in terms of asper (Managing to beat even a helicopter), I wonder how a illegally modded motorbike would do",
          "score": 13
        },
        {
          "text": "Indeed. Indeed. Constant noise disturbance. And to add. Some riders choose to make their PMA or PMD with loud music....",
          "score": 11
        },
        {
          "text": "Stayed in the old Plaza condo at Bugis for 2 years. Still PTSD from the noise. Got masjid, got KTV, got construction, got traffic.",
          "score": 9
        },
        {
          "text": "I think the worst are those older model diesel buses. Especially while taking off from the bus stop. Super loud.\n\nWas wondering why the whole fleet hasn’t been replaced with electrics yet",
          "score": 7
        },
        {
          "text": "The average noise is fine the thing that was most annoying was people hammering past at 3 am at night with 2 stroke motorbikes. People hooning with sports cars was bad but not nearly as bad a 2 strokes flying past.",
          "score": 5
        }
      ]
    },
    {
      "id": "t3_1r5cxm3",
      "subreddit": "singapore",
      "title": "UAE ‘surpassing Hong Kong’, challenging Singapore for global trade crown",
      "url": "https://old.reddit.com/r/singapore/comments/1r5cxm3/uae_surpassing_hong_kong_challenging_singapore/",
      "score": 150,
      "num_comments": 52,
      "created_at": "2026-02-15T20:00:45",
      "selftext": "The UAE is eclipsing Hong Kong and rapidly emerging as a rival to Singapore as a premier global trading hub. Driven by an aggressive post-pandemic strategy of \"economic statecraft,\" the nation’s non-oil trade reached $1.03 trillion in 2025, hitting its 2031 targets six years ahead of schedule.\n\nBy maintaining a non-aligned stance that balances Western partnerships with a role as a hub for diverse capital flows, the UAE has attracted significant global investment and talent.\n\nDubai-based DP World now rivals Hong Kong’s Hutchison Ports and is positioned to challenge Singapore’s PSA International for global leadership in port operations.\n\nBeyond logistics, the UAE is investing heavily in AI to secure a first-mover advantage in the next frontier of trade technology.",
      "comments": [
        {
          "text": "Singapore has a long line of competitors from Dubai to Shanghai. Consider it a flattery. \n\nFor Malaysia or Hainan or whoever that wants to dethrone Singapore, the queue starts right at the back. Please wait in line. \n\nFor Singaporeans, other people are watching like vultures to carcasses. If we don’t buck up, they will steal our lunch.",
          "score": 188
        },
        {
          "text": "- 1 million UAE (and 9 million non residents), so it's a tiny country\n- Unlike Singaporeans who have some of the highest PISA scores in the world and highly educated metrics by any global measure, native born UAE are exceptionally uninspired and mediocre in any global ranking\n- region will continue to be destabilized by design as America cannot have a major hegemon arising which can threaten Israel + intrinsic tribal acrimony between the middle east states and tribes means the region will never prosper beyond a limit. ASEAN is miles ahead and one of the blue prints for successful regional cooperation\n\n\nThere is no challenge to Sg/Hong Kong from UAE. The main \"challenge\" to Singapore will be from other high IQ highly driven Asian countries like Korea, Chinese cities, Taiwan, even Vietnam eventually replicating the Singapore success story. \n\n(China for example has already surpassed Singapore growth multiple since 1965, so they have successfully copoed AND surpassed our model)",
          "score": 93
        },
        {
          "text": "It hit that number because it was primarily driven by gold and the exports of precious metals. And as we have all seen, gold prices spiked up from US$2,800/oz at the start of the year to sub US$5,000 by the end of 2025. The UAE is the biggest gold hub in EMEA, so their gold imports from many African countries also spiked.\n\nThere's no reason to be panicky.",
          "score": 25
        },
        {
          "text": "SingaporeRabaks still the \n competitors are foreigners in Singapore…the real competitors are foreigners in foreign countries.",
          "score": 10
        },
        {
          "text": "TBH, the location matters and Dubai/UAE got a great location. Anything else - IDK",
          "score": 8
        },
        {
          "text": "They certainly are trying and they have a lot more going for them in some ways than we do.  They have a naturally better position as an air hub, they have oil, and the new generation are not anywhere near as entitled as the older ones (probably because there are a lot more of them, the pie is smaller and they know it).\n\nStill, unless we really screw up and do something crazy that destroys our competitiveness for global capital/talent, like put in dividend/capital gains taxes, they've got a long way to catch up.  However unmotivated a lot of Singaporeans are at work, they have significantly more skin in the game than almost all employees in the UAE.  That makes a difference.",
          "score": 7
        },
        {
          "text": "Unlikely. Numbers are one story but the reality is different. \n\nThe geopolitical instability in the Middle East dwarfs any resemblance in SEA. Trade flows reverse easily at the first sign of conflict and oil wealth will gradually lose out significant market share to renewables (ev, solar and wind). It used to be the who controls the oil controls the world but with the advances in renewables and invention of shale fracking, fewer countries are held hostage to those regions with oil reserves. \n\nThe article fails to mention that there are two US aircraft carrier groups parked in the Arabian Sea waiting to conduct a protracted campaign against Iran. A matter of when and not if. Venezuelan campaign only had one aircraft carrier group so 2 significantly increased the battlefield coverage. \n\nMore importantly, our long and strong track record of neutrality gives us credibility in the great powers of even middle power rivalry. We don’t have an interventionist approach unlike UAE and much of SEA depends on our capital allocation which also functions as a soft form of diplomacy. Who doesn’t like travelling around SEA with its rich and vibrant culture and great hospitality.\n\nNo doubt they are up and coming rival but it seems that UAE can be the jewel of the Middle East and we can be the New York/Switzerland of Asia Pacific so we both serve very different functions.",
          "score": 3
        },
        {
          "text": "Saying UAE is nothing without oil is like saying SIN is nothing without global trade.\n\nUAE can just colonize Sudan/Africa and steal more oil and gold with US backing.\n\nAnd that is what they are doing.\n\nSIN cannot stop East-West decoupling and restoration of Western colonialism.\n\nLook at Rubio’s recent speech and how the Europeans are warming up to the idea.",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1r5zvos",
      "subreddit": "singapore",
      "title": "China embassy in Singapore reminds citizens to avoid gambling after MBS casino visitor falls to death",
      "url": "https://old.reddit.com/r/singapore/comments/1r5zvos/china_embassy_in_singapore_reminds_citizens_to/",
      "score": 124,
      "num_comments": 47,
      "created_at": "2026-02-16T12:27:29",
      "selftext": "",
      "comments": [
        {
          "text": "Lol telling Chinese not to gamble is like telling the sun not to rise today…",
          "score": 120
        },
        {
          "text": "&gt; The office added that gambling overseas violates national laws, and punters can be subject to legal action.\n\n&gt; \"Embassies and consulates cannot provide consular protection for illegal activities,\" it said.\n\n&gt; The Ministry of Public Security of China has opened a reporting platform for Chinese citizens to report information and suspected illegal gambling activity.\n\nTIL",
          "score": 83
        },
        {
          "text": "That's a pretty normal take. \n\n\nWhat else are they gonna say, please continue gambling overseas? Encouraging taking money out of the country and losing it overseas? \n\n\nThey know they can't stop them, they used to go to Macau, Gambling cruises in international waters to gamble, so it is just a recommendation. \n\n\nAlso helps the embassy workers, that do not need to work overtime during their own festive season to \"assist the family with after-death arrangements\". ",
          "score": 41
        },
        {
          "text": "Isn’t Macau like one of the largest gambling areas in Asia?",
          "score": 28
        },
        {
          "text": "\"As Chinese New Year approaches and more tourists visit Singapore, the Chinese embassy in Singapore is again solemnly reminding Chinese tourists and Chinese citizens in Singapore to strengthen legal awareness and stay away from gambling,\" it warned.",
          "score": 14
        },
        {
          "text": "I wonder how recent this is since the last reported suicide by falling was from 1 year ago.",
          "score": 9
        },
        {
          "text": "Falls? The person jumped. Suicide.",
          "score": 9
        },
        {
          "text": "Oh no! Anyway…",
          "score": 4
        }
      ]
    },
    {
      "id": "t3_1r5tz7w",
      "subreddit": "singapore",
      "title": "PSP: Persistent underestimation of Govt revenues erodes public trust, Budget lacked redistribution to ensure AI benefits all Singaporeans",
      "url": "https://old.reddit.com/r/singapore/comments/1r5tz7w/psp_persistent_underestimation_of_govt_revenues/",
      "score": 104,
      "num_comments": 37,
      "created_at": "2026-02-16T07:49:06",
      "selftext": "",
      "comments": [
        {
          "text": "Instead of asking for more spending maybe they should ask why the budget spending far exceeds the rate of inflation. Many ministries have +8% spending. What is all this money used for?",
          "score": 46
        },
        {
          "text": "Be prudent, save the bullets for the next crisis.",
          "score": 41
        },
        {
          "text": "only economically illiterate people would think that running massive and constantly overestimated fiscal surpluses are a good thing. it's a basic macroeconomic identity that government surpluses are private sector and household deficits - the government surpluses come about because you are poorer.\n\n\nit's such a moronic idea to think that you can account for government finances like a household. consistently overestimated surpluses are not good things. \n\n\nyou cannot complain about GST increases, reduced CDC vouchers, and high COE prices, while praising government budget surpluses. they are two sides of the same coin!",
          "score": 37
        },
        {
          "text": "Contrary to what some say here, recently the Government is actually spending more money into the economy than it is taxing for one reason - the NIRC. The investment return itself isn't being taxed from the people or businesses (though it could be argued part of the capital base comes from historical budget surpluses). Without spending from the investment returns, the Government would be in deficit. ",
          "score": 17
        },
        {
          "text": "voters rejected PSP for $1 groceries, vouchers, top ups. clearly, the ppl dun care abt reforms or estimates. ",
          "score": 12
        },
        {
          "text": "So what is the actual point of raising the GST if we are consistently pulling surplus every year?",
          "score": 1
        },
        {
          "text": "Voters should always be reminded that the purpose of a government should not be *profit making*. \n\nIgnoring the optics, why is govt Accumulating all this surplus for what exactly? Not only the handouts have been insufficient, what they have achieved is just supercharging inflation to a level that is unsustainable. \n\n1.5 million HDB lmao. Point to me a country in the world with these prices for *public housing*.",
          "score": 1
        },
        {
          "text": "PSP should strive to win more votes at the next election before calling for permanent reforms. Clearly, most Singaporeans do not trust PSP.",
          "score": 1
        },
        {
          "text": "Well…. better than over-estimating …. OMG I’m certainly not having PSP manage my retirement funds\n\nU want govt  to apply more financial leverage on sovereign wealth? Are u out of your mind?\n\nJust toss accounting and auditing prudency out the window",
          "score": -3
        }
      ]
    },
    {
      "id": "t3_1r5jpcz",
      "subreddit": "askSingapore",
      "title": "Such a Creepy Encounter in MRT(24M)",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r5jpcz/such_a_creepy_encounter_in_mrt24m/",
      "score": 278,
      "num_comments": 42,
      "created_at": "2026-02-16T01:00:15",
      "selftext": "So, today I was taking the MRT with a friend to go to an event.\n\nThe door opened and I was facing my friend while taking. \n\nSuddenly, I felt a smack on up bum. Froze for 2 seconds. \n\nI turned to check and stared a I saw 2 non-Singaporean teens looking so weird, didn't say sorry or anything. It's so weird, normally one would say sorry or even move away, looking apologetic.\n\nBut these teens were not. \n\nThe guy was wearing a black shirt and he was a bit feminine. (No hate)\n\nI didn't think about it much as I went on to attend an event.\n\nI took a photo of the guy who touched me. Should I go report to the MRT Staff?\n\nIt's my first time experiencing such encounter. I feel like I should have shouted at him.",
      "comments": [
        {
          "text": "Sorry that happened. I hope u are okay. Yes i think you should report it, maybe consider filing a police report online too.",
          "score": 342
        },
        {
          "text": "&gt; Should I go report to the MRT Staff?\n\nUh whats’s stopping you from reporting this? You may have been molested and you clearly sound traumatised. They might have CCTV footage which may be able to show if you were indeed molested.",
          "score": 109
        },
        {
          "text": "Hi the MRT carriage has CCTV, as well as the stations. What happened was wrong and criminal. You must make a report at the station so the station master can go through CCTV footage and identify the perpetrators. The police will assist. Just go back to the station and say you want to lodge a report for sexual assault. But you must try to remember details as much as you can: date, time, platform. Their description would help too. I'm so sorry this happened to you. Nobody should be made to feel unsafe in a public space like that.\n\nEven if it's an accident, you should still be notified of the outcome. Please make that report. It can prevent someone else from becoming a victim too, assuming it was intentional sexual assault.",
          "score": 77
        },
        {
          "text": "I think it’s hard to have a case unless there’s some camera. It’s hard to prove that they did smack your butt and that it’s not someone else or someone’s item that hit it.",
          "score": 24
        },
        {
          "text": "So many No molest ads around stations , people still molest. Just straight report. Hope you are ok…",
          "score": 13
        },
        {
          "text": "sexual harassment is a serious crime. doesn't matter if it's straight or homosexual",
          "score": 10
        },
        {
          "text": "The next time that happens, original poster, you must confront them head on.",
          "score": 6
        },
        {
          "text": "harassment is harassment. didnt even need to state your gender and age",
          "score": 5
        },
        {
          "text": "All molesters and sexual assaulted deserve to be chained up and caned. Report them and let’s all hope this perverted scum gets the heavy hand of the law.",
          "score": 5
        },
        {
          "text": "Please report. Thanks for your service.\n\nMight be a prank or those dare games. But report anyway and warn / punish them if can to learn that this is not right.",
          "score": 4
        },
        {
          "text": "Should have screamed ‘MOLEST’ and it would have been settled like in the good ol days",
          "score": 3
        },
        {
          "text": "If its obviously them smacking your butt and not other objects, make a report. You will keep the streets safe for other ladies. What nationality are the teens? Locals?",
          "score": 2
        },
        {
          "text": "Which MRT isit? Please report it, regardless if you've mistaken it or not. It may actually be a person who will constantly commit this crime until he is caught. So please just report.",
          "score": 2
        },
        {
          "text": "[removed]",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r5eam9",
      "subreddit": "askSingapore",
      "title": "[HDB People] Do you throw your rubbish into the chute directly everyday?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r5eam9/hdb_people_do_you_throw_your_rubbish_into_the/",
      "score": 276,
      "num_comments": 80,
      "created_at": "2026-02-15T21:11:59",
      "selftext": "Moved into a fairly new HDB a few years ago. Corridors are those long maze-like ones, so the rubbish chute is a solid 2 minute walk from my unit.\n\nNew neighbour shifted in beside me recently and straight away started putting those big green plastic bin right outside their door. They toss their rubbish in there every day… and only wheel the whole bin to the chute once a week.\n\nBy day 5 the stench is unreal. I’ve lived here 3+ years and never had this problem before, but ever since they moved in I’m suddenly seeing way more cockroaches scurrying around the corridor (especially at night).\n\nDo any of you actually do this as well? Or is my neighbour the only one treating the corridor like their personal mini bin centre? 😂\n\nGenuinely curious if this is a common hack when the chute feels too far. My opinion is this should not be condoned because it's unhygienic and inconsiderate, plus walking 2 minutes everyday is healthier.",
      "comments": [
        {
          "text": "Surely they can go throw the trash on the way to work or when they go for lunch/dinner\n\nCan't imagine having to stick my hand into the green bin to pull out 5 day old trash  to throw down the chute",
          "score": 248
        },
        {
          "text": "Erm. You might want to talk to your neighbour first? This one not landed leh why need the big ass green bin.. \n\nIf not just one service your neighbour",
          "score": 241
        },
        {
          "text": "My household clears our \"wet rubbish\" daily.\n\nNever seen anyone in hdb use those large green bins outside of their house. Maybe your home owner is trying to live like a lander property owner. \n\nBut on the serious note, you could report it on one service app and see how it goes.",
          "score": 222
        },
        {
          "text": "You should know the drill. Town council -&gt; MP -&gt; social media",
          "score": 205
        },
        {
          "text": "Shenjingbing. My non confrontational way will be to ask Town Council to speak to them without letting them know a neighbour complained, just saw they spotted the green bin and this is not allowed for hygiene reasons.\n\nThe only time I will do this was in Japan because of of designated waste collection days and heck I left my wet trash in my freezer until trash day. To do it in SG is crazy. Already so convenient, still want to be lazy.",
          "score": 81
        },
        {
          "text": "I got 2 rubbish bins in my home - 1 in the laundry yard and 1 in the master bedroom. Master bedroom dustbin has a no food or drinks rule. \n\nI clear both rubbish bins daily after dinner. \n\nNever had a cockroach issue in 6 years of living here. \n\nIf my neighbour did the large rubbish bin shit, i’ll shit on their door and say that i only flush my toilet once a week to save water",
          "score": 52
        },
        {
          "text": "You try town council. If it can’t be solved, what’s stopping you from throwing your trash inside? I’m sure it looks like one of those public bins.",
          "score": 20
        },
        {
          "text": "wheel that bin downstairs and get rid of it",
          "score": 19
        },
        {
          "text": "I have a chute in my kitchen, I seal that shit up 24/7. \n\nI throw trash every morning/night (depending if got food items) by bringing them downstairs myself. Sometimes I get lazy and it'll be 2 days, but only if I don't have any open food containers etc. 1 week a bit insane. Lol. \n\nAnd my 2 days is still having the trash in my home and not outside contaminating neighbours. Ew.",
          "score": 14
        },
        {
          "text": "Oneservice their ass. Such actions must not be left unchecked.",
          "score": 12
        },
        {
          "text": "One service, definitely unhygienic.",
          "score": 12
        },
        {
          "text": "I’m staying in the old style HDB where the rubbish chute is in my kitchen so I throw every night. Last time my father doesn’t do it and we had tons of cockroaches. After I started, the cockroaches are gone.",
          "score": 11
        },
        {
          "text": "If the green bin block the coridoor, sure can oneservice app cuz of fire hazard",
          "score": 9
        },
        {
          "text": "omg please report them to town council. extremely inconsiderate just to save a daily 2 min walk",
          "score": 8
        },
        {
          "text": "Dont have bro. On the way to work can just carry throw. ",
          "score": 6
        },
        {
          "text": "Report via One Service app. It will be routed to whichever agency that has authority. Cockroaches infestation is no joke.",
          "score": 6
        },
        {
          "text": "Condolences. \n\nHigh chance they will degenerate into hoarder over that years.\n\nSell and move while you still can?",
          "score": 5
        },
        {
          "text": "That's digusting",
          "score": 5
        },
        {
          "text": "Report to town council say there’s a green bin on a residential floor. Ask them to clear. When they ask for your unit number give theirs instead and say “don’t know who put here in front of my door, need help from your cleaner to remove it please!”",
          "score": 4
        }
      ]
    },
    {
      "id": "t3_1r5yuhr",
      "subreddit": "askSingapore",
      "title": "Anyone not going for reunion dinner tonight and what's your (valid) excuse?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r5yuhr/anyone_not_going_for_reunion_dinner_tonight_and/",
      "score": 135,
      "num_comments": 108,
      "created_at": "2026-02-16T11:36:06",
      "selftext": "As per title. Relationship with family is not good and am dreading CNY since i'll have no choice but to show face.. otherwise its as good as disowning family or having zero filial piety 🙄. \n\nPersonally don't see the point of pretending to be harmonious once a year when there's no real care and concern or warmth in the family relationship. So for those in similar situations, what's your excuse from CNY activities? Crowdsourcing valid excuses to recycle for the next few years since i didn't have one this year 😂",
      "comments": [
        {
          "text": "just bit the bullet, announced that i wont be visiting anyone this year. reason: tired from work and need to rest. that's only part of the reason. \n\nhonestly, i got sick of pretending to be fine in a family that doesn't seem to show much concern for me. like invite me and all the food contains things I am allergic to, no alternatives. \n\nmy job in CNY was basically to pretend to be a filial adult child ferrying my parent around to visiting to fake being normal in front of people. i don't even like spending that much time with my parent (was very abusive and neglectful) but i couldn't go no-contact completely for reasons i wont get into here. \n\ndecided this year i want to sleep and focus on my own mental peace and someone else can be the driver or deal with it.",
          "score": 96
        },
        {
          "text": "Grayce Tan and Melvin probably not showing up to their respective reunion dinners tonight.",
          "score": 70
        },
        {
          "text": "take mc...?",
          "score": 67
        },
        {
          "text": "Go holiday",
          "score": 57
        },
        {
          "text": "why so many redditors hate their families",
          "score": 36
        },
        {
          "text": "lao sai better not share food",
          "score": 19
        },
        {
          "text": "Booked an Airbnb in Malaysia, tell everyone I'm \"overseas\".\n\nI’m lucky my parents are real W and they don't guilt-trip me for skipping the reunions. I sent some gifts through my parents and reject all red packets to keep the relatives happy.\n\nHonestly, it’s a total vibe. Right now, I’m on the 63rd floor in a bathrobe, sipping whiskey, watching Netflix with the AC on blast and no worry for work for the next two days. The view is absolutely elite. This is the peak for me.",
          "score": 18
        },
        {
          "text": "Sick, holiday, work. Or just say don't feel like going lor. If no real care / concern why still bother pretending.",
          "score": 16
        },
        {
          "text": "Just go overseas. This is what I do almost every year.",
          "score": 14
        },
        {
          "text": "Just say u kenna Covid and then siam.",
          "score": 14
        },
        {
          "text": "Volunteer for guard duty?",
          "score": 10
        },
        {
          "text": "why bother if the relationship is bad? my friend, any reason will be seen as a bad excuse because they would see it differently. personally, just tell them that u will be sitting out, end graciously end off with, \"happy cny\" - done.  \n  \nunless u are planning to rekindle the relationship, i would suggest you keep your peace.",
          "score": 7
        },
        {
          "text": "\"I kena COVID\" then stay home and sleep",
          "score": 6
        },
        {
          "text": "i just said i don’t feel like it",
          "score": 5
        }
      ]
    },
    {
      "id": "t3_1r5dgeq",
      "subreddit": "askSingapore",
      "title": "What's a childhood snack that you liked but you dislike it now?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r5dgeq/whats_a_childhood_snack_that_you_liked_but_you/",
      "score": 136,
      "num_comments": 105,
      "created_at": "2026-02-15T20:28:54",
      "selftext": "I'm going to say Super Rings or Oriental Cheese Ball. I remembered how cheesy and addictive they were.\n\nBut recently I bought them again out of nostalgia, just to relive that old memory. \n\nUnfortunately, they didn’t taste the same anymore. The flavour felt overly artificial and almost like the cheese powder was more chemical than savoury.",
      "comments": [
        {
          "text": "Apollo chocolate wafer in the red foil packet. Bought a pack out of nostalgia a few years back and wondered how I ever enjoyed it lol.",
          "score": 190
        },
        {
          "text": "Actually the current Super Rings removed the additive Tartrazine as it was proven to cause harm in humans. I preferred the toxic version I had when I was young haha.",
          "score": 114
        },
        {
          "text": "Actually, most of the old stuff tastes horrible now. I’m not sure if its cost reduction by using alternative ingredients, but I think more likely its that singaporeans got more affluent and started eating more healthier and quality things over time and now these taste like garbage.\n\nAll the old snacks like super rings and apollo and haw flakes all taste horrible",
          "score": 73
        },
        {
          "text": "Those chocolate wafers with the red wrapping. There are two kinds - chocolate and white chocolate. I chomped on those a lot as a kid but now they just seem kinda plasticky. Too much exposure to chocolates from around the world, I guess. \n\nOn another note, I still love the iced gems as much hahaha.",
          "score": 59
        },
        {
          "text": "Mamee. Tried it recently. Doesn’t taste like it’s bad for you anymore 🤣",
          "score": 54
        },
        {
          "text": "The pola snack animal crackers. Had no idea how I was so addicted to them in the past, I'd blow my pocket money on them at the mama shop and not have any cash left for recess.\n\nNow they taste and feel like wet cardboard in the mouth.",
          "score": 27
        },
        {
          "text": "10-cent ice popsicle that looks like coloured condoms",
          "score": 24
        },
        {
          "text": "The coloured disks… i dunno what they are. Used to get them from my canteen. Would go crazy for them but now, it is like a waste of time. Lol",
          "score": 23
        },
        {
          "text": "Man. I just did that. \n\nI remembered loving super rings.\n\nThey changed the damn recipe. I was like \" wtf is this?'.",
          "score": 17
        },
        {
          "text": "My late grandma bought Apollo chocolate wafer for us whenever we went to stay with her during the school holidays. It just brought back old childhood memories of her.  \nAs of childhood snack that I liked during young but dislike now are haw flakes, tastes more “sour-like” sweet",
          "score": 15
        },
        {
          "text": "There was this chocolate that came in \"straw\" like plastic and you kinda squeeze it out. Used to love them but when I tried it now, it taste so bad.",
          "score": 13
        },
        {
          "text": "White rabbit candy. I have no idea how I enjoyed it. It’s too sweet now.",
          "score": 13
        },
        {
          "text": "twiggies. tastes so much nicer to me when i was younger",
          "score": 11
        },
        {
          "text": "Not really a snack brand or anything, but I stopped liking raisins. I started to dislike the texture, even though 15 years ago I would eat raisins from the Sun-Maid’s small red box almost everyday.",
          "score": 10
        },
        {
          "text": "Somehow when I let kids try our childhood snacks, no matter how different it tastes now compared to back then, kids still love it though hahaha \n\nI guess our taste buds were really unrefined when we were younger. Anything sweet or salty is goooood",
          "score": 10
        }
      ]
    },
    {
      "id": "t3_1r5cpe1",
      "subreddit": "askSingapore",
      "title": "Just found Free Headset in Elevator",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r5cpe1/just_found_free_headset_in_elevator/",
      "score": 50,
      "num_comments": 47,
      "created_at": "2026-02-15T19:47:58",
      "selftext": "Is it suspicious? There was a post it on it that wrote “FREE” in all caps. It was also left in the elevator of the HDB I live in, and I am in need of new headsets. Should I graciously accept it or report it?\n\nA bit paranoid… Do let me know if anyone knows anything!\n\nEdit: it was left sealed and brand new! Even the price was intact.",
      "comments": [
        {
          "text": "probably CNY clearing stuff from home and got this as a gift but not gonna use it, so bless whoever that needs it.",
          "score": 140
        },
        {
          "text": "Probably left by the owner who found something nicer. Just take lol.",
          "score": 40
        },
        {
          "text": "I think shld be ok. Probably CNY clear stuff maybe unwanted vday gift",
          "score": 26
        },
        {
          "text": "Congrats OP! I think u can leave a note saying thank you to the stranger and how it changed your life or something. Bless them and move on",
          "score": 13
        },
        {
          "text": "Thats a good way to pass it on in the absence of a residents chat group. maybe the owner just wanted to leave it somewhere sheltered and relatively clean with easy access to neighbours",
          "score": 10
        },
        {
          "text": "If u can't trust it, give it to one of those people who blast tiktoks on the buses. At least can do some good with it.",
          "score": 7
        },
        {
          "text": "Hopefully the free headset is not to spy on someone",
          "score": 3
        },
        {
          "text": "Just take la. Rezeki. what headset though? like brand/make/model",
          "score": 3
        },
        {
          "text": "Hopefully it just won't fit the original buyer's ears that's all",
          "score": 2
        },
        {
          "text": "What are you paranoid about?",
          "score": 2
        },
        {
          "text": "Rejected Valentines day gift maybe?",
          "score": 2
        },
        {
          "text": "I usually leave free stuff at the lift lobby for people to take. Sometimes is very disheartening because the people who took the items just leave the empty boxes there. \n\nEg I left a brand new tumbler in a box, the person took the tumbler and left the box there. Really damn angry",
          "score": 2
        },
        {
          "text": "i love how people are using lifts in HDBs now as donation boxes ahaha. like the hand sanitizer during covid placed by residents!\n\nhuat! glad the needy found the donation!",
          "score": 2
        },
        {
          "text": "if paranoid, read the manual on how to factory reset so it'd forget existing paired devices. not much else to do.\n\n\nbut if sealed just take it as a goodwill gesture of someone with abundance.",
          "score": 2
        },
        {
          "text": "Like everyone already said, last minute CNY clean out, and probably didn't want to bother with Carousell. So easier to just leave somewhere where people can find it easily instead of throwing it in the trash.",
          "score": 1
        },
        {
          "text": "be careful of hearing aids",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r5wk7i",
      "subreddit": "askSingapore",
      "title": "Inviting Muslim friends over for CNY meal",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r5wk7i/inviting_muslim_friends_over_for_cny_meal/",
      "score": 46,
      "num_comments": 64,
      "created_at": "2026-02-16T09:47:11",
      "selftext": "Since it's Chinese New Year Period, if I were to invite my muslim friends over for a home cooked meal at my place, what are some things I need to be mindful of ?\n\nBesides strictly no pork and alcohol and getting halal certified ingredients, are there some ritual cleansing detergent I can find to wash my utensils and cookware before cooking?",
      "comments": [
        {
          "text": "As a Muslim, I appreciate how thoughtful and considerate you are in trying to accommodate your Muslim friends. I'm sure they would feel the same way as well.\n\nAlso, it seems you are more knowledgeable than most since you're asking about utensils and ritual cleansing. I think before moving forward, you should be aware that while the general rules are there, the \"sensitivities\" between Muslims tend to vary.\n\nIf I was your friend and you have invited me over, I would tell you straight up to order halal food and we can enjoy together. Because I am very particular when it comes to food. Now, your friends may not be as \"sensitive\" as I am and may very well be like \"as long as no pork/lard, I am ok\".\n\nMy point here is, check with them on where they stand. Are they very strict with the \"halalness\" of the food/drinks/utensils etc? Or are they more lenient? ",
          "score": 90
        },
        {
          "text": "If they are the stricter type, they wont eat anything from utensils that has come into contact with pork before.",
          "score": 74
        },
        {
          "text": "Ask your friend. There is no hard and fast rule, depends on how strict they are. Some are fine as long as no pork/lard. Some must have halal certified, etc.",
          "score": 61
        },
        {
          "text": "Why not just order halal food and use disposable utensils?",
          "score": 29
        },
        {
          "text": "Depends on how strict they are. Your chopping board might not be clean enough for them since it's cutting non halal food. Food source halal, utensils might need to be ritually clean enough for them as in not touched pork / non halal stuff. Food preparation also needs to be permissible to be considered halal. The things used to prepare food also needs to be thought about.",
          "score": 16
        },
        {
          "text": "we use something called \"sabun sertu\" to clean the utensils/cookware! you can find it at al barakah/toko warisan (physical shops) or even shopee (if you have time to wait for delivery) :)",
          "score": 10
        },
        {
          "text": "It depends on the individual. I've had Muslim friends who didn't mind going over to non-muslim households and using their cutlery, as long as there's no pork or alcohol directly in the food and drinks.\n\nI've also had Muslim friends who won't enter non-Muslim households at all. Even if there's no food or drink involved or we offer to order delivery like pizza or McDonalds and use dispoable plates and cups.\n\nBest advice is to ask the people you're inviting because it really depends on how strict they are, and don't be offended if they politely decline a visit.",
          "score": 9
        },
        {
          "text": "You are very considerate. Kudos to your family upbringing. Muslims are generally very accepting n tolerant n simple. Your gesture will b well appreciated. But knowingly they will not want you to overburden yourself. Just halal food ordered n paper plates cups. Most Muslim I know will bring something for you like Kuih etc for the hosts",
          "score": 6
        },
        {
          "text": "Ask your friends, some are more relaxed.\n\nBest is buy takeaway like pizza, chicken etc and desserts",
          "score": 4
        },
        {
          "text": "Why are you getting downvoted? It's a valid question.",
          "score": 4
        },
        {
          "text": "If they are friends with you and you consider them a friend they are not too hardline, don't need to over with special detergent just don't serve pork/lard and if any of your utensils were used for such things just normal wash can already the special detergent is just to sooth the heart but normal soap is fine, if they're hardline then you need to make a show of that special detergent and halal ingredients. you can just take pic and whatsapp hi this is okay for you guys to consume right? did i buy the correct special detergent etc and that will satisfy their trust enough since you're friends anyway and they'll even think wow op is so thoughtful checking on this and that",
          "score": 3
        },
        {
          "text": "With utensils and plates, id advise to purchase disposable ones (less headache for you, less doubt by guests - both win²), and halal food in separate containers if youre ordering :).\n\nThis sound such a lovely idea to invite your muslim friends to celebrate your festive :)",
          "score": 3
        },
        {
          "text": "They start fasting from 2nd of cny onwards, if you didn’t know already.",
          "score": 3
        },
        {
          "text": "Communication is key. Who’s to say no pork or what not.",
          "score": 2
        },
        {
          "text": "Just order halal meal for all of you guys. That’ll be the best option.",
          "score": 2
        },
        {
          "text": "Just order Halal food. You save yourself the trouble and your Muslim friends will also feel at ease at your home. After all, they took precious time off from their schedule and travel all the way to your house for CNY.",
          "score": 2
        },
        {
          "text": "Typically I would order halal food, purchase bottled water and packet drinks. Prepare paper plates, utensils, cups. Basically anything that they have to use is disposable for peace of mind. If budget allow, I’ll get Muslim friendly CNY goodies as well.",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1r580cj",
      "subreddit": "askSingapore",
      "title": "Is it possible to sustain in a job which you have no passion in?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r580cj/is_it_possible_to_sustain_in_a_job_which_you_have/",
      "score": 44,
      "num_comments": 57,
      "created_at": "2026-02-15T14:58:50",
      "selftext": "For people who are in your current job solely because it pays decently well, but you have no passion for your job at all, did you manage to remain in your job for long?",
      "comments": [
        {
          "text": "Of course. Many people in FAANG hate their jobs. Some upfront will tell you it’s not as glamorous behind the scenes. As always if you are paid enough you tend to bite the bullet. The problem is when you aren’t paid enough to deal with it!",
          "score": 95
        },
        {
          "text": "I thought recently got wise man say “don’t love your job, job your love”? 🤷🏻‍♂️",
          "score": 65
        },
        {
          "text": "As long as you don’t hate it, if the job is just boring but your boss and colleagues are ok I think it’s possible. And you’re ok with the salary \n\nI mean if you look at the older generation I highly doubt they have passion in their jobs. It’s just a means to an end.",
          "score": 31
        },
        {
          "text": "You don't have to be passionate about your job to be happy with the quality of life it provides for you. This is enough motivation to do a good enough job to keep the job. Many people also have personal pride in the quality of their work, so they don't need \"passion\" to be a quality employee and advance their career. Only a very small % of people are actually passionate about what they do for work, the rest of us lies somewhere in between \"it's not bad\" to \"I can kind of tolerate it\". It's pretty easy to disassociate your job from your identity and find passions in the non-work hours of your life.",
          "score": 22
        },
        {
          "text": "fresh grad tech role in gahment, work is so mundane, learning nothing much I wanna quit, but the golden handcuff and juicy bonuses is making me think twice about leaving",
          "score": 15
        },
        {
          "text": "Yes. Job is just a job to me. I don't hate it. I have no passion for it.\nI have two young kiddos to support. It pays alright but not like  Henry.\nThat job provides me with WFH and great dependent corporate coverage which is why I'm still on that job. It allows me to clock off and spend meaningful time with my children and loved ones. Passion on job is overrated to me lol",
          "score": 10
        },
        {
          "text": "Dont like my job but im still here cause the job market is really really bad. \n\n\nI try to remind myself this is not the end, when things pick up im going to get a better job and now what i gotta do is to save as much as i can and keep looking out for better job openings. ",
          "score": 10
        },
        {
          "text": "Different people do different things based on circumstances. \n\n1. Do you have family to support? If so, most people will just work for the money since they need it. Others, probably not. \n\n2. Are you a means to an end person? If you are, you’d probably just work for the money for your future plans. If not, you’d probably want work to be part of your journey. \n\n3. Are you a “love what you do and never work a day” kind of person? Then you’d definitely find a job you’re passionate in. \n\nI, for one, cannot see myself in a job I hate. I’ll hate my life, hate waking up, hate the people there, and just turn bitter. But I see people who don’t like their job but are still there for years.",
          "score": 9
        },
        {
          "text": "you see those uncles and aunties clearing plates and trays, do you think they have a passion for it lol",
          "score": 7
        },
        {
          "text": "It cannot stay where I am because its not just that I have no passion - the job also grinds me down completely and robs me of all my energy. I get paid reeeeally well though, but that money is useless if Im too tired or burnt out to spend any of it.\n\nSo, I’m gonna leave.",
          "score": 6
        },
        {
          "text": "if there has been slavery for millennia, this is far from\nimpossible",
          "score": 3
        },
        {
          "text": "yes, as long as you have a larger framework that you are aiming towards eg. kids, mortgage, maintenance of lifestyle, etc. source is me, in my boring ass job for close to five years already… bored to death but the job i truly like is v low paying.",
          "score": 2
        },
        {
          "text": "Ofcourse possible to sustain. The human mind and body are powerful and malleable.. instruments.  Remember in NS army days you are taught to endure stress to the body, mind over matter to push past limits and beyond.\n\nOr think about slavery in the old days when people internalized their role as indentured servers/jobs, for them and their children in the slave class. Where people can be so used to their lot in life they internalize it.\n\nSo thinking about that, I realize how good I have it compared to many others past and present.\n\nI also believe passion can be learned/developed.",
          "score": 2
        },
        {
          "text": "I was a cabin crew for 10 years and I don’t like travelling",
          "score": 2
        },
        {
          "text": "Just go in, talk cock and gtfo, best time every month is when you see your pay deposited in your back account.",
          "score": 2
        },
        {
          "text": "I think it's possible if your motivation is money. ",
          "score": 2
        },
        {
          "text": "Yes. I have a passion for money.",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1r5mx0c",
      "subreddit": "askSingapore",
      "title": "Does anyone remember their time as a kid playing along the HDB corridors in the 80s and 90s?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r5mx0c/does_anyone_remember_their_time_as_a_kid_playing/",
      "score": 43,
      "num_comments": 29,
      "created_at": "2026-02-16T03:03:44",
      "selftext": "I was thinking about the recent influx of complaints about neighbours being nuisance especially those with kids and it got me thinking when did we become so intolerant? \n\nI remembered as a kid I always played on my bicycle along the corridor from one end to the other end and my next door neighbour would tease me about when I’ll remove my training wheels. And then there’s time when me and one of the neighbour kids would play outside our units along the corridor together with our toys laid out on ground. Also I am pretty sure I probably made a lot of noise as kid jumping around with my skipping rope and singing along to kids show. But I don’t recall anyone coming down to our unit to complain. To be honest, I’m not even sure I’ve ever interacted with the neighbours directly above or below our unit. And before anyone says that it’s because the flats were build different in the past, I would like to highlight that noise nuisance complain today come from all types of HDB flats not just the newer BTO flats.\n\nThis got me thinking about the mouse utopia experiment conducted by John B Calhoun where mice were given unlimited resources in a controlled environment which led to population to boom initially, but it  eventually collapsed despite there still being an abundance of resources. Calhoun described this phenomenon as behavioural sink.\n\nAre we, as Singaporeans, in the pursuit of population growth heading towards the same direction as the mice in Calhoun’s experiment? Our birth rates are abysmal and our society feels more fragmented than before which are similar trends that appeared in the experiment before the mouse colony declined. I am interested to hear what Singapore redditors think about this.",
      "comments": [
        {
          "text": "those who complain are always the loudest online. i can hear these kids a lot of the times esp during school holidays and i just put on my earplugs. kids will be kids. and its a communal space. can also hear the grandkids of my neighbour living upstairs running like little gorillas and its worse than the those running along the corridor. only good thing is that it is once in a while. welp what to do just pray they grow up soon and put on the earplugs. thinking of soundproofing asap. hopefully i can retire in a landed property overseas.",
          "score": 25
        },
        {
          "text": "Ah the good old days of block catching. \n\nBack then I think it was harder for formal complaints to get through without as much internet access as we do today. \n\nIf you wrote a letter to hdb you can suck thumb waiting for them to reply. They could toss your mail in the trash and there’d be no way for you to prove they didn’t. \n\nIf a neighbour had beef with you they’d calmly speak to you, or they’d slash your tires at night and there was no CCTV and nothing you could do, children would get caned and made to stop any bad behaviour. \n\nAlso people in general then were more tolerant - children could play, people would say hi, neighbours actually helped one another, noise above 2dB didn’t hurt anyone’s feelings. \n\nNow BTOs are full of intolerant Karen’s. If you have a new bto and are in the block telegram or chat you’ll know what a toxic cesspool it can be. Somehow so many people have become intolerant bitchy whiners who backstab, insult, *comprain*, and just speak with caustic sarcasm. \n\nMany people in society are horrible humans. The internet just makes their ridiculous views and vitriol spread more easily.",
          "score": 23
        },
        {
          "text": "Long long ago, in the 1980s, I remember the whole stretch of neighbours on the same level all had kids around same age group so all of us played together along the corridor. Back then every family on the same level had roughly the same income level and roughly the same family composition too. The norm was 1 breadwinner father, 1 full-time housewife mother and 2 or 3 children. If the children produced noise, it was tolerated by all households since the noisy gang was made up of children from every household.\n\nFast forward to 2025, I have already moved 3 times. My current neighbours are majority boomers with empty nests since their children already moved out.\n\nNow why would people be upset by children being children? Likely because our family composition no longer same so we no longer have anything in common, children no longer play together, adults may not talk to neighbours since we are too different and lastly the way we work also no longer same.\n\nI only have 1 neighbour who is a couple in their 40s but they are still reproducing like rabbits (I already lost count of their children). Their children are playing along the corridors, screaming shrilly at any time of the day.\n\nThe boomers are trying to take a nap... and I am trying to work from home when 1 household's children of various ages are screaming blue murder at each other but they are doing it right outside my room. I didn't scold them though, the worst I did was open my door and glare at 1 of them for playing with my doorbell endlessly. The rest of the time I tolerated. I keep reminding myself that their children will grow up and leave, just to make myself tolerate it better.",
          "score": 15
        },
        {
          "text": "Block catching was a thing in the past",
          "score": 9
        },
        {
          "text": "When did we become so intolerant? \n\n- when living spaces got smaller. Some homes make me feel claustrophobic \n- when living spaces got denser. Instead of 12*8 families in block, it’s now usually 25*16? \n- when productivity increases and productivity means you are now taking on more jobs each increasing year for slightly better pay. Each time your company cuts workers, you get more work. \n- when mothers starting juggling in addition to household chores and children, full time work, academics, monitoring of devices\n- when one party’s income is no longer able to bring in enough to feed the family \n- when new culture clashes \n- when bosses requires us to work around the clock \n- when you can’t trust your neighbours to have best interest of your child \n- when you don’t even know your neighbours so you accord them with the worst intentions \n- when children are trapped in full day institutional care most part of the day, so the only time they get out of that environment, they become even more uncontrollable \n- when kids are fed food with way too much chemicals cos food manufacturers value profitability over health and pump in tons of colouring, flavouring and preservatives \n- when kids don’t have much time to interact with their parents to learn how to regulate themselves \n- when there are so few safe open spaces",
          "score": 5
        },
        {
          "text": "yessssss we r like mice in calhoun's experimentsssss embrace da enddddd",
          "score": 4
        },
        {
          "text": "Block catching was amazingly fun (and free!). \n\nObviously in the old days, you have kids playing at playground, kids playing soccer at the void deck, it's more lively and noisy back then compared to now. People are also more tolerant (in some ways) and also more filled with warmth. We have more technology that allows us greater access to each other but ironically we just simply become more socially isolated than ever before. \n\nAs for the mouse utopia experiment, I've pondered about the same thing several times before and there's definitely some similarities, but it isn't limited to Singapore only, but a global situation (developed nations particularly).",
          "score": 3
        },
        {
          "text": "Time changes, our parents came from kampong era where it is common and a joy to hear your neighbors.\n\nAlso remember the ones that started complaining are from our generation that had those memory, so kinda weird we have fond memories of it yet want to curb it when grown up.",
          "score": 3
        },
        {
          "text": "This is what happens when the boomers are no longer working and too free, they start to complain about everything to the town council. Also the influx of new citizens from a particular country who also like to complain about everything because they want their own country culture to be integrated into SG.",
          "score": 2
        },
        {
          "text": "Yeah last time staying at toa payoh during the 70 at that time very one door is open we greet each other and when kids play hide and seek they be running in and out of neighbors house . And then when come to any festival there really a mood for it as neighbors will be share food with each other. And there really safely if someone walk pass and it not from the blk we will look out to see like which neighbors house he going to . Now it totally opposite door closed everyone mind their own business.",
          "score": 2
        },
        {
          "text": "People are less tolerant nowadays, maybe. But I think the complain culture is made easier. Gov and authorities are more receptive to feedback. More channels to report your beef. \n\nIn the past, one needed to write a letter to the agency, or the press. Not many people can write a proper complaint letter, especially to the press where the standard is very high. \n\nSo, advancements, technology and attitude has made us Karens and less tolerable. Everyone has a loud hailer and a movie camera, plus several platforms to distribute and publish. Bystanders are clicking to see whose beef they can relate to and add their 2 cents of clicks and likes or downvotes. \n\nWe have simply devolved into individuals of who to follow or who to laugh at. All at snippets of 10 seconds or less, some without context or background; as long as it relates to ‘me’.\n\nHowever, I suspect there would be less frivolous complaints if our online presence is not masked and anonymous.",
          "score": 2
        },
        {
          "text": "I was that kid once",
          "score": 1
        },
        {
          "text": "The problem with high rise living is that we are too close and have no space to miss our neighbour. It’s easier to want a nice relationship if you don’t meet as often. In the kampung you have your own bit of space outside living areas.",
          "score": 1
        },
        {
          "text": "No internet and TV starts in the evening /afternoon. So it wasn't so bad",
          "score": 1
        },
        {
          "text": "Block catchings were still a thing when I was a kid from 2009 to 2014. Is it still a thing now?",
          "score": 1
        },
        {
          "text": "Block catching was fun when the block was long with staircases. Nowadays the newer blocks are smaller hence not easy to play anymore also. Void deck space is also not big and rectangular like old times. \n\nWith the long and wide corridor my neighbours and i used to play zero point or cycle .",
          "score": 1
        },
        {
          "text": "Block catching.\n\nI think will get lots more complaints now.",
          "score": 1
        },
        {
          "text": "I’m sure they complained, but you were a kid living in the moment and were blissfully unaware. I’ve had water poured onto us a few times as a kid when we were at the playground making noise… \n\nLive it up when you’re in the moment! \n\nBut honestly, what really frustrates me in sg is how with a few tweaks of building codes we could all live so peacefully, double glazed windows for soundproofing and heatproofing (AC), leaving a gap between floors… so so much wasted potential here. With so many new buildings coming up it’s just a waste to see so many old mistakes that’s been done endlessly being repeated again and again. And these are our most expensive purchases in our lifetime :/",
          "score": 1
        },
        {
          "text": "Working remote is not a thing in the past. \n\nMost parents taught kids in the past to not do those things at night and be considerate. \n\nYou think too much. Nothing to do with the experiment. Expectations changed. Humans can reflect, adapt, and redesign social systems. Mice cannot.",
          "score": -2
        }
      ]
    },
    {
      "id": "t3_1r5e8hs",
      "subreddit": "askSingapore",
      "title": "As a local, what do you guys feel about our tourism brands/attractions?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r5e8hs/as_a_local_what_do_you_guys_feel_about_our/",
      "score": 33,
      "num_comments": 45,
      "created_at": "2026-02-15T21:09:10",
      "selftext": "Just a random thought - there’s always so much talk about our growing tourism receipts and us becoming a popular destination of choice in Asia for many reasons. I’ve always been curious what we as locals feel about our own places of interest/travel brands. I know there’s more to tourism here than just places of interest (e.g. food, culture, entertainment etc.), but in the more conventional sense, do you guys feel proud of our places of interest and us as a destination?\n\nI have a few usual suspects when I think of Singapore as a destination -\n\n\\- Changi Airport\n\n\\- Jewel Changi Airport\n\n\\- Marina Bay Sands\n\n\\- Gardens by the Bay\n\n\\- Resorts World Sentosa (USS, Adventure Cove, SG Oceanarium, Weave)\n\n\\- Mandai Wildlife Reserve (Singapore Zoo, Night Safari, River Wonders, Bird Paradise, Rainforest Wild Asia, Curiosity Cove)\n\n\\- Sentosa Island (beaches, luge, cable car, clubs, resorts)\n\n\\- Orchard Road\n\n\\- Joo Chiat\n\n\\- Singapore Flyer\n\n\\- Singapore Botanic Gardens\n\n\\- Raffles Hotel\n\nWhich homegrown tourism/attraction brands would you vouch for even as a local, and why? (aside from our airport and national carrier, which have been obvious winners for years) Curious to hear everyone’s perspectives!\n\nEdit: I know places of interest are typically targeted for tourists. But all factors aside (pricing), as a Singaporean, which places would you vouch for as a local, would visit and why? What are your personal favourites?",
      "comments": [
        {
          "text": "I think after some point you get bored because you know we live here and have seen those places quite frequently but i always felt that excitement whenever i got to changi airport + Jewel.. \n\nIts definitely an experience whether we are traveling out or not , that place def has some exciting element to it..",
          "score": 60
        },
        {
          "text": "The ones that I have been before, like Jewel, GBTB, Sentosa, Flower dome etc, I feel those are very high quality and you can tell that a lot of attentions were paid to the detail to ensure that every part of the process of going through the experience is enjoyable. \n\nBut I think for the locals we don't tend to go to these places much, because we know it's mostly built to target tourists, and it's pretty pricey to go regularly. But for what it is, I'm quite happy with what we have to offer tourists. ",
          "score": 29
        },
        {
          "text": "Sometimes I feel like, “wah all our attractions are man-made and not ‘real’”\n\nBut I realised when I go to BKK or Guangzhou etc., most of the attractions eg night markets, malls, temples etc are also man-made.\n\nNot every place is Niagara Falls or Zhangjiajie, I guess.",
          "score": 26
        },
        {
          "text": "With the exception of the Flyer, Orchard Road, and MBS, I honestly think all the destinations on your list are world class. I may not visit them regularly but I recommend them to tourists without reservation and I always feel proud to bring foreign visitors there. Many of them are also not that pricey if you go frequently (e.g. Botanics are free, GBTB and Mandai have membership programs) so I think they do make an effort to make themselves accessible to locals. \n\nI feel that many Singaporeans have no idea how shitty zoos, public parks, airports, even malls can be in other major global cities. It is wild to me that some Singaporeans would say that Mandai or GBTB are nothing special. ",
          "score": 21
        },
        {
          "text": "Not a local but an expat who’s been here more than 20 years and I still go to these places with visitors, work visitors and family….\n\nGardens by the Bay\nMandai wildlife reserve \nBotanic Gardens\n\nAll fantastic I go regularly to all three but probably Mandai the most as my son loves it.\n\nFor me I’d say the bits I take visitors too more are those spots with good photo ops so\nRaffles\nChina town\nArab street/kampong glam\nSentosa \nEast Coast Park \nMBS\n\nUsually if I’m being a tour guide I’ll try and link anything to local food be it restaurant or hawker related especially if guests are foodies.\nI think hawker food and good restaurants play a major role and the sheer variety are a major attraction for tourists especially repeat visitors.\n\nMy folks whenever they visit have a list of things they wanna eat over a week 🤣. My wife’s family from Hong Kong also have a list but it’s an even bigger one",
          "score": 14
        },
        {
          "text": "Gardens by the bay is goated. Flower dome changes at least 4-6x per year (for each season + special days) and it’s an escape from the SG heat.",
          "score": 7
        },
        {
          "text": "I love our Mandai parks.\n\nUSS is an embarrassment though. Looks dated, doesn’t feel immersive compared to parks overseas, lack of rides.",
          "score": 7
        },
        {
          "text": "Honestly as someone from the east \n\nChangi Airport and Jewel is like my neighborhood mall where I go for lunch or dabao back from\n\nBut flying from Changi I say the main highlight is duty free and the attractions and amenities\n\nMBS- I mean I went to the mall side, I’m too broke to afford anything there retail wise. But nice place to stroll and enjoy aircon\n\nGBTB- it’s alright, just I feel it’s nothing really special it’s just a park with unique sculptures outside of the paid area but lights are cool during festive seasons\n\nRWS- NGL I FEEL USS FELL OFF ALOT. overpriced shiz where they are biased towards express pass holders by letting them in with phones and plebeians like me are supposed to put them in the lockers. \n\nOceanarium and Weave I haven’t been tho. But Sea aquarium slaps.\n\nMandai- Top tier attractions imho esp with the SG60 1 for 1 promos. Tho I haven’t been to rainforest wild or curiosity cove. The newer parks are small compared to the OG and night safari. I feel like tourists should spend like 2 days here to cover every park. Like half day in SG zoo, evening go night safari\n\nDay 2: try to comb River Safari or river wonders as it’s called now, bird paradise, rainforest wild, curiousity cove.\n\nSentosa Island: really depends, skyline and luge are great. Cable car is okay if you go Mount Faber but when I went cable car it has a $1 promo for a short trip. Fort Siloso is great if you’re into WW2 history and you can explore like the nature trails and walk from coast to coast\n\nOrchard road: also subjective though i just do some window shopping there \n\nJoo chiat: as someone whose friend works there, it’s very quaint and it’s more for those cafe hoppers (I don’t cafe hop) and I’ve seen ang moh tourists take pics of the murals and I’m like dumbfounded because it’s a mural bruh.\n\nSG flyer- never been on it, kinda feels overrated and overpriced\n\nBotan gardens-good choice if you want a less touristy place than GBTB, it also got historical ties as well and I like the fact I can look at GCBs around the park and look at the architecture if I could ever see it\n\nRaffles Hotel- I’m broke bruhhh, but a solid choice from what I’ve seen and heard about.\n\n\nAS A LOCAL I FEEL THESE PLACES SHOULD DESERVE MORE LOVE\n\nChinese and Japanese Gardens\n\nScience Center\n\nNational Gallery\n\nNational Museum\n\nPeranakan Museum\n\nBedok 85 (just for their Bak Chor Mee and Satay, yellow signboard BCM for the win)\n\nKampong Glam and Haji Lane \n\nA few hours walking around heartland areas",
          "score": 5
        },
        {
          "text": "Is the best that we can do considering the lack of land (literally and also the fact that we cut down much of nature to build more houses and roads) and seasons. \n\nZoo, although pricey is a place that I am happy to go  again n again (because my kids can sleep better after running around lmao)",
          "score": 5
        },
        {
          "text": "I really like our airport, Botanic Gardens and Mandai Wildlife Reserve. \n\nI like Gardens By the Bay but I also think it’s a bit expensive and personally won’t go myself. I only went during covid cos they had some offer.",
          "score": 5
        },
        {
          "text": "Personally I enjoy Bugis area - Fortune Center, temple areas, Arab street, down to Nicol Highway, walk by the water to F1 track and then Marina Bay Area. Joo Chiat is lovely was well - quaint shops and eateries!",
          "score": 4
        },
        {
          "text": "It's easy to be cynical but personally are attractions are truly world class. Even as a Sgean I feel a bit of awe entering the vortex area at Jewel, and I've seen it many times. Imagine being a tourist.\n\nI guess the only criticism is that they're all man-made. But personally I would rather go to a well-managed and curated man made attraction, than a natural one that's poorly managed. Overseas there are a lot of these where it's rife with scams or peddlers.",
          "score": 3
        },
        {
          "text": "Everyone's listing the big locations but I think the things you don't really think about and appreciate sets us apart, like city planning and how much greenery/trees we have considering singapore is a pretty bustling metropolis. You don't really appreciate it until you've been to truly chaotic cities in the region",
          "score": 3
        },
        {
          "text": "I've taken people from overseas around the usual suspects and they all seem to enjoy themselves.",
          "score": 2
        },
        {
          "text": "For foreigners, the safety of our country is extremely impressive.",
          "score": 2
        },
        {
          "text": "It’s alright for such a young country. Just give it time to slowly develop",
          "score": 2
        },
        {
          "text": "The one I am semi hesitant is our food lol. People keep harping on how great it is but if you don't go to the right stalls there are a lot of misses.",
          "score": 2
        },
        {
          "text": "Parks, malls, rides, museums, heritage etc - none are unique to Singapore. What we do have, that weaves into all of these - is efficiency and safety. These are two things that us locals take for granted but are highly appreciated by time-constrained tourists that stop over here.",
          "score": 2
        },
        {
          "text": "We punch above our weight but there desperately need more transport options to Mandai. Direct shuttle buses from Orchard, Marina Bay, Paya Lebar etc would be good. Direct MRT, while unrealistic, would be great.",
          "score": 2
        },
        {
          "text": "Having lived in New York City for a long time, I found the major tourist attractions (Times Square, Little Italy etc.) an absolute beating that I had no need or use to visit at any point. I loathed taking friends visiting from out of town there because I knew it was going to be absurdly expensive and not any good. \n\nOn the other hand, I find the tourist attractions in SG to be of very high quality and often times good fun. The view from atop MBS is amazing, The Flower Dome and Cloud Forest are pretty amazing, and while places like Lau Pa Sat and Satay by the Bay are certainly a lot more expensive than my local kopi shop, you can still find some pretty good meals there for not insane prices (like going to Little Italy and paying $60 USD for a glass of house red and the worst chicken Parmesan you've ever had).",
          "score": 2
        },
        {
          "text": "As locals we like to min max stuff so we tend to nitpick A LOT. For example, when it comes to food a common argument is that \"oh but you can get it at Teck WHY (or some ulu location which takes 1.5hrs to get to) for CHEAPER and TASTIER\" but as a tourist with 24 hours layover, bedok 85 is good enough. \n\nAgree with the other dude that GBTB is GOATED. Love their displays and they usually go all out for sakura season, Christmas, etc. Even the Madam White snake display last year looked fairly decent irl when you're there. \n\nOur zoo, night safari, sea aquarium are quite well-done too. I would apply for corporate passes to go there! Only thing that probably can be improved is the weather itself; it gets too hot/rainy so animals are always hiding in the shade.\n\nSome other areas you didn't mention is Clarke Quay, Kampong Glam, Lau pasat, Maxwell hawker centre, Chinatown (in general)! I think each of these areas has its own charms and it's fun to pretend to be a tourist. As we go about our daily lives we tend to miss out on the quirks and character of the attractions. \n\nSentosa is pretty \"meh\" for me - obviously curated for tourists / corporate events and marketed to be this idyllic resort instead of pulau belakang mati haha. Nothing wrong with that tho I wish they hadn't demolished the iconic giant merlion. \n\n\n\n",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1r5zo7l",
      "subreddit": "askSingapore",
      "title": "What is getting more expensive in JB than in SG?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r5zo7l/what_is_getting_more_expensive_in_jb_than_in_sg/",
      "score": 34,
      "num_comments": 48,
      "created_at": "2026-02-16T12:17:16",
      "selftext": "Recently I saw comments from other places where people are complaining JB items are becoming more expensive than SG\n\nIf I were to travel from SG to JB, what are some things that I should look out for and not to buy?",
      "comments": [
        {
          "text": "Depends on the currency exchange at the time. Myr has appreciated about 15% vs Sgd in the past 2 years. So items from places like Uniqlo may be priced in a way that's cheaper in Singapore.",
          "score": 37
        },
        {
          "text": "Taking into account the time wasted at custom and Q. I would say most things I can get in SG, just get in SG. But if go for a day trip or chill, still ok to go 2D1N.",
          "score": 21
        },
        {
          "text": "I wouldn't say more expensive than sg but more expensive to the point it almost reaches similar price level.\n\nThe baked goods, newer bakeries opening up, I feel like they know that Singaporeans are willing to fork out money to buy. Manzanita at komtar and verrona hills are those that are newer than Seasons, Lavender, Verbena. But I also feel like verrona hills pastry taste nicer than lavender, maybe it's the butter",
          "score": 10
        },
        {
          "text": "Electronics",
          "score": 8
        },
        {
          "text": "Recently, I bought Decathlon Whey protein in SG instead of JB. It is now more worth it buying in SG due to the stronger ringgit.",
          "score": 6
        },
        {
          "text": "Village Grocer at Mid Valley is definitely more expensive than Shengsiong \n\nImported goods are pricey. But of course locally produced still relatively well priced. \n\nEating out at places like Souper Tang or Meng’s is going to be RM 100/person these days",
          "score": 6
        },
        {
          "text": "Cakes from some patisseries are as expensive if not more expensive than Singapore. Some might deserve it due to the artistry that goes into making the cakes, but some I tried were unfortunately mid despite high google rating",
          "score": 4
        },
        {
          "text": "Imported fruit and veggies. Stuff like US/Australian celery and lemons can be quite a bit more expensive in Malaysia. For groceries if it's not made/grown in Malaysia, compare prices first. \n\nAlso Decathlon may not always be cheaper, definitely have to price compare too ",
          "score": 4
        },
        {
          "text": "Generally groceries, fast food and petrol are still relatively cheaper in JB. Stick to these items and you can save abit.",
          "score": 3
        },
        {
          "text": "Because singaporean cheap cheap cheap \n\nGo long le price more and more ex but they still spend!\n\nBut groceries really can save.",
          "score": 2
        },
        {
          "text": "Higher end tyres. Meaning the larger sized ones, sportier specced ones etc. These are more ex in jb. \n\nThe small ass tiny ones and economy tyres, are much cheaper in jb.",
          "score": 2
        },
        {
          "text": "Fresh produce.",
          "score": 2
        },
        {
          "text": "The time spent in jams and queues is what makes it more expensive",
          "score": 1
        },
        {
          "text": "Uniqlo and adidas etc. shoes are cheaper in Singapore",
          "score": 1
        },
        {
          "text": "Medicines\n\n I think Panadol cheaper right?",
          "score": 1
        },
        {
          "text": "If things are getting more expensive. The Malaysian retailers will definitely be the first to bear the brunt of this inflation crisis",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r5v6lh",
      "subreddit": "SingaporeRaw",
      "title": "Singapore is exempt",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r5v6lh/singapore_is_exempt/",
      "score": 225,
      "num_comments": 41,
      "created_at": "2026-02-16T08:42:33",
      "selftext": "",
      "comments": [
        {
          "text": "Sound like a mountain tortoise whose knowledge is based on 50 years ago. Outdated and irrelevant.",
          "score": 69
        },
        {
          "text": "That's an Americunt",
          "score": 67
        },
        {
          "text": "Lol are we expected to be grateful",
          "score": 45
        },
        {
          "text": "I would think the hookers here are significantly more expensive",
          "score": 44
        },
        {
          "text": "Thank god for LKY. Can’t stand passport bros and some white people colonist mindset",
          "score": 34
        },
        {
          "text": "How do you know someone is American? \n\nDon't worry, they will make sure they tell you.",
          "score": 29
        },
        {
          "text": "Singapore is a haven for narcissists and sociopaths",
          "score": 16
        },
        {
          "text": "I would punch you, but I dont want you to have to take a 2nd mortgage to afford a doctor",
          "score": 11
        },
        {
          "text": "Funny how they call a school a school and not a “shooting range”.",
          "score": 7
        },
        {
          "text": "passport bro",
          "score": 6
        },
        {
          "text": "Based.",
          "score": 3
        },
        {
          "text": "Based.",
          "score": 2
        },
        {
          "text": "Doubt it's speaking for their people la.\n\nAlso TiL got difference between Americans and americas.",
          "score": 1
        },
        {
          "text": "Man the dude replying was an old acquaintance from a long time ago sia",
          "score": 1
        },
        {
          "text": "Murica is 4th world country",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r5en5i",
      "subreddit": "SingaporeRaw",
      "title": "Blangadeshi working and living well in Singapore! Bring family here. ❤️❤️❤️",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r5en5i/blangadeshi_working_and_living_well_in_singapore/",
      "score": 105,
      "num_comments": 31,
      "created_at": "2026-02-15T21:28:43",
      "selftext": "",
      "comments": [
        {
          "text": "Looks like hard working bunch!\n\nI hate the condescending snakes but i like the hardworking ones. 😊😊😊\n\nI always buy kopi in the morning for them",
          "score": 91
        },
        {
          "text": "i’ve used these guys for the last few years.  this is a bit like an ad but their workers really are customer focused and efficient.",
          "score": 74
        },
        {
          "text": "This post is an ad",
          "score": 67
        },
        {
          "text": "What’s with the constant cuts?",
          "score": 16
        },
        {
          "text": " Even the Bangladesh also make fun of the Indian song remake by the Chinese 刚买的飞机被打了..\n\nThis song 1 or 2 years ago: \n\nhttps://youtu.be/wH65b_4kTHA?si=FfN8IDZPQx-jfWP9",
          "score": 8
        },
        {
          "text": "Ad say ad la",
          "score": 7
        },
        {
          "text": "Mods pls do the needful",
          "score": 6
        },
        {
          "text": "Blangadeshi yo",
          "score": 2
        },
        {
          "text": "![gif](giphy|jyPWfqzhit2HEBDymN|downsized)",
          "score": 1
        },
        {
          "text": "Unoriginal and lame.",
          "score": 1
        },
        {
          "text": "The young guy sounds like a good boss.   \nRegarding the worker's young kids, the school fees will wipe out his earnings in a few years' time.",
          "score": 1
        },
        {
          "text": "Freaking ads the moment the boss gets involved\n\nTalk about backfiring. Dont treat viewers like morons",
          "score": 1
        },
        {
          "text": "“Have another family here” if taken literally it’s quite a dangerous suggestion…",
          "score": 1
        },
        {
          "text": "Looks like a paid ad LOL",
          "score": 1
        },
        {
          "text": "They will do everything except allow wages to rise so that locals could take those jobs.\n\nNow there will be no more locals thanks to demographic collapse.\n\nYay!",
          "score": 1
        },
        {
          "text": "That is actually the employer home btw which they have to pay rent to",
          "score": -3
        },
        {
          "text": "Why not pay the workers more salaries?",
          "score": -7
        }
      ]
    },
    {
      "id": "t3_1r5xxsa",
      "subreddit": "SingaporeRaw",
      "title": "Best cny x ramadan collab",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r5xxsa/best_cny_x_ramadan_collab/",
      "score": 100,
      "num_comments": 30,
      "created_at": "2026-02-16T10:52:30",
      "selftext": "",
      "comments": [
        {
          "text": "https://i.redd.it/8vvuq3ytvrjg1.gif",
          "score": 54
        },
        {
          "text": "Why this comment section full of salty people lol.",
          "score": 28
        },
        {
          "text": "Comment section don't want peaceful times, they want drama and arguments like the Grayce tan saga everyone loves it got so many comments viral parody videos gave us a good laugh and yeah that the reality. we humans tend to prefer chaos messy over peace. ",
          "score": 24
        },
        {
          "text": "Cringe",
          "score": 11
        },
        {
          "text": "98.7 DJs?",
          "score": 10
        },
        {
          "text": "Btw there are mixed Malay Chinese, so they eat reunion dinner at midnight I assume",
          "score": 8
        },
        {
          "text": "Rehearsal for 2028 to 2030? ",
          "score": 3
        },
        {
          "text": "wat the fackery circus clown is this.",
          "score": 2
        },
        {
          "text": "Ceca: This clip is racist and not inclusive!",
          "score": 1
        },
        {
          "text": "Who's the girl? I want to slap her lol",
          "score": 1
        },
        {
          "text": "I dislike this couple.",
          "score": 0
        },
        {
          "text": "Yeah….. I’m glad I left SG",
          "score": -4
        },
        {
          "text": "hmmm.. yuck",
          "score": -5
        },
        {
          "text": "Disgusting. No idea what the f she is smoking to think it's cool to do a video like this",
          "score": -15
        }
      ]
    },
    {
      "id": "t3_1r5tthl",
      "subreddit": "SingaporeRaw",
      "title": "My company half day office today, but if want to apply for leave need to apply for full day leave. What logic is this?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r5tthl/my_company_half_day_office_today_but_if_want_to/",
      "score": 61,
      "num_comments": 99,
      "created_at": "2026-02-16T07:41:55",
      "selftext": "Can anyone explain what logic they are using?\n\nIf company half day then if want to take the day off shouldn't it be half day leave only?",
      "comments": [
        {
          "text": "It's a working day, so if you want to take leave today,you will need to apply for a full day but if you go to work, because the boss is nice,he decides to let you go back half a day earlier.",
          "score": 317
        },
        {
          "text": "Is normal in most companies.Half day is not an entitlement. At discretion of Company",
          "score": 160
        },
        {
          "text": "looks like this is your first job and first year working.",
          "score": 150
        },
        {
          "text": "As per MOM “Any leave you take will be considered a full-day’s leave, even if it is taken on a half working day.”\n\n\nhttps://www.mom.gov.sg/employment-practices/leave/annual-leave/special-situations",
          "score": 71
        },
        {
          "text": "Wah shag, if i were you i just go bear with it half day. If not mc. Worst case resign //",
          "score": 42
        },
        {
          "text": "because today's early release is not an official half day. ",
          "score": 38
        },
        {
          "text": "OP, half day is the best fucking deal u get. Lmao it's literally just 2 to 2.5 hours of wayang and u go home.\n\nMost wouldn't be seriously working as many are on leave etc.\n\nAs for why it's like that - I just remind myself I rather be tired than unemployed:)\n\nHappy new year to you and good luck for 2026",
          "score": 34
        },
        {
          "text": "My company is an mnc, and put a lot of emphasis on fairness and dei stuff, so im still working full day today since hari raya no eve half day deepavali no eve half day why cny must have?\n\nIm gng office today also, later night arnd 6 got meeting with global colleagues. Have to cause wont be around tomorrow and the day after and 6 is the best time for both sides. \n\nAfter that need rush back for reunion dinner\n\nCan help me explain my logic then",
          "score": 21
        },
        {
          "text": "How tf we supposed to know \n\nGo ask your HR lor",
          "score": 17
        },
        {
          "text": "I mean this is HR rule. It also applies to Xmas eve and NYE, not just CNY eve",
          "score": 12
        },
        {
          "text": "Ask your co lor. How would we know the logic behind this?",
          "score": 9
        },
        {
          "text": "Civil service also same",
          "score": 8
        },
        {
          "text": "Like my Encik used to say \"off day is a privilege, not an entitlement\"",
          "score": 7
        },
        {
          "text": "Don't think it's half work day.\n\nIt's more like \"due to festive, ok la we let you leave early. But if got important things you cannot leave early. We are all adults here.\" Bla bla.\n\nIe: not official.\n\nThis is especially more clear if you work in a job that charges by man hours.",
          "score": 6
        },
        {
          "text": "cny eve halfday is just a benefit provided by the company in goodwill, not a given.",
          "score": 4
        },
        {
          "text": "This is normal practice for most companies.",
          "score": 3
        },
        {
          "text": "You open a company and will be the first to implement this rule",
          "score": 3
        },
        {
          "text": "First time ppl join civil service",
          "score": 3
        },
        {
          "text": "How dare you suggest you want to relax and stop contributing to the nation’s GDP \n\n/s",
          "score": 3
        },
        {
          "text": "Apply half-day morning, and show up \"early\" at 11:30am.",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1r5lcy8",
      "subreddit": "SingaporeRaw",
      "title": "do you guys like affectionate girlfriends?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r5lcy8/do_you_guys_like_affectionate_girlfriends/",
      "score": 56,
      "num_comments": 64,
      "created_at": "2026-02-16T02:03:49",
      "selftext": "i’ve always been very affectionate and loving towards my boyfriend and i can feel he appreciates it, but sometimes i’m scared it might be too overwhelming. he tells me it’s fine and that he loves it, but i’m still curious. what do you guys think?\n\ndon’t get me wrong, i’m busy and i have my own personal life too, but despite my schedule, i still make sure to check in on the small things, asking him every meal if he’s eaten, reminding him to take his medicine on time if he’s sick, making sure he drinks enough water, stuff like that. i also reassure him, tell him he’s doing well, that i’m proud of him, and try to ease worries about his career and future. i just naturally show love through constant care and support. do guys actually like this level of affection or can it be too much sometimes?",
      "comments": [
        {
          "text": "“You are not too much or less for someone that truly loves you”.",
          "score": 91
        },
        {
          "text": "I think it depends on the guy, but it would make many other guys jealous of your bf too",
          "score": 53
        },
        {
          "text": "what in the social media dating brainrot gender war skibidi qn is this",
          "score": 40
        },
        {
          "text": "No guy, no actually make that no one, will ever say no to affection. Let's get that out of the way. \n\nWhat guys MIGHT dislike is the smothering. \n\nPersonally I love my girlfriend to bits, but sometimes it's just stuff I don't have bandwidth for. Between work and wanting peace and quiet sometimes and wanting to just kick it with the boys, I don't really fancy the obligation to reply to \"have you eaten\" or \"have you drank water\" especially if she MIGHT get upset when I'm not up for a reply. \n\nGuys also generally operate quite different from girls. We don't need words of affirmation like \"you're doing good\" because it's never meant anything to us. Guys don't lift each other up like \"you go girl\" girls do. In fact it might create stress from obligation and not wanting to let you down. What's helpful is usually rooted in more practical things... like holding emotional space...being understanding... lifestyle choices that don't make me feel like I need to work myself into the ground for our 'future'. \n\nMy 2 cents and personal anecdotal experience at least. Might be completely off, or maybe some guys relate to this train of thought. Your boyfriend is unique so obviously defer to him on what he really likes or dislikes.",
          "score": 18
        },
        {
          "text": "Affection means nothing if it isn’t reciprocated in the bedroom.",
          "score": 17
        },
        {
          "text": "He def appreciates \n\nAs far as i understand guys i think, as a girl, they rarely get affection or care in return tbh... Its quite sad actually... Sometimes they just genuinely want a hug tbh... They are mostly alone on the inside even if they are surrounded by friends and family..\n\nSo i am sure your bf def loves the care you are showing him and its good that you check up on him from time to time..\n\nJust ensure that he's comfortable and if that he isnt comfortable with something, he can openly convey to you...as long as you give that safe environment for him to openly voice his thoughts to you and feel respected and loved while doing so , yeah i think it should be good.",
          "score": 13
        },
        {
          "text": "I’m happy that your boyfriend appreciated the effort you put in because personally I was like you in my previous relationship. But it didn’t last because he said I overwhelmed him with the love I gave. I’m happy that you find your match because I know one day I will find someone that matches my energy too.",
          "score": 8
        },
        {
          "text": "There’s a difference between affectionate &amp; clingy. If you’re really asking him if he has eaten every single meal, to me that seriously too much. But that’s me, I’m the out of sight out of mind kinda guy.",
          "score": 6
        },
        {
          "text": "2nd paragraph sounds like a mother? I think that might work for a guy without a mum's attention bah. I would run if a girl ask me wat i eat for my meals cuz there was a crazy one that did that tho we were just texting, but thats just me",
          "score": 6
        },
        {
          "text": "diff pepol diff pattern la u ask ur bf la wtffff",
          "score": 6
        },
        {
          "text": "i think the correct question is: does your boyfriend like your brand of \"affectionate girlfriend\"? and as always, the foolproof answer would be to ask him.\n\nand if he lies, it was never going to work out anyway.",
          "score": 5
        },
        {
          "text": "For me, dunnid so troublesome. A good strong bj at least once a week will do. ",
          "score": 5
        },
        {
          "text": "I have dated both affectionate and not so affectionate girls, and definitely the girl with bigger boobs win 😁",
          "score": 5
        },
        {
          "text": "...as opposed to non-affectionate boyfriends?",
          "score": 3
        },
        {
          "text": "Everyone needs some personal time. To maintain a good and healthy relationship, just make sure you give him enough time and space to breathe. (This is applied to you, too. If you feel it’s too much, just talk to him). Affectionate partners are likable at first but over time people will feel they’ve clingy. Many guys lie about that, apparently they don’t want to lose their girlfriends but they don’t know how to set a healthy boundary either.",
          "score": 3
        },
        {
          "text": "Only in the bedroom",
          "score": 3
        },
        {
          "text": "Err you’re a bit acting like his mother…",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1r5wjoj",
      "subreddit": "SingaporeRaw",
      "title": "Social oppression",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r5wjoj/social_oppression/",
      "score": 47,
      "num_comments": 29,
      "created_at": "2026-02-16T09:46:30",
      "selftext": "",
      "comments": [
        {
          "text": "Hoes don’t understand the effect their words have on people.\n\nDude has been holding a grudge for that trifling comment since.",
          "score": 31
        },
        {
          "text": "i dunno, pretty sane take to me.",
          "score": 15
        },
        {
          "text": "He’s not wrong but SG already has an accessible and cheap education system. The schools here are also damn good. The trick is to ensure there is a pipeline ensuring social and class mobility can happen. This starts from school, so I think it is possible. So long as education is accessible, there is a chance for mobility. \n\nNo system can close the gap between the haves and have-nots. Any such system would likely be worse for everyone.\n\nAnyway that girl he is talking about learned that oppression Olympics from the Americans who exported it to other societies. It is best not to just import or transplant foreign ideologies, especially ones that can’t even pass basic reasoning and logic checks.",
          "score": 12
        },
        {
          "text": "Way he talks macam one jhk pretending to be sinkie",
          "score": 7
        },
        {
          "text": "The most oppressed group in sg is those who think they're oppressed. U can criticize sg wealth gap etc but social mobility is not non existent, it being good or bad is relative to who you ask. That is the real truth, you only hear from complainers but not those who have succeeded",
          "score": 7
        },
        {
          "text": "This is just a one minute plus rant and humbrag. Where are the specifics to close the gaps?",
          "score": 6
        },
        {
          "text": "It's always the same in a developed country. The class divide. No rich people wanna befriend poor people or take them out for meals unless they need ur assistance in fixing the car",
          "score": 5
        },
        {
          "text": "Really wish we go back in the past where it's words instead of a video.",
          "score": 3
        },
        {
          "text": "Sry but this is nothing new. I get this is prob just a rant but say might as well not say.\n\nI’ll say one thing though: good education is nothing without good jobs.",
          "score": 3
        },
        {
          "text": "The rich are cancer",
          "score": 3
        },
        {
          "text": "nepobabies also. how many more better qualified sinkies have their jobs taken away by the likes of li hongyi?\n\nnepobabies are the cause of the low quality qualifications FT problem. the FT dun argue with the nepobabies because they are clueless themselves lol.",
          "score": 2
        },
        {
          "text": "He's not 100% wrong but he forgot about the people with mental health disorders like how our dear prime minister forgot about us.",
          "score": 1
        },
        {
          "text": "Sounds logical to me",
          "score": 1
        },
        {
          "text": "Is this the same guy who also said he look like Korean guy?🤣",
          "score": 1
        },
        {
          "text": "Am I the only one wondering why he holding the HL milk so close to his chest while talking about wealth inequality.\n\nhttps://preview.redd.it/ffoj8yv83sjg1.jpeg?width=833&amp;format=pjpg&amp;auto=webp&amp;s=bcd55da06462bfa363d74d8cbabcf528f43156ee",
          "score": 1
        },
        {
          "text": "9% gst for the poor is a huge deal compare to the rich.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r5zz2c",
      "subreddit": "SingaporeRaw",
      "title": "Not hating,But be Responsible",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r5zz2c/not_hatingbut_be_responsible/",
      "score": 41,
      "num_comments": 30,
      "created_at": "2026-02-16T12:32:13",
      "selftext": "Saw it like few minutes ago in Sengkang ",
      "comments": [
        {
          "text": "Post on Facebook where the boomers can see",
          "score": 23
        },
        {
          "text": "The same people btw that complains about haze but proceeds to do this type of shit and pollute the air and environment. But hey if we sound it out we are labled as racist and insensitive 🤷🏽‍♂️",
          "score": 18
        },
        {
          "text": "To be fair to the minority ethnic groups here, should fine those people gao gao. \n\nRevive the CWO and send them to clear their own rubbish.",
          "score": 15
        },
        {
          "text": "\"Heng, Ong, Huat 啊!\" \nThrows handful of Kimzhua upwards into air. \nProceeds to walk away like one boss.",
          "score": 7
        },
        {
          "text": "What's new? Entitlement?",
          "score": 4
        },
        {
          "text": "Why not hating. Just hate bro. These boomers need all the hate in the world",
          "score": 4
        },
        {
          "text": "Here we go",
          "score": 3
        },
        {
          "text": "\"Rules for thee, not for me\"",
          "score": 3
        },
        {
          "text": "rfid paper👍🌟❤️",
          "score": 2
        },
        {
          "text": "Where all the clout chasing tiktokers youngsters. They need to make video about the littering. \n\nI guess they won't cause zhi zi ren.",
          "score": 2
        },
        {
          "text": "High chance they were from kampung",
          "score": 2
        },
        {
          "text": "This unfortunately is Chinese privilege",
          "score": 2
        },
        {
          "text": "Kongwee why ah why such practice\n\nI feel that its because the paper seller cannot sell paper so they say burn this give your deceased huat huat. (In ancient time)\n\nCan enlighten me on my 1000 years of culture and heritage",
          "score": 1
        },
        {
          "text": "This one is older gen culture. I think it will die out sooner or later.   \nyounger gen no more do this type of thing",
          "score": 1
        },
        {
          "text": "Money money money",
          "score": 1
        },
        {
          "text": "Was hoping this mentality will slowly die out but recently still saw some young families doing this also. Guess wont be happening so soon.",
          "score": 1
        },
        {
          "text": "Why are they burning this during CNY? Also not hungry ghost festival or qingming yet",
          "score": 1
        },
        {
          "text": "Our poor CECA FT have to clear this mess later. ",
          "score": 1
        },
        {
          "text": "True, innovative about keep Singapore clean but this one tsk tsk..",
          "score": 1
        },
        {
          "text": "Oh my, this is definitely the doing of boomers. Sigh post on Facebook would be more effective.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r5clqi",
      "subreddit": "SingaporeRaw",
      "title": "How much do you guys spend on public transport?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r5clqi/how_much_do_you_guys_spend_on_public_transport/",
      "score": 41,
      "num_comments": 29,
      "created_at": "2026-02-15T19:42:02",
      "selftext": "i got this summary from the simplygo app. I haven’t been paying attention to how if you tap out and tap in again, money gets deducted so i’ve been taking buses for one stop or just one train station instead of walking. if i cut down on that i could probably save $30 in feb",
      "comments": [
        {
          "text": "~$100 x 2million people = $200 million monthly\n\nWow",
          "score": 30
        },
        {
          "text": "Used to be around $150, but i started cycling to the station instead of taking bus, sometimes just walking if its 1 busstop away, tapping into the mrt before 730am and now its only around $90 a month",
          "score": 15
        },
        {
          "text": "No transport costs for mi since i sit on my PMA throne zooming around SG 6km/h",
          "score": 7
        },
        {
          "text": "That’s very low",
          "score": 4
        },
        {
          "text": "$54. Unlimited rides. ",
          "score": 4
        },
        {
          "text": "as long as you spend more than $128 consider the monthly pass! also if it's just one stop to/fro your house, consider getting a bicycle lol",
          "score": 3
        },
        {
          "text": "VTO PAP… 65% approved for transport fares to go up… honestly when will transport fares go down? \n\nEconomy up = fares up\nEconomy down = fares up\n\nSome politician have the check to say SMRT rail net profit of 6 million which is less than 1%\nSo… must profit more than 1%???? MRT suppose to bring in 20% net profit???? \n\nLess than 1% cannot? \n\nHuh??? VTO PAP",
          "score": 3
        },
        {
          "text": "$0 i walk to and fro\n\nWake up early , back home late\n\nNo bbfa",
          "score": 3
        },
        {
          "text": "you can press a button to contest that charge, especially if you have a clear routine",
          "score": 2
        },
        {
          "text": "I own a motorbike and most of the time i go to jb pump.\nUsually will go in 2 week to pump 1 time will be abt rm30\nMonthly will be rm60\nSometime I take public transport will be 15 buck monthly",
          "score": 2
        },
        {
          "text": "I look at the detail for one journey : Train service : -1.28 then bus service -0.21 . If you have already taken a train then taking the bus won't cost too much . In this case it is only 16% more. As a tutor I mainly cycle from a house to another. I only ocassionally take public transportation when going with others or lazy. My average transport costs is from $40 to $ 50 ",
          "score": 1
        },
        {
          "text": "About 60sgd per month. I take public transport (bus) only.",
          "score": 1
        },
        {
          "text": "Use your child/parent/grandparents concession card. Cheaper. ",
          "score": -6
        }
      ]
    },
    {
      "id": "t3_1r56yn6",
      "subreddit": "SingaporeRaw",
      "title": "Pedestrian dies after accident involving prime mover in Boon Lay, driver arrested",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r56yn6/pedestrian_dies_after_accident_involving_prime/",
      "score": 36,
      "num_comments": 9,
      "created_at": "2026-02-15T13:57:17",
      "selftext": "",
      "comments": [
        {
          "text": "3rd world migrant workers with questionable driving licence placed through a [crash course for class 4](https://www.channelnewsasia.com/singapore/class-4-driving-lessons-priority-singaporeans-prs-work-pass-holders-long-wait-times-5346356) licence by employers who only care about their profits.\n\n&gt; \"A good number of the failures are Work Permit and S Pass holders. They had converted their foreign driving licence to a Singapore Class 3C licence, but seemed to lack the proficiency to drive even Class 3 vehicles competently,\" said police, adding that this has led to higher demand for Class 4 driving retests and related lessons.",
          "score": 26
        },
        {
          "text": "\"A 48-year old male prime mover driver was arrested for driving without reasonable consideration causing death.\"\n\nLol another one..How many more must die? Sinkie lives dirt cheap?",
          "score": 18
        },
        {
          "text": "That carpark is super dangerous.\n\nWhole day many cars moving up and down and it’s really hard to cross. Being a hardware hub, fruits wholesale, market and food centre.\n\nTraffic level is a bit high for carpark then the zebra crossing is also a bit far to walk to. It’s just a big carpark with high level of traffic.",
          "score": 5
        },
        {
          "text": "\"A 48-year old male prime mover driver was arrested for driving without reasonable consideration causing death.\"\n\n\n\n\nNever show name big big means foreigner. ",
          "score": 3
        },
        {
          "text": "Rip",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r5xykp",
      "subreddit": "SingaporeRaw",
      "title": "Chinese views Singapore as China's Crimea",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r5xykp/chinese_views_singapore_as_chinas_crimea/",
      "score": 33,
      "num_comments": 105,
      "created_at": "2026-02-16T10:53:29",
      "selftext": "",
      "comments": [
        {
          "text": "Who tf is bringing up ww2 shit in 2026? I dont think sinkies have any generational trauma or anything like that.\n\nIf anything, most netizens are anti China. This guy's delusion is strong.",
          "score": 73
        },
        {
          "text": "Mental illness is real and this guy definitely has it.",
          "score": 31
        },
        {
          "text": "I think he’s delusional. Nothing ambiguous about that.",
          "score": 27
        },
        {
          "text": "The war has ended for more than 80 years. Every country except china has moved on.",
          "score": 26
        },
        {
          "text": "Who the fuck is this street sitting, gutter oil drinking neckbeard?",
          "score": 19
        },
        {
          "text": "War is over. But we already said many times, We forgive but never forget.   \nAnd Singapore hate Ah Tiong even more. Nowadays, since when would you heard people saying bad things about Japan? Mostly towards either PRC or CECA.",
          "score": 11
        },
        {
          "text": "How much is ccp paying him?",
          "score": 9
        },
        {
          "text": "Lol fuck china",
          "score": 8
        },
        {
          "text": "Weird breed.\n\n\nImagine hating a country so bad, that you want that county to unite with yours.",
          "score": 7
        },
        {
          "text": "Kongweeee why you use other platform? Reddit not enough for your kpi?",
          "score": 5
        },
        {
          "text": "poor guy, the beijing smog and formaldehyde in his vegetabels damaged his brain cells",
          "score": 5
        },
        {
          "text": "how SG policy is shaped by one netizen. Sounds legit.",
          "score": 5
        },
        {
          "text": "Interesting. \n\nI view China as neo-nazi. They have to distract their own populace from all the domestic issues they're facing.\n\nI'll explain why below. WARNING: TLDR\n\n1. Property crash - in some areas, while property prices in most places have dropped by around 50%, prices in some areas plunged by as much as 70%. The the good news? Property developers' debt crisis is still unfolding, meaning the property prices very likely yet to bottom out.\n\n2. Exodus of foreign companies and capital - thanks to draconian rules to clamp down on foreign companies, ownership and investment, tier-1 and tier-2 cities have hollowed out of foreign companies. \n\n3. Massive retrenchment and unemployment - mass retrenchment in the last 2 years due to the exodus of foreign companies pushed many working class into structural unemployment. This issue is exacerbated by the approximately 8 million university graduates entering the workforce each year. \n\n4. Structural underemployment - with so many workers and fresh grads unemployed, the competition of jobs have spread to the food delivery sector and there are even cases where fresh grads holding master degree sweeping the streets. The irony, on the other hand, is that factories can't find enough workers. Many uni grads believe that working at a factory with menial pay, coupled with the 996 culture, is below them. \n\n5. Aging population - this adds healthcare and social welfare pressures on the younger workforce who are already struggling to find gainful employment just to make ends meet. The older generation also believe in real estate to park their wealth, and many of them own more than 1 investment properties. This leads to high vacancy rates as rural migrant workers can no longer afford rent due to reasons explained in point #4.\n\n6. Involution - 内卷 has pushed the China society to the extreme. Unemployment and underemployment lead to poor domestic consumption. Retailers and platform providers are undercutting prices to encourage customers to spend on their products/services or their platforms. In return, they squeeze their suppliers in pricing and credit terms. From factories to retails, every businesses in the supply chain are affected by the downward spiral of prices. While the whole world is battling against inflation, China is battling against deflation.\n\n7. Domestic political crisis - Xi Jinping has been fighting to keep his position and power as the various factions within the CCP are blaming him for the problems in China today, since he took power in 2013. In the past few years, Xi Jinping has been purging political rivals and dissidents in the name of anti-corruption campaign. Today, his allies and cronies are being purged by his rivals. All these has been happening for years and the recent removal of the a very senior military general who's widely seen as the figure head of the PLA is only going to deepen the political strifes and potentially destabilizing the CCP and the China government as a whole.\n\nLet's not get started with the issues China face with the US and the international community, particularly countries deeply involved in the Belt and Road Initiative.\n\nAll in all, China may look like business as usual on the surface, but deep down, it's fighting fires both on the outside and on the inside of its house.\n\nGiven how the CCP is all about the optics, I'll take any criticisms they have of others as a distraction tactic, nothing more.",
          "score": 4
        },
        {
          "text": "He thinks he personally single handedly changed our foreign policy. \n\n\nDelulu much? ",
          "score": 4
        },
        {
          "text": "I take my grandmother slipper and slap his botak head. Knn. Leave sg alone",
          "score": 4
        },
        {
          "text": "When you think you hate little pinks enough, you don't.",
          "score": 4
        }
      ]
    },
    {
      "id": "t3_1r5vkhy",
      "subreddit": "singaporefi",
      "title": "What financial advice would you give to a recent NSF?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r5vkhy/what_financial_advice_would_you_give_to_a_recent/",
      "score": 19,
      "num_comments": 51,
      "created_at": "2026-02-16T09:00:40",
      "selftext": "I just enlisted in January and I’m looking to invest maybe 10 percent of my NSF allowance into ETFs/stocks. How do I start researching for these topics and can you investors give me advice as to how I can better safekeep my money or any long term strategies to grow my money?",
      "comments": [
        {
          "text": "10% is too little. You will pay a lot in transaction fees if you are not even buying $100 worth each time. \n\nOther NSFs are saving hard because all your room and board are provided for, not much to spend on. ",
          "score": 22
        },
        {
          "text": "Read the wiki. Don't pick stocks and do your due diligence on ETFs. This sub always recommends VWRA. \n\nMy NSF bros were all about crypto in 2017-18. Some might make a lot but you realize they're taking a lot more risk. Its basically gambling. \n\nOn Broker, use IBKR.  \n\n[https://www.reddit.com/r/singaporefi/comments/uopn2w/a\\_guide\\_for\\_nsfs/](https://www.reddit.com/r/singaporefi/comments/uopn2w/a_guide_for_nsfs/)",
          "score": 16
        },
        {
          "text": "Save your emergency funds first. If you're going uni, have a buffer for your uni fees.",
          "score": 6
        },
        {
          "text": "Don't fall into the half ball trap",
          "score": 4
        },
        {
          "text": "I would give a difference advice compared to the \"standard advice\" of DCA VWRA. \n\nYou're young, and depending on the financial situation of your parents, you can take risks and have not a lot to fear. \n\nYour most important asset isn't your savings/money/NS allowance. It's your time. \n\nFocus on learning. If it's finance knowledge you're after, take the time to learn and experiment. Pick stocks (even though you will probably lose on average), understand why you win/lose. As long as you avoid highly leveraged stuff, you're probably fine. \n\nIf there's a clear industry you want to go, spend the money on lessons, on industry events (where it makes sense), go network. Go speak to people. \n\nSpend your most important asset (time) on areas that help you grow and learn. Thereafter, when you gain your actual assets (after you start working), you'll put that money into much better use.",
          "score": 4
        },
        {
          "text": "10% of 800 is very little money to invest dude. If you don't have any savings atm, you should probably just keep it in your bank for emergency savings (maybe 3 months worth of your monthly expense) then maybe try to invest monthly when you start working full time. During this 2 years try to educate yourself financially through sources like YouTube and books like the pyschology of money. \n\nBut don't stress too much enjoy your youth while you can like buying something you like or saving up for overseas trips with your friends. All the best.",
          "score": 3
        },
        {
          "text": "Signing on for NS might actually make financial sense?? Sign on bonus which you can drop into stocks + invest schemes and your NS 2 years is included in it. Then after sign on contract go to uni and then other service lines.",
          "score": 2
        },
        {
          "text": "Sign on\n\n\n(Edit: I'm serious in case you think I'm joking, work 3 years get paid for 5 years. Stay for sixth year get another 20+k bonus. NSF 2 years then go study part time uni 3/4 years just nice. Get your 100k by 25yo instead of 30yo)",
          "score": 2
        },
        {
          "text": "Invest in skills - you have more disposable income to invest if you invest in the right skills",
          "score": 2
        },
        {
          "text": "Army got the 2% thing, just go build your seed money. You don't have 5k 10k you also very difficult to operate. Build your seed money.",
          "score": 1
        },
        {
          "text": "are you going uni? then just save some money for a nice ord grad trip assuming your time is service has been tiring and trapped. then work hard, get job then start your FI journey from there. no need to stress so much if don't have so much capital yet",
          "score": 1
        },
        {
          "text": "The money isnt much to grow but it's important to grow the discipline and habit of setting money aside. Would always recommend investing in yourself first. Is there any skills or hobbies youre interested to pickup. Doesn't hurt to explore those activities when youre still at this age.\n\nFirstly there are still risk in investing but look into World ETF. Sub reccomends VWRA but i think thats out of your budget. You can look up into FWRA instead because if it's smaller denomination(8-9usd per quantity). Kinda similar but there are differences that you should look it up about.\n\nI would say to invest maybe every 2-4 months instead so that the fees won't be as taxing to your overall investment amount. \n\n$2 fees on $60 worth of stocks vs $120 worth every time you purchased.",
          "score": 1
        },
        {
          "text": "Singapore Savings Bond.\n\nSave up $500 first then buy that.\n\nThen, go and do up research and look into low cost globally diversified ETF.\n\nWhen you are ready and accumulated a good sum, liquidate the SSB and invest.\n\nSSB is 10-year government bond that can be redeem without penalty and with prorated accrued interest at any time within 1 month.",
          "score": 1
        },
        {
          "text": "Save up your money.",
          "score": 1
        },
        {
          "text": "what is your emergency fund like? \n\nI'd park this in GSX or Mari bank, depending on who gives better daily interest. while waiting for this fill up, go read up and research in the ETFs, their TER, coverage &amp; overlaps. \n\nonce you have 6 months expenses saved up, time to make the move.",
          "score": 1
        },
        {
          "text": "For small amounts of money, learn first. Don't rush into doing.",
          "score": 1
        },
        {
          "text": "Just find a low cost, total market ETF (see Vanguard for good examples) and dollar cost average into it \n\nI believe - given what is happening in US - you want more explosive to global markets vs. US \n\nIt isn’t rocket science \n\nIt’s boring \n\nBut boring makes you rich over time",
          "score": 1
        },
        {
          "text": "Read many finance-related books and don't believe everything that you read on reddit",
          "score": 1
        },
        {
          "text": "Best financial advice I can give you is use your NSF free time to get IT certifications (those industry recognized type, not skillsfuture). If you are into IT. If not, then some passion you can monetize or industry you want to work in.\n\nThen, build on your presentation skills.\n\nThen the rest is up to you. Go work and climb the ladder. Stepped on anyone who blocks your way, Formed your own power base or clique to climb together.\n\nWhen young, You have little money but a lot of time. That is the most financially rewarding thing you can do. CLIMB THE LADDER to get as much money as you can.\n\nBy 30yrs old, prepare to buy that BTO with that savings. 1st pot of GOLD.\n\n30yrs old onward, if got spare cash after BTO and family expense, your spare cash can start be invested either in properties or equities. UP to you. That time, you got more money but little time.\n\nTarget to have that BTO paid off by age 40yrs old. Because that is the time you will face retrenchment if you are not getting into senior mgmt role and still stuck in low end of the hierachy. Mid managers also not safe.\n\n  \nGot 1 SG property in hand, you are safe liao.\n\n  \nRemember, dont' be scared by TFR or ageeing popuulation. The other side of the coin is 6.9million population then onwards to 9.6 milllion population.  Singapore cannot survive if it's stuck at 6.9million population.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r5be9a",
      "subreddit": "singaporefi",
      "title": "Your views on copytrading",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r5be9a/your_views_on_copytrading/",
      "score": 6,
      "num_comments": 16,
      "created_at": "2026-02-15T18:28:30",
      "selftext": "That's been a lot of talk lately about copytrading \"successful\" traders via apps like eToro and others. \n\nI took a quick look at the returns and other data for the highest rated traders and they look impressive, clocking 20-40% annual gains consistently, with a rare bad year here or there with 10-40% loss.\n\nWhile the numbers look numbers, I also wanted to get real-work insights from actual investors/traders. Can copy trading, if done judiciously, be a good primary method of trading and income generation for ordinary folks? What are the potential pitfalls to watch out for? \n\nCheers! ",
      "comments": [
        {
          "text": "The world of investment suffers from the worst case of survivorship bias. Only the people that do well will post their results.\n\nIf you were to conduct a coin toss in a stadium of 50,000 people eight times, your chances of calling it right all 8 times is ~0.4%. That still means that about 200 of people would get it completely right. A coin toss isn’t a game of skill but we would attribute their success to some latent talent, skill or psychic ability when it’s just dumb luck. \n\nDon’t blindly follow others or chase crazy returns. Be happy with slow compounding.",
          "score": 61
        },
        {
          "text": "The problem with choosing someone to copytrade is that you're:\n\n\\- predicting future performance based on past performance\n\n\\- outsourcing conviction and DD, hence trading securities you may not properly understand (because you don't need to - you're just blindly following)\n\n\\- using someone else's risk management framework, which may not be the level of risk that suits your personal circumstances\n\nIt's basically gambling.",
          "score": 15
        },
        {
          "text": "i tried..... lost a few hundred ",
          "score": 12
        },
        {
          "text": "“Successful” is the fly in the soup.",
          "score": 4
        },
        {
          "text": "Don’t be scammed by it.",
          "score": 4
        },
        {
          "text": "I remember a case mention in Dec25, about an unlicensed forex trading company also employing copy trading to entice people to join them. May not be totally related to what u mentioned here, but this is the 1st thing that comes to my mind when it comes to copy trading.\n\nAnyway here is the link:\n\nhttps://www.channelnewsasia.com/singapore/samtrade-fx-three-charged-fraud-money-laundering-police-5623121\n\n“ These accounts were used in one of the products offered by Samtrade FX called \"copy trading\". This allowed clients to \"copy\" the trades executed by certain trading accounts. \n\nMost of the clients' copy trades ultimately copied the trades in 11 accounts, named \"Ultimate Trader\" accounts, which were controlled by Yue, said the police.”\n\nSo I guess just do yr own due diligence",
          "score": 2
        },
        {
          "text": "EToro?",
          "score": 1
        },
        {
          "text": "It's actually a bit like investing in an actively managed unit trust or ETF except without any explicit fees.\n\nThe biggest problem is that there is no mandated investment strategy or philosophy.\n\nThis means even if you luck out and find someone who is legitimately good to copy from, if they decide to change strategy or pass their account over to another to use, you also end up changing to a strategy or \"fund manager\" that may not be as successful.\n\nIt is also filled with recency bias. All those who are bad recently will have lower followers but there is no guarantee that whatever strategy that works today will work forever.\n\nIn other words, the most popular traders to copy from will be those who did well recently but not necessarily those who will do well in the long run.\n\nIt's a fun experiment but I wouldn't allocate too much money to it.",
          "score": 1
        },
        {
          "text": "It's easy when you're up but when you're down do you still copy? \n\nBest to gain knowledge and not be ignorant?",
          "score": 1
        },
        {
          "text": "For a balanced view, it's similar to giving your money to a managed fund, just on a retail level, minus fees and conflict of interest. \n\nLike all things investment, caution to not go all-in. End of the day, you only have the person's short term track record to base off. \n\nBut then again, not everyone is looking to outperform over a 20-30 year period across multiple market conditions. Maybe this person does well in high beta momentum trading during choppy markets and it's something you can ride short term?\n\nAlso notable that it's pretty easy to get rugpulled by this person setting up this portfolio as exit liquidity against one of his other personal positions elsewhere. \n\nIf anything, it's perhaps more wise to understand and emulate the methodology, and take trades in the same vein that work for your own risk profile.",
          "score": 0
        },
        {
          "text": "Their returns are shown in account transactions? Seen their withdrawals? Unfortunately, these copytraders are scams and fakes. Why do I want to make you money, with added stress of handling your money, with so little in it for me? How much can you give me to trade? $500k? $1m? My company gave me a 80 cut, you can give me that much? ",
          "score": -1
        }
      ]
    },
    {
      "id": "t3_1r57a0p",
      "subreddit": "singaporefi",
      "title": "HFE Questions",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r57a0p/hfe_questions/",
      "score": 5,
      "num_comments": 8,
      "created_at": "2026-02-15T14:15:02",
      "selftext": "Hi, I have 2 qns regarding my HFE and wondering if u guys have any experience!\n\n1. If my partner has past 12 months income, but I'm currently a student (but drew some internship income which paid into my cpf over the last 12 months), will HFE take into account my income even though I'm a student? As this affects my grant amount\n2. We recently applied for the SBF in Feb, but if we re-apply now for a new HFE before results are out, will it override the grant we got at the point of application of the SBF? If our income has increased or if we decide to apply for owner-occupier instead of co-owner\n\nThanks all!",
      "comments": [
        {
          "text": "Write in to hdb and check directly",
          "score": 8
        },
        {
          "text": "You used this HFE letter to apply for a flat. Now this HFE reference number and your new flat registration number are tied to each other. You will realise HFE cancellation eService says you have a new flat application and block you from cancelling your HFE.\n\nYour second question is confusing. Why would you want to change 1 co-owner to an occupier now? If your reason is go escape ABSD in the future then it will be rejected, govt not gonna help you escape from taxes.",
          "score": 3
        },
        {
          "text": "I think, for the second point don't bother. Later wait you get less.",
          "score": 1
        },
        {
          "text": "1. My experience was from many many years ago so just to caveat that their practise may have changed! We also applied when i was an intern and when i called HDB, they said that since i was a full-time student, my internship pay was considered \"allowance\" and hence not taken into consideration when they calculate for grants or loan. Then after applied HFE, they did ask for a supporting document i think my internship letter. Probably to confirm that whatever went into cpf is from internship and not from full-time employment. You can just go ahead and call them up to ask.\n\n2. AFAIK, the hfe is tied to the bto/sbf application by reference number. You re-apply hfe, it's a new hfe number, you cannot tie to back to the same application. You can, however, ask for reassessment but subject to conditions. I believe now there's an option to do deferred income assessment",
          "score": 1
        },
        {
          "text": "Given the over-usage of owner-occupier to own both hdb and private, im not surprised this 'hole' will be closed one day",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r5kbao",
      "subreddit": "singaporefi",
      "title": "Personal/Renovation Loan vs Savings",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r5kbao/personalrenovation_loan_vs_savings/",
      "score": 3,
      "num_comments": 22,
      "created_at": "2026-02-16T01:23:17",
      "selftext": "I'm going to do some renovation for my new place soon and planning to get reno/personal loan (2% EIR) to do it while letting most of my funds sit in my trading account to get the excess interest in relatively safe vehicles like short-term ETFs (4-5%)\n\nAnything I should lookout for or is it just better to withdraw the cash there for the reno?",
      "comments": [
        {
          "text": "Which \"relatively safe vehicles\" are yielding 4-5%?",
          "score": 7
        },
        {
          "text": "Didn't know there are 2% EIR renovation/personal loans. Mind sharing which bank/program is this?",
          "score": 3
        },
        {
          "text": "Reno loan is unsecured which FI doing 2%?",
          "score": 3
        },
        {
          "text": "Scb advertise as eir 2.08% but not inclusive of $199 annual fee. Nearly signed up for it till I saw the annual fee clause. \n\nMari/GXS can get below 3% but not sure if any hidden fees.",
          "score": 2
        },
        {
          "text": "No free lunch sir.",
          "score": 1
        },
        {
          "text": "Ok to loan. But that’s dependent on your job stability.\n\nThe investment part, is a separate question.",
          "score": 1
        },
        {
          "text": "4-5% is not low risk\n\nUnless you are pumping it into CPF SA guaranteed 4%",
          "score": 1
        },
        {
          "text": "what are safe short term ETFs that get you 4-5%? as far as I am concerned, ETFs are mid to long term investments. for reno, spend within your means and just use the cash.",
          "score": 1
        },
        {
          "text": "There's a reason why no one would recommend a renovation loan",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r5k8a0",
      "subreddit": "singaporefi",
      "title": "Life Insurance for kid.",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r5k8a0/life_insurance_for_kid/",
      "score": 1,
      "num_comments": 22,
      "created_at": "2026-02-16T01:20:04",
      "selftext": "Hi, my FA has recommended me to buy a life insurance with multiplier X2 and early CI for my young kid less then 10years old. Coverage is $300k till 75years old and then will drop to 100k till 85 years old.The premium will be around $40k payable in 15years. Is this plan good? Or should I take up a term insurance? Thank you.",
      "comments": [
        {
          "text": "At this age, a complete waste of",
          "score": 8
        },
        {
          "text": "But next time inflation $300K won’t even be worth that much, let your kid buy himself when he gets older",
          "score": 5
        },
        {
          "text": "Your kid has dependents? Why do they need life insurance for.",
          "score": 5
        },
        {
          "text": "I got term for my kid till age 65. Not cause i need their death payout, its for the ECI and disability payouts in case i ever need to take an extended no-pay leave to care for them (if they are still under my care).\n\nAfter they grow up and go out to work or have their own family, they will take over the term premiums and the payout will be theirs in case the adverse should happen to them.\n\nThe good part about starting early is that the low low premiums will be locked in till the policy term and will benefit them tremendously in the future.",
          "score": 4
        },
        {
          "text": "Imagine if you invest the premium for your kid right now.\n\nBy the time kid is 21.. wow wow wow\n\nPower of compounding",
          "score": 2
        },
        {
          "text": "1. Do you need 300k if your kid pass on?\n2. Why not just standalone CI plan?",
          "score": 2
        },
        {
          "text": "Ifa here. This sounds like a fwd plan.    \n\nWhat is the objective of buying this plan? For coverage to protect your kid or something else. If its coverage, then go for max multiplier. I would even argue that a term plan till they reach working age is also a gift.",
          "score": 1
        },
        {
          "text": "Hi Op, agent here\n\n\nWhat is the point of the life coverage?\n\n\nYou could get either a eci multipay or single claim term plan on your kid.\n\n\nThe sum assured should be your wife or your income. Touch wood really claim eci, one parent take time off work or quit to take care of the kid, depending on the illness. \n\n\nAt least the payout give you options.\n\n\nThe savings from buying term vs wholelife, you should invest it for your kid. 15 yrs later you give him the monies. \n\n\nAt that point, your kid has a rather relevant eci term plan cover to 65 as the sum assured Is based on your income, he can top up when he start working or just continue the term plan.",
          "score": 1
        },
        {
          "text": "Buy term life and invest the rest?",
          "score": 1
        },
        {
          "text": "Dont just include early CI, make sure later stages also covered. Take the median income p.a. then multiply by 2-4x to get your child's coverage. I'm not sure why 300k will drop to 100k but i thought there are plans that wont drop and you pay for 15-20 years only? Term is cheap, only abhorrently expensive in the late silver years. But then you'll be long gone so just get also no harm. Unless opt for private class, dont need to be too high coverage. Medical bills rarely go above $200k unless super complex. Even shield plans are a \"maybe\" already. You can always transfer payor to your child once he is earning an income.",
          "score": 1
        },
        {
          "text": "I am doing H&amp;S . Life and Endowment is not needed since those cash can be invested",
          "score": 1
        },
        {
          "text": "Think you will be better off pumping 20k each into your kid CPF MA to earn 5% risk free",
          "score": 1
        },
        {
          "text": "No. Let your kid decide for themselves how much CI coverage to get when he’s an adult. \n\nAnd besides, 40k in for 300k out in most likely 40-65 years doesn’t sound attractive at all. If he even gets to claim. If invested, money roughly doubles every 10 years .",
          "score": -2
        }
      ]
    },
    {
      "id": "t3_1r5yvzj",
      "subreddit": "singaporefi",
      "title": "IBKR - SGD  Margin Loans - 1.572% Rate",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r5yvzj/ibkr_sgd_margin_loans_1572_rate/",
      "score": 0,
      "num_comments": 14,
      "created_at": "2026-02-16T11:38:11",
      "selftext": "Hi , \n\n  \nJust wanted to know how to use the SGD loans for higher returns since the loan rates are lowest . 90% of my assets are in SGOV . So using margin loan to do something safe is my goal here . \n\nI don't want to convert SGD loan to USD and park in money market funds due to currency risk . \n\nAny ideas ? Thanks much . ",
      "comments": [
        {
          "text": "What exactly do you want to do?",
          "score": 2
        },
        {
          "text": "Is this 1.572 rate in the room with us right now?",
          "score": 1
        },
        {
          "text": "if u have a margin account, as long as the cash balances u see are in negative, you're using margin already...\n\nso to 'use' it, simply purchase whatever u want",
          "score": 1
        },
        {
          "text": "Borrow and invest in same currency else you take on currency risks.\n\nInvest in assets that are currency hedged for that asset.  \n\nIt does not have to be SGD, it can be CHF.\n\nThere are plenty of products for SGD and CHF that pays well above the margin rate.",
          "score": 1
        },
        {
          "text": "If you’re confident that your margin loan rate doesn’t fluctuate, then anything that returns above 1.572% in sgd works. If you can’t find it, then are you sure you want to take loans???\n\nBasically many MMFs return above that. So you can earn the difference. But if your quantum is not half a million or more, is it worth it?",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r5duwg",
      "subreddit": "singaporefi",
      "title": "Want to own a landed but don’t want to live in it",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r5duwg/want_to_own_a_landed_but_dont_want_to_live_in_it/",
      "score": 0,
      "num_comments": 22,
      "created_at": "2026-02-15T20:50:11",
      "selftext": "Hi all — looking for some perspective.\n\nWife and I are early 30s, both high income earners, buying our first property. We’ve been living with parents / renting until now. We save and invest consistently and live fairly modestly (no branded bags, luxury travel, etc).\n\nWe’re comfortable with a \\~$5–6m budget.\n\nWe both WFH some days and spend a lot of time at home, so housing is something we’re willing to spend on.\n\nTypical advice we hear: “Just buy a freehold landed (semi-D in OCR) while you still can. Long-term appreciation + legacy asset.”\n\nFinancially, I understand the argument:\n\n\\- Scarcity of landed &amp; freehold\n\n\\- Historical outperformance vs condos\n\n\\- Hedge against future affordability\n\nBut here’s the catch — we both genuinely prefer condo living for:\n\n\\- Facilities\n\n\\- High floor views\n\n\\- More central locations\n\n\\- We don’t need much space (no kids yet, minimalist lifestyle). Hard to imagine what we’d do with 3–4 extra bedrooms\n\n\\- Personally I hate the idea of landed houses being so close together my neighbor can literally see what I'm watching on tv from his 2nd floor bedroom lol\n\nOptions we’re debating:\n\n**1) Buy landed and live in it**\n\nMaximise long-term upside, but compromise on lifestyle fit.\n\n**2) Buy landed, rent it out, then rent a condo to live in**\n\nBut landed yields are low, property tax is high — does this defeat the purpose of owning landed in the first place?\n\n**3) Buy 2 smaller condos (one for own stay, one for rental)**\n\nBetter lifestyle fit + diversification, but give up on landed potentially forever.\n\nWould appreciate thoughts from those who’ve faced similar trade-offs, especially from a FI perspective. Understand this is a very fortunate position to be in, but genuinely conflicted here- thanks in advance!",
      "comments": [
        {
          "text": "On option 2 please check your actual property taxes as it superscales for non owner occupied homes even if you only own one home.",
          "score": 14
        },
        {
          "text": "How about option 4 - Buying the biggest possible condo and live the lifestyle that you both want!",
          "score": 13
        },
        {
          "text": "Not everything in life need to optimise. Optimise your own needs and wants than what is popular",
          "score": 13
        },
        {
          "text": "Some perspectives from someone who bought a landed and rent it out.\n\n1) Rental yield is low. Hard to cover your mortgage if you intend to loan 75%.\n\n2) Non-owner occupied property tax is very high if you don’t intend to stay.\n\n3) Hard to rent out. Rental market for landed is niche, mostly high earners expats with family. Together with reason 2, there’s a need to manage your cashflow well.\n\nThat said, capital appreciation is key. Make sure you can hold for 4 years(SSD duration), and likely you may see substantial gains.",
          "score": 11
        },
        {
          "text": "The thing about sg landed is there are two categories. The price sensitive landed and the aspirational gcb landed. They are both not the same although most will conflate the two together. it’s not a real landed unless you have very large space. Most landed in sg doesn’t even have enough space for a decent sized pool. And even if a pool is there, you would open your window and see your neighbour. Not to mention highly illiquid. We see news headlines splashing $3k++ psf gcb sold but most are struggling to sell at $2k psf and the majority of these stories are kept out of the news (likely to prop up the market). It’s a hit and miss. I know, it took us years to sell ours and not at a fantastic price. I still wonder how our dear minister managed to sell at $3k++ psf.",
          "score": 7
        },
        {
          "text": "Why? I live in a landed and I enjoy the space",
          "score": 2
        },
        {
          "text": "Buy a landed in Singapore and don’t live in it kinda dumb for the reasons brought up by other Redditors. You’re better off buying freehold commercial property.",
          "score": 1
        },
        {
          "text": "Just index and chill. No need fret over renters, property tax, wear and tear maintenance",
          "score": 1
        },
        {
          "text": "One forgotten property type is the strata landed/cluster houses. \nPrices typically sit between your 4 room condos and a small inter terrace in OCR, usually the 3-4.5MM range. \n\nYou’ll probably appreciate the space of the house without paying over the top. \nGetting one at 4MM will free up capital to get another 2-3 bedder condo for rental. \n\nA couple of cons for clusters are the higher maintenance fees and the slower potential capital appreciation but the heavier lifting will be done by your condo.",
          "score": 1
        },
        {
          "text": "If you really can afford it and have money to burn, get those penthouse like at Atra or whatever with private lift access.",
          "score": 0
        },
        {
          "text": "Rip your inbox.\n\nAnyway u can buy and then rent to foreigners",
          "score": 0
        },
        {
          "text": "Follow your heart. But 3. Is the most practical. If either one of you decides to quit, you can always sell off one place. \n\n\nYou could always get a landed overseas on a far away island paradise when you're ready for it. ",
          "score": 0
        },
        {
          "text": "You only live once. So why not let yr lifestyle guide your decision? There will always be pros and cons wrt housing type.",
          "score": 0
        },
        {
          "text": "Plenty of other higher yield assets to invest in.",
          "score": 0
        },
        {
          "text": "If option 3 means you have to live in a smaller condo that might be too cramped, would rather you buy a bigger new / resale condo (not too old if you want upside potential).",
          "score": 0
        },
        {
          "text": "Buy what YOU want.",
          "score": 0
        },
        {
          "text": "I literally just did this myself. Early 30s single, just bought a freehold semi d and renting it out while I continue to rent a hdb master bedroom room. I very much prefer living in a hdb or condo without the ground floor insects and mosquitoes and for the lifestyle and facilities. Landed yields are terrible and barely cover 60% of my mortgage.\n\nThe only thing I would say you are missing is 5-6m budget is not going to get you a livable FH semi d of decent land size today (I.e. above 2500 square feet and not in loyang or mcpherson). You either need to increase your budget to 7m plus or go for a terrace further out in the OCR with this budget.",
          "score": 0
        },
        {
          "text": "Do you intend to have kids? Do you foresee your aged parents living with you (and kids) in the future? If yes to both you might wish you bought landed.. have a look at semi d in Macpherson and d15 areas.",
          "score": -1
        }
      ]
    },
    {
      "id": "t3_1r58nzi",
      "subreddit": "singaporefi",
      "title": "Endowus or EndowThem",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r58nzi/endowus_or_endowthem/",
      "score": 0,
      "num_comments": 11,
      "created_at": "2026-02-15T15:38:25",
      "selftext": "Anyone find it crazy that the Endowus fees are higher than what you pay the fund managers? ",
      "comments": [
        {
          "text": "I bet you were very smug when you thought of this pun",
          "score": 9
        },
        {
          "text": "Do your own math. If the investment fee is higher than the trailer fee rebate, take your investments elsewhere. There's also Dollardex, POEMS, and FSMOne for UT investments.",
          "score": 8
        },
        {
          "text": "I always read endowus from their point of view, but still, for some funds, they have the lowest amongst the rest because of cashback",
          "score": 7
        },
        {
          "text": "So you’d rather buy from banks or insurance agents?",
          "score": 5
        },
        {
          "text": "Good to see their marketing ruse coming to light. \n\nOnly a portion of their funds actually have lower fees after factoring in the platform fees they’ve slapped on you. Figuratively, it’s “returning” you the 0.3% rebate from the fund house, but charging you a 0.4% platform fee. We also don’t really know what the actual rebate is; this is a business agreement and could be more than they are giving back.\n\nTheir UI/UX is great, but the back-end operations are far from industry leading. IYKYK.",
          "score": 4
        },
        {
          "text": "I would assume you are talking about Amundi funds. Since if you actually tried to shop around (inside endowus), majority of the funds are quite expensive (1-3% expense ratio before discount) and endowus offer a reasonable discount even after adding their fees you will end up saving a decent amount of basis point discount and add to that 0 buy-in fees.\n\nIf you are just doing Amundi then yes, it’s “expensive”, there are other platforms that offer 0 fees.",
          "score": 3
        },
        {
          "text": "you are paying the fee for them as advisers. and you got to evaluate whether they add value in any way be it updating you on performance, risk coaching, making you understand the product or the strategy better.\n\nyou can't always view it as everything keep it low and the people bringing things to you earns nothing. ",
          "score": 1
        },
        {
          "text": "Wanted to respond but your comment history indicates that you are a very snide and bitter person, so no point.",
          "score": 1
        },
        {
          "text": "EndowThem indeed. My fees are over $100 per quarter wtf bbq",
          "score": -10
        }
      ]
    },
    {
      "id": "t3_1r5ynse",
      "subreddit": "singaporefi",
      "title": "What is a safe way to invest for a kid in today's market, where it can be hard to figure out risk vs reward?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r5ynse/what_is_a_safe_way_to_invest_for_a_kid_in_todays/",
      "score": 0,
      "num_comments": 19,
      "created_at": "2026-02-16T11:26:47",
      "selftext": "Hi all, I'd appreciate some advice. I want to invest a sum of around SGD 20k for my 5-year-old. I hope this will turn into a good gift to give him when he's say 21 to get started in life. Disclaimer: I'm well capable of following the market and switching from one fund/stock to another. But...\n\nThere's a lot of hype around AI and some companies are seeing staggering returns, but there's equally loud talk of an AI bubble bursting. So its confusing - if I buy into the hype, I could fly high but could also crash and burn. Over the long term I'm thinking of, sure, I'd definitely take some risk to get better than average gains. But how/where to draw the line? \n\nOr do I take the easy way out and just invest in something safer, which gives a steady return? Of course, this could mean that I lose out on some opportunity.\n\nI'd love to hear from others who have similar objectives/experience and what has worked for you. Thanks!",
      "comments": [
        {
          "text": "If you're an FSC representing AIA - i think the best is to eat your own medicine and buy some AIA ILP.",
          "score": 59
        },
        {
          "text": "FA also need to ask for financial advice 🙂",
          "score": 29
        },
        {
          "text": "Buy your own insurance and plans la knn",
          "score": 9
        },
        {
          "text": "I just absorb my child's funds into my pool and give him a 5% risk free return.. Once he turns 18 i will let him takeover his own money.\n\nSimple and practical",
          "score": 5
        },
        {
          "text": "Just put the whole $20k inside multiple SG blue chip stocks and hold it for 16 years",
          "score": 1
        },
        {
          "text": "If you're thinking of 100% long term, and you have to be honest with yourself here, can you tank a 30-50% draw down when there's a recession / black swan event.\n\nif you can, just go with the subs favourite VWRA.\n\n\n\nif you understand more, just do 89% SWRD+ 11% EIMI.\n\n  \nlong term equities are much safer than people think. even after the dot-com bubble burst the MSCI world index will recover. don't worry too much about AI bursting for the long term as you said over your kids lifetime.",
          "score": 0
        },
        {
          "text": "GOOGL",
          "score": 0
        },
        {
          "text": "Vanguard ETFs. Look at the bogleheads sub.",
          "score": 0
        },
        {
          "text": "Lump sum VWRA and don't look at it for 16 years",
          "score": -1
        },
        {
          "text": "Buy any flavour of SPY or VWRA you like and hold. Most ILPs are designed to suck the financially uninformed dry anyways.",
          "score": -2
        }
      ]
    },
    {
      "id": "t3_1r5ejnm",
      "subreddit": "singaporefi",
      "title": "Which card for better miles reward?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r5ejnm/which_card_for_better_miles_reward/",
      "score": 0,
      "num_comments": 6,
      "created_at": "2026-02-15T21:24:08",
      "selftext": "Looking to explore card options for miles. Would love some comparison and recommendations 🙏🏻",
      "comments": [
        {
          "text": "Type in google next time",
          "score": 8
        },
        {
          "text": "Bro we have no idea about your income, circumstances, expenditure etc. How to advise? You google can already, faster than asking reddit. \n\nrainbow1112 already provided a link, can start there",
          "score": 3
        },
        {
          "text": "https://milelion.com/",
          "score": 2
        }
      ]
    }
  ]
}