{
  "schema_version": "raw_scrape_v1",
  "report_id": "2026-02-11",
  "scraped_at": "2026-02-11T14:22:06.157662",
  "subreddits": [
    "singapore",
    "askSingapore",
    "SingaporeRaw",
    "singaporefi"
  ],
  "total_posts": 40,
  "total_comments": 496,
  "posts": [
    {
      "id": "t3_1r0v5k0",
      "subreddit": "singapore",
      "title": "I've always been fascinated by Singapore's changing coastlines. Here are some fun facts about places that used to face the sea",
      "url": "https://old.reddit.com/r/singapore/comments/1r0v5k0/ive_always_been_fascinated_by_singapores_changing/",
      "score": 914,
      "num_comments": 64,
      "created_at": "2026-02-10T16:16:41",
      "selftext": "",
      "comments": [
        {
          "text": "Haji Lane is named that because that's where pilgrims gather to begin their voyage for hajj. They would board their ships at, well, Beach Road.",
          "score": 162
        },
        {
          "text": "I use this tool [https://libmaps.nus.edu.sg/](https://libmaps.nus.edu.sg/) provided by NUS while doing my research. You can overlay maps from different eras on top of each other. Lots of fun!",
          "score": 120
        },
        {
          "text": "Golden mile complex used to be near the coast too",
          "score": 95
        },
        {
          "text": "As late as the early 1960s, it was possible to hit a cricket ball into the sea from Padang",
          "score": 61
        },
        {
          "text": "If I remember correctly, Mountbatten Road and East Coast Road used to run along the coastline also, yes? There were literally beachfront mansions that are no longer anywhere near the beach along those roads. ",
          "score": 37
        },
        {
          "text": "anybody old enough to remember when marina south was flanked by steamboat restaurants and you could still get a nice sea breeze during dinner?",
          "score": 28
        },
        {
          "text": "Yeah a lot of beachfront houses we had back in the day are now no longer beachfront... Esp. at pasir panjang.\n\n\"Much of once was is now lost.\nFor none now live who remember.\"",
          "score": 25
        },
        {
          "text": "You should look up Tanah Merah, we had a literal cliff facing the sea.",
          "score": 18
        },
        {
          "text": "I’ve always found our old maps to be fascinating! \n\nFun fact I’ve got: Pulau Saigon was an island along clarke quay which has since been drained and connected to the mainland. River Place condominium now sits on where the island originally was",
          "score": 16
        },
        {
          "text": "Random trivia: [The Palm trees along West Coast highway](https://maps.app.goo.gl/higmpqDANGbzK4xQA?g_st=ac) are remnants of the old Pasir Panjang coastline.",
          "score": 14
        },
        {
          "text": "There were some very old houses along old Pasir Panjang road just before West Coast Highway were in fact beachfront villas. One of those old houses is between Jubilee Residences and The Tabernacle Church. I think it is the only one left now.\n\nSo you can imagine the property has a beach in its glorious past. This also explains the coastal defence machine gun pill box right in front of Science Park Rd which is along Pasir Panjang Rd.",
          "score": 12
        },
        {
          "text": "Thian Hock Keng Temple is my favorite, because look at __all that stuff man, that's lot of stuff__ between the temple and the sea",
          "score": 10
        },
        {
          "text": "Wah.. temple facing the sea!",
          "score": 9
        },
        {
          "text": "The Galle Face Hotel in Colombo, Sri Lanka has an almost exact replica to Raffles Hotel. It faces the sea, just like what Raffles used to. Felt like living during colonial times when stayed there previously.",
          "score": 8
        }
      ]
    },
    {
      "id": "t3_1r112d3",
      "subreddit": "singapore",
      "title": "S'porean man, 36, told 'sorry no S'porean' when he tried to rent Upper Bukit Timah condo unit",
      "url": "https://old.reddit.com/r/singapore/comments/1r112d3/sporean_man_36_told_sorry_no_sporean_when_he/",
      "score": 441,
      "num_comments": 137,
      "created_at": "2026-02-10T21:42:35",
      "selftext": "",
      "comments": [
        {
          "text": "The answer is it's easier to forfeit/deduct deposits if your tenants are foreigners. You will be surprised by the numbers of bad landlord here. \n\nRenting out to foreigners can easily withhold the deposits and most foreigners will not bother to escalate to SCC. But renting out to singaporeans they will sue until your pants drop.",
          "score": 446
        },
        {
          "text": "I kena before - landlord suspicious as to why Singaporean needs to rent.  Very narrow minded thinking.",
          "score": 383
        },
        {
          "text": "You may not have thought so, but this is actually pretty common. \n\nWe often hear a lot of cases where the agent/landlord basically said “no indians”, but it does happen for  Singaporean locals as well, for those who have actively rented, they might have encountered this at least once. \n\nThere are mainly couple of reasons why this is happening, firstly, the landlord is being suspicious because they don’t think that Singaporeans will ever need to be renting, they assume everyone lives with their family with no plans of moving out alone. \n\nSecondly, they prefer foreigners because “they’re easier to bully” since this is their territory, and they are able to siphon their deposits much more easily when their lease ends. \n\nThey talk a lot about guidelines and no discrimination, but this basically happens everyday with no repercussions.",
          "score": 246
        },
        {
          "text": "Actually best to avoid this kind of landlord. Likely trying to bully foreigner on deposit. Lots of horror stories regarding landlord refusing to refund deposits.\n\n&gt; The agent said that as far as he knew, the homeowner had \"previously rented to Singaporean tenants, and the two parties ended up in court. So, this time, he wants to rent the unit to foreigners.\"\n\n\n&gt; The agent also revealed that a permanent resident had previously offered a higher rental price to secure a unit, but the homeowner still chose the foreigner who offered the lower price, due to personal preference.\n\n\n\nMost foreigners (esp those that can’t get PR)  won’t fight with landlord and just suck it up.",
          "score": 200
        },
        {
          "text": "Well well well how the turntables",
          "score": 79
        },
        {
          "text": "&gt;The agent added that the homeowner did not want to repeat the same mistake, and it was not a discriminatory practice targeted at any particular nationality.\n\nThat statement from the agent is simply rehashing what they always say regarding rental to Singaporean Indians. Mirror mirror on the wall.",
          "score": 59
        },
        {
          "text": "yall will be fine with landlords refusing to rent to local indians, companies refusing to hire non-chinese locals etc but when yall r at the receiving end of this treatment, its for the news😂 non-chinese locals r also our ppl but yall r silent abt the discrimination they face... I mean its just a 'preference' right",
          "score": 58
        },
        {
          "text": "So landlord is foreigner living in singapore and refuse to rent out to Singaporeans who are native citizens here. What an irony ha",
          "score": 24
        }
      ]
    },
    {
      "id": "t3_1r1lcyd",
      "subreddit": "singapore",
      "title": "Father of 6-year-old killed in Chinatown accident offered free accommodation in S’pore by Ascott",
      "url": "https://old.reddit.com/r/singapore/comments/1r1lcyd/father_of_6yearold_killed_in_chinatown_accident/",
      "score": 319,
      "num_comments": 127,
      "created_at": "2026-02-11T10:42:41",
      "selftext": "",
      "comments": [
        {
          "text": "Condolences to the Dad 🙏🏻 may justice be served to the female driver. The 6 year old girl had a whole life ahead of her just to be taken away by the accident…😢",
          "score": 261
        },
        {
          "text": "Came to Singapore for holiday, notable for it's safe and orderly environment, now having to return without their child walking beside them. I'm always by the stance that Singapore traffic laws have gotten way too lenient. \n\nLives are consistently lost due to road accidents every week and the only actions taken were only a couple of years driving ban and a few months of jail time. \n\nIf anyone thinks a few years is too long, dare I remind them that Covid-19 was 6-7 years ago. Ironically traffic accidents were at its lowest in 2020-2021 when circuit breaker measures was in effect.",
          "score": 197
        },
        {
          "text": "Who is paying for his wife medical fee 🤔",
          "score": 148
        },
        {
          "text": "How about the petition to Deport the driver",
          "score": 106
        },
        {
          "text": "&gt;It added that Ms Raisha had regained consciousness and was in stable condition, but remains weak.\n\nGood news, wishing her full recovery and be the witness for justice",
          "score": 99
        },
        {
          "text": "Is there a gofundme or anything for this family? ",
          "score": 62
        },
        {
          "text": "can a lawyer provide probono legal service to sue the driver?",
          "score": 17
        },
        {
          "text": "Drove to that area plenty of times and I can say that it high traffic zone for both cars and pedestrians. So extreme care is required for both side.\n\nProblem is that the driver didn't give a shit by just flooring the accelerator to have both front and rear wheel to run over the mother and kid. She doesn't even need to touch the accelerator to move off as she doesn't need much speed. Then she cut the lane from right to left. Lastly lack of looking out for traffic. \n\nIn short, a dogshit driver who shouldn't have a licence.",
          "score": 7
        }
      ]
    },
    {
      "id": "t3_1r12wrc",
      "subreddit": "singapore",
      "title": "Google deepens S’pore commitment, looks to fill 150 positions in mostly tech, engineering",
      "url": "https://old.reddit.com/r/singapore/comments/1r12wrc/google_deepens_spore_commitment_looks_to_fill_150/",
      "score": 274,
      "num_comments": 85,
      "created_at": "2026-02-10T22:55:39",
      "selftext": "",
      "comments": [
        {
          "text": "Don’t think most of it is going to locals, based on my experience maybe 20-30% will be locals",
          "score": 217
        },
        {
          "text": "Announcing +150 after last three years layoffs. Keep your resume and interview skills fresh, lest Sundal Pichai decides his \"Singapore commitment\" isn't so deep after all again.",
          "score": 60
        },
        {
          "text": "Isn’t 150 like…little? lol",
          "score": 37
        },
        {
          "text": "Would be really nice if they set aside a local quota for locals bruh, especially in this time of no job security..it's just not fair atp with all this foreign investment coming in that's supposed to benefit the country..",
          "score": 21
        },
        {
          "text": "Can our government ever work out a framework that big players has to hire and train our local workforce? How many of these positions goes to import talent than local?",
          "score": 19
        },
        {
          "text": "Nice way of putting it but Google shows deeper commitment to hire in India (***hiring 900 roles, 9X sg***) &amp; Malaysia (***hiring 484 roles, 3.2X sg***)😒",
          "score": 14
        },
        {
          "text": "The employer will follow the dependency ratio ceiling set by MOM, no point giving all places to locals. It will be something like 1 local is to 5 EP.",
          "score": 7
        }
      ]
    },
    {
      "id": "t3_1r0txz7",
      "subreddit": "singapore",
      "title": "Worker who cleaned BreadTalk display shelves with broom dismissed; outlet undergoes deep cleaning",
      "url": "https://old.reddit.com/r/singapore/comments/1r0txz7/worker_who_cleaned_breadtalk_display_shelves_with/",
      "score": 219,
      "num_comments": 74,
      "created_at": "2026-02-10T15:00:57",
      "selftext": "",
      "comments": [
        {
          "text": "Just got caught on camera this time. ",
          "score": 239
        },
        {
          "text": "Imagine how long this went on for before someone uploaded a video online",
          "score": 101
        },
        {
          "text": "Really makes me wonder what kind of orientation and training these cleaning companies give to their staff.\n\nSo many courses to upskill and upgrade for the companies to earn and to give certs and the trainees still come out this kind of no common sense actions. If no or wrong tools given then tell the supervisor unable to complete task, simple as that. Whether its a duster or a broom, a stool or a ladder, the company should be responsible for providing the appropriate equipment for the staff.",
          "score": 93
        },
        {
          "text": "Ah the classic hiring triangle. You can only choose two options. \n\n\n1. Highly experienced\n2. Available immediately\n3. Low cost",
          "score": 77
        },
        {
          "text": "Now the issue can be sweep under the rug\n\n![gif](giphy|kPIswn0RfPTGxOvDj5)",
          "score": 34
        },
        {
          "text": "If only the bread can talk",
          "score": 25
        },
        {
          "text": "Just another reason to not eat their breads.",
          "score": 17
        },
        {
          "text": "The cleaner just didn't give a damn..nothing to do with 'proper training'",
          "score": 10
        },
        {
          "text": "Red flag company finally goes on the news !! yall know how red flag this breadtalk is or not.. (1) they never paid my salary when i was their employee (2) they never resolved their breadtalk app's issue for me as a customer who kept following up with them. say will check the cctv first. check need to wait for more than three years isit? no single updates also, lol.",
          "score": 4
        },
        {
          "text": "Can't have BreadTalk without people talking about its controversies",
          "score": 4
        },
        {
          "text": "This is the problem when you want cheap, good and fast.",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1r0x0ce",
      "subreddit": "singapore",
      "title": "Maid used baby's arm to punch baby's face repeatedly, gets jail",
      "url": "https://old.reddit.com/r/singapore/comments/1r0x0ce/maid_used_babys_arm_to_punch_babys_face/",
      "score": 181,
      "num_comments": 76,
      "created_at": "2026-02-10T18:14:42",
      "selftext": "",
      "comments": [
        {
          "text": "I have two kids which I never sleep train, there are times they really piss me off and I wanna take it out on them, and these are my own flesh and blood. \n\nMuch less a domestic helper who potentially have lesser mental fortitude or familiar (family) relationship with an infant. \n\nNo choice la, cannot outsource parenting to anyone else. Have to make it work no matter the circumstance.\n\nBtw, not defending the helper’s actions at all. But I am hoping such incidences can be avoided in the first place.",
          "score": 201
        },
        {
          "text": "Every time I read one of these posts… which honestly, one is one too many, I feel so conflicted.\n\nOn one hand if I ever saw my helper or anyone, even my own husband, treat my baby like that, I would definitely be calling the police and would be irate.\n\nOn the other hand, why is a 4mo sleeping with the helper?? Why not with the parents?? I’m sorry I don’t care that you need to work the next day - it is YOUR child, you bloody well do the night wakes. It’s never the helper’s job to do that UNLESS it is the only job she has (ie no housework, no caring for the child in the mornings). \n\nEven a trained night nurse would never agree to work BOTH day and night shifts to care for babies, let alone an underpaid, untrained helper.",
          "score": 131
        },
        {
          "text": "easy to blame the maid, but maids are untrained for the purpose where many new parents simply expect the maid “to just do it”\n\nstill wrong of the maid but parents are not without fault",
          "score": 63
        },
        {
          "text": "Maybe must mandate fdw doing baby/elderly duties cannot do housework",
          "score": 60
        },
        {
          "text": "Personal experience when I hired my helper she indicated she have experience with newborn and has her own daughter who is 5yo. When she arrived she don’t even know how to wipe my newborn daughter’s ass properly that I(first timer noob dad) have to teach her the right way to change her diapers and soothe a baby etc. The saving grace was she was willing to learn and has affection for kids so we just have to practice together. \n\nAll I’m saying is treat all their experience with a pinch of salt especially on children because every child is different. Harsh reality also is even if they have their own kids, they are usually taken care of by their grandparents because the mum will come back to Singapore asap to work again.\n\nAnd all parents know that tired caregiver plus a crying baby equals disaster. I still remember my 6 week old newborn having colic issues for the entire night and it was just me staring at her and asking her what she wants(everything we tried didn’t work). It’s a huge mental game and expecting the same level of patience and commitment from the helper is just unfair and cruel",
          "score": 22
        },
        {
          "text": "Mandatory rest times and days for maids!",
          "score": 17
        },
        {
          "text": "Hitting the baby was child abuse and horrendous, but what about the parents who made the helper take care of the baby the entire night while still expecting her to work the next day? This is slavery-levels of entitlement and abuse, anyone would crack under this much workload.",
          "score": 15
        },
        {
          "text": "Parents not wanting to do the parenting",
          "score": 7
        },
        {
          "text": "As a parent, if you hire a maid, you either make them fully care for the baby or fully do housework. When you ask them to do both, you overwork and squeeze them. They are bound to get mental exhaustion eventually and these kind of shit happens.",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1r0wkgu",
      "subreddit": "singapore",
      "title": "Warning: New email scam on refund from StarHub",
      "url": "https://old.reddit.com/r/singapore/comments/1r0wkgu/warning_new_email_scam_on_refund_from_starhub/",
      "score": 155,
      "num_comments": 29,
      "created_at": "2026-02-10T17:47:18",
      "selftext": "Received an email claiming to have received a refund from StarHub. The email is full of try-hard to get believe how legit it is. But what the fk is PDPA requirement to verify payment information?\n\nReply to email isn’t even StarHub.\n\nAnd since when does ShitHub issues refund for their billing errors?\n\nTry harder.",
      "comments": [
        {
          "text": "Starhub automatically refunding money is the funniest thing I have ever heard. ",
          "score": 61
        },
        {
          "text": "They got the StarHub green wrong",
          "score": 33
        },
        {
          "text": "The biggest giveaway is starhub refunding voluntarily.",
          "score": 30
        },
        {
          "text": "The reference number is hilarious 4567-8899 🤣🤣🤣",
          "score": 26
        },
        {
          "text": "I like when the reason for thinking it’s a scam is knowing that the actual company itself would never be so generous. 🤣",
          "score": 10
        },
        {
          "text": "When you receive email like this, don't click any links on the email and just login to your starhub app or website to check.\n\nIt's shocking that some people would still fall for this trick and click the link and then get scammed.",
          "score": 10
        },
        {
          "text": "Refund? From Starhub? In this Economy?\n\nDumbest scammer ever.\n\n![gif](giphy|QsSFBWemBrjDa)",
          "score": 9
        },
        {
          "text": "Lol starhub is sending from yahoo mail",
          "score": 8
        },
        {
          "text": "🎵 Six Six six is the number of the beast 🎵\n\n~in Cambodian scammer accent",
          "score": 7
        },
        {
          "text": "I think a 10% cut from helping to move some money for a royal based in Lagos is still more believable that getting a refund from Starhub.",
          "score": 5
        },
        {
          "text": "Similar refund email purportedly from Singpass going around too.",
          "score": 3
        },
        {
          "text": "Ahahaha this one easy to tell\n\n\nWhy? I know too damn well that it is hard to get a refund from them",
          "score": 3
        },
        {
          "text": "When starhub asking money from you is more credible than refunding money to you",
          "score": 2
        },
        {
          "text": "Thanks for the heads up, its good to be updated. It may seem obvious but not everyone is alert 24/7.",
          "score": 2
        },
        {
          "text": "This is a \"Serious Discussion\". Joke, irrelevant or off-topic comments will be removed and **offenders will face restrictions in accessing /r/singapore** such as temporary or permanent bans. Please report such posts and comments. OPs must also engage in a bona fide discussion, i.e. the post should not be one just to incite outrage.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/singapore) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "text": "Never ending",
          "score": 1
        },
        {
          "text": "Impossible for them to refund you if you never went to get one in the first place. Even if you did, they would probably just say your refund is done when it's done..",
          "score": 1
        },
        {
          "text": "can we also see the email address?",
          "score": 1
        },
        {
          "text": "I hope you reported to ScamShield!",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r14nda",
      "subreddit": "singapore",
      "title": "11 years’ jail, caning for man, 22, who lied he was 15 and raped 13-year-old girl",
      "url": "https://old.reddit.com/r/singapore/comments/1r14nda/11_years_jail_caning_for_man_22_who_lied_he_was/",
      "score": 128,
      "num_comments": 12,
      "created_at": "2026-02-11T00:00:12",
      "selftext": "",
      "comments": [
        {
          "text": "&gt;The prosecutors highlighted the man’s predatory behaviour and sought a sentence of at least 11 years’ jail and 10 strokes of the cane.\n\nIf absolutely nothing else he's going to have a significantly harder time passing himself off as 16 by the time he gets out, assuming this is his final sentence.",
          "score": 56
        },
        {
          "text": "To be fair 22 is still quite young, so for these girls to immediately assume he's much older, he must look way older for his age. Good luck to him once he gets out. People are going to assume he look 50s while he's in his 30s.",
          "score": 29
        },
        {
          "text": "![gif](giphy|y0xRq0Kq6MhiHZTdpB)",
          "score": 17
        },
        {
          "text": "Not only did he target this 13 year old, he also sent explicit images to another 12 year old and asked her to send him nudes. Good on the 13 year old's elder brother and the 12 year old's mom for reporting to the police ",
          "score": 13
        },
        {
          "text": "Predator scum",
          "score": 13
        },
        {
          "text": "side track\n\n\"Later that month, the second victim’s teacher conducted a spot check on her cellphone and saw the messages the man had sent her.\"\n\nare teachers empowered/allowed to look into the contents of a student's phone?",
          "score": 8
        },
        {
          "text": "omg",
          "score": 2
        },
        {
          "text": "This guy obviously didn’t have the excuse of a bright future from NTU/NUS 😭😭😭",
          "score": 1
        },
        {
          "text": "When I was 22 ppl think I hvnt go army still in poly. This guy must look rly old…",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r1klmk",
      "subreddit": "singapore",
      "title": "Commentary: ChatGPT is a dangerous study aid for STEM students",
      "url": "https://old.reddit.com/r/singapore/comments/1r1klmk/commentary_chatgpt_is_a_dangerous_study_aid_for/",
      "score": 117,
      "num_comments": 45,
      "created_at": "2026-02-11T10:08:42",
      "selftext": "",
      "comments": [
        {
          "text": "The chatbot is obsequious and agreeable to the point that it will convince people that they have discovered secrets of the universe that will fundamentally reshape physics and mathematics.",
          "score": 85
        },
        {
          "text": "Its good for quick general info. Not to be taken as the gospel truth. Trouble comes when stupid people relies on it for hard facts instead of doing their due research and critical thinking",
          "score": 76
        },
        {
          "text": "Replace human fully with AI is dangerous for business.",
          "score": 76
        },
        {
          "text": "please lol, if u use chat gpt for p3 to p5 science, it will also get some questions wrong\n\n  \nthe problem is as adults we know it is wrong, but the learners don't, and because it's a quick stop solution, kids will keep going back to it and once they learn the wrong stuff, very hard to unlearn liao",
          "score": 25
        },
        {
          "text": "&gt; Some students bring healthy scepticism to these interactions. They sense that responses that run half a page are off. They ask me whether they really need to write all this, which at least shows they’re thinking. But many more never seek clarification. **They accept the AI answer as definitive and move on**.\n\nMaybe I'm biased, but IME, it's not just students. Fully grown adults do this too.\n\nThe underlying problem is the same as it has been pre-AI. For years our education has been built on teaching to the test, rote memorisation and regurgitation, mass drilling problem/solution patterns. Combine that with people's tendency to take the path of least resistance, and here we are. \n\nAI is just the latest development highlighting the problem. \n\n&gt; STEM educators could consider doing three things. First, design assessments that require students to demonstrate their thinking process, not just provide answers. Second, teach students to ~~critically evaluate AI outputs to~~ spot overly general or inaccurate explanations. Third, create classroom environments where productive struggle is encouraged~~, guiding students but not providing immediate access to AI~~.\n\nSee, take \"AI\" out of the conversation, it's still relevant and valid advice.",
          "score": 8
        },
        {
          "text": "Not just chatgpt but AI in general..\n\nAI overview at Google can totally give me wrong information",
          "score": 7
        },
        {
          "text": "Children should use with supervision\n\nIt is great filter for adults. You can immediately tell who knows their shit and who does not when they submit their paper.",
          "score": 5
        },
        {
          "text": "Chatgpt is just the tip. You can literally use trae/antigravity to generate a working full stack application by just giving a prompt. The codes may not be optimised but I doubt your profs will check through line by line. Gone are the days when you spent weeks burning midnight oil coding your software based fyp.",
          "score": 5
        },
        {
          "text": "Anyway at O level , many years ago,  ii have personally seem my friends and relatives that keep on failing their physics or chemistry papers until the school teacher just asked them to drop the subject at 'O' level. The ones that can afford would get tutors like Kevin ang to help them to understand the concept. I think the difference now is that they can try AI to see whether it can help them with their learning.\nSo the  real issue now is how to assess the students accurately.",
          "score": 5
        },
        {
          "text": "It should be used like a better customised version Google (but now googles got ai overview Gemini), not for it to help do every task for you. Especially in coding. Vibe coding is not the future.",
          "score": 4
        },
        {
          "text": "There's no choice, because the lecturer only talks about database management theory, but didnt go through SQL fundamentals, which is what the assignment wants. With a time crunch, we have no choice but to clear the assignment first then go back to the study materials.",
          "score": 2
        },
        {
          "text": "Lol, this teacher lives with his head buried in the sand or what. Before AI we already had rote memorisation of answers, aka blindly copying without understanding.",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1r0xcoo",
      "subreddit": "singapore",
      "title": "Shaw Lido new higher-end  Lumiere Grand hall to open on Feb 12",
      "url": "https://old.reddit.com/r/singapore/comments/1r0xcoo/shaw_lido_new_higherend_lumiere_grand_hall_to/",
      "score": 71,
      "num_comments": 16,
      "created_at": "2026-02-10T18:35:43",
      "selftext": "",
      "comments": [
        {
          "text": "&gt; Lumiere Grand tickets come with a complimentary $7 MovieBites credit for snacks.\n\nActually seems quite worth it lol",
          "score": 21
        },
        {
          "text": "The existing Lumiere reclining seats are pretty good for a budget version of the Gold Class seat. The new sofas introduced here are basically typical seats in a newer cinema in the UK. Asia has just been slow to update our basic offerings.",
          "score": 14
        },
        {
          "text": "If staying in sg, got the biz class flight feeling n food + drink ",
          "score": 10
        },
        {
          "text": "For those who come after.",
          "score": 6
        },
        {
          "text": "![gif](giphy|wjO7g6fitGq44CnpKk)",
          "score": 6
        },
        {
          "text": "Might be a good way to pamper myself once in a while for longer films",
          "score": 4
        },
        {
          "text": "4DX PLEASEEEEE",
          "score": 1
        },
        {
          "text": "Lumiere was an amazing way to watch Wicked 1, definitely worth it for a good movie imo",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r1l27r",
      "subreddit": "askSingapore",
      "title": "is it just me or are we all moving towards nowhere?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r1l27r/is_it_just_me_or_are_we_all_moving_towards_nowhere/",
      "score": 210,
      "num_comments": 103,
      "created_at": "2026-02-11T10:29:29",
      "selftext": "life has just been very stagnant. everyday is just work and home and work again and home again, like exactly the same. long terms goals are getting married, get a house, have kids, raise them up and they also go through the same mundane cycle again. often catch myself wondering what are we all running for? \n\njust want to hear some insights from fellow singaporeans; what are you slaving away every day for? is life just rly study, get a job, get married, get a house, have kids? or is there a deeper meaning where everything will all make sense in the end?\n\nalso, how do yall find time to do your hobbies? weekdays are just work and weekends are just recovering &amp; preparing for the next week. there are so many things i wld love to try but dont even have the time and energy to do them. ",
      "comments": [
        {
          "text": "This my guy, is the cycle of life. Not just life in Singapore. We eat, sleep, wake up, work, reproduce, age and die. Even if you go live in some kampong where life is simpler, without the work, the cycle still goes on. Hobbies are just meant to spice the cycle up, the cycle must continue. How you live your day is how you live your life. Try something new occasionally! Maybe you will feel more refreshed.",
          "score": 267
        },
        {
          "text": "I always feared that my life would amount to nothing because it's just work &gt; sleep and repeat. But once I accepted that there's nothing wrong with just existing, then I started to feel better. Learnt that from my cat. All she does is eat sleep shit repeat, and she's more content with a rubber band than all the expensive toys I buy her. Haha ",
          "score": 205
        },
        {
          "text": "Eat, piak, sleep, repeat.\n\nWe work to increase the quality of the three activities",
          "score": 56
        },
        {
          "text": "Depends on your own personality. We are ultimately just staying on earth and whiling our time away until we pass on. \n\nI established when I hit my thirties that I'm inherently lazy and a relatively unambitious person and that my purpose in life is to savour life. So I will work enough to enjoy my lifestyle of travelling, serving community, eating well, living well, with the ultimate goal of having a good time on my own terms. I won't work for more beyond that or push myself to a point of success to get filthy rich or famous, because it doesn't make me any happier. \n\nBut you might be someone who enjoys building something, be it career or a hobby. Eg starting a new area of business for your firm. Then that's something you might push for. Or you want to have children and bring them up.",
          "score": 55
        },
        {
          "text": "You complain about doing the same thing over and over again. Yet you continue doing the same thing over and over again. That sounds like a you issue. Life is what you make of it. Participating in hobbies and interests should be easy because they are things you should look forward to. Unless you are working ridiculous 100+ hour weeks, \"Don't have time and energy\" is a pretty weak excuse to not do anything (especially if you don't have kids yet).",
          "score": 24
        },
        {
          "text": "My colleagues always go japan leh.",
          "score": 23
        },
        {
          "text": "There is no meaning to life. We just exist. \n\nBut it does not mean we can’t create happiness and memories during our stay here. \n\nIt’s the mentality. Most of the people don’t go out on weekday’s nights, thinking needing to work the next day. \n\nAnd when weekends come, they thinking they need to recharge for next week’s working days. Hence life becomes stale and uninteresting. \n\nGo out and meet friends for dinners on weekday’s nights. Go for dates. Don’t stay at home, couch surfing. \n\nJust move. You will find the time and energy.",
          "score": 16
        },
        {
          "text": "Life has no meaning - it just about experiencing things and if it interests you, make life better for others. \n\nRoutines get boring because it’s always the same. Law of diminishing return. But you’ll also realise there’s a benefit in routines - it keeps things in order. \n\nRegardless of what you’re doing, doing it everyday makes it lose flavour to varying degrees - be it going on holidays or working or sleeping whatever!",
          "score": 8
        },
        {
          "text": "I always thought that I would love family life like getting married, having kids, stable job, etc. But after I achieve all those, life is boring and falls into routine like you mentioned. Do I regret getting married and having kids? Kinda. But I'm pretty sure I'd be regretting family life if I didn't have one. Just enjoy your current moment and try to do something exciting every now and then!",
          "score": 8
        },
        {
          "text": "If we tend to do things conscious and consume life like a child, life journey is magic!  Not a cycle.",
          "score": 6
        },
        {
          "text": "Life is just full of routine: Like we essentially just sleep, wake up, eat, work/play, eat , work/play, eat and sleep.  \nBut we can't stop doing it because we need to do it to stay alive.   \n\n\nWhat we can do is to find our own meaning to life.   \nIf you enjoy learning new things, then spend time to learn new things.  \nIf you like exploration, then get out and explore the world.  \nWhat you choose to do in the \"work/play\" session is what makes a difference. \n\nIt is true that the standard life is   \nStudy &gt; Get job &gt; Get Married &gt; Get House, Have Kids.  \nBut you have to ask yourself if you want to follow the conventional. \n\nI'm kinda only missing the last step but my partner and I do not want to have a kid. So we'll just slaving away for holidays / hobbies / retirement plan.\n\nI'm not sure why do you not have time to do your hobbies. Does your job require you to OT? Or are you part of the sleep early gang? If work is draining you till the point you have no energy to do other things, maybe you should change your job / company. \n\nEveryone have the same 24hrs. so if you don't have time right now, you got to identify where did your time go to and how to make time. \n\n  \nFor me, I go for dance and pilates after work on different work days. (I end work at 6PM)   \nFor me the trick is; \n\n1. Find a studio that is either close to work or home.  \n2. Head to the studio immediately after work.  (I mean if you got time to add in dinner then feel free to add in. But I usually eat after my classes.)\n\n\n\nPS: Usually no one likes weekdays because of work but because of my arrangement, I'm actually looking forward to weekdays cause after working I GET TO DO WHAT I LOVE &amp; ENJOY. \n\n  \n",
          "score": 5
        },
        {
          "text": "No, it's just you.\n\nThe problem with you along with everyone else here is that nothing you mention is directly force onto you to do anything. You seem to have forgotten that you have free will to do what you want yet you simply continue to perform what society expects of you. Deeper meaning? No, nothing will make sense in the end because meaning in life is not randomly assigned like one day you'll wake up with sudden epiphany. Meaning in life comes from how you choose to live your life and the way you choose sounds like you have done nothing to choose by simply let others choose for you. \n\nYou are running because everyone else tells you to run instead of choosing where to run.\n\nHalf the people here assume that the only way to enjoy life is getting rid of everything and having 100% of your day to be able to focus on your hobbies but that is not true. I don't understand why people rush from home to work the back home then complain there is no time, what do you guys do between 7pm and 11pm? Just sit at home and do nothing? \n\nRecovering and preparing for the week on your weekends? Are you telling me you spend 48 hours, sitting there in intense meditation to survive the work week like its a 5 day marathon running 100km each day? At some point I am convinced that everyone has convince that work is literally the worst thing that can happen and you believe it making life harder. Is work fun? No but the mental attitude you have towards work is extremely important. You don't have to love work but chanting to yourself day in day out that work is hell work is terrible will make your life terrible. \n\nI don't know how hard everyone's work is, but if your job is confined mostly to a desk bound job, consider yourself lucky. Your tiredness is entirely mental, not physical. It's all about how you choose to handle your mental status",
          "score": 5
        },
        {
          "text": "u have just written the script for an NPC, and to be honest, most of us are NPCs.  \nsay, somebody suggests, \"travel around and immerse yourself in different cultures. not just 2-3 weeks in Europe kind, but travel and stay for a year or 2. experience life differently,\n\ngo be a monk for 3 months. marry somebody, then go on a side quest, cheat and try not to get caught. go to jail and see how life is like on the other side but don't get killed. fund an orphanage, be an influencer, adopt an elephant and raise it from young, have an MRT station named after you by winning an olympic gold medal and donating all the winnings..\n\nwould u do that?\n\npeace is underrated. it is like passive investment. 10% CAGR over the next 20 years. boring but peaceful.\n\nquestion is, what do u want to do with ur peace?  \nthere is no shame being an NPC, but it is incredibly delusional and frustrating to live that script, thinking that u deserve a different outcome.",
          "score": 4
        },
        {
          "text": "I think this is when the reality hits you? you probably thought your life will be fun and games just like studying but this is the reality. Every one just trying to earn a living here",
          "score": 3
        },
        {
          "text": "Lots of time for hobbies cos single, no job and little responsibilities. Fortunate enough to have a healthy body though I'm jaded about life and the future. ",
          "score": 3
        },
        {
          "text": "Well technically we exist only to have sex and reproduce but we are \"cursed\" with a long lifespan and \"sentience\". So just do whatever you want. Man has created a lot of things to pass time so just pick what you interests you!",
          "score": 3
        },
        {
          "text": "Honestly i dont believe life has a deeper meaning. You need to find contentment within yourself. Time is how you make of it. For me that's after work and weekends. ",
          "score": 3
        },
        {
          "text": "Reminds me of this meme\n\nhttps://youtu.be/AfgL9Y1O1ko?si=asjzTQJk9Ga9SVV7\n\nIt isn't uniquely Singapore. Such is life.",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1r0v2cp",
      "subreddit": "askSingapore",
      "title": "To those who waited for MOP before divorcing, how did you stay sane?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r0v2cp/to_those_who_waited_for_mop_before_divorcing_how/",
      "score": 184,
      "num_comments": 175,
      "created_at": "2026-02-10T16:10:54",
      "selftext": "Unfortunately, I have lost love for my husband and no longer see having a future with him. I currently have about 3 years till MOP and financially I am not in a place to move out due to the loans we have combined. Somedays are difficult when we are home together but thankfully, we are still somewhat amicable as he is a nice person and I still see him as a good friend who  supports me work wise since we work in the same field. \n\nHowever, I feel like soon I will go insane waiting for my freedom. I feel like I am unable to do things like a single person would just because I am still married. Like if I were to ever meet someone new one day, will I be accuse of cheating by people around me who don't know what's going on in my marriage? I do want children of my own, but with the situation I'm in, I will have to wait a few years at least. \n\nIt also sucks that I have been avoiding friends and family because I don't know how to approach the topic whenever they ask me why my husband isn't around during meetups. Only 3 people in my life are aware and I feel like a bother every time I need someone to talk to.\n\nI have tried keeping myself busy with work outs, planning travels and work but at the end of the day I feel so empty. \n\nWould love to hear from anyone who went through or is going through this. Thanks!",
      "comments": [
        {
          "text": "I wouldn’t know the full situation, but it sounds like a trade between money (your loans) vs years of your life when you’re in your prime… I think the lost money is acceptable if that’s an option.\n\nThree years is a very long time to develop new friendships, find a new partner, and find yourself again. Imo putting it off will irreversibly take a part of you away, so much so that I feel that most people will carry that bitterness with them for a long time. I hope you find the courage to do what you need to do!",
          "score": 258
        },
        {
          "text": "so.. u see him as a good friend, how does he see u? if its also as a good friend, why would he be against his good friend seeing somebody new? ",
          "score": 79
        },
        {
          "text": "Is relationship hostile ? \n\nIf not what's different from having a housemate ? Hi bye, text when you need rents / share bills / need minor helps. \n\nOr is it because you are itching to date the next guy and take them home now? Then hotels? Short trips to batam or johor ?",
          "score": 60
        },
        {
          "text": "Open relationships are not illegal and don't void your HDB privileges. Just openly tell people your situation and start dating??",
          "score": 51
        },
        {
          "text": "Just curious, was there a drastic difference when u both were dating vs after marriage? Why did u decide to marry this person?",
          "score": 26
        },
        {
          "text": "Redirection to develop your career. Chiong numbers for 3 years. \nI think the toughest part is how to manage family gatherings. Which you guys have a talk it out.",
          "score": 24
        },
        {
          "text": "Wait.. does your husband know???",
          "score": 23
        },
        {
          "text": "Just make it clear that you are getting a divorce? Maybe get some paperwork done to show you are already in the process, and make it clear to whoever you want to date. ",
          "score": 21
        },
        {
          "text": "Life is too short to wait for MOP\n\nPretty sure you can write in if you are divorcing",
          "score": 15
        },
        {
          "text": "If both are sure this is the end of the marriage, get a separation agreement in place. Have it mutually agreed upon that both parties will live separate lives and have the option to date. \n\nOnly date or move forward if you are sure that it is the end of your marriage!",
          "score": 13
        },
        {
          "text": "Pls don't mind me giving advice here..but since  you and your husband have agreed to separate before divorce, it'll be good to have an agreement regarding the starting date of the separation because there'll be a need to have a separation period of 3 years minimum before applying for divorce anyway. \n\n41M divorcee here. My ex-wife wanted a fast divorce in 2020 so she backdated our separation to 2017 and I agreed on it because I didn't want additional drama for my children.",
          "score": 12
        },
        {
          "text": "3 years is a damn long time. If you have minimally 2 bedrooms I would just have an arrangement with the husband to live separate lives like house mates and lay down ground rules for dating others. \n\nI have a friend who is in your situation but she met someone new and got a job overseas so now she’s living out of SG while waiting for her MOP. She is still legally married to the “ex”. From what I know he also has a new gf and is living in the house (paying the mortgage on his own). I’m not sure how they’re gonna split the financial part once the house sells though - this is dependent on the rs dynamic",
          "score": 9
        },
        {
          "text": "I feel like it's a good situation if it's amicable for you both at home. Much better than most housemate (or even family) situations and people get through it. \n\nThen it comes down to determining what exactly gives you this 'stuck' or 'driving you insane' feeling. \n\nIf it's dating, you pretty much have to tell the person you meet since it's a first test of shared values. The person must be able to see this as \"good on you, MOP sell that's money for you/our future\" instead of \"eee live with soon-to-be ex-husband, weirdo\" \n\nIf it's the meetups, wouldn't \"he's busy with work\" or \"he doing his own stuff\" suffice? There's no rule for married couples to be permanently joined at the hip. Better yet...why not just the truth?\n\nApart from shouting it to the authorities (no-no) why should it be seen as something shameful? And a source of guilt/judgement? It is what it is, you should be able to still live your life. \n\nIt feels like it's a mindset thing that's holding you back from living fully for most of these. Though yes the delayed timeline not being able to have kids until actual divorce does quite suck.",
          "score": 8
        }
      ]
    },
    {
      "id": "t3_1r0yi3a",
      "subreddit": "askSingapore",
      "title": "What do you miss about the old Singapore ?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r0yi3a/what_do_you_miss_about_the_old_singapore/",
      "score": 176,
      "num_comments": 167,
      "created_at": "2026-02-10T19:41:33",
      "selftext": "Maybe it's just me getting older, but lately I've been feeling deeply nostalgic for the Singapore of my childhood and teenage years.\n\nI miss the slower rhythm of life in the 90s before smartphones took over. Hanging out meant actually talking or playing outside……there was less distraction, less rush. Everyday interactions felt more genuine, with less tension and conflicts.\n\nI also miss waiting for the 7pm or 9pm Channel 8 dramas after school, which the whole family would gather to watch.\n\nThe classic Jackie Chan / Stephen Chow  movies and other shows that aired during CNY, Saturday morning cartoons… and the list goes on…\n\nWhat do you miss most?",
      "comments": [
        {
          "text": "Less people. Felt like I actually have space to breathe. People were nicer back then.",
          "score": 168
        },
        {
          "text": "Everything. Especially the lower temperatures and people being more present in the moment.",
          "score": 125
        },
        {
          "text": "Less crowd, more fields and greens",
          "score": 53
        },
        {
          "text": "I miss it too. Was born in the late 80s but I miss everything. The funny hairstyles, the fashion, the skyline, the architecture, orange phones, the snacks, the togetherness, the movies… (Teenage Textbook, Forever Fever) Pyramid Game was cheesy but gimme it any day\n\nSometimes I have to look at some heritage pages on FB. I look at it with longing. Would give my smartphone and laptop to go back to the older days…\n\nWish I was born in another era.",
          "score": 50
        },
        {
          "text": "Less people bro. You could sit anywhere on the mrt during off peak hours.",
          "score": 47
        },
        {
          "text": "Miss the days when we still can feel like Singaporeans rather than in a global corporation",
          "score": 42
        },
        {
          "text": "Miss the childhood time when everyone are more real. Friends making are easy and pure without any intention. Now even people come say hi you have to think twice pretend before going deeper into friendship.\n\nPast is the day we have real kampung spirits where even adult they help one another.\n\nNow what we have replace is singkie pawn singkie mindset. I get promoted i need to block all singkie make sure they look bad. I suck up to the top. \n\nWe change from encourage to criticised others. Eh what job u hold. Eh why u nvr buy condo. Eh why u take bus.\n\nWe keep say Singaporean identity did not change. Yes our kiasu kiasee nvr change but a lot of our helping spirit simply vanish and  what take over is competitive and selfishness.",
          "score": 38
        },
        {
          "text": "Nowadays even 5pm feels very crowded to get home. \n\nWish commute is a happy matter. \n\nIt's way too crowded and stifling.",
          "score": 28
        },
        {
          "text": "I missed the 1st version of mcspicy",
          "score": 28
        },
        {
          "text": "the old filet o fish in the blue wrapper",
          "score": 25
        },
        {
          "text": "Less crowd less humid less competition",
          "score": 17
        },
        {
          "text": "Playing football under the block. Playing block catching. Playing slipper rounders and using the plastic ball. I remember collecting and playing those styrofoam 2D airplane or birds. Playing hopscotch at the back of my school, at CCs. \n\nI remember during Chinese new year, my neighbours would come over and gave us oranges and pineapple tarts while we would return the favour with rendang and ketupat on Raya. I would stay over their place after school because their grandson had those M.A.S.K crusader toys, the one where the motorbike could change to a helicopter and the car to a pseudo flying car. \n\nI stayed in Bedok, so I remember seeing the huge construction all along upper changi road and Bedok south for the MRT stations. I remember bus service 226, which was just a short stint from the bus interchange to Bedok reservoir. I remember that long ass walkway from the interchange to the newly built mrt station, with pirated CDs and roasted chestnut uncles peddling their wares. Even saw a few Banglas selling mangoes that they picked from the various mango trees that gov planted hahaha. \n\nI remember climbing the big hill between Bedok and Tampines, the one that was beside the now defunct ITE Tampines. I remember riding my bicycle from my primary school to the reservoir, riding all the way up the hill where Home Team chalets are now. Was a good... Hiding place to chill (no netflix that time) with your crush and having almost zero prying eyes ( I mean your buddies would be coming over to 'check' on us lol ). \n\nI remember playing Streetfighter at the uncle shops under the block. All of us would take turns, winner stay. My fav char was Akuma. I remember skipping my tuition classes at Parkway Tower and basically spending time and money at the arcade playing Soul Caliber. \n\nI can still hear that distinctive buzzing sound when you want to connect to the internet at home, and the frustration when you realise mid game that your mum was on the phone with her work kakis.\n\nI remember the time when the boys in school would have that sharp pointy comb, while the girls would have 'cockroach' feelers for their hair. From 3310 to 3315 to razr. Creating midi ringtones, downloading them, seeing who had the highest snake points.\n\nFrom Northstar to Converse to Vans. Legit had street cred if your shoe was not white, while trying to hide it from your teachers. Using socks with logos but hiding them by folding them and unfolding them when sitting on the bustop railings, whistling to the girls from other schools. \n\nThose were the days.",
          "score": 13
        },
        {
          "text": "Game arcade, 1 token of dungeon &amp; dragons / time crisis etc.",
          "score": 11
        },
        {
          "text": "People don't talk about 65% and 35% every single day.",
          "score": 11
        },
        {
          "text": "Orchard Road was so much livelier. Rmb the cine kids days?",
          "score": 10
        },
        {
          "text": "Sg was WAY LESS noisy. I'm on the autism spectrum and I struggle with noise sensitivity. I didn't struggle with noise in sg in the 90s because it wasn't so bloody overwhelming. After the late 2000s, things just started getting worse. I left the country for a while and got back and now, everything is so loud and noisy and just in your face. It's not just the constant construction, there are way more people here now. Many more people, vehicles, activity, and way more noise.\n\nBut also I miss the Singapore where there were WAY more Singaporeans than foreigners. We're now barely half the population (3.6m/6m)",
          "score": 10
        },
        {
          "text": "Miss the before in car cam footage saboing. Also pre-STOMP days where every single thing people paotoh for hearsay $50 ntuc voucher lol",
          "score": 10
        },
        {
          "text": "Pasar malam",
          "score": 9
        },
        {
          "text": "Lots of places to sit and hang out with your friends. You can sit in malls, outside malls, staircases in and around the malls. There was less pressure and even just a day out with a friend ends with an enjoyable bus ride home. \n\nTV programs back then gave us lots to talk about and it felt like we had a little bit of our own culture in the form of the songs, variety programs and documentaries.",
          "score": 8
        },
        {
          "text": "Life was simpler back then. We really had fun with our friends, did tons of stupid things and not worrying about becoming famous overnight.\n\nTechnology may have improved, we get news and info at our fingertips but we no longer have as much fun as the past from what i feel.",
          "score": 7
        },
        {
          "text": "Don't know if its the age that I miss or the actual environment. Mistakes just weigh less before, no need scared to be cancelled or do something embarrassing and end up on the internet",
          "score": 7
        }
      ]
    },
    {
      "id": "t3_1r0yosk",
      "subreddit": "askSingapore",
      "title": "Those who left Singapore - what are the big unexpected adjustments you had to make? Any regrets?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r0yosk/those_who_left_singapore_what_are_the_big/",
      "score": 144,
      "num_comments": 111,
      "created_at": "2026-02-10T19:51:52",
      "selftext": "Hi, the post title says it all. I appreciate Singapore for many things (truly) but it has become a very stifling place for me. I’m currently exploring options for living abroad (finding a job, etc). I do think though that I’d miss aspects about living in Singapore - there are the obvious ones like convenience, efficiency, social circles, and even taxes. For those of you who moved abroad, how did you adjust? I have lived abroad before as a student, but that’s a relatively different context (no taxes, living in school dorm with friends which largely eliminates loneliness, etc). \n\nWhat have you found to be most useful in your process of moving overseas - eg why did you move, how did you decide on the country / city you’d like to move to, how did you adjust to life there? What were the biggest surprises (positive &amp; negative)? Any regrets? ",
      "comments": [
        {
          "text": "Moved overseas after SG and the biggest surprise wasn’t “no chicken rice” lol, it was **how much mental bandwidth SG saves you**.\n\nIn Singapore, life is frictionless: transport, food, admin, safety, delivery, everything just… works. Overseas, basic errands take longer, things close early.\n\nAs a working adult, you don’t get friends via school/class/NS pipelines. If you don’t actively join communities (sports, volunteering, classes), it can get lonely in bursts.\n\n  \nI miss SG convenience a lot… but I also feel less “compressed” day to day. Trade-offs, but worth it for the right personality.",
          "score": 319
        },
        {
          "text": "Cooking at home almost everyday as there is no hawker centre equivalent in London. Probably a very close equivalent would be supermarket meal deals but not a fan of cold sandwiches all the time. \n\nAlso how big this country is, and how expensive trains are 😭\n\nAlso the weather. Things go on even when it's raining/drizzling and we just wear waterproofs and still go out. And most community swimming pools are indoors, not like the SG swimming pools.",
          "score": 77
        },
        {
          "text": "I think the biggest adjustment is my opinions on **money and accumulating wealth**.\n\nIn Singapore, I was like a squirrel. Always have to save money and earn more money, had a huge investment portfolio goal because of the pressure that comes from our high COL. Once I moved overseas, I learned to let go of wanting to be rich due to fear of not being able to keep up.\n\nOf course good financial habits still need to be there, but I have re-adjusted my take on money and it is liberating a bit to have more breathing room and an option to live life differently.",
          "score": 64
        },
        {
          "text": "I moved to a lower cost of living SEA country because I work remotely and want to cut down on cost of living. I really miss the healthier choice thing the SG govt came up with. The food and drinks here are overly sweet, salty and oily",
          "score": 47
        },
        {
          "text": "I moved to live in USA for 2 years and I truly miss home. \n\nIn sg, safety is highly highly underrated. You can use your phone and nobody is going to snatch it out of your hand. You don’t have to be on high alert all the time.\n\nTax is not only an insane amount in USA, but they just fine you if you fuck up your submission.\n\nYou need to use your brain for many things. \n\nRenting, transport, figuring lots of shit out. Our govt has simplify all of these for us it’s like “sit in thie car, follow the route and just drive”.  \n\nThere’s also a lot of sexism in the states (as much as people don’t want to admit it) so I understand the feminism. I won’t deny Singapore is completely free of it but at the very least, it’s not as bad as overseas.",
          "score": 44
        },
        {
          "text": "I moved to the US over a decade ago. No regrets. I have a big house and a big yard. Get to enjoy my weekends in nature. People here are much more community-minded and will look out for a fellow stranger. The biggest thing I miss about SG is hawker food, which is cheap and delicious. And family and friends, of course. But I go back home every year for visits and I am reminded why I don’t like modern SG. I’m only nostalgic for old SG, which no longer exists.",
          "score": 34
        },
        {
          "text": "Moved to the US. What surprised me was how much more free time I had. That’s because in SG, a lot of free time was spent commuting, whether to and from work, ferrying kids etc. Still do it here, but it just takes a lot less time and they get more sleep and time to do extracurriculars.\n\nThere’s also a lot more product conveniences to make your day-to-day frictionless. It can be as simple as the wide selection of pre-washed veggies, paper towels that split in half, though not in the digital realm. Nature is a lot more varied and very accessible but that’s geography dependent.\n\nAlso, it’s hard to get used to the taxes here… filing was so much easier and less financially painful in SG, but I guess you pay for it in other ways. Also gives you an appreciation of SG’s digital conveniences—FAST transfers, medical forms (filled out at least ten pages of paper forms here).\n\nOverall it has been better for us, just trade offs",
          "score": 27
        },
        {
          "text": "I’ve been abroad for 6 years in different counties with work; left when I was 26 and just after less than 3 years of working in Singapore. It was a really interesting journey as I see myself adulting through the 6 years in ways I’ve never imagined myself to if I were to continue living in Singapore. I’ve never wanted to leave Singapore all my life but now I would definitely choose it all over again. At times it is really tough but the personal growth and development are pretty much unexpected and very worth it.\n\nI found myself to be more of myself abroad, not conforming to societal norms. However with this I’ve also unexpectedly found it harder to connect on the same wavelength with friends and families back in Singapore as we have different mindset and perspectives now.",
          "score": 26
        },
        {
          "text": "Being close to and having a view of nature is a big plus, as compared to looking at other HDB flats, carparks or roads… I do miss cheap hawker food sometimes but cooking is so much better for my health overall. Having seasons is also amazing and super exciting!",
          "score": 19
        },
        {
          "text": "I moved cos I want to live with my spouse.\n\nBeen living in China for 2 years plus. Really dislike living here. The people. The food. The weather. Can't work as I don't have work rights. No friends here either. I used to go back to Singapore every month. The flying was crazy. So last year I went back like 4 times. But the first visit was for like 3 days only. No social life? No choice but to bear with it. Luckily spouse is very understanding and doting. Will bring me out every weekend (one day).\n\nWe'll be moving (back) to Australia this year. I don't particularly like living in Australia. It's not much of a choice cos my spouse won't be able to get a job in Singapore. The ageism in workplace in Australia ain't as bad as Singapore. But we have another issue, racism.\n\nI was telling my spouse that perhaps when we retire, we should move (back) to Singapore. Eons ago, spouse didn't want to live in Singapore.  But spouse has been to Singapore quite a few times over the past 2 years and is now open to living in Singapore.",
          "score": 18
        },
        {
          "text": "Transportation was a huge issue for me. I moved to a very car-centric country and public transportation was very… unpredictable. I ended up having to start leaving home super early. I did end up getting a car a few years later and it was a game changer.",
          "score": 17
        },
        {
          "text": "I'm living in Taiwan now\nSalary is lower here but so is cost of living\nThere's always trade offs",
          "score": 9
        },
        {
          "text": "Moved to the US. 0 regrets, but no place is perfect. the USA is amazing if you like nature, space and meeting people from various world views. Specially in large cities - the breadth of experiences and viewpoints are mind expanding, specially coming from a society like Singapore. Another thing about the US is upward mobility - if you want to hustle, you can achieve great things based on just merit. I have lived in many parts of the world, and US is the one coutnry that truly rewards hard work and hustle.\n\nbut i loved my life in Singapore. I particularly miss the convenience, the quality of the public transit network and the weather :) But no place is perfect!! Neither the US nor Singapore",
          "score": 8
        },
        {
          "text": "The food and safety.",
          "score": 7
        }
      ]
    },
    {
      "id": "t3_1r0zjy3",
      "subreddit": "askSingapore",
      "title": "Those who travel 1 hour or more across SG to get to work every day, what pros/cons are there?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r0zjy3/those_who_travel_1_hour_or_more_across_sg_to_get/",
      "score": 132,
      "num_comments": 99,
      "created_at": "2026-02-10T20:35:38",
      "selftext": "Not everyone gets WFH or hybrid arrangement. For those who travel 1 hour+ (total 2 hr+ back and forth), what are some factors in your job that make it worthwhile despite the long commute? Or is it all just bad?",
      "comments": [
        {
          "text": "The salary",
          "score": 271
        },
        {
          "text": "If the pay is $100k per month, I will sit my ass down the bus to and from Changi to Tuas every single day.",
          "score": 263
        },
        {
          "text": "Pros: many places are on the way home so if you need to stop by it’s along the way.\n\nCons: literally everything else. Not enough sleep, not enough time. Dinner has to be eaten alone near work as by the time I reach home it’s too near bedtime. Every errand needs to be done on weekend or take leave. It’s hard to maintain relationships with friends and family as you don’t get to see them much.\n\nThe commute is also very draining as I don’t get a seat and have to stand throughout while the aircon barely works on MRT these days",
          "score": 83
        },
        {
          "text": "pros - not starving to death.\n\ncons - still not making enough to prevent starving.",
          "score": 83
        },
        {
          "text": "Im a bus girl so that journey allows me to complete my Spotify playlist. Meeting up with friends can be strategic too. Pick somewhere along your home route so you “cheat” by halving your commute time lol \n\nOnly con is if late grab very ex \nIf location is ulu and you end work late hard to get grab home",
          "score": 61
        },
        {
          "text": "i get to have niche knowledge of the layouts of random parts of singapore that i would never step foot in otherwise.\n\nand i love eating so its great to find random gems or being suddenly in reach of famous food places you otherwise wouldnt go on your own time. \n\nalso my tips for jobs with long commutes is try to find one where at least its near the train station, if you need to take bus to get out of your estate to mrt station. cause doing bus-mrt-bus is really shag.\n\n i feel more tired traveling 1.5hrs doing bus-mrt-bus compared to the same amount of 1.5hrs doing bus then mrt",
          "score": 34
        },
        {
          "text": "I did it for a few years, five days a week. I was super tired everyday. Affected my mental health. Not worth it at all.",
          "score": 33
        },
        {
          "text": "Good bosses, nice coworkers, good working environment.",
          "score": 25
        },
        {
          "text": "The pros is the salary. I probably can buy a car, but I tried driving once and it only saved me only 10 mins. And that didn’t include the time for parking. Anyway taking public means I can spend 1 hour reading everyday. I finish one book every 2-3 weeks. \n\nThe cons is definitely have to put up with crazies occasionally. Just today saw this aunty pick a fight with old uncle because he placed his bags on the seat.",
          "score": 19
        },
        {
          "text": "Bc i live in cck, its normal that my commute is long. Im used to it.",
          "score": 16
        },
        {
          "text": "I stay west but office in east. But I love money so I will keep working!!",
          "score": 12
        },
        {
          "text": "I live at the end of the EW MRT line and I work in finance which means CBD so kinda no choice there. Also, I started work during a time where there's no WFH so I guess I got used to it anyway. I do appreciate that it is less crowded where I live though so somewhat away from the hustle and bustle.",
          "score": 11
        },
        {
          "text": "I used to commute 1.5h one way, now my commute is 1h one way door to door and i feel this is my sweet spot! Personally like having the physical distance between my home and my workplace, i.e. work area is generally somewhere i will not travel to except for work, as this helps me mentally compartmentalise work from play. One of my past workplaces was connected to a shopping centre I used to visit for leisure and now that place is forever tarnished in my mind, haha. this is a very unpopular opinion but i’m also someone who doesn’t particularly enjoy wfh, because i dislike work encroaching into my rest areas. Maybe it’s where I live but I typically give myself about an hour to get to most places anyway, so a 1h commute to me is not a big deal.",
          "score": 8
        },
        {
          "text": "Flexible time. \n\ni.e. Can start anytime; finish any time. As a person supporting region and HQ in USA, work is spread over the day. So enjoy the not so crowded public transport before 0630 and got to spend a bit of time with my daughter too; then return in early afternoon; Take breaks in between and another couple of hours work in the late evening. ",
          "score": 7
        },
        {
          "text": "It’s all cons. Reducing travel time to work is seriously one of the best investments in mental health.",
          "score": 5
        }
      ]
    },
    {
      "id": "t3_1r0xh3y",
      "subreddit": "askSingapore",
      "title": "does “report 15 mins early” count as paid time?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r0xh3y/does_report_15_mins_early_count_as_paid_time/",
      "score": 106,
      "num_comments": 94,
      "created_at": "2026-02-10T18:43:13",
      "selftext": "worked for a company as a retail assistant being paid $13/h. i was asked to report 15 mins early for every shift at 1045am. timesheet came out today and i was only paid for work done between 11am and 7pm.\n\ntechnically between 1045 and 11am, i did do work because i had to check on admin matters within the shop which really only took about 5 minutes. afterwards, i would immediately start serving customers at about 1050am.\n\nif this counts as paid time, how do i go about raising this to the employer?\n\nedit: wont be raising this issue as i’ve seen now that its the norm. i’ll just suck my thumb and look for jobs that align more with my interests. in that case, ill enjoy working and wouldn’t really mind the 15 mins early reporting time. (if there is a need for it)",
      "comments": [
        {
          "text": "No, normally is to ensure that you are on time for the actual working hours. Buffered time",
          "score": 160
        },
        {
          "text": "Feel free to take a 15min shit during work hours to makeup for it",
          "score": 120
        },
        {
          "text": "First time working retail? This seems fairly common in the retail space.",
          "score": 54
        },
        {
          "text": "The answer is don't.\n\nWhile I can't say about retail, because I was in F&amp;B, the answer is that I would show up 5-10 mins early to prep myself but only start working at the stated time.\n\nYou kind of have to be smart about it. Got to make yourself look buy without actually being busy before you start your work. A lot of you young'ins need to realize that work is not school, just because your boss demands you, you don't need to treat everything like it's the law. You have to know where you can push your boundaries without being annoying.",
          "score": 34
        },
        {
          "text": "if i were you, i wld js go for the normal time and not really come in 15 mins earlier\n\nmaybe 5 mins earlier only. If you can't do that, then after doing ur admin things, go for a toilet break for 7 - 10 mins",
          "score": 29
        },
        {
          "text": "Depends, do you actually start work then?\n\nIt’s micro management really. If you’re starting work then, absolutely it’s paid time, otherwise it’s wage theft. I don’t care how normalised it is here, it is what it is.\n\nWith that said, use this as your motivation to get out of that work sector.",
          "score": 16
        },
        {
          "text": "I usually report early but *not do anything* until my time start.",
          "score": 13
        },
        {
          "text": "No",
          "score": 8
        },
        {
          "text": "I've been in such \"must report early\" and \"must go home late\" jobs since I started working back in 2001. Honestly hor, being calculative openly with boss will only cause boss to become calculative right back at me so I don't start that vicious cycle. Like if I complained about 15mins extra work then my boss will start using stopwatch to track how many minutes I go pee/poop and gather evidence against me. What for I wanna start such a vicious cycle and cause myself more pain?\n\nYou know hor you can silently go into human-screen-saver-mode without being spotted by boss during working hours if you feel you are overworked. This is a skill called \"Act Yi Ge busy\". When boss walks past you, you must appear super busy, at other times you go into human-screen-saver-mode.\n\nAll jobs will have some preparation time that isn't paid. The worst I encountered is not even in retail, it is MOE teacher must use personal time to mark students' homework, do lesson plans and communicate with parents... that is many hours and including weekends burnt.",
          "score": 8
        },
        {
          "text": "Nope, get use to it",
          "score": 8
        },
        {
          "text": "You can take the 15mins out from your work time by going to the toilet, pretending to be busy, keep repeating your chores",
          "score": 5
        },
        {
          "text": "Nope..",
          "score": 4
        }
      ]
    },
    {
      "id": "t3_1r0yzl6",
      "subreddit": "askSingapore",
      "title": "Is it un-filial if you reject your parents to drop by during weekdays after work?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r0yzl6/is_it_unfilial_if_you_reject_your_parents_to_drop/",
      "score": 76,
      "num_comments": 70,
      "created_at": "2026-02-10T20:06:53",
      "selftext": "I might be trying to get some agreement or tractions on this, not sure if there’s anyone else facing this issue as well. but do correct me if I really sounded badass..\n\nI have moved out from my parents home since 2 years ago, and have been visiting them once every 2 - 3 weeks. At times, my parents would ask me to drop by for dinner on weekdays after work, which I have been complaining that it is not on my way home. \n\nI am working at raffles place, staying at Pasir Ris and my parents are at Sengkang.\n\nMy younger sibling is staying with them. \n\nI have been visiting them for Sunday lunch at least once or twice per month, spending about 2-3hrs during each visit.\n\nMy parents had the idea that anywhere in sg = no on the way since it is accessible.\n\nThey remained firm in their stand and doesn’t see my point of view.\n\nI do feel hesitant to go back home tbh, as there is usually nothing for me to do except to engage in conversations that may not be amicable (usually with different povs on certain topics like marriage) or being forced to drink herbal teas when I have always rejected drinking them.. \n\nQns: is this normal for me to feel this way, and to those with assertive parents, how do you set clear boundaries and feel less guilty for rejecting them?",
      "comments": [
        {
          "text": "Invite them to your house 1-2 times a month",
          "score": 186
        },
        {
          "text": "i used to find them annoying when my parents were still around. Now i hate myself for not spending the time with them when I had the chance.",
          "score": 135
        },
        {
          "text": "\n\n\n&gt; My parents had the idea that anywhere in sg = no on the way since it is accessible.\n\nInvite them to your place at your convenience and see what they say about this.\n\n&gt; I do feel hesitant to go back home tbh, as there is usually nothing for me to do except to engage in conversations that may not be amicable (usually with different povs on certain topics like marriage) or being forced to drink herbal teas when I have always rejected drinking them.. \n\nHonestly, it’s your life and how you want to spend your time is up to you. You don’t have to feel guilty about not wanting to subject yourself to less than pleasant interactions.",
          "score": 68
        },
        {
          "text": "Wa bro the only thing stopping from moving out is my mom's cooking. Irreplaceable and ultimately comforting.",
          "score": 58
        },
        {
          "text": "As I grew older, I find the value in doing it. Priorities change, and I find that the extra few hours per week is worth it. I make it a point to do at least once a week",
          "score": 54
        },
        {
          "text": "Up to an individual family. Suggestion: Make it a habit to visit at least once or twice a week for a meal. My guess, They are just concerned that you are not eating well. Or just want to see their previous son more often.\nI visit my parents avg 3 times a week, open my place for a visit anytime.",
          "score": 26
        },
        {
          "text": "Hi OP! \n\nCan I suggest that perhaps your parents think you are not spending enough time over because the time is not really quality time?\n\nI have had better results when I try to create a project involving myself and parents. 3 successful ones are: 1. Chasing drama, 2. Growing houseplants, 3. Playing pickle ball.\n\nHanging out becomes more fun for myself AND parents.\n\nYou mentioned herbal tea and questions - this seems like a competence problem, as in your parents are trying to create common experiences or talking points but dont have the social competence to manage the parent child relationship. Unfortunately you might have to help them with that.",
          "score": 13
        },
        {
          "text": "Honestly I don't see how they're assertive at all. They're asking you to go back to their place more often for family dinners cos they miss you. You're only seeing them once or twice a month, most people I know meet up with their families every week for dinner. \n\n\nFor that one meal, they have to buy groceries, cook and clean up after you. Your herbal teas are also not cheap, they're doing it cos they're worried abt your health. Since your sibling stays there, they want to have family meals more often. You'd rather 3 people visit you then just you visit them? \n\n\nPasir ris and sengkang are so near each other. Just take a Grab back after the meal. Or maybe invite them to your place and prepare a meal for them (on a weekend maybe)\n\n\nTbh what more boundaries do you want? You want them to stop telling you to come back for family meals? To not contact you so often? ",
          "score": 13
        },
        {
          "text": "Not unfilial at all. You’re already visiting regularly, which is honestly more than many people do. Sounds like it’s mainly **weekday + travel fatigue** (same, I also hate travelling after work).\n\nAlso, sometimes parents asking you to “drop by” is less about dinner and more their way of saying they miss you.\n\nWhen you’re older, you’ll probably miss even the “annoying” parts. Trust me :))",
          "score": 12
        },
        {
          "text": "When they're gone, you may regret not seeing them more often. I myself see my remaining parent once a week, even if it's just an hour to drop by, bring them some fruits  or some good food I found. They appreciate that you made the time. Weekdays I am way too tired to do anything, but I make a real effort on weekends to just see them for awhile.\n\nIt is a blessing to still have parents.",
          "score": 11
        },
        {
          "text": "Honestly having my own place after marriage is the best thing so far. I don’t necessarily dislike being around my family, I just really enjoy having my own quiet space where I can be myself and relax. I have dinner with my own parents about once a week, either eat out at their place. Same with my in laws, but they tend to initiate more dinners so I see them more most weeks. If there is no pre planned dinner, I will initiate with my own parents at least once a week. Some weeks where I already have plans I don’t meet them at all. Like typical Asian households we never really sit down to “set expectations”, but I guess a personal “goal” is to set dinner once a week. Honestly I would be happy to have them over if they wanted to come over or asked to have dinner haha but if they don’t then I will take it as they have their own plans and are also busy. I’m not sure if perhaps instead of saying it’s too inconvenient, to say you’re tired and suggest another date to meet eg weekend?",
          "score": 8
        },
        {
          "text": "cheaper solution do a call with them on some of the weekdays after work like while preparing dinner or simply eating  \nsome of them just wanna see that u are really taking care of yourself nothing much plus some of their time might not left much  \nthing are unpredicted this morning I read an article about someone felt lucky he still got a chance to say good morning to his mum but in the late afternoon his mum suddenly passed on in the sleep",
          "score": 8
        },
        {
          "text": "It's up to each family, as each family has their own rules and setups.\n\nThe easy answer is to sit down and have a conversation to make it clear.\n\nBtw, Pasir Ris and Sengkang are in the same general direction and is a pretty quick drive up the TPE. It's not like one is in Pioneer and the other in Pasir Ris, - that would really be out of the way from Raffles Place. This is my case, traveling from Jurong East to Bedok, then back home to Tengah area when I have to meet my parents and in-laws. Wife and I still make it a point to visit our parents once a month for a meal.",
          "score": 8
        },
        {
          "text": "Hmm.. every family is different. So there is no right or wrong imo. Also, there is no need to feel guilty because everyone have their own ideal lifestyle and others should respect it.\n\nFor me, distance is a form of inner peace for everyone in my household and i've shared openly with my folks before i moved out. I have also shared that weekends are really short, some times we just wanna rest, so I can't really commit to a regular fixed meet up. So it has evolved to a — i have more time this week we could meet, otherwise next time.\n\nHave also been in situations, where my in-laws were very fixated on meeting every Sundays. Then at least 2-3 (sometimes 3-4) times impromptu during weekdays, and it eventually felt like us taking on a side hustle. Which really stresses me out, because there is no time for me to do my own thing, or to just rest. And the level of \"socialising\" is lowkey driving me nuts.\n\nEventually, we just reject and gradually, the whole sunday culture got abolished because all the other kids wanted time for themselves, and also started rejecting. 😅\n\nNow we basically all run 'own time own target', everyone seemed okay and happy tho.\n\nBut like i say, every family is different. But it's good to share your thoughts with your family and work around the situation.",
          "score": 7
        },
        {
          "text": "You have this internet’s stranger’s permission to not feel guilty. \n\nIt feels like your visits are done out of duty, and that you don’t have a very close relationship with your parents, and don’t feel you can open up about your thoughts and feelings with them. Hence spending time with them can feel like a strain to you, while others who have closer, warmer relationships with their parents may feel differently. I empathize because I also feel a similar disconnect with my parents. I think you are doing what you can given the circumstances. \n\nI think in the long run you will also have to accept that you are not going to be able to change them, and you’ll have to just let certain things go whenever they say things that frustrate you internally. And that will bring you more inner peace and calm whenever you do see them.",
          "score": 6
        },
        {
          "text": "Your parents miss you lar.",
          "score": 5
        },
        {
          "text": "I think you should have a heart-to-heart talk with your parents as to why you are not visiting them as often as they'd wished. You have chosen to move out, which clearly shows that you want to have your own life and live on your own terms? They need to understand that kids will grow up and have their own lives too. No need to feel guilty. ",
          "score": 3
        },
        {
          "text": "As an adult with aging parents..and recently became a parent myself...your parents misses you. Asians aren't good with words but action shows.\n\nI am happy to just co exist with them in the same space. Seeing each other still alive. Mentally sound, have food, tick tick tick.\n\nThe herbal drink....my grandma uses to do what they did. Shes gone now, I regret not drinking every herbal tea she made.",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1r0zwnu",
      "subreddit": "askSingapore",
      "title": "Joined a company for 2 days and the role is completely different from the JD. Can I leave immediately?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r0zwnu/joined_a_company_for_2_days_and_the_role_is/",
      "score": 66,
      "num_comments": 47,
      "created_at": "2026-02-10T20:52:20",
      "selftext": "So, I just started a new job 2 days ago and I’m already losing it. I accepted the offer based on a specific JD, but now that I’m here, they’ve completely switched my role to something I never wanted to do (and something I’ve always avoided).\n\nWhat’s even crazier is that the actual tasks I was hired to manage are being handled by a different colleague. \n\nI’m basically doing a totally different role than what was advertised and interviewed for. It feels super misleading.\n\nI have a 2 week notice period for probation. Since CNY is coming up, I was thinking about taking the holiday week (19-20 too) and then using MC to fill up the rest of the 1 weeks so I don't have to go back.\n\nI’m getting a massive headache just thinking about this. Is it okay to just leave? Is it considered rude or will I get blacklisted for this? I feel like they lied to me about the role, so I don't really want to stay at all.",
      "comments": [
        {
          "text": "Yes. Cut losses while it’s still early. \n\nI’ve learnt it the hard way - I fell for the bait and switch because of a 20% higher salary, but now I’m stuck in a miserable role and can’t get out without going jobless or starting over from a fresh grad salary despite having 6 years experience. I will happily take a 50-60% pay cut, but no employers will take me",
          "score": 112
        },
        {
          "text": "Just leave.",
          "score": 33
        },
        {
          "text": "Hi, HR here! \nTwo things you have to make sure of.\nOne: from documentation perspective.\nDid you sign an offer letter / contract? Was the role that you were supposed to be hired for listed as the role you signed? If yes, then you have all the reasons to leave and backed by documentation.\nTwo: from good faith perspective.\nGood Communication can go a long way. Trust me, with the rise of AI, we HR think that soft skills are getting rarer, like communicating. Speak to your manager and N+1 about the discrepancy of the role mentioned in the contract versus the role you’re doing now, and that you don’t think it’s gonna work and you’re willing to serve your 2 weeks notice. Most of the times, the wont need you to serve 2 weeks since you’re new and no use of doing 2 weeks job.\nHope this is helpful!",
          "score": 23
        },
        {
          "text": "Just a different perspective for your reference: unless the firm wants to use you for something fishy, it's in their best interest if you quit early during the probation before they spend too much training you. So don't worry about it, just tell them you don't like the job and ask for a graceful quit",
          "score": 20
        },
        {
          "text": "Some employers do not give paid sick leave during the first 3 months, so check on that before doing your \"use MC\" plan. Though I doubt they will make you give 2-week notice given you just joined.\n\nOther than that, it's better to cut your losses quickly - true for both yourself and the employer - if you are pretty darn sure it's not going to work out. It's possible they will blacklist you, but you ain't returning anyway.\n\nI resigned from my last job after 1.5 months, and I knew I was going to quit after day 3 because the company was a shitshow, just that I wanted to secure my next role first. Probably blacklisted by the company and cursed at by the external recruiter, but it is what it is.",
          "score": 10
        },
        {
          "text": "Yes cut and leave it’s ok.. I had a really nice lady join us for about 2 weeks and she vanished into this air.. I think she came to office really early and dropped her laptop and her pass and rejected all calls and texts.. she totally vanished like just vanished",
          "score": 9
        },
        {
          "text": "It’s normal. Interviewers will lie and jd will lie.",
          "score": 6
        },
        {
          "text": "Yes, okay to leave quickly if you feel like the job scope doesn't suit you. Personally  I feel like it's better to leave early then to stay on and drag because they spend time training you.",
          "score": 4
        },
        {
          "text": "Typical bait and switch. Check with HR if you need to serve your notice period and get the hell out of there.",
          "score": 4
        },
        {
          "text": "If you can prove that the JD is different from the role you are playing, please flag it out. We need a stronger workforce that doesn't pander to businesses.",
          "score": 4
        },
        {
          "text": "Of course! The probation is also for you to see if you are a fit, not just for the company to evaluate you.",
          "score": 4
        },
        {
          "text": "Omg i was in the exact situation last year.. not sure if it is the same company.. I tried to voice my concern with HR and hiring manager but i realized later that they did this on purpose to all the hiring, not just to my position. \n\nAnyway, I quit after 2 months as it was a total watse of time and really draining.",
          "score": 3
        },
        {
          "text": "I would say serve your notice period and run.",
          "score": 2
        },
        {
          "text": "I would say cut loss at earliest then restart job search while serving notice.. learnt that the hard way myself.. stuck out longer than I thought then end up also cannot put on resume as tenure too short for this particular stint\n\nAlso unlike what people are saying that you can cut short notice easily, it depends on the co also, sometimes they just don’t want you to leave earlier then you no choice have to serve also, unless you ok to buyout your notice",
          "score": 2
        },
        {
          "text": "happened to me before. I tried to shift roles by performing well and doing my best.  \neventually there was no role change and I quit. Wasted quite a few months of my life lol.",
          "score": 2
        },
        {
          "text": "Don’t be guilty. In my company before, I’ve had colleagues who left after 4 days, a week, 2 weeks and a month.",
          "score": 2
        },
        {
          "text": "Just tender with resignation letter , indicate your last day and leave. At least your notice period arent long and chances of you landing in another job is higher.\nI tendered after 4 months when the project i was hired for was so badly coordinated and the rush to complete despite so many misalignments that it gave me doubts if the project will succeed.  Totally demoralised and lost with the lack of direction from the PMO who is forever busy with other stuff but yet wants to show his dominance over this project.",
          "score": 2
        },
        {
          "text": "Yes just leave, you’d be very kind to them if you don’t just walk out of the job without notice. Happened to me before at an MNC. If you stay you run the risk of deviating from your desired career progression and/or doing a role that you are not suited for.",
          "score": 1
        },
        {
          "text": "It’s 2 days. If you say to leave; I don’t think they will enforce the 2 weeks on you. No purpose to pay you extra 2 weeks salary just for you to learn more about what they do and waste their time training.",
          "score": 1
        },
        {
          "text": "Firstly, MNC or SME?",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r16cy4",
      "subreddit": "askSingapore",
      "title": "Why does the healthcare sector pay lower compared to other sectors. Aren’t they considered essential workers?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r16cy4/why_does_the_healthcare_sector_pay_lower_compared/",
      "score": 63,
      "num_comments": 63,
      "created_at": "2026-02-11T01:01:49",
      "selftext": "Sorry if my English is terrible, I’m typing this at 1 in the morning. M19, I’m currently studying in a healthcare related field and I’m looking for career options that could possibly support my future partner and I. My options are paramedic, nurse, social worker and OT/PT. They all pay around the same 3-4K as the starting pay. I understand that this is still starting pay but if I compare to people in finance it’s almost 1-2k less(5k). My parents were both in the finance field and they both earned a lot, close to 18k a month each(crazy). I’ve talked to people in the jobs I’m looking for and they said that realistically I can make about 12k a month if I work for 10-15 years with the company. Should I change sector to business to make it easier for myself? The workload in courses like business accounting and logistics seems a lot less than what is needed for my course. I really want to be a paramedic because my body allows me to focus a lot better at night and in high stress environments without getting too tired but I fear that I won’t be able to support myself when I start out. To wrap this whole paragraph up, why do people in the healthcare sector get paid less than people in business, do they get paid in good karma, who knows. Sorry for the long paragraph, was just thinking of my future. ",
      "comments": [
        {
          "text": "Hi OP, before you dive into the healthcare sector, I recommend that you work as a healthcare assistant first. It’s not just the low salary, working with patients can truly test your faith in humanity…",
          "score": 111
        },
        {
          "text": "firstly gov sets public healthcare pay and they have try to contain costs because the budget is limited. if whoever pays you has that mindset, you will always have downwards pressure on your pay. the counterfactual: compare that to people who are queuing up to throw money at AI developers because delivering a new product = more revenues. they will race to pay higher. one strong senior banker and his team can bring in fees from a billion dollar deal that more than pays for their salaries and bonuses.\n\nsecondly there's the problem of inflation vs deflation. an AI engineer with 100x the compute he has now vs 2 years ago can generate 100x the output. so, he can be paid a nice share of the extra produce. healthcare workers do not have the same economies of scale - nurses cannot take care of an exponential number of patients to warrant a slice of the improved economies.\n\nthe problem that intersects both examples above is baumol's cost disease - which basically drives wage inflation in industries without commensurate productivity increases.",
          "score": 84
        },
        {
          "text": "Would argue finance people are grossly overpaid. They literally add no value to the society, neither create goods nor services. Their main business is moving money around. I wish healthcare workers were paid a lot more. \n\nBtw for your parents 18K a mth at their age isn't a lot. Thats more the avg for finance workers.",
          "score": 52
        },
        {
          "text": "If you want to make big bucks you don’t become a nurse. A doctor might be able to do so once they go private but nurse/ paramedic/ social worker are not the type of roles that pay lots",
          "score": 50
        },
        {
          "text": "because its not a money-making business, unfortunately",
          "score": 30
        },
        {
          "text": "1. Business pov: In order for healthcare sector to pay high salaries, healthcare sector needs to be able to make enough money to do so. Is the healthcare sector generating revenue and profit margins the way finance sector is doing so?\n\n2. Economics pov: Availability of skilled workers. Supply &amp; demand issue. There are alot more people able and willing to work in the healthcare sectors you mentioned and at the current pay, vs in certain financial industry niches.\n\n3. Job competitiveness pov: Finance industry is made up of tons of private companies competing for the best talents. More competion = more power to employees to command higher pay if certain companies wanna fight for them. Compared to healthcare sector, it’s mostly govt-affiliated and there’s only 3 “companies” controlling the hospitals - NHG, NUHS, SingHealth. From what I know, healthcare staff aren’t really poached from one group to another group and being offered higher pay. I only know of healthcare staff being poached to private clinics to run their own private practice independently.\n\n4. You’re finally realizing that the world isn’t fair. A higher job value to society doesn’t equal higher pay. The richest and best-paid people honestly probably are at the bottom of the list to what is considered of value to society.",
          "score": 20
        },
        {
          "text": "\n because the higher you are paid, the more those will cost and as an essential services you cant have it cost too much that regular people cant afford.",
          "score": 12
        },
        {
          "text": "I work in healthcare. Honestly I think most healthcare workers get by ok. Like nobody is starving, people have families etc. The salary may not seem much compared to some sectors (but erm the pay range within healthcare is huge also) but depending on your job, you do get allowances, benefits and super good job security. You see all the posts here complaining about bad job market? Yea healthcare is always hiring. The most impt thing is you must want to work with patients and not everyone is cut out for that.",
          "score": 11
        },
        {
          "text": "Because the healthcare sector depends on people with passion. And passion can be abused.",
          "score": 10
        },
        {
          "text": "Don't choose healthcare for the money. You’ll burn out fast. The pay gap you’re noticing is real and it doesn’t disappear just because the work is meaningful. Healthcare only pays you in job security, benefits and stability. \n\nThat said, money isn’t everything if you’re aligned with the work. I joined healthcare because of a genuine calling too (mental health) and I recently resigned because they look at numbers over people, impact reduced to KPIs and a lot of unspoken ugliness behind the scenes. It takes a huge amount of emotional labour to survive that without losing yourself. I will likely never return to healthcare again. \n\nIf being a paramedic genuinely suits your temperament (and this translates to high stress, night shifts and crisis response), that’s not something everyone has. That matters. But go in with clear eyes: starting pay will feel tight, progression is slow and recognition isn’t guaranteed. \n\nThere are plenty of people who make good money and are miserable there too. The better question is, \nwhat kind of tired do you want to be: physically/emotionally tired or morally drained and bored?\n\nWhatever you choose, protect your peace early. No job is worth your mental health. And it’s okay to change paths later. You're 19, not locked in for life.",
          "score": 6
        },
        {
          "text": "The more “essential” you are, the more plentiful you need to be, and therefore the cheaper the better it is. Like road sweepers and f&amp;b staff.",
          "score": 5
        },
        {
          "text": "if you feel healthcare industry is paid low, then look at the retail industry... It's even lower..",
          "score": 4
        },
        {
          "text": "Because it’s a capitalistic world.",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1r11m0t",
      "subreddit": "askSingapore",
      "title": "Ladies of Singapore, what are your opinions on our local blogshop livestreams?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r11m0t/ladies_of_singapore_what_are_your_opinions_on_our/",
      "score": 38,
      "num_comments": 43,
      "created_at": "2026-02-10T22:04:32",
      "selftext": "There was a recent thread discussing our local blogshop scene and there were a handful of comments discussing the live streamers as well…\n\nCommon consensus:\n\n\\- Live-streaming paints a cheap “pasar malam” vibe to the brand (very intrigued by this becos I never thought of it that way before)\n\nCurious what your thoughts are! ",
      "comments": [
        {
          "text": "Honestly I kinda get the “pasar malam” comment lol. The vibe is very “fast fast last piece” and it makes the brand feel cheaper even if the clothes aren’t.\n\nBut at the same time… I still watch sometimes because it’s the only way to see how the fabric falls, whether it’s sheer, how long it actually is, etc. Product photos are always a bit… optimistic.\n\nI think livestreams aren’t the problem, it’s the execution. If the host is shouting promos every 10 seconds and everything is “OMG SUPER WORTH IT”, it feels like clearance sale 24/7. If they slow down a bit, show the details properly, stop the fake urgency, it would feel less cringe.",
          "score": 102
        },
        {
          "text": "i actually enjoy watching lovet’s livestreams, especially those from 2023. they usually use the same people every week, and the models/personalities they use/used were fun and entertaining, not annoying or noisy. \n\ni’ve watched other brand’s livestreams before and let’s just say they influenced me to NOT buy their stuff instead.",
          "score": 34
        },
        {
          "text": "Ya I also don’t like the pasar malam vibes but i feel that live streaming has made the industry more competitive and this benefits the consumers. They dangle more promos and prices can go lower. I like shopsassydream’s live actually. It’s at a comfortable pace, not too overly noisy and does not have the pasar malam vibes.",
          "score": 13
        },
        {
          "text": "There was a similar discussion about blogshops in general from r/SingaporeInfluencers but that page is now under 'renovation'! I think one of the points mentioned about livestreamers that someone mentioned was the fact they change in front of customers to continue to engage your attention and some felt that it was in poor taste to do that. \n\nI don't really watch livestreams in general especially from brands like Topazette and Mikayla cos the designs are too repetitive and the streamers are a bit too loud for my liking. I will only intentionally go to a livestream if there is something specific that caught my eye and I want to see them trying it on. The only thing I hate is that they might take forever to try on something you like because they will take 30 minutes addressing sizing issues, raving about the design and materials and answering questions related to the items. I usually just click the vouchers, cart out and not watch the livestream because usually I would have seen the preview of the item first on the page.",
          "score": 13
        },
        {
          "text": "I have friends/colleagues who feel that way but I don’t echo the same sentiment haha. I enjoy the vouchers I get from the livestreams, plus I’m too tired to keep up with new releases so livestreams popping up on my feed is the only way I get to stay updated on what’s the latest lol. It’s also not very invasive because you can always just scroll away if you don’t want to click into the live. Plus I like seeing how certain clothes flow on their bodies (maybe it also helps that I am similar size to my fav livestreamer as well).",
          "score": 8
        },
        {
          "text": "My sis watches the livestreams on speaker mode, her husband calls them \"birds\"",
          "score": 8
        },
        {
          "text": "As a brand owner myself (not fashion-related), I’ve also been puzzled why blogshops have been stooping to a pasar malam level. Sure it’s totally fine if they’re running their clearance sales, but for regular launches and try-ons, the shouting of just “buy buy buy” “pit to pit” etc etc is crazy. And what’s the point of just shouting at people to “faster cart out” - I know they wanna trigger impulse shopping but they’re much more effective ways to do that! And all the “please buy please please” - like why begging people to buy ah??\n\nThe tiktokshop lives from western countries are so chill. Brands kinda put on a vibe, use livestreams to facilitate shopping, build their brand and community etc. No one’s shouting or overstimulating incessantly and repeating the same few pasar malam words 1948392 times",
          "score": 7
        },
        {
          "text": "Chello has nice designs and website with good looking models. I saw their livestream once and wow ah lian accents that completely ruin the brand vibe sadly. Still nice and buy the dresses",
          "score": 6
        },
        {
          "text": "Honestly I like the livestreams - seeing the try-ons, getting sizing advices and vouchers.\n\nI think the ‘pasar malam’ vibes is normal - the hosts are there to push sales, engaging their audiences to encourage buying behaviour and brand loyalty.\n\nI don’t think I will be pushed to purchase if they just say nothing, do try-ons and move on LOL, to me it will feel as if they are not really bothered to make a sale if you get what I mean, I will not be intrigued to find out more about their brand or the products.",
          "score": 5
        },
        {
          "text": "I used to not get it but i like that it exposes you to what's out there and you can ask the sellers details about the item or any enquiries and they'll answer you right then and there.",
          "score": 4
        },
        {
          "text": "I ordered since early Dec on their livestream and till now have not receive them yet for CNY. Can’t even cancel cos once order is through they put the status as pending for courier so TT doesn’t allow cancellations.\n\nSo it’s worse than pasar malam cos at least pasar malam I get the goods right away lol",
          "score": 3
        },
        {
          "text": "My wife loves the Facebook live sellers. She will spend plenty on clothes and I let her do that so that I can justify my spending on shoes and football jerseys.\n\nMy take as a millennial uncle who swears by shorts and jerseys: those live sellers seem to have the same design. I can know that my OL colleagues buy from the same sellers cos they wear the same dang design. \n\nBut who am I to say. Football jerseys look the same every season anyway with the same colours.",
          "score": 3
        },
        {
          "text": "Question for the ladies... I'm a guy with an overseas GF who doesn't really know the local blogshop scene (can be livestreams or no livestreams). If she was in town and I had to bring her to the ones that are actually nice and that you guys would actually buy from, which brands would these be? \n\nI'm hearing good stuff about TinselRack, Lovet, Modparade?",
          "score": 2
        },
        {
          "text": "I remember last time, and still have today but not as common, when I was going to the nearby shophouses and wet market with my mother, there would be a few salespeople hawking their goods outside of shops. Like someone doing a cooking demo to sell some woks, or some uncle showing off a vacuum cleaner to all the housewives.\n\nThese livestreams are actually no different from those, but in an online format. Like the salespeople show off their products, engage and entertain the audience, answer questions and then throw in all the \"Buy now!\" offers to get sales. I guess the only difference it that ordering online comes with the risk of it possibly being a scam or your order gets lost in the mail, whereas those live in-person sale demos you can cash and carry the product home.",
          "score": 2
        },
        {
          "text": "never shopped livestreams or blogshops, don't quite get the appeal tbh",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1r0vv2a",
      "subreddit": "SingaporeRaw",
      "title": "Do yall see the pattern now?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r0vv2a/do_yall_see_the_pattern_now/",
      "score": 429,
      "num_comments": 60,
      "created_at": "2026-02-10T17:02:25",
      "selftext": "",
      "comments": [
        {
          "text": "Best is they reveal the victim face, name, nationality but delibrately omit the driver’s detail. If she is singaporean rest assured it will be released.",
          "score": 242
        },
        {
          "text": "Born and bred Singaporean names will be revealed.\n\nForeigners' names are redacted based on past offence cases",
          "score": 176
        },
        {
          "text": "If you want to be even more comparable, the drunk driver who dismembered his victim was named as Australian man \n\n\nWhat does this tell you ",
          "score": 140
        },
        {
          "text": "singaporean are lowest caste according to heritage. u dunno meh? caste system",
          "score": 110
        },
        {
          "text": "We want her name!",
          "score": 100
        },
        {
          "text": "Rules for thee but not for me",
          "score": 64
        },
        {
          "text": "Only after charging then you’ll know the name lah, not after arrest",
          "score": 46
        },
        {
          "text": "uhm... please don't come after me; I'm not defending against anti-ceca sentiments here. but first case, proven guilty in court, second case, still pending court to hantam. I reckon once court proceedings start, her name will be made public.",
          "score": 34
        },
        {
          "text": "Why this chao ah neh so special, all media trying to downplay and cover up for her? Tharman or shanmugam relative? Or lee hsien loong mistress?",
          "score": 28
        },
        {
          "text": "If victims were sinkies, a PAP minister would have come out and slam you netizens for being racist, nasty, xenophobic\n\nBut cos the victims are from Indonesia, they lan lan keep quiet",
          "score": 20
        },
        {
          "text": "CECA protected species",
          "score": 13
        },
        {
          "text": "Down with cecas",
          "score": 13
        },
        {
          "text": "It seems like when a person of a different nationality does something in a different country, ST publishes nationality / country to avoid confusion or saying things that aren't true (eg Malaysians have probably already been charged). When it's all same country and nationality, there's no need state \"Singaporean woman charged in Singapore\"?",
          "score": 12
        },
        {
          "text": "Small scarifice for the nation to sleep soundly.",
          "score": 10
        },
        {
          "text": "Stand up for CECAPore, only imports please. \n\nNS for local boys, its a privilege.",
          "score": 9
        },
        {
          "text": "I believe name will be revealed once she has been formally charged, and media do publish information about nationality when they have been formally charged, like..  Indian National charge for whatever..   like in the case of the ICA officer..\n\n[https://www.cpib.gov.sg/two-men-charged-for-giving-bribes-in-the-form-of-sexual-acts-to-an-ica-officer/](https://www.cpib.gov.sg/two-men-charged-for-giving-bribes-in-the-form-of-sexual-acts-to-an-ica-officer/)\n\n",
          "score": 8
        },
        {
          "text": "GIVE THE NAME NOW\n\n\nSTOP HIDING SINGAPORE",
          "score": 6
        },
        {
          "text": "What pattern? 50% of sg aren’t residents so obviously laws have to bend to ensure the 50% also happy what. 65% voted for this mah",
          "score": 4
        }
      ]
    },
    {
      "id": "t3_1r1m04o",
      "subreddit": "SingaporeRaw",
      "title": "Chinatown Accident | Singaporeans leave flowers and McDonald's at accident site as offerings to the 6-year-old victim",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r1m04o/chinatown_accident_singaporeans_leave_flowers_and/",
      "score": 316,
      "num_comments": 49,
      "created_at": "2026-02-11T11:11:32",
      "selftext": "",
      "comments": [
        {
          "text": "appreciate those thots but sorry to say, the rodents are gonna infest that location.  no food pls. flowers are best!",
          "score": 172
        },
        {
          "text": "Whats the difference here between putting macs and food offerings during 7th month? Yall criticize to high heavens during 7th month but somehow this is more acceptable?",
          "score": 68
        },
        {
          "text": "Appreciate the flower but wtf McDonald???",
          "score": 59
        },
        {
          "text": "see this post then get reminded, still no news and no reveal of that scumbag driver",
          "score": 27
        },
        {
          "text": "\nWhy the drunkcowwww typeeeee likeeee thisss oneeeee the finger jolting 10 times per second?",
          "score": 17
        },
        {
          "text": "Sad incident",
          "score": 15
        },
        {
          "text": "Just to clarify with people who seem to think that I contributed to the offerings, I wasn't the one who placed anything there. I donated straight to the father via his alumni group. But I'm just trying to be understanding here for those who perform death rites in their own ways.",
          "score": 6
        },
        {
          "text": "Flowers are fine. No offerings, the victim and their family is Muslim.",
          "score": 5
        },
        {
          "text": "Im not sure if I should point this out but victim is a MUSLIM. I dont think if food offering is appropriate. \n\nMuslims dont \"eat\" food in the afterlife. What her soul need is prayers - ask your Muslim friends to help offer her prayers if you really care about the kid.\n\nOtherwise, you are just littering the place and making cleaners' job harder by placing food there.",
          "score": 4
        },
        {
          "text": "Saddest Happy Meal ever, RIP",
          "score": 1
        },
        {
          "text": "They could just put mcd toys instead of food for more pests",
          "score": 1
        },
        {
          "text": "Good idea to put mcdonalds. 1 year later the offering will still be nice looking, no rot.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r0v33h",
      "subreddit": "SingaporeRaw",
      "title": "Basmati rice is ruining Nasi Lemak and killing the heritage of the dish",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r0v33h/basmati_rice_is_ruining_nasi_lemak_and_killing/",
      "score": 233,
      "num_comments": 82,
      "created_at": "2026-02-10T16:12:12",
      "selftext": "Is it just me, or is the shift toward Basmati rice in Nasi Lemak shops getting out of hand? \n\nI get that it’s \"healthier\" or seen as \"premium,\" but it completely misses the point. \n\nAuthentic Nasi Lemak should be fluffy, slightly sticky, and rich—Basmati is too grainy and doesn't soak up the santan (coconut milk) the same way. \n\nAnd for our Muslim friends who uses hands to eat Nasi lemak, which is easier to hold and eat honestly?\n\nTo me, it feels like we're sacrificing heritage for a food trend. Am I crazy, or do others miss the \"normal\" rice too?",
      "comments": [
        {
          "text": "Completely washed out basmati rice sometimes feels like eating sand lol.",
          "score": 116
        },
        {
          "text": "I also prefer normal grain rice for Nasi Lemak.\n\nNo difference for both type when eating with hands.",
          "score": 76
        },
        {
          "text": "I've been saying this so much. I hate basmati rice in nasi lemak. Play with the protein or sides not the main soul of the dish. Imagine if someone started making basmati sushi. Its ridiculous and arrogant",
          "score": 64
        },
        {
          "text": "What's that yellow jizz in your trAIditional nasi  lemak?",
          "score": 23
        },
        {
          "text": "how did we go from nasi lemak being a cheap breakfast staple to some premium &gt;$10 artisanal food?\n\n10 15 years ago we used to laugh at the idea of $10 nasi lemak. Nowadays chains like crave can sell nasi lemak for $12+",
          "score": 20
        },
        {
          "text": "No basmati rice for nasi lemak.... It kinda Degrades it.... :(",
          "score": 13
        },
        {
          "text": "I dislike basmati rice with my Nasi lemak. You eat Nasi lemak to enjoy the rice and sambal. The side dishes are just the co-stars. So regular fluffy rice only. \n \n\nAs for eating with hands, no difference. Biryani is much more enjoyable with hands.",
          "score": 11
        },
        {
          "text": "https://preview.redd.it/azvu8q1d2oig1.jpeg?width=1200&amp;format=pjpg&amp;auto=webp&amp;s=eeb3cf241a233c67d44b280b1bcaa30df3202017\n\nI love cooking nasi lemak with jasmine rice! ❤️",
          "score": 11
        },
        {
          "text": "It’s all crave’s fault",
          "score": 11
        },
        {
          "text": "Totally agree with you dude I fucking hate nasi lemak using basmati rice. ",
          "score": 8
        },
        {
          "text": "Basmati rice should only be used for Briyani style dishes.",
          "score": 6
        },
        {
          "text": "Very true. agreed.",
          "score": 6
        },
        {
          "text": "nope not crazy. I very much prefer non basmati nasi lemak. esp those rice that has shorter and a bit clumped together grain. I do wonder though why many nasi lemak seller use basmati rice? is it really because it feels more “premium”?",
          "score": 6
        },
        {
          "text": "Can we have normal like the old school nasi lemak. I don't need like some extreme good, just plain simple.",
          "score": 5
        },
        {
          "text": "basmati for briyani and nothing else",
          "score": 3
        },
        {
          "text": "Yes don’t think basmati rice match nasi lemak. Yucks.",
          "score": 3
        },
        {
          "text": "Imitation is greatest form of flattery?",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1r0wcdn",
      "subreddit": "SingaporeRaw",
      "title": "Trying to tabulate a list of IDs/contractors to be careful of for renovation",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r0wcdn/trying_to_tabulate_a_list_of_idscontractors_to_be/",
      "score": 219,
      "num_comments": 55,
      "created_at": "2026-02-10T17:32:59",
      "selftext": "Reposting again since previous post got removed, but [previous post's comments](https://www.reddit.com/r/SingaporeRaw/comments/1najw8k/trying_to_tabulate_a_list_of_idscontractors_to_be/) are still available.\n\n\\---\n\nI’m compiling a list of IDs/contractors that homeowners should be wary of. These names are based on hard to compile sources (word of mouth, forums, Telegram, Lemon8, etc). The aim is to share information so that others can do their own due diligence before committing. Along with the names, I'll try my best to include links to where the discussions took place so you can verify yourself. These are rarely available depending on where it was sourced from.\n\nNote: some of these experiences were with certain individual IDs within these firms, so you may still have a good experience if you engage the right person. There’s also the possibility that IDs move between firms, so please always do your own diligence. However, if you’ve had experiences where the workmanship itself was poor, do mention it - as that usually points to the contractors used by the firm as a whole, not just the individual ID.\n\nIf you are an ID/contractor reading this, please note this list reflects individual experiences and feedback - not absolute fact - and I encourage homeowners to always research further.\n\nHere’s the current list (please add on if you’ve come across others or PM me directly):\n\n1. [Lemonfridge](https://www.tiktok.com/@alilshan_/video/7338061156373761282)\n2. ⁠[Swiss Interior](https://imgur.com/z2s5RWa)\n3. Livspace\n4. Aart Boxx Interior (poor workmanship)\n5. ⁠Okaeri Studio (Jayden)\n6. Tab Gallery ([here](https://www.zaobao.com.sg/news/singapore/story20251103-7760947), [here](https://www.reddit.com/r/SingaporeRaw/comments/1hbm27z/renovation_and_ids_in_singapore/) and [here](https://www.facebook.com/groups/348293689060800/posts/1936453406911479/))\n7. ⁠Fifth Avenue Interior (Jay), Third Paragraph Interior (Austin, Sufen), Andre Interior Co\n8. [Fineline Design](https://www.todayonline.com/singapore/interior-design-group-loses-defamation-suit-against-clients-who-left-bad-reviews-google)\n9. ⁠Wood Origins Vinyl Flooring\n10. ⁠[Siris Studio](https://mothership.sg/2025/08/nicole-liel-siris-studio/)\n11. [Gin&amp;G](https://www.tiktok.com/@littlecityloft/photo/7569484149048757522)\n12. The Local Inn.terior\n13. ⁠Casa Interior Design\n14. Zenith Design Theory ([here](https://www.reddit.com/user/Darren-denny/comments/n3tjh2/gabriel_seng_joon_hian_home_renovation_cheater/) and [here](https://www.reddit.com/user/Grrover-gracey/comments/krikz2/reno_scammer_gabriel_seng_joon_hian/))\n15. ⁠Renosaves Project\n16. [Atelier Here, Hier Architects](https://imgur.com/aONySJm)\n17. Carpenters 匠 (Suspended on HDB's DRC)\n18. ⁠Knock Knock Studio (Jade)\n19. Senso Studio (Jethro, Jeremy)\n20. [Conquest Design Group](https://imgur.com/bT6rne4), [Interior Times, 2J Interiors](https://mothership.sg/2025/09/interior-times-payment/), Elysian Design Studio, Empyrean Design Studio, Sora Studios\n21. Posh Home (Charles Tan)\n22. ⁠Renovaid\n23. ⁠Moda Interior Design (poor workmanship)\n24. ⁠3D Innovations Design Pte Ltd\n25. Playground Interior, Homu Homu\n26. ⁠Woodcraft Interior Design\n27. ⁠AP Concept\n28. Yellow Stein\n29. AC Hub\n30. ⁠Internio Design\n31. ⁠Dreamcatcher Interior Design\n32. ⁠Metis Designers Firm\n33. ⁠Sponge Ptd Ltd\n34. ⁠LWH Reno\n35. ⁠Greno Construction\n36. Aian Furniture and Renovation\n37. ⁠Ai Genz Builders\n38. LS Home Renovation\n39. ⁠Epic D'sign &amp; Innovation\n40. PRDT interior\n41. Interior Dairy\n42. ⁠Key Concept\n43. ⁠SHE Interior Design\n44. ⁠Ft2 Interior Design\n45. ⁠Massing Design\n46. ⁠Symphony Concept\n47. ⁠The Local Project\n48. ⁠INTR Studio\n49. Singapore Hacking &amp; Tiling\n50. ⁠21 Interior Studio\n51. ⁠Metre Architect\n52. [Areana Creation](https://www.facebook.com/groups/503185364261770/permalink/1462039258376371/)\n53. ⁠TBG Interior Design, Maximo Spark Interior Design, Tim Carpentry\n54. ⁠Leecon Pte Ltd (Jordan, Dennis)\n55. ⁠SKY\n56. ⁠WM Metalogy\n57. ⁠Gingko Interior Solutions (poor workmanship)\n58. Charlotte's Carpentry\n59. [Tidplus Design](https://www.elitigation.sg/gd/s/2024_SGHC_187)\n60. [⁠Concept WX](https://www.elitigation.sg/gd/s/2025_SGMC_71)\n61. ⁠AP Vision\n62. ⁠Cross Studio\n63. ⁠Cassia Studio\n64. ⁠Tiling Connection\n65. ⁠Supreme Houzz Design (Cynthia, Celena)\n66. Design 4 Space\n67. ⁠Will Renovation Group\n68. [⁠HomBee Interior, B-Cube Interior](https://www.facebook.com/groups/1000263134243369/permalink/1902007387402268)\n69. ⁠Metre Architects\n70. ⁠BKH Door Services\n71. ⁠Singapore Carpentry Pte Ltd, ET Builder Pte Ltd\n72. ⁠The Alchemists Design\n73. ⁠Zinc Design, BBMY Design, Nam Lee Awning Construction\n74. De L'Art Project (Brandon Lin)\n75. [In-Expat Consultant](https://www.case.org.sg/casetrust/casetrust-watchlist/) (Unauthorized usage of CaseTrust Logo)\n76. [Trinity Interior Design](https://www.renotalk.com/forum/topic/82151-avoid-robin-tan-from-trinity-interior-design-unless-you-want-to-have-nightmares/) (Robin)\n77. [Renologist](https://imgur.com/a/LilljHq)\n78. [Unimax Creative](https://imgur.com/6KJvd4a)\n79. VT Engineering &amp; Construction\n80. [Archive Interior Design](https://imgur.com/0loLHSg) (Lucas)\n81. Apex Studios\n82. Ethan Interiors\n83. [Comfort Home Interior](https://imgur.com/9yMuxoZ)\n84. Garden By The Moon Pte Ltd\n85. [Reno Scout](https://imgur.com/9yMuxoZ)\n86. Concrid Interior (poor workmanship)\n87. [Proz Design Pte Ltd](https://www.facebook.com/groups/503185364261770/permalink/1548564766390486)\n88. Icon Interior Design\n89. [Innofix Renovation Pte Ltd](https://www.facebook.com/groups/1000263134243369/permalink/1945714469698226) (Favourite Colours / Renovation Contractor BP on Carousell)\n90. Muwu Construction\n91. Edgeline Planners\n92. Archisthetic Interior, Archisthetic Builders\n93. 9 Creation Pte Ltd\n94. Icon Studio Pte Ltd\n95. Peng Cheng Engineering Pte Ltd\n96. [K Electrical &amp; Renovation](https://www.lemon8-app.com/@tt88188/7492739324602188305) (Kelvin Lee Ka Weng)\n97. PD Door Pte Ltd\n98. Hashtag Interior\n99. SG Interior KJ\n100. Pupil Office (Amy Lim)\n101. Absolook Interior Design, Absolook Design Studio\n\nThere are quite a few names on different chats on [Renotalk](https://www.renotalk.com/forum/forum/9-renovation-contractors-interior-designers-suppliers-reviews/page/68/) too so check it out. While I find [CASE's list](https://casetrustapplication.azurewebsites.net/Home/casetrustlist) very useless, I'll just include it for completion. Also found this [comment](https://imgur.com/jSyGsSw) who has a [compiled list](https://docs.google.com/document/d/1XO_g2vto4NBQ_Ugln6ZRNT_WSX9EYDF0Vp6wCzDFpWo/edit?usp=sharing) as well.\n\nUPDATED (as of 2026): I've realised that some firms branched/split off their mothership, so I've put them together in the same line. That way homeowners can better assess (since it’s very probable that reviews of the mothership would apply to the subsidiary/split firm). Also note that even though this post has been made some time ago, I update it frequently whenever I find more or ppl reach out.",
      "comments": [
        {
          "text": "Can tabulate the one that is good?",
          "score": 47
        },
        {
          "text": "Glad to see my ID here. Number 7 on this list. Withheld payment because they don’t want to fix defects. Then sued us somemore.",
          "score": 34
        },
        {
          "text": "Put it in Google sheets loh can add reasons or experience also.",
          "score": 27
        },
        {
          "text": "This is such great post! There'd been many horror story on [SG corrupt renovation/ID scene](https://www.reddit.com/r/singapore/comments/j1wlxq/we_need_to_talk_about_the_horribly_corrupt/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button) been raised since ages ago. I'm glad it resurfaced again. I have had encounter few companies that just blatantly block if you contact them about their poor job done, swinging warranty that never gets honoured, plenty google review raised but these companies can always buy Google review to bury those.\n\nAlso plenty \"ahbengs\" set up these companies with little to no experience (esp nowadays with AI) , since they're essentially just concierge of contacting all other contractor. Please avoid those and all the heavily sponsored companies, don't just look at those suspiciously high reviews, scrutinise their lowest one too.\n\nOP pls open subreddit on renotalkSG. Huge thanks for consolidating this list",
          "score": 19
        },
        {
          "text": "Saw my ID on the list. Happy to provide the story. Good on you OP for this!",
          "score": 10
        },
        {
          "text": "the company don't really matter, its always the individual designer who is reliable and trustworthy.\nand any good interior designer is always booked years in advanced",
          "score": 8
        },
        {
          "text": "Would you kindly list them in alphabetical order for ease of checking?",
          "score": 7
        },
        {
          "text": "Urban home design. ID James. \n\nWholly incompetent. Whenever things go wrong on the ground it's because of the building, the unit, the environment etc but never his fault.",
          "score": 6
        },
        {
          "text": "Mr Designer Studio - Timothy\n\nAvoid at all cost",
          "score": 5
        },
        {
          "text": "Tessa from Livspace was absolutely shocking to work with. Thoroughly incompetent and clueless. The 'subcontractors' she engaged were family members. Livspace's terms are predatory and provide no recourse for shoddy work.",
          "score": 5
        },
        {
          "text": "Lol Hashtag Interior number 98.. orbi good... The director named Francisco Loi Weng Tat bankrupt liao\n\nhttps://preview.redd.it/pq3xu60k9pig1.jpeg?width=1598&amp;format=pjpg&amp;auto=webp&amp;s=0d331a18a7af3aa0a39caf3bbb76b855d93c3b8a",
          "score": 5
        },
        {
          "text": "Avoid WM metalogy or Wellmax (sam company) at all cost. Lack of commitment, poor workmanship and just a horror to get a responses from them. They will play a waiting game with u until you give up instead of fulfilling their job. ",
          "score": 4
        },
        {
          "text": "IDs or whatever they are called, it's still renovation contractors.\n\nIt's common knowledge that second-hand car dealers and contractors are slimy characters.\n\nEngage with care and precaution and at one's own risk.",
          "score": 3
        },
        {
          "text": "Sadly, they can just close shop and reopen under new names and most people will be none the wiser.",
          "score": 3
        },
        {
          "text": "Perhaps can number the list so we can refer to them when we comment",
          "score": 2
        },
        {
          "text": "Anyone tried Uncommon Uncommon / Uncommon Studios?",
          "score": 2
        },
        {
          "text": "Do share the story with renologist anyone, curious to know cuz one of my classmates who I don't keep in touch with, seems to be on the founding team or sth.",
          "score": 2
        },
        {
          "text": "I did gone to visit and get initial artwork from some of the above designers. But didn't pick them from spidey sense and after hearing the horror stories, I'm glad I didn't! \n\nHad a good experience with Noble Interior, they are not super groundbreaking with design but we wanted something simple and functional, that they did deliver. Their contractors are damn solid especially the flooring guy, I've never seen someone who takes so much pride in grout lines.\n\nStill holding good on warranty promises 3 years in too!",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1r0tj14",
      "subreddit": "SingaporeRaw",
      "title": "Chinatown Accident | Indonesian embassy officials said the driver was released after brief detention under local regulations.",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r0tj14/chinatown_accident_indonesian_embassy_officials/",
      "score": 216,
      "num_comments": 74,
      "created_at": "2026-02-10T14:36:52",
      "selftext": "[https://kumparan.com/kumparannews/kbri-bicara-kasus-wni-korban-kecelakaan-di-singapura-26nhltY1Cwj/1](https://kumparan.com/kumparannews/kbri-bicara-kasus-wni-korban-kecelakaan-di-singapura-26nhltY1Cwj/1)\n\n&gt;Translation: Thomas Ardhian Siregar, deputy head of Indonesia’s diplomatic mission in Singapore, said the driver had been secured by police immediately after the accident.\n\n&gt;Thomas explained that the suspect was detained briefly but later released in accordance with local regulations.\n\n&gt;“On the first day, the suspect was detained. But under Singapore regulations, a person cannot be held for more than 48 hours without a court decision,” he said.\n\n&gt;“Because there has been no court ruling yet, the suspect was released in accordance with the law,” he added.",
      "comments": [
        {
          "text": "It is a standard practice here.  \nShe was detained but pretty sure the paperwork process is still on-going hence she has to be let go.  \nShe doesnt have to surrender her passport too because she wasnt formally charged yet.  \nBut at this point she would already be on bail, they call it the station bail.  \nA bail before a formal charged by our court.\n\nWhoever bailed her for this station bail is responsible for her attendance at the police station when summoned.  \nNow the IO should be getting his findings plus his recommendations submitted to AGC.  \nAGC will decide the list of charges. Once confirmed, they will summon her to the police station and convert the station bail to a court bail with a hearing date not too long from now.\n\nOn that day in court, she will be formally charged by the state on her alleged crime/s.  \nWe will get more details on that court day.",
          "score": 218
        },
        {
          "text": "This is standard Singapore procedure, not a loophole. Police can only hold someone for max 48 hours without charging them or getting a court order. The driver is still officially a suspect, investigations (forensics, witnesses, etc.) are continuing, and she can be recalled or charged anytime.",
          "score": 134
        },
        {
          "text": "Confirm run road now. Packing all the curry powder and chai latte into the suitcase now.",
          "score": 110
        },
        {
          "text": "https://preview.redd.it/ylspkn34nmig1.png?width=1021&amp;format=png&amp;auto=webp&amp;s=1204273f4faadc132b7b239e705d575854d2f72b\n\n[https://www.channelnewsasia.com/singapore/chinatown-car-accident-indonesian-embassy-6-year-old-girl-died-5919296](https://www.channelnewsasia.com/singapore/chinatown-car-accident-indonesian-embassy-6-year-old-girl-died-5919296)  \n\n\nThe mother regained consciousness:( She only found out about the daughter's death one day later. ",
          "score": 66
        },
        {
          "text": "Is her name a state secret?",
          "score": 66
        },
        {
          "text": "The lack of name and CSI makes it sound like she is a expat wife with little friends or community exposure.",
          "score": 27
        },
        {
          "text": "does the authority keep the passport, in case the suspect fly away ?",
          "score": 12
        },
        {
          "text": "Asking a genuine question: if no one wants to charge her yet and still call her a “suspect”, can members of the public charge her instead ? \n\nThis way we can force it to become a court case for public hearing. I hope the mothershit “journalist” attend the hearing",
          "score": 11
        },
        {
          "text": "Her son was wearing uwc uniform ah?",
          "score": 7
        },
        {
          "text": "100% confirm chop + guarantee got links to PAP. First time I see name can hide so long.",
          "score": 7
        }
      ]
    },
    {
      "id": "t3_1r0vdmu",
      "subreddit": "SingaporeRaw",
      "title": "Chinatown Accident | Six-year-old Sheyna Lashira the Tanah Kusir Cemetery, RIP little one",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r0vdmu/chinatown_accident_sixyearold_sheyna_lashira_the/",
      "score": 210,
      "num_comments": 6,
      "created_at": "2026-02-10T16:31:06",
      "selftext": "",
      "comments": [
        {
          "text": "CECA 1, Rest of World 0\n\nMotherland wan sui!! PAP's favourite bunch..\n\nSinkieland no natural resources, no big vast land, only got minimal employment headcounts.. Yet rather give to CECA than give to locals..",
          "score": 49
        },
        {
          "text": "Rest in peace young one 🙏🏻 we need justice to be served asap for that irresponsible, arrogant and ungrateful female driver!",
          "score": 26
        },
        {
          "text": "PAP's biggest success story in modern history is CECA",
          "score": 6
        },
        {
          "text": "RIP",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1r1lysc",
      "subreddit": "SingaporeRaw",
      "title": "Chinatown Accident | Ascott offers complimentary accommodation to support father as he stays in Singapore to be with his wife while she receives medical care",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r1lysc/chinatown_accident_ascott_offers_complimentary/",
      "score": 130,
      "num_comments": 32,
      "created_at": "2026-02-11T11:09:47",
      "selftext": "BRB booking my next few staycations with Ascott",
      "comments": [
        {
          "text": "Condolences to the father. Poor girl has a whole life ahead of her just to be taken away by some reckless and arrogant female driver. Everytime I think about this incident it just makes me frustrated. Hope the driver gets the punishment and karma she deserved asap",
          "score": 63
        },
        {
          "text": "PR promotion or not, it's still very helpful to a distraught father who just lost his child and a husband with an injured wife in hospital.",
          "score": 49
        },
        {
          "text": "Cheap advertisement scored. How about Grab/SMRT/SBSTransit? ",
          "score": 42
        },
        {
          "text": "can release father name cannot release culprit name? what is there to protect? ",
          "score": 27
        },
        {
          "text": "Name of victim's father is published but not the driver's name 😡",
          "score": 21
        },
        {
          "text": "Poor guy. Staying by himself can't be good for him now. His wife is in hospital, his kid is dead. \n\nHope he gets more support.",
          "score": 14
        },
        {
          "text": "thats a W for the hotel, at least its some support provided ",
          "score": 9
        },
        {
          "text": "Is there a go fund me for the victim hospital bills, if anyone knows can share? \nLike to contribute a bit.",
          "score": 7
        },
        {
          "text": "❤️",
          "score": 3
        },
        {
          "text": "Not even joking, booking Ascott from now on.",
          "score": 2
        },
        {
          "text": "The hospital fee will be very costly, unless insurance cover, also claims from the driver?",
          "score": 1
        },
        {
          "text": "At least some humanity by a business. Thanks Ascott hotels",
          "score": 1
        },
        {
          "text": "Respect to Ascott",
          "score": 1
        },
        {
          "text": "W hotel",
          "score": 1
        },
        {
          "text": "Ascott is really good, always my go-to when I'm overseas.  Their customer service is top notch.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r13llk",
      "subreddit": "SingaporeRaw",
      "title": "Requirements: Malaysian nationality",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r13llk/requirements_malaysian_nationality/",
      "score": 122,
      "num_comments": 46,
      "created_at": "2026-02-10T23:21:40",
      "selftext": "",
      "comments": [
        {
          "text": "See that blue button over there on the right?  Click on that",
          "score": 134
        },
        {
          "text": "\"Report discriminatory job ad to TAFEP\"",
          "score": 52
        },
        {
          "text": "Jobs in Singapore hiring specifically Malaysians. \n\nYou won't see your ST CNA Mothership reporting such news",
          "score": 49
        },
        {
          "text": "What the fk is yugoslavia pte ltd?!?!",
          "score": 33
        },
        {
          "text": "haram",
          "score": 28
        },
        {
          "text": "*“Report discriminatory job ad to TAFEP”* for more sharp elbows and great monitoring years ahead!",
          "score": 13
        },
        {
          "text": "Singapore job posting working in singapore but want exclusively hire Malaysians? 🤬\n\nReport for discriminating!",
          "score": 7
        },
        {
          "text": "MOM won't do a single thing about it. After all, they need to keep up the country's business friendly image...",
          "score": 7
        },
        {
          "text": "Is this what Singaporeans mean when they say foreigners are taking our jobs 😂",
          "score": 7
        },
        {
          "text": "Boycott this company. The next line about having to be \"mandatory\" in English **and** Chinese is atrocious as well.",
          "score": 7
        },
        {
          "text": "I thought i saw the company very familiar. Saw a documentary by CNA about a bakery from Balkans opening shops in Singapore. Could this be it? Hmmm seems like Singapore give them a place to make their fortunes but yet they rather hire Malaysians....oh well....😎\n\n[CNA Pilot brings Balkan Bakes To Singapore.]\n(https://youtu.be/S8_5NdEma2k?si=bTgONW9BSMyD3avs)",
          "score": 5
        },
        {
          "text": "Why does a bakery prefer to hire malaysians?🤔",
          "score": 5
        },
        {
          "text": "Ah if rentals aren't obscenely high, then bakeries can pay more and hire locals. We voted for high rentals and job ads like this. ",
          "score": 5
        },
        {
          "text": "There are many like this but they are smarter and don’t spell out the nationality requirement",
          "score": 3
        },
        {
          "text": "Lol maybe even Malaysian don’t want, can barely survive in jb these day with that after you deduct daily transport and meal allowance… Not forgetting ringgit has strength a whole lot.",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1r0wl66",
      "subreddit": "SingaporeRaw",
      "title": "Why did \"Say no to CECA\" failed to gain much traction offline?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r0wl66/why_did_say_no_to_ceca_failed_to_gain_much/",
      "score": 105,
      "num_comments": 48,
      "created_at": "2026-02-10T17:48:36",
      "selftext": "",
      "comments": [
        {
          "text": "People are reactive and passive, until the policy affects their livelihood.",
          "score": 68
        },
        {
          "text": "Cos most locals affected are those in PMET tier..\n\nPeople in PMET tier don't have time for protests or even time to engage in online stuff..",
          "score": 64
        },
        {
          "text": "Cos a lot of ppl don’t dare to take it offline",
          "score": 49
        },
        {
          "text": "Will be branded as racist, just look at lmw. Unless you come from a very strong and fortified position, most cant take the heat.",
          "score": 44
        },
        {
          "text": "The first reason is that in the movement there are people with legitimate grievances that have to do with the national interests of the citizenry of the country, and there are outright racists or racial essentialists. \n\nYou combine them together, you maybe got big umbrella, but the racists will naturally turn away or de-legitimize those with a valid economic argument and tamper the movement. Furthermore, the Singapore government enjoys painting all the movement with a broad brush by waving aside it by pointing to those who are racists and claiming that is what the movement represents.\n\nSo unless someone can clearly articulate why CECA is a poor economic plan, and to do so, one needs to understand why they negotiated for it in the first place - not just make arguments as though the other side has no reason to have a FTA with India and show that on balance the benefits are much less than the detriment.\n\nOtherwise the argument from CECA is stuff that is easily used by racists to comfort themselves that they are among a large group of people who are also racists or racial essentialists. ",
          "score": 35
        },
        {
          "text": "So many countries but they chose that country to sign Ceca with, why not Sweden? Denmark? Thailand? Mexico? Why particularly that country?",
          "score": 12
        },
        {
          "text": "[The world doesn’t want us anymore: Indians facing backlash everywhere : r/immigration](https://www.reddit.com/r/immigration/comments/1mz6z5t/the_world_doesnt_want_us_anymore_indians_facing/)\n\nWe are not the only ones getting fed up with CECAs.",
          "score": 11
        },
        {
          "text": "Cause many singaporean like to complain this complain that but deep down they know they are just sop followers.\n\nMost singaporean in work are comfort taker or I will say not a risk taker. Cannot think out of box cannot improve process. When change come feel uncomfortable straight say y need to change so troublesome. Never try first than make comments. \n\nDont believe ask them change job when stagnant a lot will no lah. Later cannot find job. Ask them go do more difficult things no lah not my work. Or worst use rank to throw work to others. Let others make mistake than ownself pretend never see.\n\n\nIn the end  all only complain this complain that. But deep down they know that forigner bring a different game to the economy. They dare to try cause for them is either do it or fail and get send back. Company need leaders who can criticised and think of process to improve not leaders who are yes yes to everything. That only apply to pap. \n\nWhat I am saying that singaporean only complain but deep down they know they have things that they cant compete with forigners which is not being comfort and try to go for things that make them uncomfortable. \n\nThat why we only complain people snatch job but deep down we know we have things that is missing and need improvement",
          "score": 10
        },
        {
          "text": "It’s like aircon. Until the aircon is off, no one gets affected.\n\nHolding a protest at Hong Lim park where it is hot and humid means people are less likely to stay and listen",
          "score": 9
        },
        {
          "text": "Sinkie pwn Sinkies mindset.\n\nUntil that is all Sinkies are pwned and the imports have won. Prepare for the great whining of the 2030s.",
          "score": 9
        },
        {
          "text": "The CECA issue is one of the reasons opposition won their second GRC during 2020 GE, as the Ramesh security guard case occured just before GE when emotions are at its highest.",
          "score": 5
        },
        {
          "text": "Because unlike echo chambers like Reddit subs, most people don’t think it matters. \n\n“No time”, “fear of taking it offline”, etc have all been proven false by pink dot which has never gone below 10k participants. \n\nThe real question is why we still do not have skills/jobs based quotas like say Australia.",
          "score": 3
        },
        {
          "text": "It didn’t pose an unavoidable threat, so it didn’t gain much support.\n\nThe sectors that were affected back then was largely engineering, and construction workers, which, most Singaporeans would just tend to avoid, in favour of an office job. \n\nIt’s hitting IT back then as well, but IT wasn’t as hot as it is today pre-covid.\n\nSo, no one cared. Just adapt, avoid those sectors where you compete with others who can easily undercut you. I’ve had friends who took one look at the lecture in NUS engineering and changed course right after that.\n\nCECA hasn’t posed enough of a threat yet to say… uproot the entire banking/finance industry, or the civil service.\n\nSo until then, people are blissfully apathetic towards those affected.\n\nIt’s only when people are caved in on all sides that such… movements(?) gain support.",
          "score": 3
        },
        {
          "text": "The premise of your question is not accurate because:\n\n* The second photo shows a respectably large crowd\n* Parliament debated CECA\n\nEven if there wasn't offline traction, it doesn't matter because political movements don't have to be offline.",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1r0y27d",
      "subreddit": "SingaporeRaw",
      "title": "ATB tell us she is really in Singapore \"我真的在新加坡”",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r0y27d/atb_tell_us_she_is_really_in_singapore_我真的在新加坡/",
      "score": 103,
      "num_comments": 101,
      "created_at": "2026-02-10T19:16:53",
      "selftext": "",
      "comments": [
        {
          "text": "Din tai fung is taiwan right?",
          "score": 112
        },
        {
          "text": "If PRC says that, then it also speaks volumes about the damage this government is doing to our hawker heritage.",
          "score": 109
        },
        {
          "text": "Yawwwn. They and their superficial XHS post.\n\nEdit: we're in our own echo chamber.\n\nXhs is self stroking than an echo chamber - a huge cocktail of mainlanders and Msians stroking their own \"influencer\" egos",
          "score": 41
        },
        {
          "text": "If singapore is China, then don’t come la. Why travel to eat the same food. Go Africa or something.",
          "score": 39
        },
        {
          "text": "With every passing year, I can see it. Surely but slowly Singapore’s culture is eroding away. The things I remembered experiencing as a child have vanished as I reached adulthood. And with my increasing age, my fond memories of all things singaporean is also fading away. One day I will wake up and look at the people of this country, tiong to sgrean and sgrean to tiong. I will no longer be able to tell which is which. ",
          "score": 37
        },
        {
          "text": "Alot of locals feel the same too",
          "score": 21
        },
        {
          "text": "So many chao ah tiong locust and their garbage brands in sg.",
          "score": 13
        },
        {
          "text": "She is indirectly “poking” sinkies.",
          "score": 11
        },
        {
          "text": "Singapore culture really eroded to high heaven.",
          "score": 8
        },
        {
          "text": "Yea they are trying to claim the whole world their own now",
          "score": 7
        },
        {
          "text": "I'm local Chinese. That's why our other ethnic races, our Malay, indian, Eurasian friends are critical in making sure that Singapore retains this unique blends of these cultures, and not allow these Chinese brands to turn SG into a mini cina !!",
          "score": 5
        },
        {
          "text": "They will eat up Singapore. Our govt is too weak when it comes to China to resist.",
          "score": 5
        },
        {
          "text": "She's copying other people content idea, I seen this type of content made by other PRC when they visit Malaysia and Singapore quite a few times.",
          "score": 4
        }
      ]
    },
    {
      "id": "t3_1r17zmp",
      "subreddit": "singaporefi",
      "title": "Any advice on how to hit $10k monthly salary in 5-7 years timeframe?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r17zmp/any_advice_on_how_to_hit_10k_monthly_salary_in_57/",
      "score": 75,
      "num_comments": 94,
      "created_at": "2026-02-11T02:00:24",
      "selftext": "Hi all, I am a 33M with a Supply Chain Management Degree (Kaplan). Have always been in the public sector (first job started here and rotated within) and now doing sort of project management role. Reviewing my career path recently and just thinking where else I could go or what can I do so that I can hit my goal stated in the title.\n\nPersonal Facts:\n\n1. Drawing around $5k\n\n2. In a Junior Manager Post\n\n3. Looking for courses to upgrade myself to move into sectors / industries which pays more. \n\nIntrinsic motivation:\n\n1. Getting married soon and planning for kids \n\n2. Retiring my parents (blue collar workers and are not as physically fit anymore)\n\nExtrinsic motivation:\n\n1. Different friend groups were sharing on salary recently and I find myself on the lower end when we were comparing. The next guy/girl “ranking” above me (from different groups) were drawing around $7k while being 1 - 2 years younger than me. One friend on highest end is drawing like $10k and 3 years younger than me.\n\nSo what are some of the good paying jobs I could go into and the skillsets I need to obtain prior to applying for them so that I can raise my salary range. (I took the highest end aa a goal but of course with a more realistic yet tough timeline (i think). \n\nAll comments / suggestions are welcomed. 🙏🙏🙏",
      "comments": [
        {
          "text": "You're in public service so comparing annual package is more relevant. Assuming 17months annual package, your monthly is around 7k. Some in private don't get any bonuses, not even 13month. There's also the issue of retrenchment especially today with AI being able to do much of what junior staff needs to do, and do better. \n\nYou want to get higher pay but have a family planned. If your objective is higher pay then your spouse has to be the one securing stability - meaning she has to be in government service. If she's already in private then the most logical course of action is for you to just stay on in public service while she fights it out in private (juggling future pregnancy and child-rearing). \n\nThink very carefully what your priorities are before making a rash decision. What I hear is perm status in public service is extremely difficult to come by; once you give that up, be very sure that you don't come to regret it if you eventually return and are forced to accept a long term contract arrangement.",
          "score": 133
        },
        {
          "text": "Might want to adjust your expectations to a more modest $7k in that timeframe, anything more is a bonus by then.",
          "score": 57
        },
        {
          "text": "First of all, comparison is the thief of joy.\n\nSecond, you want to double your salary in 7 years? Basically impossible in the public service, unless you promote three times with 20% increments and get 10% annual adjustments.",
          "score": 57
        },
        {
          "text": "5k as a 33M with a Private Degree in Government Permanent role is an achievement in and of itself. And the fact that both your parents are alive and retiring? That you’ll have a wife and about to get kids? These are all beloved blessings to be held close. \n\nComparison is the thief of joy and often times the grass is only greener because it’s a carpet. Water your own garden with all that you have and take in the scenery as you age.",
          "score": 21
        },
        {
          "text": "Learn how to manage projects using AI tools (ex: claude as agents), rebrand yourself as someone experienced in applying AI in your sector to boost productivity, and move to new role?\n\n[Claude Academy](https://anthropic.skilljar.com/claude-101) &lt; good resource to start learning.\n\n\nI’m predicting that in the next 2-3 years, managers that can set up and use AI properly in the workspace can command higher salary. Old timers are late to upskill usually.",
          "score": 12
        },
        {
          "text": "What marketable skills do you have that private sector will want? What industries are you working with today in your public sector role? What are you doing in relation to these industries?\n\nNo course is going to get you a private sector job. Relevant past experience does. \n\nOnce you list down all the experience you have and in which industries, just go to linkedin and mycareerfutures to look at JD and salary ranges.\n\nGenerally closer to the customer, pay more. For functional work, the more your scope impact the PNL (not via your pay),  pay more. E.g., supply chain improvement matters more for commodities companies where margin is slim per MT but high in absolute value, earned through improving every dollar from the supply chain. And of course supply chain providers like 3pls and 4pls since that's their bread and butter. Every improvement counts to their bottom line. Procurement in the right spend category aligned to the success of the firm for companies that has extremely high spend Vs revenue so every dollar savings adds significantly to the bottom line.\n\nOf course after you do this and realize you have no marketable skills, you are indeed starting from zero. But blindly jumping in to some course to get a better pay is also not going to work. Best is to adjust your current scope to see if you can find more exposure to relevant work experience in current role.\n\nIf you want to start from zero, you can always take an accounting accreditation like ACCA, go into audit which needs warm bodies, OT like mad and survive for 5 years or so and I think you won't be far from your target of 10K. The work life balance will be non-existent though. May not be good for setting up a family.",
          "score": 6
        },
        {
          "text": "Get into sales",
          "score": 3
        },
        {
          "text": "Honestly on the assumption that continue to stay in your job now for the next 5-7 years. If you get promoted, im sure a managerial role in the public sector will draw a 10k monthly, or very close to, after bonuses.",
          "score": 3
        },
        {
          "text": "easier to think about why do you need more money\n\nthe best things you can give your kids and retiring parents is your time. Not more luxuries. \n\nyou will always have friends who will earn more than you.",
          "score": 3
        },
        {
          "text": "1) U cannot earn much in the supply chain field\n\n2) Those ppl w higher ranks may have job hopped a few times or from private to public sector (allows them to skip several ranks)\n\n3) You have to see what fields ur frens are in too. If they are in tech or finance then ur comparing apples to oranges. U have to see within the supply chain field (public - similar rank and private)",
          "score": 2
        },
        {
          "text": "Keep jumping or switch career to say property agent.",
          "score": 2
        },
        {
          "text": "You probably need to go into private sector, with 2-3 job hops to get to 10k.",
          "score": 2
        },
        {
          "text": "10K+ is no longer hands on position but more on managing people. Not everyone is suited for such a role.",
          "score": 2
        },
        {
          "text": "10k is high end of MX11A iirc \n\nNot likely for farmer to double salary in Civil service in 5yr\n\nUnless you're hi-po or scholar track\n\nOnly possible route is to jump out\n\nEvery two years jump Each jump 20%",
          "score": 2
        },
        {
          "text": "$10k base... is well, if you want to hit close to 10k base before 40 in PS and you not a scholar or \"identified\" one, it's gonna be hard. Realistically, if you are a decent worker who gets high Cs and Bs, you can expect to get around $8-9k by 40 which is already very good. To get $10k, you have be at least a RO or HOD role.\n\nSo you need to be proactive, value added, take initative. Learn to send out emails to give your thoughts and opinions, share information. Write emails to management. Do presentations. Make them KNOW you. Be confident and give smart opinions. Technically, this applies to all jobs. \n\nI am not aware of any non-finance/non-specialised job that can pay as well as public sector consistently (including bonus). Considering the bonuses and non-peer pressure when it comes to taking the benefits in public sector.",
          "score": 2
        },
        {
          "text": "Your question focuses on the salary, but you're missing out the employer's perspective. Why would employers want to pay you more unless you deliver more value for them?\n\nSo my advice is, if you want to earn more, figure out what additional value you can give your company. Most of the time promotion means moving into supervisory role. That means from individual contributor (IC) to management. That can give a big pay jump. BUT...\n\nThe thing that makes one a good IC is not what will make one a good manager. As a manager you have to learn people skills, you have to discipline/counsel poor performers, manage talents who are smarter than you, learn delegation skills, learn how to present to board meetings, deal with politics like other managers who bully your staff. You may have to work on strategy and plans, like thinking what the company should do in 5 years time. Etc etc.\n\nEventually you find that your specialisation (whatever you did as IC) becomes less and less.\n\nIf you want to remain as individual contributor, then your growth is limited. See if you can transit to a mentor or trainer role.\n\nThat's how the 10k earners I know did it.",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1r17c80",
      "subreddit": "singaporefi",
      "title": "Buying a HDB Masionette",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r17c80/buying_a_hdb_masionette/",
      "score": 26,
      "num_comments": 54,
      "created_at": "2026-02-11T01:37:07",
      "selftext": "Hi all,\n\nWe are 34M and 30F (no kids) and looking to make the purchase of our first house. We decided to look at getting a resale near my in-laws because of the larger square footage of older HDBs, and have our eyes on a Masionette. It's been a dream for both of us to live in one.\n\nSome financial status:\n\nGross combined monthly: $15,400\n\nTotal CPF OA: $290,000\n\nCash &amp; Investments: \\~$137,000\n\nCurent commitment:\n\n6yo Mazda 3 (\\~1.5k monthly expense)\n\nThe unit we're eyeing at costs $920k at a matured estate. We're eligible for first timer household and proximity grants (no parent living in). We're not that keen on a EC/condo but we know buying an older flat has it's disadvantages as well (pro-rated CPF as it doesn't cover until 95). It's likely going to be a forever home and not a vehicle for investment for us given its non-existent exit plan.\n\nI'm wondering if it's the right move, or should we just go for a EC/condo? Are we financially comfortable to go with this unit?",
      "comments": [
        {
          "text": "Since you claim it’s going to be a forever home, I would recommend 5room flat. \n\nWhen you get older climbing up/down stairs can be a PIA",
          "score": 84
        },
        {
          "text": "I mean if you are not financially comfortable for the hdb, it’s likely to be worse for condo? \n\nWhen buying resale, I feel it silly to think of property as an investment.  There are better avenue to invest cash.",
          "score": 28
        },
        {
          "text": "For someone that has lived in a maisonette for a large proportion of my life - the stairs can really be a massive pain. \n\nWashing machine is downstairs, wardrobe upstairs. You get the drift. \n\nBut on the other hand, elderlies that lived with us in the maisonette also improve their health very significantly the moment they’re required to use the stairs basically 6-8 times per day.",
          "score": 25
        },
        {
          "text": "Btw, just note you are not eligible for first timer grants with a combined income of $15.2k",
          "score": 15
        },
        {
          "text": "Reno will be more than 100k, just saying. I see some people saying 100k...I think realistically 150k",
          "score": 8
        },
        {
          "text": "Given it's only the 2 of you, you may consider if you need that much space. For me and my wife, we got a resale 4 room (20+ years) which is quite wide and spacious for 2 persons, as it's the last few blocks without bomb shelters and you can tear down the walls (we just chose to hack 1 wall, but it creates a lot of space.)\n\nEven if there is a future kid or 2, a 4-room flat should be adequate. The loan repayments are also much lower than a mansionette too. \n\nI would suggest to see what's a comfortable amount you like to pay for monthly repayments, and do you REALLY REALLY want to pay a premium for space.\n\nNot forgetting the remaining lease and location, you have to consider it all. I chose a older house (thou still within the 95 year) due to its location and space, and have no regrets over it.\n\nLastly your renovations will be a large sum as well, so your final budget will need to include it. I can afford more renovation as I saved on getting a smaller space, and the house looks as if a new house.",
          "score": 5
        },
        {
          "text": "Do you ever plan to have kids?\n\nIf yes, choose a mansionette with a location that gets you family support (near enough so someone can come over to help easily in 10-15 mins drive max or public transport if they are coming to you) and choose one with an okay enough primary school in 1km that you don't mind your kid attending.\n\nFuture proof this then even if you can never manage to sell the unit, you are ok to really live there forever.",
          "score": 5
        },
        {
          "text": "If only able to buy 1 house, not much point buying a small EC or condo for \"investment\" purposes (900k don't think you can get anything close to HDB size). It will be super tedious to sell and buy back HDB when you want to try and realise your investment gains, and since you only have 1 home, you will have to fork out some or most your investment returns again anyway.",
          "score": 4
        },
        {
          "text": "I think it would be an impractical move because:\n\n\\- your cash position is too low for the price of the property.\n\n\\- you will be buying too much \"house\", leaving too little for investing. \n\n\\- you will be slaves to paying for your home. \n\n\\- it will be very difficult to sell it at a good price in the future, if you ever need to (e.g. to move closer to schools for future children or when it becomes impractical to climb up and down the stairs daily).\n\nYour dream can quickly turn into a nightmare if one of you decides not to work or loses the source of income. You can rent one for a year or so before deciding whether it is what you want for the long-term. ",
          "score": 4
        },
        {
          "text": "Older HDB means &gt; 40 yrs one according to your description? Likely you need to do a major renovation and probably more than 100k given the size? 1M worth for &lt; 60 years ya need to consider very thoroughly.",
          "score": 3
        },
        {
          "text": "If you love it buy it. Definitely don’t buy something even more expensive thinking it’s an investment. \n\nAnd no need to be scared of stairs. You can install a chair lift, or you can enjoy it for 30, 40 years then rent it out and rent a small flat, or sell it at a bad price but still more than enough to buy a small and old flat.",
          "score": 3
        },
        {
          "text": "Someone else will talk about the financial aspects but the stairs is going to a significant disadvantage. There could be situations that prevent stair usage. Needn’t be old age. A very difficult pregnancy, a random fall. Not to mention babies + stairs.",
          "score": 3
        },
        {
          "text": "Consider EA instead of EM. EMs are mostly old by now, which likely means many maintenance related issues will tend to crop up like spalling concrete or water leaks. The shorter lease will also be problematic for financing. Stairs are quite cumbersome and are fall hazards for elderly or kids. EA have better space utility.",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1r0tdlh",
      "subreddit": "singaporefi",
      "title": "consolidate debts without doing dcp/drs/ccs?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r0tdlh/consolidate_debts_without_doing_dcpdrsccs/",
      "score": 18,
      "num_comments": 21,
      "created_at": "2026-02-10T14:28:17",
      "selftext": "I (25F) have an outstanding debt of $40,000 in total. My monthly payments exceeds my salary per month- currently earning 2.3k before CPF deductions (does not include shift allowances and overtime pay).\n\nBreakdown of the above debts:\n\n$9500- DBS Cashline\n\n$2200- DBS Loan (Ends in Dec ‘26)\n\n$4100- Credit cards\n\n$5500- Moneylending\n\n$19,000- Credit Cooperative \n\nI am aware that DCP is unable to cover money lending loans and I highly doubt they are able to cover credit coop loans as well. \n\nI believe a $40k loan is a bit unrealistic based on my take home pay, so I’m actually looking to see if there are ways for me to get a 30k loan from banks or any financial institutions to clear and shut down my credit lines, money lending and the sum from credit coop without having to go through dcp/drs and hurt my cbs report. I am willing to do $900/month for 3years as it is more manageable for me and I will have more breathing room for daily expenses and sustain until my next month’s pay.\n\nA little more context- I am not staying with my parents, they have been out of the picture. I am currently staying at my bf’s house. His parents are kind enough to let me in and I do not have to contribute to monthly rents etc. \n\nI hold accountability for the debts I am in and I do not wish to trouble anyone. I’m very committed towards clearing my debts and trying to not feed myself with negative thoughts. I’m aware I’m still young and a 40k debt isn’t what my life is worth. I’m willing to take up any advice that could possibly help me to recover financially. Thank you. ",
      "comments": [
        {
          "text": "900/month for 3 years is not even enough to clear the principal amount... You'll need to cut down your expenses much more aggressively",
          "score": 28
        },
        {
          "text": "Without any sort of DCP/DRS/CCS?  \n  \nStep 1: Borrow money from your boyfriend to pay off the debts with the highest interests first.  \nStep 2: Work double overtime to pay the rest of your outstanding loans and until you've fully repaid your boyfriend.  \nStep 3: Cancel your credit card and never borrow money again.\n\nI'm not going to mince words. You are overspending. Without rent expenses, you should be able to comfortably live between $1k-1.5k a month. Those with an extremely frugal lifestyle can even keep their monthly expenses below $1k without rent.",
          "score": 27
        },
        {
          "text": "DMP is your best bet to restructure your debt. That will stop the insane interest from continue rolling while all credit lines will be shut down to prevent you from borrowing easily. Go talk to Credit Counselling Singapore about it.\n\nAnd why are you worried about your credit score being hurt? Unless you are in a job role where stability is affected by your score, otherwise, it can be rebuilt down the road (quite easily in fact) once you settle your current debt.",
          "score": 10
        },
        {
          "text": "Unfortunately u have no way out of this without going thru any sort of dcp, nobody will lend you such a large amount considering your current income. Your best bet sadly is to borrow from your bf/friends/family\n\n\nYou need to prioritise to get rid of your moneylenders first, and see whether you can restructure for a 5 year personal loan on your existing credit limits. Have you checked your credit score?",
          "score": 9
        },
        {
          "text": "It's not realistic to expect to not hurt your CBS report. If you hold accountability, then you should accept that your credit score will be extremely bad after this. ",
          "score": 5
        },
        {
          "text": "DCP will hurt your chances of securing any loan in future until you clear it and let credit score settle for 6 months or more. Do consider this fact for DCP. One upside of DCP is it prevents you from opening any more credit lines, curbing the bad habits. Consistent payments also builds up your credit score over time.\n\nNever ever go with Money lender, they are literally legalised loan sharks with crazy interest rates.\n\nTry credit counselling first, they can advise you better and decide where to go from there.\n\nAll the best OP! Realisation is a very good first step!",
          "score": 3
        },
        {
          "text": "900 per month for 3 years for 30,000 imputes an EIR of 2.67% PA. No where in the world there's unsecured lending that low.\n\nEverything, everything is risk adjusted and you are not worth the risk, not with your profile.",
          "score": 3
        },
        {
          "text": "Isn’t this the point of drs",
          "score": 1
        },
        {
          "text": "Don't think any bank will still loan you if you have outstanding with them...\n\nUnderstand that you don't wish to trouble anyone but your best bet is to borrow from close friends or family as those are interest-free.",
          "score": 1
        },
        {
          "text": "Sorry but how is credit cooperative able to give so much money out usually in loan unless this is after u have defaulted a few time .\n\nYes dcp doesn't cover credit as credit cooperative loan is sort of like a special kind of loan that is not on credit report .\n\nThe only way  I can think of is only to burn weekend / night sleeping time to reduce debt by doing more jobs",
          "score": 1
        },
        {
          "text": "DMP will be a solution for you",
          "score": 1
        },
        {
          "text": "Keep it up. Jiayou. ",
          "score": 1
        },
        {
          "text": "1. How did you get into such a debts? If overspending, maybe can consider away some valuables.\n\n2. Get a copy of your credit bureau to see where you stand.\n\n3. List down what is the min. payment for each loan and what's their interest rate?\n\n4. Base on your income and what you have in outstanding, quite unlikely the banks will grant you any further loan. If you can taking other loans to pay back existing loans, you will still be back to square one with outstanding loans.\n\n5. You can consider apply to digital bank loans such as Trust and GXS. CIMB, HSBC, Stanchrt, Maybank as foreign banks can be less strict.\n\n6. If you pay off your DBS loan first, how much can still be lend out from DBS?  ",
          "score": 1
        },
        {
          "text": "1) own your debt by taking on dcp/drs/ccs. \n2)5.5k should be clear asap for obvious reason \n3) possible to supplement your income by taking on additional jobs on weekends, post work \n4) get a better job- many non office jobs can earn higher than 2.3k.",
          "score": 1
        },
        {
          "text": "Why not focus on increasing your income instead? Become a PHV driver and double your income with some hard work? ",
          "score": 1
        },
        {
          "text": "MAS regulation is that banks only allow you to take loan of 8x times your salary.. Therefore max out your credit card to pay back the licensed money lender, then u apply for dcp.. this is the best way for your current situation..\n\nThe other best way is to buy toto and hope u can strike a 2nd prize..",
          "score": -2
        }
      ]
    },
    {
      "id": "t3_1r0wxmx",
      "subreddit": "singaporefi",
      "title": "HFE application for self-employed",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r0wxmx/hfe_application_for_selfemployed/",
      "score": 3,
      "num_comments": 14,
      "created_at": "2026-02-10T18:10:02",
      "selftext": "Hi everyone! Does anyone have experience with applying for HDB's HFE as a self-employed person? My spouse owns a company and I freelance (which sometimes includes temporary part-time work, but mainly I take freelance projects). Our income thus does not come monthly.",
      "comments": [
        {
          "text": "For self-employed people, I assume you don't have official pay slips unlike salaried &amp; employed workers, so HDB usually will ask for latest IRAS NOA. If I'm not wrong, bank statements may be asked for as well. Not sure what HDB's standard of hairline cut to assessable self-employed income, but I heard it's at least 30%. So for e.g., if you earn $100k/annum, only about $70k/annum will be assessed. Just sharing what I know, but best is for you to go through the steps to applying for HFE and you'll get the best answers that fit you &amp; your spouse. All the best!",
          "score": 6
        },
        {
          "text": "Me!!\npls feel free to dm me I went through a whole suffering for it",
          "score": 5
        },
        {
          "text": "It was quite simple for my HFE loan. They asked for my NOA during application, which I just have to log into singpass and auto retrieve. Other than that, there were no need for other upload of documents &amp; it went through smoothly. \n\nBut yes, remember there is a 30% cut for assessment of loans. All the best!",
          "score": 2
        },
        {
          "text": "Self employed can also pay yourself salary. \n\nOwn a company leh, if company profit but pay no salary = owner $0 income. \n\nPay yourself income.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r1ibld",
      "subreddit": "singaporefi",
      "title": "Advice getting into equity research / portfolio management",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r1ibld/advice_getting_into_equity_research_portfolio/",
      "score": 1,
      "num_comments": 14,
      "created_at": "2026-02-11T08:27:48",
      "selftext": "Hi, I’m 31 this year and from Private Banking Ops. I’m trying to land (sell side) equity research roles and work my way to become a (buy side) portfolio manager. I passed CFA Level 1 and am applying actively, but unfortunately not getting much response. I know it’s difficult because I don’t have relevant work experience, but I’m set on it and (naively) optimistic. Looking for any advice from experts or those already in the field to help me, thank you!",
      "comments": [
        {
          "text": "I heard Phillip Capital hires anyone with a beating pulse, but the pay is low. In general the industry is shrinking and it’s very tough to break in. You can also consider learning or brushing up your Chinese to cater to the family office pool.\n\nI’m currently an equity analyst in a mutual fund, feel free to DM.",
          "score": 16
        },
        {
          "text": "It is 100% very difficult lol. You're competing against the sharpest fresh grads with keen eyes.\n\nGet the rest of your CFA papers in, do blog about your research and attend events to get connected if you're not from an already connected family (probably wouldn't need to ask if so).\n\nSince you've at least narrowed down your interests, then just do or die until you make it in. Good luck.",
          "score": 15
        },
        {
          "text": "I lateraled into buyside equities from a non-finance background. Not that much younger than you. Am happy to help. Shoot me a DM.",
          "score": 4
        },
        {
          "text": "Honestly? You’re too late",
          "score": 4
        },
        {
          "text": "CFA 1 is nothing, you either get all 3 levels and get into a small shop or try ur best to get into applied finance masters/MBA programs and get in through the graduate pipeline.\n\nFamily office is one that generally have a more flexible entry barrier.",
          "score": 3
        },
        {
          "text": "unfortunately, like what others have said, the ship has long sailed",
          "score": 2
        },
        {
          "text": "Why not embark on IJP?",
          "score": 1
        },
        {
          "text": "To be frank, a Private Banking Operations professional wanting to transition into Asset Management (not Fund Operations / Fund Administration) is a gargantuan task.\n\nYou are competing against an applicant pool filled with First Class Honours / Highest Distinction / Summa Cum Laude graduates from Harvard &amp; Stanford &amp; Oxford &amp; Cambridge &amp; NUS &amp; NTU &amp; SMU where many of them have multiple internships in M&amp;A, investment banking etc under their belt before graduating from university \n\nalong with many Masters Degree in Finance holders from non-IB background seeking to transition into professional fund management.",
          "score": 1
        },
        {
          "text": "Get a masters in financial engineering. \n\nSG grad from NTU and NUS around 50% find job while still studying part time masters and 80% doing new job after grad. Average salary 170k USD.\n\nSource: went thru the same and all my sinkie course mate found new jobs within 1 year of the 2-3 year part time course with significant pay rise.",
          "score": -8
        }
      ]
    },
    {
      "id": "t3_1r1nyyl",
      "subreddit": "singaporefi",
      "title": "What are some sales role within the financial industry?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r1nyyl/what_are_some_sales_role_within_the_financial/",
      "score": 0,
      "num_comments": 31,
      "created_at": "2026-02-11T12:46:09",
      "selftext": "Background: 33M in risk management role looking to start from the bottom doing sales, I may not have the necessary experience but I am confident in my glib tongue. It’s been tiring working in a silo at my role, kinda want to explore jobs where I can bounce off energy with people.\n\n  \n\nWhat are the sales related role in a financial industry? Assuming I have a good financial knowledge both within the industry and the macro economy.\n\n  \n\nTrying to stay away from property and insurance roles",
      "comments": [
        {
          "text": "like bro ... is this a serious question when the hall is full of FAs and RMs?",
          "score": 21
        },
        {
          "text": "Besides the client sales role mentioned, there are a lot of financial service providers, like Bloomberg, MSCI, S&amp;P, etc, that have B2B sales office based in Singapore. I don't know if they would consider experienced lateral hires for entry level roles, but you might have an inroad with your risk experience for their risk products.",
          "score": 10
        },
        {
          "text": "Having a ‘glib’ tongue is not enough to excel in sales, my friend. There’s more to it than simply ‘seducing’ prospects into buying your product. You need strong territory planning skills, time management, dealing with client escalations, knowing how to multi-thread, identifying right persona, adopting MEDPPIC and to some extent, be ruthless enough to ‘sell the dream’.\n\nMore importantly, be mentally prepared that the PIP conversation will never leave once you enter corporate sales. The money may be lucrative but it is absolutely not worth your mental health. There’s a reason why sales have a high turnover rate. \n\nRemember that your best performance is only as great as the last quarter.",
          "score": 6
        },
        {
          "text": "are you in market risk? actually is there a reason why you wanna leave risk management?",
          "score": 3
        },
        {
          "text": "Lol good luck avoiding insurance products or some insurance-hybrid products when it comes to financial sales…\n\nData on principal sizes shows that big money like certainty. Which also explains why the fixed income markets are multiple times larger than equity markets.\n\nInsurers all have affluent-segment departments and products that dedicate themselves to the HNW market precisely because they do well with big money.\n\nRegardless if you are FA, banker, agent or broker targeting retail, mass-affluent or HNW, insurance will continue to play a significant role in your products.",
          "score": 2
        },
        {
          "text": "Retail RM : do bank insurance, doing structured deposits, and other ILP.\nPriority RM: above plus equity trades\nPB RM: full investment suites, UL, Trust\nCorporate RM: loans, loans, loans \n\nPaywise PB RM is top tier, follow with priority, retail then corporate. Corporate RM has job stability",
          "score": 1
        },
        {
          "text": "You'll be in for a shock. Sales will humble you my friend. Good luck!",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r16grl",
      "subreddit": "singaporefi",
      "title": "SBF Exercise",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r16grl/sbf_exercise/",
      "score": 0,
      "num_comments": 4,
      "created_at": "2026-02-11T01:05:33",
      "selftext": "If I apply for the current SBF exercise and get allotted a queue number, but decide not to pick any remaining units due to a lack of interest, will I lose my first time applicant status for future BTO &amp; SBF exercises? ",
      "comments": [
        {
          "text": "https://www.straitstimes.com/singapore/politics/first-timers-must-select-bto-flats-when-invited-by-hdb-or-lose-priority-for-a-year-from-august-launch#:~:text=Mr%20Lee%20said%20the%20Housing,new%20category%2C%20Mr%20Lee%20said.\n\n\nHere you go",
          "score": 12
        }
      ]
    },
    {
      "id": "t3_1r0yhf7",
      "subreddit": "singaporefi",
      "title": "What to do with 25k USD?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r0yhf7/what_to_do_with_25k_usd/",
      "score": 0,
      "num_comments": 22,
      "created_at": "2026-02-10T19:40:29",
      "selftext": "Hi everyone,\n\nI have 25k USD on my DBS account that I only invest into fixed term deposit (3%) for 3 months. I don't need that money right now nor in the next 2-3 ywars so what would be a good way to invest it? Is Amundi a good idea?\n\nThanks in advance",
      "comments": [
        {
          "text": "0 DTE QQQ calls tonight.\n\nWhat strike? \n\nYes.\n\n—edit— op this is the most upvoted comment. You have to do it now.",
          "score": 43
        },
        {
          "text": "Honestly think about moving it out to SGD. USD looks shaky long term.",
          "score": 3
        },
        {
          "text": "Don't keep usd in cash. Keep it invested in most things are better than just in cash",
          "score": 3
        },
        {
          "text": "Fixed D is good enough",
          "score": 2
        },
        {
          "text": "SWIFT to IBKR buy VWRA.\n\nSWIFT to Binance buy BTC.\n\nSWIFT to Tiger / Moomoo and buy VOO or QQQ.",
          "score": 2
        },
        {
          "text": "What in the low effort...\n\nWhat do you mean right now? How long is right now? Tmr? Next week? Next month? Next year? Next decade? Next life?\n\nWhat is this money for? Your daily spending? Your holiday? Your house? Your retirement?\n\nEdit: I saw that you edited your post.\n2-3 years... okay, what is this money for?",
          "score": 1
        },
        {
          "text": "Btc",
          "score": 1
        },
        {
          "text": "IBKR, VWRA",
          "score": 1
        },
        {
          "text": "META",
          "score": -2
        },
        {
          "text": "Do physical gold, pretty much zero risk in it. Can teach you.",
          "score": -4
        }
      ]
    },
    {
      "id": "t3_1r0yow9",
      "subreddit": "singaporefi",
      "title": "Savings / investments as a 21 year old",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r0yow9/savings_investments_as_a_21_year_old/",
      "score": 0,
      "num_comments": 10,
      "created_at": "2026-02-10T19:52:01",
      "selftext": "Just curious as to how much money people have saved or invested around my age group ",
      "comments": [
        {
          "text": "What's the point of this question? If we all say that age don't need to invest, then you also don't invest?",
          "score": 8
        },
        {
          "text": "zero, try not to compare at ur young age",
          "score": 5
        },
        {
          "text": "Does 0dte counts?",
          "score": 3
        },
        {
          "text": "this sub? at least 100k by 30, salary 20k jskm",
          "score": 2
        },
        {
          "text": "No one cares because it might just be your parents’ money. Or it can be because you did a lot of part-time work but your studies suffered as a result.",
          "score": 2
        },
        {
          "text": "Assume they got none and you thinking about saving and investing already puts you ahead of the curve.",
          "score": 1
        },
        {
          "text": "Probably none HAHAHAH. But it good to start early !",
          "score": 1
        },
        {
          "text": "19 here with 10k only but im gonna deposit everything i earn from internship and ns into tiger broker",
          "score": 1
        },
        {
          "text": "两种宗教不可信，比较，计较。",
          "score": 1
        },
        {
          "text": "I peered into each individual 21 year old singaporean's bank account last night to bring you this answer. The median is $30M with SD $1M. Unfortunately, you are the only one below $5M invested :(",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r0zny8",
      "subreddit": "singaporefi",
      "title": "Need some financial advice",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r0zny8/need_some_financial_advice/",
      "score": 0,
      "num_comments": 21,
      "created_at": "2026-02-10T20:40:48",
      "selftext": "Hello redditors!\n\n23F, with about $200k in the bank, I don’t really know how to invest, how should I manage it? And also am I counted as average at 23??",
      "comments": [
        {
          "text": "Read the pinned post.\n\nDelete this one cos the predatory FAs are all going to be DMing you.",
          "score": 11
        },
        {
          "text": "I'm guessing you gonna get tons of DMs soon. I'm gonna give you some advice. \nFirst, you're young, get your shield, term and life in place, especially CI. \n2nd, dont listen to insurance friends who wants you to \"support\" them. Its BS. When they switch job or agencies, you are the last on their minds. Do your research and buy ONLY what you need. Not endowments, not ILPs. \n3rd, dont be tempted to buy risky products like crypto or currency. Stick to proven indices and just DCA, can be monthly or quarterly.\n4th, You CAN try stocks but lose only what you can. And never try penny stocks.\n5th, Remember what I said before when you decide to ignore my above advices.",
          "score": 9
        },
        {
          "text": "Start with The pinned post loads of wisdom in there.\n\nProbably not going to go out into the risk curve",
          "score": 3
        },
        {
          "text": "Don't reply to random strangers in dm telling u they will give u specialized advice or whatever",
          "score": 2
        },
        {
          "text": "Asking advice from here sometimes is basically rojak advice hahaha. In any case, this sub got a lot of \"experts\" when it comes to personal insurance haha.\n\nYou go ask Gemini AI can be better sometimes.",
          "score": 2
        },
        {
          "text": "There's the pinned post AND this one I did too. I recommend doing the pinned post first before jumping into this 'newer' one.\n\n  \n[https://www.reddit.com/r/singaporefi/comments/1mu8b2v/a\\_semidetailed\\_2025\\_guide\\_to\\_financial/](https://www.reddit.com/r/singaporefi/comments/1mu8b2v/a_semidetailed_2025_guide_to_financial/)",
          "score": 2
        },
        {
          "text": "First, you must explain how you get 200k at age 23. Else uncle dont tell you how to invest.",
          "score": 1
        },
        {
          "text": "Read the pinned post first",
          "score": 1
        },
        {
          "text": "If you knew even a single person in your age range, you’d know damn well you are well outside the range of ‘average’, why play dumb? \n\nHumble bragging aside, with the time horizon you have, I’d split the sum into three baskets:\n\n1. 6 months of expenses, keep in HYSA or maximally 80% in SSB, which is decently liquid\n\n2. Near-term expenses, like housing, school fees, vacations, or big ticket items. This can be placed wholly in SSB or MMF, depending on your risk appetite.\n\n3. ETFs, the pinned post will tell you all you need to know.",
          "score": 1
        },
        {
          "text": "Make several buckets according to your goals and risk level. Do not forget to diversify: assets, currency, geography, etc.",
          "score": 1
        }
      ]
    }
  ]
}