{
  "schema_version": "raw_scrape_v1",
  "report_id": "2026-02-17",
  "scraped_at": "2026-02-17T20:43:44.848525",
  "subreddits": [
    "singapore",
    "askSingapore",
    "SingaporeRaw",
    "singaporefi"
  ],
  "total_posts": 34,
  "total_comments": 466,
  "posts": [
    {
      "id": "t3_1r6trr5",
      "subreddit": "singapore",
      "title": "S'pore woman cancels restaurant dinner due to family death, allegedly charged S$400 cancellation fee",
      "url": "https://old.reddit.com/r/singapore/comments/1r6trr5/spore_woman_cancels_restaurant_dinner_due_to/",
      "score": 469,
      "num_comments": 146,
      "created_at": "2026-02-17T10:27:48",
      "selftext": "",
      "comments": [
        {
          "text": "“While the restaurant empathises and tries to be flexible, it did notice last-minute cancellations due to customers choosing to book several restaurants at once, and only deciding where to go at the last minute. Such customers also give emergency reasons for their cancellation.”\n\nAt other times, the restaurant said, when some guests tried to back out citing a medical condition, and were informed about the cancellation charge, they turn up anyway \"just fine.\" 👀👀",
          "score": 621
        },
        {
          "text": " Nothing wrong ah, terms and conditions.\n\nEveryone wants compassion and sympathy, then who show that to the restaurant and their losses?",
          "score": 384
        },
        {
          "text": "Good that MS didnt reveal the name, cos it sounds like the lady is just trying to stir",
          "score": 367
        },
        {
          "text": "Recently had a close family death too. Personally, a $400 cancelling fee would have been the last thing I would care about, somemore spending time and effort to talk to media and gives 1 star review during a time of grieving. \n\nI couldn't understand her mentality and priorities...\n\n",
          "score": 278
        },
        {
          "text": "alot of people dont understand high end F&amp;B. By cancelling last min, the restaurant will incur ingredient loss,  opportunity loss, labour, etc. Those important events once a year is damn important for them in terms of income. also not right for them to just eat the loss.",
          "score": 223
        },
        {
          "text": "This woman reacted with extreme aggression and uncouthness, by using vulgarities on the manager who called her to explain. And she expected people to be compassionate toward her? I have little sympathy.",
          "score": 172
        },
        {
          "text": "Unfortunately, those are the restaurant’s terms and conditions. Not trying to downplay the authenticity of the woman’s loss of her loved ones, but technically anybody can just say they lost someone close to them without any supporting document or they say they have a sudden medical condition etc, then is the establishment supposed to just bear the loss of revenue? Anybody can just be saying grandparents passed away, mother fall down, father got emergency diarrhoea and shitting out of his pants, but who can verify? Even airlines also require death certificate for a refund.",
          "score": 142
        },
        {
          "text": "This Karen apparently also had a lot of special requests which the restaurant spent time and money to prep for. She also asked to reschedule to 15 Feb but the restaurant couldn't accommodate because they were full then. 14 Feb cannot go but 15 Feb can? Make it make sense Karen. \n\nThere were some unfair 1-star reviews on Google Maps cos of this issue last night, but fortunately they've already been taken down. Honestly serves this Karen right, who knows how many times she has pulled off this stunt with other restaurants.",
          "score": 111
        },
        {
          "text": "Honestly, quite a fair and reasonable response from the restaurant. They weren't rude about it and explained their rationale politely and firmly. Compassionate grounds are out of goodwill and are not an entitlement. It sucks but the restaurant is not obliged to refund the deposit.",
          "score": 68
        },
        {
          "text": "Lol so 14/2 not ok but can recover by 15/2? No need to prepare for the funeral? The woman sounds damm sus.",
          "score": 51
        },
        {
          "text": "I ran a business where reservations where not refundable within 24 hours notice (not a restaurant - it was a flat rate cost)\n\nYou would not believe how many people suddenly have a death in the family when they realize that it's the policy.\n\nOrders of magnitude more than possible.",
          "score": 44
        },
        {
          "text": "I'm with the restaurant on this. If they just allow full refund of deposits, it'll open floodgates of everyone else reserving a table and cancelling last minute if they decide to go somewhere else. \n\nThe terms and conditions were already stated upfront. The woman accepted this and paid the deposit. The restaurant has every right to deny her request. \n\nImagine if you own a bakery and customers make preorders of cakes and decide to cancel one day before. You'll quickly go out of business if you refund all their deposits. \n\nThis was a valentine's day curated dinner. From the description it looks like it was a special occasion menu.",
          "score": 33
        },
        {
          "text": "Sometimes restaurants have a waiting list where they can fill up spots for last min cancellations\n\nBut not for Valentine’s Day. People don’t want to be waitlisted, they find alternatives early. Also menus and ingredients have to be prepped in advance, sometimes custom. It’s the one day of the year for restaurants to earn big money\n\nSingaporeans no class nowadays curse and swear at staff. And also brainless. Other countries have more enterprising people who blast out at their network offering their tables, and once I’ve seen two singles deciding to have an impromptu blind valentines date because of this",
          "score": 31
        },
        {
          "text": "The ultra high end restaurants, especially those omakase or fine dining kind, aren’t just expensive because they can. \n\nThey’re expensive partly because of the crazy amount of prep time required and speciality ingredients, and you can’t just drop in for a quick bite, you need reservations in advance.",
          "score": 20
        }
      ]
    },
    {
      "id": "t3_1r6dwdq",
      "subreddit": "singapore",
      "title": "Singapore's Faiz Basha overcomes tricky conditions, finishes 35th in slalom at Winter Olympics",
      "url": "https://old.reddit.com/r/singapore/comments/1r6dwdq/singapores_faiz_basha_overcomes_tricky_conditions/",
      "score": 373,
      "num_comments": 13,
      "created_at": "2026-02-17T00:16:24",
      "selftext": "Congratulations to the only Singaporean Olympian at the 2026 Olympic Games, Faiz Basha! He DNFed (did not finish) the first run of his previous event (Giant Slalom) so it's great that he completed both runs here.",
      "comments": [
        {
          "text": "Keep up your good work and reach greater heights to  fly the Singapore flag high!",
          "score": 109
        },
        {
          "text": "![gif](giphy|Z2raLnReaS9CwtPbSf)",
          "score": 56
        },
        {
          "text": "you made us proud!",
          "score": 36
        },
        {
          "text": "saw the footage, hope he's ok. still amazing that we have anyone to represent us at all in the winter olympics",
          "score": 29
        },
        {
          "text": "You are an inspiration! Hope to see more Singaporeans competing in the winter games.",
          "score": 18
        },
        {
          "text": "Well done!!!! So PROUD OF U ALREADY. having to be a participant is already dream come true!!!!",
          "score": 13
        },
        {
          "text": "Amazing! 35th best in the world!",
          "score": 11
        },
        {
          "text": "Great effort, good run!",
          "score": 6
        },
        {
          "text": "It’s amazing how he trained using roller blades. An inspiration to all.",
          "score": 5
        },
        {
          "text": "can't wait to have him in Prism ads",
          "score": 4
        },
        {
          "text": "Represent!",
          "score": 3
        },
        {
          "text": "The Norwegian skier who was in the lead after round 1 straddled the post and dnf. That was heartbreaking for him so to watch our Singaporean conquer the course is very impressive.",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1r6woqx",
      "subreddit": "singapore",
      "title": "Do anyone remember this tunnel from the channel 8 drama \"10 years ago?",
      "url": "https://old.reddit.com/r/singapore/comments/1r6woqx/do_anyone_remember_this_tunnel_from_the_channel_8/",
      "score": 270,
      "num_comments": 29,
      "created_at": "2026-02-17T12:45:37",
      "selftext": "",
      "comments": [
        {
          "text": "Not sure if it the same one, but I remember one drama about a time travelling tunnel. It features 3 (or rather 2?) protagonists who have past events they regret or want to change. For a channel 8 drama, it was surprisingly dark and depressing. \n\n\nStory: &gt;!They naively think it is straight-forward, but due to the Butterfly Effect, every event they change in the past has unpredictable long term effects. Desperate to get the perfect outcome, they keep using it, but it makes everything progressively worse.!&lt; \n\n\nIn the end, &gt;!2 of them give up on the tunnel so as to not make things worse, but the last of them gets stuck in an infinite time loop!&lt;\n\n\nI may misremember some details but thats the gist of it.",
          "score": 85
        },
        {
          "text": "Sounds like 十年你还好吗 (If Only I Could), 2016 mediacorp drama featuring Rui En?",
          "score": 64
        },
        {
          "text": "No, but I do remember it from Alexandra Technopark. You can see the entrance here: [https://maps.app.goo.gl/GLWV5GxiA66fxdvu8](https://maps.app.goo.gl/GLWV5GxiA66fxdvu8)\n\nIt's open to the public if you want to check it out.",
          "score": 55
        },
        {
          "text": "confirm, this is the tunnel at alexandra technopark.. i used to walk through it everyday to get to work from the busstop along alexandra rd",
          "score": 25
        },
        {
          "text": "I remember the tunnel but not the show",
          "score": 11
        },
        {
          "text": "for the curious, the installation itself, which is unrelated to the show, is part of [Singapore Art Week 2026](https://artdis.org.sg/next-stop-together/?utm_source=chatgpt.com) at Outram Park mrt. created by 李俊樂, it features a letter from his mother and him walking through the tunnel. \n\n&gt; It is a mother’s letter to her son on the verge of turning 21. She says adulthood for him is not only about freedom and independence, but also entering a world that may not fully understand him. She promises steady support while teaching him how to navigate public life with confidence and consideration for others. She worries about not being able to accompany him forever, but hopes he will continue forward bravely when that day comes. The core message is that he does not need to become someone else, because his true self is already precious.",
          "score": 7
        },
        {
          "text": "Dark before Dark",
          "score": 3
        },
        {
          "text": "The drama name is Beyond  (2006)",
          "score": 3
        },
        {
          "text": "I remember Paige insists to change then the show ends.",
          "score": 2
        },
        {
          "text": "I remember Tong Xin Yuan (portrait of life) also have this scene",
          "score": 2
        },
        {
          "text": "[removed]",
          "score": 1
        },
        {
          "text": "I really wanna read the Chinese words there. Anybody has a closeup photo?",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r6cm70",
      "subreddit": "singapore",
      "title": "Throwback to 1939: Singapore’s Water Usage Peaks the Day Before CNY 🧧🚿",
      "url": "https://old.reddit.com/r/singapore/comments/1r6cm70/throwback_to_1939_singapores_water_usage_peaks/",
      "score": 214,
      "num_comments": 14,
      "created_at": "2026-02-16T23:29:38",
      "selftext": "And consumption was the lowest on the first day of CNY itself. Anyone knows if its the same today?\n\n\n\n[Source: The Straits Times, 2 April 1939](https://eresources.nlb.gov.sg/newspapers/digitised/page/straitstimes19390402-1.1.17)",
      "comments": [
        {
          "text": "I feel that despite it being almost a century later, it might actually still be true",
          "score": 72
        },
        {
          "text": "There used to be a CNY tradition where people don't bathe or wash their hair on the the first day of CNY. That might have contributed to the peak.",
          "score": 36
        },
        {
          "text": "If Chinese people showered in the morning in the 1930s I don't see why we can't all do it now...what happened in between 😭",
          "score": 22
        },
        {
          "text": "I like that straight-forward straight to the point style of writing !",
          "score": 4
        },
        {
          "text": "The tone of writing was so much different then. \"Chinese\" (or any other race), \"working-class\" - all seem like taboo nowadays (CMIIW)... ",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1r6vcpp",
      "subreddit": "singapore",
      "title": "ComfortDelGro taxi turns turtle in Ang Mo Kio on first day of CNY",
      "url": "https://old.reddit.com/r/singapore/comments/1r6vcpp/comfortdelgro_taxi_turns_turtle_in_ang_mo_kio_on/",
      "score": 115,
      "num_comments": 13,
      "created_at": "2026-02-17T11:40:08",
      "selftext": "",
      "comments": [
        {
          "text": "Now year of horse not turtle. Turtle never had a year anyways",
          "score": 82
        },
        {
          "text": "Most impt question is..... What's the plate number",
          "score": 51
        },
        {
          "text": "财源滚滚",
          "score": 29
        },
        {
          "text": "福倒",
          "score": 17
        },
        {
          "text": "The driver is accidentally doing a “福到” 🧧",
          "score": 7
        },
        {
          "text": "Huat ah",
          "score": 6
        },
        {
          "text": "当龟",
          "score": 5
        },
        {
          "text": "Fan tai sui",
          "score": 1
        },
        {
          "text": "Huh, no one seriously hurt in this situation? Someone up there or down there looking after the drivers.",
          "score": 1
        },
        {
          "text": "Funny headline from ST.",
          "score": -1
        }
      ]
    },
    {
      "id": "t3_1r6ywh7",
      "subreddit": "singapore",
      "title": "AFC confirms Tampines Rovers awarded 3-0 win over Công An Hà Nội in AFC Champions League Two",
      "url": "https://old.reddit.com/r/singapore/comments/1r6ywh7/afc_confirms_tampines_rovers_awarded_30_win_over/",
      "score": 107,
      "num_comments": 21,
      "created_at": "2026-02-17T14:44:50",
      "selftext": "",
      "comments": [
        {
          "text": "Vietnam team penalised in match in Singapore because they fielded a man named China from Brazil. Make it make sense",
          "score": 58
        },
        {
          "text": "tampines wei",
          "score": 49
        },
        {
          "text": "How tf is this happening again",
          "score": 30
        },
        {
          "text": "This feels familiar",
          "score": 21
        },
        {
          "text": "WE ARE SO BACK PARK THE DAMN BUS",
          "score": 20
        },
        {
          "text": "The irony here is that Công An means police in Vietnamese. Vietnamese Police breaking the rules is nothing new. After all, Vietnam has the best police force that money can buy.",
          "score": 16
        },
        {
          "text": "Time to 马到成功",
          "score": 13
        },
        {
          "text": "Marks the beginning of greatest comeback",
          "score": 7
        },
        {
          "text": "PARK THE BUS 291 293 65 and 67",
          "score": 5
        },
        {
          "text": "Sanfrecce 2.0 lets go! Time to park the buses from Tamp Bus Interchange.",
          "score": 1
        },
        {
          "text": "[deleted]",
          "score": -4
        }
      ]
    },
    {
      "id": "t3_1r723p0",
      "subreddit": "singapore",
      "title": "About 23,000 community care sector employees could get at least 7% pay raise as part of new salary guidelines",
      "url": "https://old.reddit.com/r/singapore/comments/1r723p0/about_23000_community_care_sector_employees_could/",
      "score": 83,
      "num_comments": 14,
      "created_at": "2026-02-17T18:04:07",
      "selftext": "SINGAPORE: About 23,000 community care organisation staff members could see at least a 7 per cent pay increment as part of new salary guidelines, \n\nHealth Minister Ong Ye Kung said on Tuesday (Feb 17).\n\nNoting that an increase in salary for staff members would translate to an increase in operational costs, Mr Ong also said that there will be a first tranche of support of S$100 million (US$79 million) to help defray the cost of the higher salaries.",
      "comments": [
        {
          "text": "Yes please do. The amount of essential work they perform is well deserving of visibility and remuneration.",
          "score": 55
        },
        {
          "text": "These are jobs with real impact. And only 23,000 employees are given at least 7% raise. \n\nFor good comparison, the news reporter should be asking how this compares to raises given for paper pushers in the public service especially those whose job don’t show real impact",
          "score": 14
        },
        {
          "text": "Used to work with a nursing home at my previous job. The nurses (mostly foreigners) are SO wonderful. They learned to speak mandarin, some dialects and malay to better communicate with the residents, and they know every resident so well. Can tell us who likes what, who doesn’t get along with who so that we can accommodate them better during activities, what cheers them up etc.\n\n7% isn’t much if you do the calculations but hopefully the new salary guidelines ensure better increments for them in the years to come.",
          "score": 12
        },
        {
          "text": "Finally a good thing with impact to recognise essential workers instead of claps.",
          "score": 7
        },
        {
          "text": "Good",
          "score": 5
        },
        {
          "text": "u/kopisiewsiewdai do let us know what your boss say this time round. \n\nhttps://www.reddit.com/r/singapore/s/Q3FDG54YKt",
          "score": 1
        },
        {
          "text": "A 7% bump isn’t life-changing, but for community care staff who’ve been stretched for years, it’s at least some recognition.\n\nAlso the S$100M support matters, otherwise orgs would struggle to sustain it.\n\nStill… with rising costs everywhere, I wonder if 7% is really enough long term.",
          "score": 1
        },
        {
          "text": "Second tranche of support will be from patients bills",
          "score": 1
        },
        {
          "text": "Does this include AIC employees",
          "score": 0
        },
        {
          "text": "Are they underpaid by 7%",
          "score": -4
        }
      ]
    },
    {
      "id": "t3_1r6v5tr",
      "subreddit": "singapore",
      "title": "Love With Muscular Dystrophy: Our Unconventional Story | On The Red Dot",
      "url": "https://old.reddit.com/r/singapore/comments/1r6v5tr/love_with_muscular_dystrophy_our_unconventional/",
      "score": 29,
      "num_comments": 2,
      "created_at": "2026-02-17T11:30:52",
      "selftext": "",
      "comments": [
        {
          "text": "It's a very touching story... Wish them a blessed and happy life ahead",
          "score": 3
        },
        {
          "text": "But really take a long of guts to do that. I mean the woman.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r6nemj",
      "subreddit": "singapore",
      "title": "r/singapore random discussion and small questions thread for February 17, 2026",
      "url": "https://old.reddit.com/r/singapore/comments/1r6nemj/rsingapore_random_discussion_and_small_questions/",
      "score": 8,
      "num_comments": 215,
      "created_at": "2026-02-17T06:01:40",
      "selftext": "*🌻☀️Good morning all have a great day and stay strong, stay safe and stay healthy! Jiayou!*\n\nTalk about your day. Anything goes, but subreddit rules still apply. Please be polite to each other!",
      "comments": [
        {
          "text": "Finally ran for the first time today~ it was drizzling abit just now but it’s ok. No cny celebrations for a few years already~",
          "score": 6
        },
        {
          "text": "We made a memory game and got it published (after getting some feedback from NUS-FASS psychologists and NTU-NIE educators) - basically something which helps cognitive development and made a game out of it with some AI regression tables!\n\n[https://play.google.com/store/apps/details?id=com.vitatech.palletchallengelite](https://play.google.com/store/apps/details?id=com.vitatech.palletchallengelite)\n\nIt's meant to be a mental health game that can stimulate memory, focus and concentration. I started this project to help a next of kin elderly person tackle possible cognitive decline... ended up with so many kids asking for it and then it became Pallet Challenge.\n\nDo check it out, it's 100% Singaporean-made and developed... though hosted elsewhere (haha Android store - not sure where their google data centre is at).",
          "score": 5
        },
        {
          "text": "This weather is perfect man it needs to stay",
          "score": 5
        },
        {
          "text": "What a rainy CNY~",
          "score": 2
        },
        {
          "text": "My arms are so very le tired...\n\nAfter my nieces passed the age for me to carry, and after MRed, there's no impetus to lift weights. Previously I used to train with a dumbbell just before reservist, just so the rifle with M203 can be more manageable.\n\nJust now carried my cousin's toddler for quite some time. Hard to put down when they want you to carry (albeit for them to be able to play with \"toys\", not purely for you to carry).\n\nTomorrow probably gonna get arm muscle ache. But it's worth it.",
          "score": 2
        },
        {
          "text": "Almost forgot this trait of bus drivers during CNY duties. \n\nVery reckless. 🥲 Almost slipped when he suddenly stepped on the brakes.",
          "score": 2
        },
        {
          "text": "anyone remembers the one year when Fragrance bak kwa and Bee Cheng Hiang were fighting over channel 8 adverts? they'd alternate between ads the whole 2 days of CNY... fun times",
          "score": 2
        },
        {
          "text": "How many cups of coffee have you had today?",
          "score": 2
        },
        {
          "text": "is it just me or the waterfall in jewel is no longer circular? or maybe the pour down is just more chaotic?",
          "score": 2
        },
        {
          "text": "Am thinking if I should attend japanese class but am working mom with 2 young kids and without helper. Has anyone done it before? I learnt when I was in uni and wish to cont to maybe lvl 5 or 4...",
          "score": 1
        },
        {
          "text": "Watching ‘art of sarah’ in Netflix, the story of Boudoir reminds me of Bacha and TWG lol",
          "score": 1
        },
        {
          "text": "CNY is just another warzone for parents,  my mom checks all the hongbao i get and see how much money is in it. If i get more than what she gave to their kids, she will take away the excess n told me she will return it to them. Then next year she will prepare same amount  i got for their kids \n\nWoman refuses to be seen as poor",
          "score": 1
        },
        {
          "text": "For those who dont celebrate cny and is bored at home, what outdoor activities can be done? V sian leh this year.",
          "score": 1
        },
        {
          "text": "Wah finally hearing some lion dance in my area 🎊",
          "score": 1
        },
        {
          "text": "Anyone knows if Gong Yuan Mala Tang is open at Clementi Mall? Rainy days call for soup",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r6tcmb",
      "subreddit": "singapore",
      "title": "Amos Yee: Why Singapore Military Sucks",
      "url": "https://old.reddit.com/r/singapore/comments/1r6tcmb/amos_yee_why_singapore_military_sucks/",
      "score": 0,
      "num_comments": 47,
      "created_at": "2026-02-17T10:09:11",
      "selftext": "",
      "comments": [
        {
          "text": "Really need to stop giving this sick person a platform and publicising his disturbed thoughts.",
          "score": 69
        },
        {
          "text": "Can we stop giving this clown attention",
          "score": 59
        },
        {
          "text": "Bro why did you post this man\n\nEveryone that served know it sucks, don't need a pedo to tell us",
          "score": 40
        },
        {
          "text": "why even bother giving this joker the attention he seeks?  ",
          "score": 34
        },
        {
          "text": "Lost me at United nations will defend us HAHAHHAA",
          "score": 26
        },
        {
          "text": "He’s so scared",
          "score": 13
        },
        {
          "text": "That's how it is when you convinced yourself that you won't survive NS, and then you spiral deeper \n in that fear every time you mentioned it.",
          "score": 11
        },
        {
          "text": "&gt; There has not been a threat in another country attacking Singapore for the past 60 years.\n\nOh, please. There's plenty that happens, both domestically and internationally. Just because it's not publicised doesn't mean that our army is twiddling their thumbs\n\nAlso, NS is more than the Army. Perhaps Mr Yee should join SPF or CD instead: the work they do is very impactful",
          "score": 10
        },
        {
          "text": "He will confirm keng Pes F, good for him",
          "score": 8
        },
        {
          "text": "\"Military from the UN will defend us\"\n\nLmao what, dont say military, UN dont even have the funds now\n\nEven if you say USA not UN, look how Ukraine turned out. Right now still fighting sial, what USA UN military?",
          "score": 8
        },
        {
          "text": "This guy still at it?\n\n![gif](giphy|ji6zzUZwNIuLS)",
          "score": 8
        },
        {
          "text": "Pedo says what?",
          "score": 6
        },
        {
          "text": "So scared of ns",
          "score": 5
        },
        {
          "text": "Damn, this guy doesnt even make sense anymore does he",
          "score": 5
        },
        {
          "text": "Still behaving like edgy sec 1 boy.",
          "score": 5
        },
        {
          "text": "CB. He registered a .org ?",
          "score": 4
        },
        {
          "text": "What in the zazza is this pedo on?",
          "score": 3
        },
        {
          "text": "OK paedo",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1r6hscg",
      "subreddit": "askSingapore",
      "title": "How are y'all celebrating CNY now??",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r6hscg/how_are_yall_celebrating_cny_now/",
      "score": 501,
      "num_comments": 37,
      "created_at": "2026-02-17T02:34:50",
      "selftext": "Just now like at 12+ am , i was at this playground and i saw this father and daughter come to the fitness corner to  play with Sparklers like nearer to the grass patch , just the two of them. \n\nThe daughter is probably about 12/13 yrs old and father kept lighting her the Sparklers and they played together for like a good 30mins and then they cleared everything up and went back home..\n\nThat was so cute to watch!!\n\nHappy CNY everyone!!\n\nHow are y'all celebrating CNY now??\n\n\nEdit : apologies its not fire crackers , those were sparklers!! \n\n",
      "comments": [
        {
          "text": "In the gym at 430am now.",
          "score": 147
        },
        {
          "text": "88.88km ride today! 🚴‍♂️",
          "score": 69
        },
        {
          "text": "just finished 120 minutes gym, at home now start eating stuff (egg tart, pineapple tart, orange) with a big mug of milo, surfing reddit and internet. later self cooked mee sua soup, before start sitting on sofa netflix marathon and nap. \n\nit's going to rain whole day from the look of it. ",
          "score": 54
        },
        {
          "text": "Waiting for Friday to see if I huat",
          "score": 49
        },
        {
          "text": "on my 6th can of tiger currently",
          "score": 38
        },
        {
          "text": "Rent a hot gf for the day",
          "score": 28
        },
        {
          "text": "Are you sure you are seeing correctly?\n\n\nOk jokes. On my bed alr, ready to toh. Happy Chinese New Year stranger!",
          "score": 18
        },
        {
          "text": "Just ate. Eating now. Will be eating soon.",
          "score": 14
        },
        {
          "text": "Thank you for the description it is so cute to read!",
          "score": 7
        },
        {
          "text": "Same vibe here, late night walks and simple bonding time instead of crowded house hopping. The sparkler moment sounds very wholesome CNY energy",
          "score": 6
        },
        {
          "text": "Initially wanted to go to east coast to walk/jog, but it's raining now so me and my family end up chilling away in a nice cafe.",
          "score": 2
        },
        {
          "text": "Going to a cafe pickup some cupcakes for gifting tmr, hv my brunch there, and in evening join my relatives for some dinner",
          "score": 2
        },
        {
          "text": "Video games and gig work (double pay).",
          "score": 2
        },
        {
          "text": "is chinatown bazaar still open? any freebies to pick up that are left behind? or any cheap deals?",
          "score": 2
        },
        {
          "text": "\"For me... it was just Tuesday...\"",
          "score": 1
        },
        {
          "text": "Working...",
          "score": 1
        },
        {
          "text": "Sleep in, I was so burnt out from work.",
          "score": 1
        },
        {
          "text": "At Tokyo with my newly wedded wife spending the day at Disneyland!",
          "score": 1
        },
        {
          "text": "I just finished a fun search for the best pineapple tarts. It's all about who can gather the most impressive collection this year.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r6xnp4",
      "subreddit": "askSingapore",
      "title": "What’s a Singapore opinion you’ll defend even if the whole kopitiam turns against you?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r6xnp4/whats_a_singapore_opinion_youll_defend_even_if/",
      "score": 416,
      "num_comments": 456,
      "created_at": "2026-02-17T13:35:55",
      "selftext": "I'll start. Aircon too cold is worse than too hot. Fight me. ",
      "comments": [
        {
          "text": "Prices shown on menus should include GST. I don't like eating somewhere and then seeing a higher price on the bill than expected.\n\nLike we don't have different GST rates like how the US is for different states, so what is the problem of showing a slightly higher price? Does that actually deter people from going there?",
          "score": 521
        },
        {
          "text": "Restaurants charging $ for tap water should be hanged drawn and quartered",
          "score": 479
        },
        {
          "text": "Breadtalk and toastbox are horrible and bringing down our standards, fight me",
          "score": 442
        },
        {
          "text": "10% service charge shouldn’t be levied for QR code ordering",
          "score": 325
        },
        {
          "text": "Please do not have kids if you don't earn much...",
          "score": 318
        },
        {
          "text": "CPF is not perfect, but it is necessary to prevent irresponsible people from being a burden to society.",
          "score": 272
        },
        {
          "text": "bcm have to eat dry version.",
          "score": 237
        },
        {
          "text": "govt should intervene more directly in preserving stuff like hawker culture and old traditional shops\n\nCoffeeshops/hawker centers should have maximum rental amounts. Not just whatever the landlord desires. It serves the community and shouldnt be for profit. \n\nIf the foreigners from a certain country that love to buy properties complain so be it, its high time they learn to invest in something other than properties",
          "score": 170
        },
        {
          "text": "Playgrounds should have Shelters. \n\nLike how it is in Australia.\n\nIn fact all outdoor seating must have shelter it’s so darn hot 🔥",
          "score": 169
        },
        {
          "text": "There is nothing wrong if you prefer to speak English over Singlish",
          "score": 121
        },
        {
          "text": "Kallang/Geylang/Marine Parade are not east but central. They are literally in the central region of SG as defined by URA. Those saying East &gt; West should be comparing Tampines/Pasir Ris w Clementi instead of comparing Katong w Choa Chu Kang.",
          "score": 69
        },
        {
          "text": "Kaya toast, egg + kopi should not be more than $4 (i did the maths)",
          "score": 57
        },
        {
          "text": "Wedding ang bao should come from the heart not hotel rate",
          "score": 50
        },
        {
          "text": "People should not be allowed to profit exorbitanty from flipping their BTO/HDB. Public housing is a social necessity and the idea of treating it like an investment doesn't sit well with me. Any sale should be done solely with HDB, and HDB should regulate the prices.",
          "score": 20
        }
      ]
    },
    {
      "id": "t3_1r6bpwr",
      "subreddit": "askSingapore",
      "title": "uncle shoulder checked me super hard on mrt platform (butsukari otoko?)",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r6bpwr/uncle_shoulder_checked_me_super_hard_on_mrt/",
      "score": 327,
      "num_comments": 84,
      "created_at": "2026-02-16T22:55:13",
      "selftext": "Earlier today around 3pm at Clementi MRT, I was walking around the platform trying to leave when I spotted an older uncle (maybe late 60s) walking towards me (I'm a girl)\n\nI didn't think much of it cause we were obviously far apart enough that we wouldn't collide so I just continued walking forward. He then rammed me in the shoulder so hard that I got the wind knocked out of me (felt it in my chest for the next 10ish minutes)\n\nObviously I was like wtf? so I turned and he was just slooowly strolling along as if nothing happened, didn't even turn around. Meaning he stiffened his shoulder and hit me with enough force to hurt on purpose la\n\nSuddenly a lady about a metre in front of me asked me if I was okay because she said she saw what happened. She explained that HE ALSO SHOULDER CHECKED HER RIGHT BEFORE HE DID THE SAME TO ME WTF\n\nIs there action worth taking? Should I go over to Clementi and ask the MRT staff for CCTV footage of the incident? There weren't any trains coming plus it was pretty empty so I fear he was just trying to bully women 😭",
      "comments": [
        {
          "text": "Yall need to call him out (literally). The louder the better the embarrassment. Yell OUCH as long as possible while assessing the situation next time.",
          "score": 286
        },
        {
          "text": "Probably wanted that female contact. Please report him",
          "score": 198
        },
        {
          "text": "You should report him. What an asshole. Make a police report",
          "score": 161
        },
        {
          "text": "Quote from this other reddit post: [https://www.reddit.com/r/singapore/comments/1fhyyrh/a\\_random\\_man\\_hit\\_my\\_friend\\_in\\_the\\_head\\_with\\_a/](https://www.reddit.com/r/singapore/comments/1fhyyrh/a_random_man_hit_my_friend_in_the_head_with_a/)\n\n'The IO told her they cannot arrest the man under \"voluntarily causing hurt\" as it's not a grievous injury. The only solution is for her to file a complaint to the magistrate's court, and pursue private prosecution at her own expense.'",
          "score": 108
        },
        {
          "text": "i experienced the same thing last year at little india stn. It was a short uncle and he was with his wife too.\nHe shoulded checked me really hard but he jerked back instead lol...i nvr saying afterwards because he walked away swiftly with the wife. The age is around the number you mentioned too.",
          "score": 36
        },
        {
          "text": "Please report him. It’s the accumulated complaints that will eventually make a difference, as it proves a pattern and makes it hard for SMRT/police to continue to do nothing.",
          "score": 35
        },
        {
          "text": "This happened to me (see my post). Told the MRT staff and wasted 2 bloody hours with transit police with NO FOLLOW UP. Next time this happens I’m turning around and VCH-ing the guy lol, since nothing is gonna come out of it anyway 🙄🙄",
          "score": 25
        },
        {
          "text": "Shout 痴漢！！！\n\nClementi has always been a hotspot for weirdos..\n\nTake photos then report to the train station staff.. dont let sociopathic behaviour take root and fester..",
          "score": 25
        },
        {
          "text": "As is clear from the replies, police won’t do anything. I know it’s sudden and you’re unprepared but the best thing to do is make a big fuss and get public attention immediately. Chase after him and shove your phone in his face and start live streaming. \nI learnt this from older sister many years ago when a man molested her on a bus. She stood up and shouted at him and kept scolding and shouting until others intervened. The bus driver had to stop the bus. The guy totally shrank and apologised and alighted.",
          "score": 22
        },
        {
          "text": "Yuck. I really think you should report it, in the hopes that multiple reports on the same culprit will accumulate for the police to take action eventually. I’d imagine this will at least force them to keep a copy of cctv footage if anything",
          "score": 15
        },
        {
          "text": "My wife got shoulder checked by an uncle similarly at Tampines Mall last saturday, the mall was uncrowded, and he still choose walk into her. ",
          "score": 13
        },
        {
          "text": "Geez! Outrageous. Yes must report and get CCTV footage as evidence.",
          "score": 10
        },
        {
          "text": "You and the other lady should go complain together since it happened to both of you. If anything the train staff should send ppl to look out for this man at this station, but like the other comment mentioned no guarantees. Sorry it happened to you tho",
          "score": 10
        },
        {
          "text": "Oh man I had this experience too. One guy in his 50s slammed his shoulder into me at an NTUC. Like he would move aside for guys walking near him, but if it was a female, he wouldnt move aside and would increase his speed a little and shoulder check her. \n\n\nSadly it's not the first time I experienced this, but it was the first time in Sg. I was hit so many times in Korea. ",
          "score": 9
        },
        {
          "text": "Outrage of modesty",
          "score": 9
        },
        {
          "text": "Sounds very familiar to Japan where an elderly man will purposefully knock into you with his shoulder for no apparent reason. And they purposefully target females, also for no reason.",
          "score": 7
        }
      ]
    },
    {
      "id": "t3_1r6bwdt",
      "subreddit": "askSingapore",
      "title": "Unmarried Chinese folk in their 30s (or older), do you still collect angpows during CNY?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r6bwdt/unmarried_chinese_folk_in_their_30s_or_older_do/",
      "score": 195,
      "num_comments": 88,
      "created_at": "2026-02-16T23:01:56",
      "selftext": "I’m close to 30 and feel pretty paiseh to take angpows during CNY honestly, somehow I feel like I’m too old to do so especially when the only other people receiving angpows are the school-going kids🤣 those who aren’t married yet, do you still take angpows or give any?",
      "comments": [
        {
          "text": "Still do. Tried telling my older cousins not to give me but they still do. To them it’s a form of blessing. I’m in my 40s.",
          "score": 238
        },
        {
          "text": "I still receive ang baos. But there are a couple of relatives who have stopped giving and I understand. I don’t think there’s any issue. Although I don’t hand out ang baos, I give my mother money for ang baos every year.",
          "score": 173
        },
        {
          "text": "In this economy? I'll take what I can get!",
          "score": 119
        },
        {
          "text": "Still do. A bit paiseh, but feels rude to refuse.\n\nBut if my relatives stop giving one day or if angpow is only a small sum like $10, then that's fine with me as well.",
          "score": 67
        },
        {
          "text": "When I was unmarried in my 30s, I made sure to collect all my angpows. It’s one of the rare privilege sof being single",
          "score": 63
        },
        {
          "text": "For my family, start working = stop collecting ang baos = start giving ang bao to parents.\n\nI know many colleagues whose families not like my family though. Their parents don't stop giving them ang baos and also don't start expecting ang baos from them, as long as they stay unmarried.",
          "score": 59
        },
        {
          "text": "Im in my late 30s, still collecting angpows haha",
          "score": 57
        },
        {
          "text": "Yes. If they give just accept graciously. It's a tradition in my family to give ang pows to the singles including the elderly spinsters and bachelors (Quite a few in my family tree) Token sum and no pressure to give. \n\nIt's just a way of blessing us although we often insist that the younger couples keep their hard-earned money for themselves. Caring goes both ways.",
          "score": 46
        },
        {
          "text": "They give me. I accept. Why not? Nothing wrong with that.",
          "score": 33
        },
        {
          "text": "People give i take, but i also give to next gen kids,",
          "score": 17
        },
        {
          "text": "If they give just accept. I think the back and forth will make it even more awkward",
          "score": 16
        },
        {
          "text": "It’s to wish someone good luck. What does it have to do with age or marriage status?",
          "score": 15
        },
        {
          "text": "Yes, just take. ",
          "score": 13
        },
        {
          "text": "As long as I’m not married, I want my angbao. Not like my relatives remember my age anw. When I was 24, my married older cousin asked my mom if I was taking O levels that year. Im turning 30 this year",
          "score": 10
        },
        {
          "text": "(free) money not taken is money lost",
          "score": 10
        },
        {
          "text": "I am 41 and I am more than happy to collect if I am offered",
          "score": 6
        },
        {
          "text": "I felt very paiseh though rejecting is worse cuz it's a token of blessing and not a big sum. I think we should receiving  once we start our full time job tbh.",
          "score": 6
        },
        {
          "text": "I do. My older single cousins all do too (im considered one of the youngest in the family tree) and they’re all in their 40/50s. But they also look and act very young lah lol so to my parents generation they are still like children",
          "score": 5
        },
        {
          "text": "I see my single aunts collecting so i think its ok bah",
          "score": 5
        },
        {
          "text": "free money must take.",
          "score": 5
        },
        {
          "text": "Like to hijack this thread a bit, do you guys give relatives who are divorced?!",
          "score": 5
        },
        {
          "text": "I think age doesn't really matter because the angbao is about the blessing and not the money inside. I would graciously accept it and it doesn't matter even if it's a token $2 inside. if you feel paiseh you can always bao an angbao of your own back for the kids or elderly in their family even though you're unmarried 🙂 or give back in some other ways during other festive seasons (eg. could buy cny goodies for them for cny, dumplings for duan wu jie etc)",
          "score": 4
        },
        {
          "text": "I’m married and one of my aunts still give me angpow so I will take. In return I give her grandchildren more angpow money than the other nieces/ nephews. \n\nI think my brother who is single still gets angpow from the other relatives though he’s in his 30s. I will continue to give my younger brothers angpows til I die haha",
          "score": 4
        }
      ]
    },
    {
      "id": "t3_1r6b58g",
      "subreddit": "askSingapore",
      "title": "Are you close to your cousins?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r6b58g/are_you_close_to_your_cousins/",
      "score": 68,
      "num_comments": 36,
      "created_at": "2026-02-16T22:32:12",
      "selftext": "As per the title, I have about 30 cousins across both sides of my family. I’ve realised that, as an adult, I’m only close to maybe 5–6 of them. I used to be close to more when we were younger, but life happened and I just don’t see most of them anymore. I met a cousin for the first time in years today and it was pretty awkward, we don’t really talk, even though our parents still do.\n\nJust wondering if it’s the same for you guys.",
      "comments": [
        {
          "text": "Redditors here don’t even have friends irl and you expect them to be close to their cousin?",
          "score": 243
        },
        {
          "text": "Not close at all, it's pretty normal considering we only meet every half a year or so.\n\nI've even memorised the questions they ask me and the way they ask the questions because every single time it's the same (they don't remember that they've asked before and they don't remember my answers)",
          "score": 51
        },
        {
          "text": "I'm close to my mother's side. The family used to regularly visit grandma and play mahjong over the weekends. We also catch up during weddings and baby showers.\n\n\nThat being said, there are a select few in especially close to because we made it a point to meet for dinner every 2-3 months. This was not something that organically happened. I reached out to them suggesting dinner, and it eventually it becomes a habit.\n\n\nPeople think that kinship should not need more maintenance than friendships, but the reality is that all relationships need some form of maintenance.",
          "score": 50
        },
        {
          "text": "Lol fall out between the siblings (my parents and their parents) and cousins decided that they didn’t even want to attend my wedding even though I went to their house to invite personally. They cut me off even though I didn’t do anything. Now we are no contact and since then CNY has been empty and peace. Haven’t seen them in years. Only have like 2 cousins to give Ang Bao to nowadays.",
          "score": 33
        },
        {
          "text": "Not close at all. Don't say cousin, i barely have any friends. All have our own family commitments in our 30s. Hopefully, the next time we meet is not someone's funeral.",
          "score": 30
        },
        {
          "text": "Sadly no. Especially not with my younger cousins. They’re glued to their devices at family gathering and keep to themselves. As we got older, there have been some unpleasant comments about each other here and there by the older generation, yet they act cordial when everyone meet up. It’s odd and sometimes pretentious.",
          "score": 20
        },
        {
          "text": "Do you think Li Hongyi and Li Shengwu are close? 😂",
          "score": 20
        },
        {
          "text": "Yes. I had one cousin who was very close to me. We grew up together, play together and almost same personality. I said \"was\" because he passed away from cardiac arrest in 2023 at age 27. Since then I really don't have a \"close\" cousin anymore. I still have cousins but wasn't the same without him and have not seen most of them in years",
          "score": 10
        },
        {
          "text": "Sort of. I'm closer to my first cousins; we all still stay in the same neighbourhood and meet for dinner every week.  We aren't as close as we used to be when we were kids, but I think we are relatively close compared to others.\n\nFor my second cousins, there are a lot of them in varying ages, I only see them once every few months during family gatherings.",
          "score": 7
        },
        {
          "text": "Hell Nah.",
          "score": 5
        },
        {
          "text": "I guess it's still ok",
          "score": 3
        },
        {
          "text": "Yes! it's the same for me. As we grow older, priorities change, habits change, lifestyle changes, and we tend to start losing people. I always have great memories of playing with my cousins, but I don't get time or rather make time to create memories now. I regret that a lot. \n\nBut, it is never too late to start something. Of course our cousins will get to understand us and so I now consider some time to strengthen those relationships.",
          "score": 3
        },
        {
          "text": "Used to be very close/ bff with 2 of the cousins ( let’s call A and B) out of around 10-12 ( all paternal side) cos we were all the same age.\nWe had every single shit if stuff so common.\nEvery family gathering, we (A,B and me) will always be a seperate entity. A and B was my blood, flesh and bone.\nYears passed and we are the type who will talk like we are always in touch even if we never talked for ages.\n\nSuddenly, B had some personal feuds with his father cos father an affair and ended up cutting ties with all family members. B and his mother felt like everyone side with the father.( actually don’t know wtf happened in their family fight)\nLast heard from a relative that He got married and is very successful in life.",
          "score": 3
        },
        {
          "text": "No. Plenty of cousins, probably around 20. The last time I met a few cousins was at a funeral about 15 years ago. Some I have not seen for 30+ years.",
          "score": 3
        },
        {
          "text": "I had a cousin I was super tight with growing up, then we lost contact. I was at a pub once when a friend tapped me and said \"hey that guy over there claims he knows you and your mum\" and I was like \"who is that, I don't know him\"\n\nEven went over to speak to him, and only 15mins into the conversation I was like \"holy crap it's you?!\"\n\nI cringed recalling how the conversation went:\nMe - Soooo you said your mum knows my mum? Cool how did they meet?\n\nHim- errrrr, they're sisters?",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1r6aqw4",
      "subreddit": "askSingapore",
      "title": "Wwyd if your neighbours own chickens and stink up the whole place",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r6aqw4/wwyd_if_your_neighbours_own_chickens_and_stink_up/",
      "score": 52,
      "num_comments": 30,
      "created_at": "2026-02-16T22:15:59",
      "selftext": "My neighbours keep chickens and a rooster. The birds crow constantly, including late at night (2–4am). \n\nOn top of that:\n\n\\* The whole lobby smells strongly of chicken droppings\n\n\\* The common rubbish chute area has gotten worse because they wash the chicken cage there\n\n\\* They burn some kind of very strong, smoky woody incense (not religious prayer incense) to mask the smell, but it’s so overpowering that the stench travels up and down floors\n\nBecause the wind direction blows from their unit towards mine, every time I open my door we gag from either chicken smell or this heavy incense. The smoke and scent get into our home — our clothes, bedsheets, and fabric items absorb it. Sometimes this goes on for days.\n\nWe’ve dealt with this for years. They’re not receptive to feedback at all.\n\nMy family is extremely sensitive to smells because genetically, we’ve got noses like dogs. \n\nAt this point, what would you do if you were in my shoes?",
      "comments": [
        {
          "text": "If this is HDB you can report it. You can’t keep chickens in HDB",
          "score": 149
        },
        {
          "text": "I dont think NEA allows chickens to be kept on non landed properties. Correct me if I'm wrong.",
          "score": 77
        },
        {
          "text": "Just report them to NEA",
          "score": 55
        },
        {
          "text": "Since when can keep chicken in HDB? Just report",
          "score": 22
        },
        {
          "text": "Report to HDB/TC/OneService with pictures and videos. I’ve had the misfortune of living beside a neighbour like that, although I felt mine was worse as we were living on the top floor. Similar to you, had to endure foul smells for months. Additionally, mine was also a hoarder and filled the entire corridor with their trash. They were very unreasonable and chose to be aggressive towards us so I just reported them. Everything was removed within a month.",
          "score": 15
        },
        {
          "text": "Kidnap the chicken and make soup, then treat your neighbours to eat.",
          "score": 12
        },
        {
          "text": "I’d make a report to NEA, HDB, MP at this point. \nYou can get rid of the chickens easily with the help of authorities but I doubt you can get rid of the stench e.g. burning of incense, or even old smelly stuff should they choose not to do anything about hygiene. \n\nI guess you don’t have much options since you already tried speaking to them. \n\nAnother diplomatic option is to take a few afternoons to gather feedback from nearby neighbours. Encourage them to join you in having an engagement with said neighbour. If no result then afterward engage MP+grassroots to speak to them.",
          "score": 6
        },
        {
          "text": "***Neighbour Turns HDB Corridor into Poultry Farm &amp; Bio-Weapon Testing Site***\n\n\\^I can already imagine this headline on Mothership/mustsharenews/any other tabloid site\n\nJokes aside, [https://www.channelnewsasia.com/singapore/keeping-poultry-hdb-flats-not-allowed-public-health-reasons-tan-kiat-how-3056346](https://www.channelnewsasia.com/singapore/keeping-poultry-hdb-flats-not-allowed-public-health-reasons-tan-kiat-how-3056346)",
          "score": 3
        },
        {
          "text": "in our country, normally at night you gather gourd, ganja and obviously the chicken you can find at night 😜 and cook them together and have fun. Well, that was back in early and mid 90s. dunno how now. 🤣",
          "score": 3
        },
        {
          "text": "Take video and email the town council for enforcement.",
          "score": 2
        },
        {
          "text": "U can try to raise the issue with ur MP but beware it will take months for it to resolve. All depends on how cooperative ur neighbour is. My parents' neighbour kept dozen of cats and allow them to keep breeding. Their place smells of cat poo and had incident of cats falling from the window. Even then, it took months and months of intervention and following up for them to eventually remove the excess cats. ",
          "score": 2
        },
        {
          "text": "Call police",
          "score": 2
        },
        {
          "text": "We.....we have found it! It's the real Kampung Spirit™, quick call the ministers for photos!",
          "score": 1
        },
        {
          "text": "Report to NEA, etc. everything you can think of.",
          "score": 1
        },
        {
          "text": "I think there’s a limit on how many chickens you can keep, see if you can check numbers and report it if too many? I think it also cannot be commercial. \n\nSmell hypersensitivity is a thing, maybe if you can get a diagnosis a lawyer could advise",
          "score": 1
        },
        {
          "text": "i would have a nice chicken dinner witj free chicken",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r6o424",
      "subreddit": "askSingapore",
      "title": "What do yall fellow Chinese eat for CNY day 1 breakfast?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r6o424/what_do_yall_fellow_chinese_eat_for_cny_day_1/",
      "score": 46,
      "num_comments": 78,
      "created_at": "2026-02-17T06:28:26",
      "selftext": "most shops are closed.\n\nEating prata before cny feasting is crazy.\n\nplain bread? eggs?",
      "comments": [
        {
          "text": "Usually have 1 or 2 of that whole pandan/butter/walnut cake from neighborhood bakery at home",
          "score": 63
        },
        {
          "text": "Breakfast? Still rushing to prepare a big lunch! 🤣",
          "score": 44
        },
        {
          "text": "I'm just preparing myself milo. Because lunch and dinner would be heavy, plus still got cny snacks. I'm hoping to at least maintain my weight and not gain it. Even yesterday steamboat, also didn't eat much rice, and didn't drink the soup, soup makes the body retain water...",
          "score": 29
        },
        {
          "text": "Steamboat = breakfast, lunch , dinner",
          "score": 29
        },
        {
          "text": "Eggs not bad. The fewer carbs the better, you'll get more than enough throughout the rest of the day, lol. \n\n\nPlus a fruit and coffee for a nice start to the day.",
          "score": 25
        },
        {
          "text": "Annual traditional breakfast of McDonald's.\n\nMy parents have eaten it even before I was born lol",
          "score": 17
        },
        {
          "text": "No breakfast. Wake up and get ready for visiting, eat at relative place.\n\nCHARGE!!!",
          "score": 10
        },
        {
          "text": "Leftovers from dinner. Family tradition is to stir fry the leftover braised duck with ginger, garlic, and curry powder. Served with rice, braised eggs, and leftover 過年湯/CNY soup. Just finished preparing and about to dig in.",
          "score": 10
        },
        {
          "text": "Chiong to macdonalds before the horde wake up",
          "score": 7
        },
        {
          "text": "All those CNY snacks lor.",
          "score": 6
        },
        {
          "text": "2 Prata with Egg, 2 Kosong.",
          "score": 6
        },
        {
          "text": "Fast food! Malays and Indian stall too..",
          "score": 6
        },
        {
          "text": "Leftover steamboat",
          "score": 5
        },
        {
          "text": "Nian gao",
          "score": 5
        },
        {
          "text": "Dry mee sua + some leftover stuff from cny eve dinner.",
          "score": 3
        },
        {
          "text": "bakwa and protein shake",
          "score": 3
        },
        {
          "text": "Bak kwa sandwich is always good",
          "score": 3
        },
        {
          "text": "Bakkwa lol. We also prepare popiah for visitors so there's that.",
          "score": 3
        },
        {
          "text": "Steamed grey mullet with lots of rice and a side dish of chapchye!",
          "score": 3
        },
        {
          "text": "Maggi with whatever leftover from last night",
          "score": 3
        },
        {
          "text": "Leftovers. 🤣",
          "score": 3
        },
        {
          "text": "Cheese and crackers.",
          "score": 3
        },
        {
          "text": "Pineapple tarts, almond cookies, blueberries cookies...sinful but really cnyish!😝",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1r6uehl",
      "subreddit": "askSingapore",
      "title": "Has anyone gotten their air-conditioning spoilt by Urban Company?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r6uehl/has_anyone_gotten_their_airconditioning_spoilt_by/",
      "score": 35,
      "num_comments": 32,
      "created_at": "2026-02-17T10:55:53",
      "selftext": "Essentially, I got Urban Company to come and service my aircon system. I previously gotten them to service my Aircon system, but excluding the condenser. This time round I asked them to include it. \n\nAfter around 2 weeks time, the air-conditioning system stopped working. I asked them to come down to take a look, and they tell me that the PCB (printed circuit board) is spoilt. I told them I suspect they spoilt it during the servicing as I saw their \"technician\" anyhow spraying water or chemicals when cleaning the condenser. They said they would send down a \"senior technician\" to assess it. \n\nJust this morning (first day of CNY) their \"senior technician\" told me that he cannot figure out why it was spoilt and attributed the spoilage to the natural cycle of electrical components. He insists it's not due to the fault of the \"technician\" who did the servicing. \n\nI personally don't believe their words. It cannot be a mere coincidence that my PCB spoilt 2 weeks after they did their servicing. Especially after how I seen they did their servicing of the condenser, just anyhow spraying water or chemicals without caring how or where the water/chemicals flow. \n\nSince they insist it's not their fault, I'm going to get a third party to replace the PCB, ask them for their opinion on what causes the spoilage, and subsequently bring Urban Company to Small Claims Tribunal. I know the costs is probably not justified for a SCT claim, but it's just a matter of how pissed off I am at Urban Company from the start to end. It's worse because the aircon broke down just before CNY and I still have to handle this on the first few days of CNY. \n\nAnyone got any better suggestion on how to proceed? I also would appreciate if you can recommend any reliable third party to change the PCB and give an opinion on the cause of the spoilage.\n\nEdit: Aircon is about 9 years old. Serviced regularly, between 4 to 6 months each time. Use almost everyday. ",
      "comments": [
        {
          "text": "Same for us! Our system is about 7 years old, serviced every 3-6 months depending on use and had no issues before. We’ve previously had Urban Company service our aircon system, which we were happy with. Then we included the condenser in our latest servicing last year, which we observed was just the technician spraying water at it. Was still dusty after when we inspected. \n\nWithin a week, 2 of our 3 aircon units were noticeably warmer (3-4 degrees warmer and 20% higher humidity). The original technician who did the servicing came back and claimed it was due to low gas pressure and topped up the gas. The issue persisted. \n\nThe second technician claimed that it was a gas leak, and that we had to pay to do a full test. Urban Company said they would schedule one, but we got a third technician who had no background on the issue and re-inspected the system. This third technician claimed it was due to faulty power PCB, saying that the tools showed irregular electric current. Ans in fact, the gas pressure was too high. We agreed to change the power PCB for $700. \n\nAfter the PCB was replaced, the issue persisted. The PCB was taken away so we can’t verify that it really was faulty. The third technician came back again and claimed that it was an issue with the control PCB. The control PCB was replaced for free. \n\nStill, the poor aircon performance persisted. When the third technician returned, he insinuated that our room temperature monitors were faulty. How? By using his hand to check that “cool air” was coming out of the aircon units. Ignored our data that showed a significant drop in performance before and after the servicing. \n\nWe gave up and contacted the manufacturer’s appointed servicing partner, which diagnosed that the issue was caused by a stuck LEV coil assembly (this can happen naturally). They replaced it, and our aircon has since performed even better than before the servicing.  \n\nRaised this with Urban Company, and they repeatedly denied that there were issues caused by the servicing or incorrect diagnoses by the technicians. Got generic platitudes about reviewing their processes (i.e. no acknowledgement of any failure on their part). Perhaps the PCBs were one part of the problem (no way to verify), perhaps the servicing caused some damage, but definitely the 3 Urban Company technicians did not correctly identify the full cause of poor performance. \n\nRecommend that you reach out to your aircon manufacturer or its appointed servicing partner. They would be able to inspect your system more thoroughly and maybe identify the cause (natural over time? Damage?). We don’t expect our $700 back and did not bother to pursue, but we certainly do not recommend Urban Company and will no longer engage their services.",
          "score": 36
        },
        {
          "text": "When was the last time the air con was serviced prior to this servicing? \nHow old is the aircon? \nHow often is the aircon switched on for use? \ntreat it as part of wear and tear, feel less heartpain. \n\nTry to enjoy the rest of CNY!",
          "score": 11
        },
        {
          "text": "it could be a coincidence/ or it could be due to the servicing of the CU unit. not sure how they did the CU servicing cos based on what i know just use gas to purge of the dust would suffice but if they spray just on the outer side then its what the CU is made to \"tahan\" outdoor conditions such as rain then it cld be due to wear n tear\n\nbut i think nine years is a good run for the aircon until considering you have used it almost daily. \n\nmy suggestion will be go back to the manufacturer to get the parts replaced but not sure if the parts is still available. ask about their parts replacement warranty and do take note after replacing the pcb, might also find other parts needs replacing.",
          "score": 6
        },
        {
          "text": "I engaged urban company before for aircon. They were good for urgent cleaning as my usual guy was booked. I usually service every three months and I had missed the schedule for more than a month. \n\nI wasn’t happy actually, so two weeks later, I called the usual company to do it. The regular guy had a bit of trouble doing the maintenance. He said the previous repair guy broke something. I didn’t pursue cos of language barrier plus he said aircon working, just he needed extra effort to do something (sorry can’t remember what is it). So yeah, they likely spoiled something in my aircon \n\nSorry you have to go through this. Hard to tell if it’s due to the technician or age of aircon since it’s 9 years old",
          "score": 4
        },
        {
          "text": "9 years old abit difficult to tell. Thought it's 9 months old then highly likely it's them. Else it maybe coincidence, maybe see what's the results from the third party?",
          "score": 4
        },
        {
          "text": "Obviously damaged or misdiagnosed.. \navoid all these cleaning companies that branch into air con servicing etc.. their main forte is cleaning.. not air con servicing which requires more technical knowledge..",
          "score": 3
        },
        {
          "text": "Well obviously it CAN be a coincidence,  so your third party better get some actual evidence. Otherwise your trip to SCT will be a waste of your time \n\n\n\n\nhttps://www.merriam-webster.com/dictionary/post%20hoc%2C%20ergo%20propter%20hoc",
          "score": 3
        },
        {
          "text": "Why this Urban Company suddenly spiked in Reddit, just saw a post where they just last minute left a job hanging.",
          "score": 3
        },
        {
          "text": "My brand new Mitsubishi Starmex, DINK couple only, lower than average usage, proper periodic servicing and all.\n\nUplorry within 7 years out of the blue too, outside of warranty window.\n\nSo yea, just look at it as coincidence proper wear and tear and try to enjoy your CNY. It is what it is, just buy some Toto with this “luck” of yours and hopefully SG Pools sponsor you a new compressor unit.\n\nI call first dibs if you strike first prize!!!",
          "score": 2
        },
        {
          "text": "Yeah, I engaged them once and realized it was too much money for just spraying water on the radiators. They didn't even wash the blower. I hired another coy on carousell. Much cleaner and cheaper.",
          "score": 1
        },
        {
          "text": "The pcb is in a different compartment from the fan and condenser. If the fan died, you can blame them. But a pcb sees odd unless they sprayed with the cover off.\n9 years on a consumer grade unit is about the lifespan.\n\nI would question how do they know it’s the pcb. Is it giving a pcb error code? These muppets usually just replace part by part until they find the right one. Diagnosing is a forgotten step.",
          "score": 1
        },
        {
          "text": "normal to \"spray water of chemicals\" on the condenser. There is no electrical wiring on the condenser, just pipes, maybe an earth wire connected to it.\n\nThe electrical part is on the right side of the aircon, did they cover it up during servicing?\n\nyour air con old already, might as well replace it, don't change pcb, newer models are more energy efficient.",
          "score": 1
        },
        {
          "text": "Switch to coolserve bah. Quite happy with them so far",
          "score": 1
        },
        {
          "text": "First they spoil it then they earn",
          "score": 1
        },
        {
          "text": "Why not the installer maintenance? Mine under gain city. At least came down 7 times in 2 years, all SOP look exactly the same.",
          "score": 1
        },
        {
          "text": "\nRecommend you only get maintenance from the warranty company and never those 3rd party companies for \n\n1. Competency. They are qualified. \n\n2. Less chance of funny tricks like intentionally spoiling your unit or claim unnecessary expensive repairs (ie condenser defective or motherboard spoilt) for high additional fees\n\n3. Swapping good original parts for second hand parts and/ or charging you original price",
          "score": 1
        },
        {
          "text": "The Aircon condenser is designed to be able to withstand the elements, so unless they remove the chassis and spray inside, it is unlikely for it to be damaged by water.\n\nI do have an Aircon man that I trust. He diagnosis and fixed most of my Aircon issues and I have been using him for more than 10 years. If I want his contact, then pls DM me.",
          "score": 1
        },
        {
          "text": "Any good aircon maintenance company for recommendation? I used to hire my friend father to do maintenance. Paid for chemical overhaul as quoted for $100 for system 1. Aircon keep leak and not cooling. After quite a while, I went for another company for servicing and they said my aircon is poorly maintained and is all clogged.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r6ert5",
      "subreddit": "askSingapore",
      "title": "scammed on carousell, how to confront the guy?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r6ert5/scammed_on_carousell_how_to_confront_the_guy/",
      "score": 28,
      "num_comments": 47,
      "created_at": "2026-02-17T00:47:47",
      "selftext": "hi everyone recently i was scammed on carousell for about $65, even though it’s relatively little, but i am a student and $65 is quite a lot for me. i managed to ask a friend to help me “buy” another item from him and we will be meeting up face to face soon. however im not sure how to confront him, any advice? how should i deal with this scammer?\n\ni tried texting him on carousell but he ghosted me, and i doubt singapore police will look into my case given that it has little monetary value\n\nthank you in advance\n\nedit: thank you all for your advice, im just gonna go down and meet this guy with another friend, we are both students but i think 2 is gonna be better than 1, if he punch me, ill take it and call the police, if he doesn’t punch me and don’t wanna refund i’ll call the police for civic matter and hopefully that would solve this issue.\n\ni will update how it goes and perhaps yall can do this in the future too",
      "comments": [
        {
          "text": "Report to police first in case this is a serial trickster. ",
          "score": 112
        },
        {
          "text": "Ask your friend to ask the carousell guy to paynow him $0.01 just to verify that he’s legit. Then you have proof of his identity because with a paynow or bank transfer the police will have all his details. Then when u confront him u can use this case as a way to scare him that the police will have all his information. And voice record the whole thing just to have a backup when confronting. Do it professionally instead of emotionally.",
          "score": 72
        },
        {
          "text": "Happened to me before too on Carousell, but for a much larger sum (4 figures). From my experience, police report will be useless, they are of no help at all.\n\nIf you are meeting the person, I’d try to think of some way to get their info (phone number and address are the most important). This way, you can file a small claim against them on small claims tribunal (but the entire process will cost you some $$ also). \n\nIf they don’t give you back your money at the confrontation, or if you can’t get their personal information, can try call police on the spot to come down.\n\nDisagree with others saying to just “suck it up” or to let it go. The more we let such scumbags get away with things like this, the more they will continue to scam other people. Whether it’s just $1 or $1 million, these people should pay for their crimes.",
          "score": 44
        },
        {
          "text": "Confront is never a good idea. Instead make a police report first. Scarly he punches you how???\n\nWhat if that guy is a violent drug addict or what. We never know.\n\nThe idea of confronting sounds heroic but it's not legally right. \n\nMake a police report and they will advise you accordingly. Don't take risks just for 65$   it's not worth\n\nCarousell won't give a damn, cos was it caroupay you used or direct paynow?\n\nCan't blame carousell. They did their part by implementing caroupay for safety \n\n\nIf direct Paynow, you are out of luck",
          "score": 6
        },
        {
          "text": "report police",
          "score": 2
        },
        {
          "text": "Meet up with him and threaten to call the police on the spot if he dosent return u the money,I recommend someone going with you for safety and easier to confront",
          "score": 2
        },
        {
          "text": "Can share more why you said you’re scammed? Like you paid and the person give fake stuff or?",
          "score": 1
        },
        {
          "text": "Screenshot all the evidence and complain to Carousell",
          "score": 1
        },
        {
          "text": "$65 is the approximate price for a bg4500 or bg4550. Which of these did you get? \n\nWhat was stated in his ad?",
          "score": 1
        },
        {
          "text": "I got scammed recently on carousell too. Bought a Nike slides when the listing stated it was genuine. Upon receiving it, it is fake AF. I have the original one at home to compare with. \n\nWhen I report to carousell, the reject the report of selling counterfeit goods. The rejection message asked me to write instead which I did. Guess what? When I email them, they ask me to use the app to report instead like wtf. I was in this loop for a while. \nFinally they said I had to get a memo from the manufacturer to verify that the item is fake first before I can lodge complaint against him. The hell…\n\nI don’t mind losing that $50 since I can afford it. but I just don’t want others to get scam as well. Seem like carousel don’t give a shit about it",
          "score": 1
        },
        {
          "text": "Do be careful when trying to catch the scammer. This reminds me of one of the episodes on kdrama Taxi Driver S3 where the ppl trying to outsmart the scammer ended up with even bigger losses.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r6dzas",
      "subreddit": "askSingapore",
      "title": "What's it like having relatives visiting in CNY",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r6dzas/whats_it_like_having_relatives_visiting_in_cny/",
      "score": 28,
      "num_comments": 23,
      "created_at": "2026-02-17T00:19:19",
      "selftext": "So I'm only 1st generation Singaporean. So all my relatives are overseas, my family doesn't have the time to visit them for CNY.\n\nEveryone's always complaining about their relatives visiting, but I could never understand. I sometimes wonder if I would end up being like everyone else hating on CNY. is it always that bad?\n\nIt feels good not to have to deal with that, but abit lonely even tho I'm still with my Family I guess",
      "comments": [
        {
          "text": "It's only bad if they ask nosy questions \n\nOther than that pretty much, I actually like it a lot since it's the only period of the year where my house will filled with conversations and liveliness",
          "score": 33
        },
        {
          "text": "It really depends on what sort of questions our relatives will ask but generally its a happy and fun occasion especially when we gather together to play cards. Blackjack is kind of a bread and butter for my family and we can have 10 over people gather around a small table playing it. The unity one can experience when the banker is drawing the card while all players and audience are shouting \"picture picture\" is unbeatable.",
          "score": 30
        },
        {
          "text": "Not me. I always look forward to visiting my relatives and  having good times with them!",
          "score": 10
        },
        {
          "text": "It depends on the type of relative that you have. If they are the caring type and were there for you all the time, then you look forward to it. If it’s the other way round, then you dread it. \n\nI guess need to understand the purpose of it. Most of the time, CNY gathering supposed to be celebration of the year that has been and support on the year that is coming as well. \n\nThe true meaning might have been lost with some families taking the advantage during CNY to show off to and compare themselves or kids against other relatives. This and potentially other reasons could create this hatred for CNY visiting relatives.",
          "score": 9
        },
        {
          "text": "It's amazing! You meet up your old friends that just so happened to be related by blood and eat a scrumptious meal before proceeding to play 6 hours of either card games or mahjong. And leaving after you feel abit tired.",
          "score": 6
        },
        {
          "text": "I am a foreigner married into a chinese singaporean family. Cny is nice to see faces but i have always felt out of place one way or another but I also have gotten used to the feeling, its mostly good. Specially the kids lol damn they grow up tall and fast. Makes me miss my relatives back home and makes meeting them on those occasion more heartfelt and valuable. Never teared up hugging my aunts and uncles before i left my home country.\n\nI guess si skipped the nosy questions by way of being a transplant. Most dont really makethe effort to make small chats with me though i do at times just tell them x is growing so fast, and handsome / beautiful - good job raising them. Just so i dont have to ask how are they and trip a wire i dont want to lol",
          "score": 4
        },
        {
          "text": "Not all bad. At least my relatives are not the nosy, comparing sort. It is just a nice get together and catch-up time",
          "score": 3
        },
        {
          "text": "Tired",
          "score": 3
        },
        {
          "text": "Same.But don’t u go back to hometown for CNY even for maybe 1 year",
          "score": 2
        },
        {
          "text": "Hey don’t worry, I’m also in the same situation as you, 1st gen Singaporean. The majority of my relatives are overseas, but tbh I haven’t been that close to them as I haven’t went back for CNY for almost more than a decade now, as only my closest family resides here in SG, due to work commitments as well.\n\nI used to have the same feelings as you but over time I’ve come to realise that it can be more of a blessing as I’m more introverted by nature. You can build stronger bonds with your family here in SG, and also take it as an off day for you to rest and rejuvenate as well! I’ve seen some of my friends who say they are too tired from all the visiting, which I’m unable to relate, but I’m glad I can spend time with those that matter to me the most.",
          "score": 2
        },
        {
          "text": "Wait till their sarcastic comments on why I am so fat when I am visibly jacked. No tummy, athletic build. I have a super huge frame though. \n\nFyi, the commenter is fat with a big belly. \n\nThe other one will be why are you not married?\n\nWhy your hair so long? You should cut.  ",
          "score": 2
        },
        {
          "text": "just go visit your friends",
          "score": 1
        },
        {
          "text": "sometimes can be good, just enjoy the atmosphere and play some celebratory music to get everyone in the mood",
          "score": 1
        },
        {
          "text": "I think a lot depends on your family and how they behave. Don't get me wrong, I'm a serial CNY/LNY hater, but that's mostly because I feel like there is no choice/I'm forced into everything.\n\nIf you are allowed to go hide in your room for a short break, leave the house for a bit without being questioned, etc. I don't think it'll be the worst.\n\n(Forced) pandering to the older folk is usually what turns the young people off.  \nthat said, I'll probably be singing a different tune when i'm old.",
          "score": 1
        },
        {
          "text": "Imagine one nosey/busybody classmate or colleague being nosey/busybody, but you cannot just keep quiet and smile, or ask them to shut up, because of\n\n*P I E T Y*\n\nTo them, they are entitled &lt;respect&gt; from you.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r6yhhq",
      "subreddit": "SingaporeRaw",
      "title": "Everybody Huat ahhhh",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r6yhhq/everybody_huat_ahhhh/",
      "score": 232,
      "num_comments": 16,
      "created_at": "2026-02-17T14:20:52",
      "selftext": "",
      "comments": [
        {
          "text": "马 nigga",
          "score": 45
        },
        {
          "text": "![gif](giphy|ZqlvCTNHpqrio)\n\n",
          "score": 31
        },
        {
          "text": "https://preview.redd.it/j0911lpi60kg1.jpeg?width=768&amp;format=pjpg&amp;auto=webp&amp;s=b672241acdbc5c42290445dfcc19335aaf40c435",
          "score": 26
        },
        {
          "text": "Ah yes, the huattable horse\n\nWhy yes I read right to left like a pure blooded Chinese, how could you tell?",
          "score": 12
        },
        {
          "text": "It means mother fucker omg",
          "score": 8
        },
        {
          "text": "Huat Lah!!",
          "score": 3
        },
        {
          "text": "Waiting for the next Snake year 🐍 \n\nIt’s gonna be 🔥",
          "score": 3
        },
        {
          "text": "This one 可以",
          "score": 2
        },
        {
          "text": "That's funny.. Huat",
          "score": 2
        },
        {
          "text": "Happy lunar new year everyone! Fuck CCP!",
          "score": 2
        },
        {
          "text": "https://preview.redd.it/k54pywzt01kg1.jpeg?width=1024&amp;format=pjpg&amp;auto=webp&amp;s=3a2b14ffaa5adde1afdfc13420d5d2eff3c68625\n\nhahaha. ",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1r6e589",
      "subreddit": "SingaporeRaw",
      "title": "sg parents make terrible parents",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r6e589/sg_parents_make_terrible_parents/",
      "score": 165,
      "num_comments": 45,
      "created_at": "2026-02-17T00:25:13",
      "selftext": "parents these days don’t scold their kids until someone else scolds them for you. then they get pissed at another adult disciplining their kid lol\n\nwas standing behind a kid just now waiting to buy snacks, and this kid who is probably 8-9, about 120cm max, kept doing some acrobats by extending their body to take them and i was getting pushed back by them. after the 3/4 time i told the kid don’t “push me please”, and the parent immediately turned around and i told them, i’m not trying to push your kid but your kid keeps pushing me”. their response was “it’s like that one, anyway we are done” and the kid also responded “the man also kept pushing me”. no wonder the kid like that, the parent also like that.\n\ni was behind them, so the man probably got shoved by the kid with their acrobat stretchting,  that’s why he pushed the kid back lol.\n\nthe parent did explain to the kid i was probably waiting to take the snacks, but you don’t say??  why else would i be waiting behind you for my turn. then loudly announced they wanted to get out, to paggro me lol.\n\nparenting is really terrible these days, if it were me, my parents would apologize on my behalf and tell me not to push people. 🤡\n\nanyway happy lunar new year/ cny folks, enjoy the holiday.\n\nedit: wanted to add if it was an adult who was pushing me i would 100% push back.i was trying to be nice to a kid and this what i get lol",
      "comments": [
        {
          "text": "That’s the norm nowadays. Just like how our parents’ generation see us as ‘spoilt kids’. Every following generation ‘gets worse’.",
          "score": 85
        },
        {
          "text": "low ses parents",
          "score": 44
        },
        {
          "text": "Permissive parents breed entitled brats",
          "score": 39
        },
        {
          "text": "Singaporeans are inherently a childish group- easily scammed, follow the herd, only think of money and how to avoid hardships and confrontation.\n\nThat's why the parenting here is like this.\n\nAt least in the past they didn't forget they were the parents and the law. Now many are once again being sheep and blindly following western liberal ideas of parenting.",
          "score": 36
        },
        {
          "text": "I have seen permissive parenting at work before. Kid is a brat. I like children but I have to say I really dislike that one lol. Climbs all over the parents head and is absolutely obnoxious. Can’t wait for their turn, has no concept of boundaries and just does whatever they want. \n\nParent thinks nothing wrong of it; it be interesting to see what kind of an adult becomes of this",
          "score": 25
        },
        {
          "text": "Super permissive parenting and kids will climb all over their parents heads since they set 0 boundaries! This is especially true of 2 ethnicities who I won’t mention at risk of a ban!",
          "score": 21
        },
        {
          "text": "Wait till you meet china parents. \"They are still a child\" \n\nIf they cant teach their kids, society will punish them for you",
          "score": 12
        },
        {
          "text": "Gave up on sinkies long ago. Coolie genes still passed down strongly and cannot be helped. \n\nHope TFR rate goes to zero so sinkies will go extinct. These frogs are boiled.",
          "score": 10
        },
        {
          "text": "So many parents in SG do not make the effort to control their kids when they are behaving badly out in public spaces, like MRT, shopping malls, restaurants, etc. This annoys me when the kids are causing disturbances and inconvenience to other people around. The next generation is going to grow up selfish and entitled sadly.",
          "score": 7
        },
        {
          "text": "Parents? They need to parent themselves before being parents.\n\nSpeak to any educator, and they will insist their charges are clones of their parents.\n\nHaving said this. It's also notable that adults will always shrug it off when their kids misbehave, but will play devil's advocate if the roles were switched. \n\nTransgressions such as this will be a common sight if the situation persists: \n\n[https://packaged-media.redd.it/5q6wf88v9g0f1/pb/m2-res\\_854p.mp4?m=DASHPlaylist.mpd&amp;v=1&amp;e=1771290000&amp;s=6c25e587c04d1802fc88dd3a2ccee1baee0cd799](https://packaged-media.redd.it/5q6wf88v9g0f1/pb/m2-res_854p.mp4?m=DASHPlaylist.mpd&amp;v=1&amp;e=1771290000&amp;s=6c25e587c04d1802fc88dd3a2ccee1baee0cd799)",
          "score": 6
        },
        {
          "text": "So many brats in Singapore",
          "score": 6
        },
        {
          "text": "My neighbour's kid literally screeches while playing his computer games. Not an excited shout but a keening screech at max volume that can be heard even through closed doors.\n\nParents does nothing.",
          "score": 3
        },
        {
          "text": "They dk how to raise kids anymore… both parents busy with work and leave their kids with maid/childcare centre.",
          "score": 2
        },
        {
          "text": "True, however wld step aside &amp; let kid do stunts while still stayin in q@d side &amp; enjoy performance. Since parents dun wana discipline their kids, ain’t my job also. No point steppin in dat cld potentially bcum confrontation ova dumb kid.",
          "score": 2
        },
        {
          "text": "Agree.\nWhile on the bus, mother asked child to stand and prepare to alight. Child refused to move after a few repeated reminders. Mother no choice but to take back her mobile from child’s hand. The girl just stood up to hit her mother repeatedly. Mother fought back and a slapping body match ensue for the next few seconds. Then the mother just said ‘let’s go’ and they both alighted. Just like a sisterly fight. No reprimand for defiant and hitting of mother for the little girl.",
          "score": 2
        },
        {
          "text": "Sinkies make terrible sinkies so what’s your point?",
          "score": 2
        },
        {
          "text": "Dunno wtf happened simi push push",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1r6qd2d",
      "subreddit": "SingaporeRaw",
      "title": "Who is this MP?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r6qd2d/who_is_this_mp/",
      "score": 114,
      "num_comments": 17,
      "created_at": "2026-02-17T07:58:31",
      "selftext": "Anyone knows him? Says he meets mp and go parliament all the time . The way he posts is also informal like MP liddat ",
      "comments": [
        {
          "text": "He says he’s a grassroots volunteer. But looking at the way he talks etc, likely a special needs kid who has a fixation on being an MP. Leave him alone ba",
          "score": 211
        },
        {
          "text": "Apparently some dude called Jovan",
          "score": 64
        },
        {
          "text": "Jovan Chew",
          "score": 22
        },
        {
          "text": "Can become NMP if he can learn to attack opposition.",
          "score": 8
        },
        {
          "text": "He is the MP for pulau tekong\n\n/S",
          "score": 6
        },
        {
          "text": "Oh shiiii it’s daddy Jovan",
          "score": 5
        },
        {
          "text": "The only Jovan that is relevant is the sim lim guy",
          "score": 3
        },
        {
          "text": "god he looks tired",
          "score": 1
        },
        {
          "text": "Look at this Tard.",
          "score": 1
        },
        {
          "text": "Oh shit it’s Jovan I know him",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1r6c53d",
      "subreddit": "SingaporeRaw",
      "title": "Man in S’pore advertises himself as ‘boyfriend for rent’ on social media for Valentine’s Day &amp; CNY.",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r6c53d/man_in_spore_advertises_himself_as_boyfriend_for/",
      "score": 71,
      "num_comments": 21,
      "created_at": "2026-02-16T23:11:20",
      "selftext": "He hasn't confirmed any bookings yet for CNY, but he has received a few enquiries.",
      "comments": [
        {
          "text": "52yo...\n\nKnn 30s single women bring him to gatherings invite more questions than answers. \n\n40s single women won't even need to entertain their aunties, all given up or dead already.\n\nDon't need to mention 20s.",
          "score": 73
        },
        {
          "text": "https://preview.redd.it/zml7asl4ivjg1.jpeg?width=1410&amp;format=pjpg&amp;auto=webp&amp;s=7912013d04911d9800eca1c6295d9c24c9ec5bcc\n\n*S$500 hourly rate, Mr Neo (52) told MS News that it was set based on his humorous personality.*   \n*“You get what you pay for. The rate is negotiable. Book me for both Valentine’s Day and Chinese New Year, and it’s a promotional deal, S$500 for the two occasions,”* he said.\n\nAll i can say, such is an acquired taste for most if not all 😁",
          "score": 50
        },
        {
          "text": "This type u bring home really will shut down ALL questions. Not to mention shutting down the mood hahaha",
          "score": 28
        },
        {
          "text": "This has been going on for years if not decades. \n\nI remember reading about CNY partners for hire way back in the 2000s. ",
          "score": 6
        },
        {
          "text": "Wah! This type of looks. Pay me, I also don't want.\n\nLooks more like a clown than a bf to be proud of. ",
          "score": 5
        },
        {
          "text": "Good money 👏",
          "score": 3
        },
        {
          "text": "![gif](giphy|LbvdcrbTOk6eK1kQ6u|downsized)",
          "score": 3
        },
        {
          "text": "![gif](giphy|XHeLeuirRbwptHhSWd)",
          "score": 2
        },
        {
          "text": "Look like clown leh. Maybe circus family can.",
          "score": 2
        },
        {
          "text": "he is a gigolo is it",
          "score": 2
        },
        {
          "text": "This kind of tism needs to be studied",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r6ydku",
      "subreddit": "SingaporeRaw",
      "title": "Before election: “We need the taskforce man.”. After election: “We can live with it.”",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r6ydku/before_election_we_need_the_taskforce_man_after/",
      "score": 63,
      "num_comments": 52,
      "created_at": "2026-02-17T14:14:49",
      "selftext": "",
      "comments": [
        {
          "text": "Punggol voters got played",
          "score": 45
        },
        {
          "text": "He is not called gan bo yong for nothing. \n\nY'all dumbasses suck it up, you voted for this.",
          "score": 33
        },
        {
          "text": "Just proved how dumb Punggol residents are. Time and again kena conned",
          "score": 16
        },
        {
          "text": "PSP LMW and TCB were right after all, despite all responses/comments criticising them of taking the issue lightly at that time.",
          "score": 15
        },
        {
          "text": "Kumgong then believe",
          "score": 14
        },
        {
          "text": "Before voting say we need him to help in tariffs. After election he tell you gdp growth dosent gurantee jobs.\n\nWhat is this tbh. Than next time will tell u no job not my fault cause you never go for ai course.",
          "score": 14
        },
        {
          "text": "Sinkie fault really. We never give 100% mandate",
          "score": 13
        },
        {
          "text": "https://preview.redd.it/gegw8k77i0kg1.jpeg?width=846&amp;format=pjpg&amp;auto=webp&amp;s=664afcb6ff4d8306c757bb6b48ba65edf76a7d11",
          "score": 10
        },
        {
          "text": "&gt;Before election: “We need the taskforce man.”. After election: “We can live with it.”\n\nSounds like\n\nBefore election: “With you, for you, for Singapore.”. After election: “F**k you.”",
          "score": 10
        },
        {
          "text": "Punggol residents are stupiak. I know quite a few who lives there ",
          "score": 8
        },
        {
          "text": "Did they ask us citizen about 20% increase for tobacco and 45% decrease in ARF? 😆",
          "score": 5
        },
        {
          "text": "Talk so much, 5 years later still vote PAP 🤷‍♂️",
          "score": 4
        },
        {
          "text": "I mean, it was such an obvious ploy.  GKY has never been known to be efficient at producing results.\n\nAnd if you actually believed in this Taskforce BS and voted for him…. you know who you are.",
          "score": 4
        },
        {
          "text": "Fear mongering from day 1 kids. We’ll never learn and forever live in regret. \n\nhttps://www.reddit.com/r/singapore/s/b4RWxXLgiZ",
          "score": 3
        },
        {
          "text": "And they can't even get a better rate by meeting with epstein again",
          "score": 2
        },
        {
          "text": "punggol went in 2 eyes open. millenials are very bright and intelligent people wor.",
          "score": 2
        },
        {
          "text": "Voters have short memories. Next elections come along, same results. Worse still, you have more of these snakes and morons coming here to use Singapore as a springboard to other countries. In the meanwhile, the housing prices get inflated like crazy and the “PRs” just bail whenever it’s convenient. Horrible.",
          "score": 2
        },
        {
          "text": "Really played us real good. Punggol residents kena scammed hais",
          "score": 2
        },
        {
          "text": "How did the “strong mandate” matter to the negotiations? It’s totally unrelated. They didn’t even dare to say that Gan is a great negotiator.",
          "score": 2
        },
        {
          "text": "I think the phrase I'm looking for is.... I told you so",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1r6uyb9",
      "subreddit": "SingaporeRaw",
      "title": "The Paper Doll",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r6uyb9/the_paper_doll/",
      "score": 58,
      "num_comments": 44,
      "created_at": "2026-02-17T11:21:04",
      "selftext": "I feel like such a petty person for even letting this get to me, but I honestly don't know who to talk to without sounding like I’m just jealous of her wealth.\n\nI’ve been working with this colleague, let's call her \"S\", for close to a year. On paper, she’s everything society worships: Ultra-wealthy background (her grandparents own hospitals in China), a Master’s degree from NUS, and parents who are powerful politicians. For context, I come from a typical heartland Singaporean background where we believe in meritocracy—you work hard, you apply for BTO, you save up. I haven’t been bothered by the SES difference until I realized how she actually operates.\n\nI knew she was rich, but seeing her work ethics in person was a total culture shock.\n\nThe moment she steps into the office, I feel so frustrated. She treats her job like a hobby she’s bad at. She literally just uses ChatGPT to copy-paste her workload, even for simple reports. When I try to guide her, she just scrolls on her phone and ignores me. But the worst part is the hygiene. You’d think someone that rich would be polished, right? Wrong.\n\nIt was a total sensory nightmare. She wears the same designer attire for a week straight without washing it. The smell of stale perfume mixed with sweat is everywhere because we sit side-by-side. She coughs and sneezes every 5 minutes without covering her mouth, leaving used tissues all over our shared desk. I tried my best to be polite and ask her to clean up, but she just expects me to tolerate it.\n\nI thought I could just ignore the laziness, but this has backfired badly. Recently, she openly bragged about her \"solution\" to her expiring S-Pass. She announced she married a China-born Singaporean just to keep her residence here. She was quite uncouth about it... she openly admitted she doesn't love him and calls him the \"obedient one,\" while she keeps other \"handsome\" guys on the side to make her feel beautiful. She winked and acted like she was a genius for buying her way into our country. Everyone else (because she buys them expensive lunches) just laughed like it was a normal joke, even my boss just chuckled. I felt so cheap.\n\nNow I’m caught in a dilemma. I take pride in my career, but I’m thinking about my future in this company. If I stay, I have to sit across the table from a woman who mocks the very values my forefathers built Singapore on—hard work, integrity, and family. I duno how I can continue to work with someone who treats people and laws like items on a menu. Now I feel so naive for thinking \"hard work pays off.\" Is this what corporate life is going to be like? Am I being a self-righteous hater for being bothered by her lack of morals and hygiene, or am I right to be disgusted? Please don't roast me as being jealous as I’m already feeling like my efforts are trash, so appreciate constructive comments to help me clear my mind.",
      "comments": [
        {
          "text": "The OP’s account was created less than an hour ago with spam posting in sgraw. With all the telltale signs of AI slop. Just a typical rage bait post. Move along fellow Singaporeans!",
          "score": 75
        },
        {
          "text": "Besides her, you need to ask if this job is still worthy to devote your time and energy to. Don’t die for your ideals.\n\nCNY day 1, hope you can see things in a fresh perspective.",
          "score": 73
        },
        {
          "text": "Cant believe yall fell for this ragebait on cny day 1 no less",
          "score": 28
        },
        {
          "text": "I'll add to things that never happen. Karma farming using AI. Downvote and report.",
          "score": 23
        },
        {
          "text": "Why recently so many story telling on this sub?",
          "score": 20
        },
        {
          "text": "Eh time to go and eat medicine",
          "score": 6
        },
        {
          "text": "Assuming all this is true, I can understand the difference in personal values being a detriment to your wellbeing. The bigger picture here is your long term career. \n\nIs this person working at your level? if she's is not able to change or do things properly and your concern is that due to her background she might get ahead of you in this company, then perhaps being there isn't ideal for you. If her behavior has no impact on your career progression (and maybe the company as a whole) then perhaps it may not be a battle worth undertaking?",
          "score": 3
        },
        {
          "text": "This is just my honest opinion but i feel that you’re being too idealistic if you think corporate life is a meritocracy playground. Everywhere you go, or anywhere really, there will be someone whose values don’t align with yours. Some are hardworking and have principles while some will be privileged and have no moral. That’s reality. School forces group work for exactly this reason, to teach you that you don’t get to choose your team mates in life.\n\nWhen people talk about diversity, it’s not just about race or SES, it’s also about habits, culture, worldview, upbringing, ethics, ambition and in your own experience, hygiene standards. You can be very troubled by how she doesn’t live by your standards (does not mean i agree with her behaviour) or you can just focus on yourself and accept that the world is full of people like her and learn how to ignore such things. Learn to lean towards people who share your values, and with that same values, then they deserve to be your friends. You don’t keep friends that you won’t get along with right?",
          "score": 3
        },
        {
          "text": "You again?!",
          "score": 3
        },
        {
          "text": "Why do I feel that these posts are all AI generated?",
          "score": 3
        },
        {
          "text": "I know people hate PRC here.\n\nBut all the Chinese I worked with has been pretty good. Above average experience.",
          "score": 3
        },
        {
          "text": "This reminds me of the videos that I've been watching recently on YouTube, about hygiene among the kings and queens of Europe back in Victorian days. The nobles had horrible hygiene habits and believed that water would cause bacteria to go into their bodies through open pores so they only \"bathed\" themselves (soaking in water) a few times a year.  They cloaked themselves in perfume and makeup that poisoned them slowly just to mask the awful smells and rotting skin underneath. \n\nI'm guessing those expensive clothing would wear down after repeated washes, so she just tries to reuse them instead of cleaning them properly for hygiene purposes. Our warm and humid climate is not suitable for such habits. \n\nThe part about coughing and leaving used tissue paper on the table is something that I absolutely cannot tolerate. I'd put on a mask and move away whenever someone does this in front of me. \n\nIs there any way to request for a change your seating arrangement so that you won't be directly opposite her? Who is she close to in the office, who likes to suck up to her the most, maybe you can try to strike up some kind of agreement with another person to switch seats then bring it up to the boss?",
          "score": 2
        },
        {
          "text": "Welcome to the real world where uou will encounter unpleasant stuff that you don't have much option.\n\nEither rise above it or leave.",
          "score": 2
        },
        {
          "text": "The \"values of our forefathers\" died a long time ago. All the devils are here.",
          "score": 2
        },
        {
          "text": "TLDR\n\nIn any case: Cool Story bro. \n\nPRC want face more than anyone I know. Wear the same clothes for multiple days? Yeah right.",
          "score": 2
        },
        {
          "text": "Honestly this feels like ragebait leh. Touching on topics that anger singaporeans the most. If this is a real scenario, move on with your life. Dont give ppl the joy of being able to upset you with such matters. Everywhere you go, you might meet with similar situations or not but soon you’ll know to focus your time and energy on things that really matter! In fact, she most likely doesnt care abt you or what you’re doing and how shes pissing you off as well so, dont give her the attention. Request to change place if you can.",
          "score": 2
        },
        {
          "text": "Well, those who dare scoff at you may soon encounter this themselves.\n\n\nI have no answer for this, because as a culture and as a nation, our god is Mammon. We worship money, all of us, from the top government officials to the retirees buying 4D and Toto every week. From the majority Chinese and CECA migrants making big bucks in the banks to the handout-collecting families popping out kids without stop and stacking them on government-subsidised PMDs and PMAs.\n\n\nThis is what we're going to get. Except for a tiny minority of us, the generosity of the spoilt but rich will shut both our eyes to their antics and society-degrading mannerisms and ideologies. The perceived fear of losing money, losing stability, will keep us voting foolishly until we maybe lose our sovereignty in a geopolitical upheaval or the true King comes back again. ",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1r70fj0",
      "subreddit": "SingaporeRaw",
      "title": "SG felt less crowded these few days yet things are functioning as per normal",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r70fj0/sg_felt_less_crowded_these_few_days_yet_things/",
      "score": 53,
      "num_comments": 62,
      "created_at": "2026-02-17T16:17:44",
      "selftext": "This shows that we do not need that many foreigners to be begin with",
      "comments": [
        {
          "text": "Because half of our population go back to their hometown Malaysia 🤣",
          "score": 101
        },
        {
          "text": "GDP over happiness",
          "score": 43
        },
        {
          "text": "Once they fly or drive back in, you’ll be hit again by the public transport meltdown.",
          "score": 30
        },
        {
          "text": "We need more foreigners to function because by virtue we also had more foreigners. If we remove them, we will be back to our greatest",
          "score": 11
        },
        {
          "text": "Good thing we're all able to enjoy other local delicacies like nasi ayam, mee goreng, nasi brani, mee rubus, roti prata, mee siam, teh tarek, milo dinosaur, etc. 😋 Rem support local delicacies/brands, dun buy those foreign food/brands ya👍⭐❤️ ",
          "score": 4
        },
        {
          "text": "None is too many.",
          "score": 1
        },
        {
          "text": "...huh?",
          "score": 1
        },
        {
          "text": "Uh… you aren’t in the industries that’s hit the hardest by the lack of foreigners.\n\nThat, and people planned for work to be done before/after CNY.\n\nThe effects take time to come in and make you feel the hurt.",
          "score": 1
        },
        {
          "text": "I only support maintaining of CMIO",
          "score": -8
        },
        {
          "text": "Still surprised to see all these hatred comments and thoughts here by the Singaporeans. All these racism and stereotypes hidden behind the smiley faces at its best",
          "score": -10
        },
        {
          "text": "But you dont mind if it's tiongs coming in right? You want sg to be nothing but tiongs right?",
          "score": -23
        }
      ]
    },
    {
      "id": "t3_1r6alia",
      "subreddit": "SingaporeRaw",
      "title": "Where 2 go CNY Day1?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r6alia/where_2_go_cny_day1/",
      "score": 45,
      "num_comments": 42,
      "created_at": "2026-02-16T22:09:53",
      "selftext": "Don’t really celebrate CNY as my parents are divorced and I’ve been spending the past few years celebrating it on my own. I want to do something different this year, so I’m trying to find ways to pass the time tomorrow besides sleeping…\n\nDoes anyone have ideas on where to go on CNY Day 1? Any outdoor activities that are open? I’m thinking of Pulau Ubin or something a bit adventurous. Any suggestions? 🙏",
      "comments": [
        {
          "text": "yeah. Go do some touristy thing. I think crowds will be lesser and it will be more fun. the whole MANDAI wildlife park is more than the zoo now. Have fun man !",
          "score": 48
        },
        {
          "text": "Stay home clean and redecorate your living environment",
          "score": 36
        },
        {
          "text": "Fap",
          "score": 25
        },
        {
          "text": "You check with the ferries already? They operate on CNY as well? And then if they do, what's your chances of getting 12 pax(?) on the ferry? You ok with paying for the full ferry?",
          "score": 8
        },
        {
          "text": "I left home decades ago and have basically treated my parents as good as dead. So I usually eat CNY eve dinner with foreigner friends and go drinking with them on CNY 1 and 2.",
          "score": 6
        },
        {
          "text": "National Museum? It's free for Singaporeans/PRs. Next few days likely sporadic rain so better to stay indoors or have wet weather plans",
          "score": 5
        },
        {
          "text": "Zoo! Bird paradise! Mandai!",
          "score": 3
        },
        {
          "text": "go JB, no jam ",
          "score": 3
        },
        {
          "text": "Visit an old folks home",
          "score": 3
        },
        {
          "text": "Go to the Into The Modern impressionist art exhibition at the National Gallery. Highly recommended!",
          "score": 3
        },
        {
          "text": "It’s rainy so maybe find a friend for coffee",
          "score": 3
        },
        {
          "text": "similar situation. do something fun? or just find a place to chill and enjoy the day. good thing is the streets are a lot emptier with either people travelling out or doing visiting so it will hopefully 🤞🏻 be less crowd.",
          "score": 2
        },
        {
          "text": "put on your running shoes, take a walk down the entire Singapore river.",
          "score": 2
        },
        {
          "text": "I am gonna go River Hongbao at Gardens by the Bay to look at the decor",
          "score": 2
        },
        {
          "text": "Go workout",
          "score": 2
        },
        {
          "text": "River hongbao",
          "score": 1
        },
        {
          "text": "Flower dome and look at innocent flowers and plantz",
          "score": 1
        },
        {
          "text": "It might rain more over the next few days so bring a poncho along if you're planning any outdoor activities. If not, how about checking out Filmhouse? They've curated some programmes for the CNY/V-Day season; there might be something for you to catch.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r71nqk",
      "subreddit": "SingaporeRaw",
      "title": "Bus accident in Yio Chu Kang road. Ppl got down to take photo for 4D.",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r71nqk/bus_accident_in_yio_chu_kang_road_ppl_got_down_to/",
      "score": 35,
      "num_comments": 15,
      "created_at": "2026-02-17T17:36:35",
      "selftext": "All who took the photos were passengers. who alighted quickly to take number plate photos to take 4D. also, a bit weird that no one rushed to check if everyone is ok. I wasn’t the passenger; was waiting for bus, but did go to check on bus driver who was frantic. anyway, glad nobody got hurt. ",
      "comments": [
        {
          "text": "Huat la…",
          "score": 11
        },
        {
          "text": "wait so what's the number plate? (asking for a friend)",
          "score": 5
        },
        {
          "text": "The thing is... Suay got knock and kana accident... So why the need to waste $ on such numbers",
          "score": 3
        },
        {
          "text": "who bang who? which at fault again?",
          "score": 2
        },
        {
          "text": "and you didnt manage to take the photo of the plate to share?",
          "score": 2
        },
        {
          "text": "Must be singaporean driver because foreigner driver balik kampung",
          "score": 2
        },
        {
          "text": "Sickos",
          "score": 1
        },
        {
          "text": "Driver who drives annually",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r6xh59",
      "subreddit": "SingaporeRaw",
      "title": "Deceptive approach: Singapore man posing as colleague of victim’s dad jailed five months for molestation",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r6xh59/deceptive_approach_singapore_man_posing_as/",
      "score": 15,
      "num_comments": 16,
      "created_at": "2026-02-17T13:26:19",
      "selftext": "SINGAPORE, Feb 16 — A 42-year-old man was sentenced to five months’ jail for molesting a woman after falsely claiming to be her father’s colleague, the court heard.\n\nAccording to court documents reported by the *Straits Times*, Om Kumar Rai approached the 22-year-old woman while she was walking home around midnight on June 17, 2025. \n\nHe allegedly kissed her hand twice before leading her to a staircase landing where he grabbed her right breast.\n\nOm pleaded guilty to one charge of using criminal force with intent to outrage modesty. \n\nThe victim’s name and the exact location of the incident were withheld in court records.\n\nProsecutors told the court that Om initially extended his hand as if for a handshake, but instead held onto her right hand and kissed the back of it twice. \n\nWhen the woman tried to pull away, he did not release her, guiding her to the staircase landing where the molestation occurred.\n\nThe victim managed to push him away and went home before informing her parents, who reported the incident to the police the following morning.\n\nDeputy Public Prosecutors Tay Jia En and Ng Xin Yu described Om’s actions as “undoubtedly intrusive” and urged a custodial sentence. \n\nUnder Singapore law, offenders using criminal force with intent to outrage modesty can face up to three years’ imprisonment, fines, caning, or a combination of these punishments.",
      "comments": [
        {
          "text": "The New Delhi Television Ltd (NDTV) reported this news too.   \nThey specifically reported this, \"*Indian-Origin Man Jailed In Singapore For Using Criminal Force Towards Woman*\". ",
          "score": 10
        },
        {
          "text": "C",
          "score": 2
        },
        {
          "text": "Decepticon",
          "score": 1
        },
        {
          "text": "Usual suspect",
          "score": 1
        },
        {
          "text": "Y NO CANING??????",
          "score": 1
        },
        {
          "text": "CECA reverting to its nature. ",
          "score": 1
        },
        {
          "text": "Well well well",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r6het7",
      "subreddit": "singaporefi",
      "title": "What expense and savings tracker do you use this 2026?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r6het7/what_expense_and_savings_tracker_do_you_use_this/",
      "score": 36,
      "num_comments": 47,
      "created_at": "2026-02-17T02:21:44",
      "selftext": "I've check the popular ones - Spendee, Cashew, Money manager, and it feels like i'm still finding the right one for me.\n\nCan you recommend other Apps that you have used? Especially those that are not popular or underrated. Just want to try something new. Thank you!",
      "comments": [
        {
          "text": "Excel with manual input via CSVs. The best. Full control and flexibility and you can customise what you want to see.",
          "score": 39
        },
        {
          "text": "Google sheets, cos it forces me to go through my statements and be aware of every cent of my spending. ",
          "score": 22
        },
        {
          "text": "I use Dime",
          "score": 7
        },
        {
          "text": "I use [Spending Tracker - Budget App](https://apps.apple.com/sg/app/spending-tracker-budget-app/id1525179720), although note that you need to pay to unlock the full app (I recommend to get the lifetime unlock instead of the subscription). I tried a few apps before this and eventually settled on this one since it has everything I need. \n\nYou can try the app out via the trial before committing to the lifetime purchase!",
          "score": 6
        },
        {
          "text": "I use money manager as it offers enough details and has an easy to use UI. I mainly use it to log variable expenses though (meaning those that aren't fixed and regular like Telco). And I log others in excel when I need a level of detail that goes far beyond what all such apps are for (e.g. logging utilities down to water and power consumptions - I find expense apps logging only the amount spent doesn't show actual consumption patterns since the price per m3 and kwh keeps fluctuating).",
          "score": 6
        },
        {
          "text": "Actual budget",
          "score": 5
        },
        {
          "text": "Why not focus on if you have been consistently saving every month (Positive Growth), rather than how much you spend every month (Negative)? If you have done your part in savings towards a goal, then you can spend however you like.  \n\nBeen doing this way for the last 10 years. If my salary increase significantly, then I will increase the amount I save every month. Started at 20% and now I doing 25%. Which helps to control spending without thinking about it.\n\nTo me, this is easier. I only have to think about it once a month vs recording every time I spend money.",
          "score": 5
        },
        {
          "text": "Using Money Manager now. Too many years of record inside to move elsewhere.\n\nRecently I saw Budget Flow which piqued my interest, but because the amount of data I imported from Money Manager over to it was so high that the app drained my battery so fast while trying to sync, I had to delete it…\n\nLong ago I used to use YNAB but they have increased their prices at least three times since and I have stopped. ",
          "score": 4
        },
        {
          "text": "Been using mysprout.ai for quite awhile tracking monthly expense, i’ve been searching for trackers that can do automatic transaction but this is the closest so far, upload statements and it can track my cards and expenses.",
          "score": 3
        },
        {
          "text": "Money Manager has been enough for me for a few years now. I customize my categories, set my budgets (can be changed every month if needed), and it takes less than 10 seconds to log an expense.",
          "score": 3
        },
        {
          "text": "Money Manager apps on a daily basis. \nTransfer the total monthly amount to google sheets on a monthly basis.",
          "score": 3
        },
        {
          "text": "Firefly III (opensource) with the importer.\nI download every month the csv of my banks (like 5 of them!) and the importer will do the job.\n\nI got my own allocation rules.\n\nI took me sometime to start but now every month it's very fast.",
          "score": 2
        },
        {
          "text": "Build an app.",
          "score": 2
        },
        {
          "text": "Notion 🤭",
          "score": 1
        },
        {
          "text": "I use YNAB.",
          "score": 1
        },
        {
          "text": "seedly",
          "score": 1
        },
        {
          "text": "\nI use google sheets! To record my daily expenses, I created an automation using iPhone shortcuts and linked it to that sheet. \n\nWorks pretty well for me as it reduces user friction for me.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r6hjpp",
      "subreddit": "singaporefi",
      "title": "DBS altitude card",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r6hjpp/dbs_altitude_card/",
      "score": 6,
      "num_comments": 9,
      "created_at": "2026-02-17T02:26:30",
      "selftext": "Hello! Fresh grad here who’s about to start my first full time job. Wants to start collecting miles and I googled that the DBS Altitude card is a great entry level card. \n\nI have a DBS multiplier account, so I can link the card for higher interest rate. I’d prefer DBS as I already have a savings account under DBS. I was considering UOB PPV as well, but since I’m just starting out, i don’t want to stress about the min spend.\n\nQns: i’m not sure about the fees waivering for 10,000 miles. Which one is more worth it? Paying the fees or deducting miles?\n\nAppreciate any advice too! ",
      "comments": [
        {
          "text": "UOB PPV got no min spend what. Only got cap. You're confused with UOB VS?",
          "score": 5
        },
        {
          "text": "Just use paylah for higher interest rate and get uob ppv",
          "score": 4
        },
        {
          "text": "how is dbs altitude the best entry level card \n\n1.3mpd on all spend will put u back against 4mpd card",
          "score": 4
        },
        {
          "text": "Good idea 👍 \n\nFee waiver comes along usually with min $10k / $25k per year spending\n\nCan also consider paying for annual fees @ 10,000 miles per payment.\n\nAlternatively, consider these cards for 4MPD (capped spending applies though)\n\n1. Citi Rewards\n2. UOB Preferred Platinum Visa (PPV)\n3. OCBC Titanium Rewards (not sure if can still take)\n\nOnce you hit $60k / year income :\n\n1. HSBC Revolution (4MPD, no annual fees)",
          "score": 2
        },
        {
          "text": "You have to figure out a few things before deciding on a miles strategy\n\n1) what's your retail expenditure a month\n2) what is the mix in terms of online/offline/categories\n3) can you afford to travel during off peak periods\n4) got partner?\n\nEnvision you earn 4mpd*monthly expenditure, what flights can that get you in 2 years of earning? Not forgetting some fees in transferring credit card points to miles and then miles to actual tickets. And also that in 2 years could come nerfs and devaluations\n\nFor someone who spends below 2k a month, I would strongly discourage from starting the miles game. With the same effort just go cashback and enjoy the 4-8% cashback\n\nAn exception is if it's truly aspirational to just try business class once. \n\nOnce you have clarity on 1 and 2, you can identify cards more easily",
          "score": 1
        },
        {
          "text": "Neither. Just spend enough like 500 and easy to get it waived. but no bonus miles though. Or in 1 year or two years you can get another card from DBS and kill this. ",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1r71hdj",
      "subreddit": "singaporefi",
      "title": "Miles game",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r71hdj/miles_game/",
      "score": 3,
      "num_comments": 34,
      "created_at": "2026-02-17T17:25:31",
      "selftext": "Hello! Fresh grad here earning slightly more than 30k annually. Thinking of getting into miles credit card as I’m someone who loves traveling, and can travel during non-peak periods. My spending is roughly &lt;$1k a month. \n\nRough breakdown:\n\n\\- tithe: $200\n\n\\- food (paywave, scan qr code): $500\n\n\\- gym: $98\n\n\\- transport: $100\n\n\\- others: $100\n\nWhat credit card would you recommend? Can you also share what credit cards on your different purchases to collect miles? ",
      "comments": [
        {
          "text": "Which Uni, what degree and job now? The 30k annual is abit disconcerting as it seems low. Would focus on raising this first rather than thinking about playing miles game at this point..",
          "score": 31
        },
        {
          "text": "honestly at your current earnings, a cashback card might be better",
          "score": 18
        },
        {
          "text": "read up milelion for the most appropriate cc for miles.\n\nbut based on your expenditure now, i think you should be opting for cashback instead",
          "score": 12
        },
        {
          "text": "Just get citi reward and call it a day. Most of the expenses you've listed here are not eligible for 10x rewards or even any miles at all.",
          "score": 8
        },
        {
          "text": "With such low spend, better to earn cashback",
          "score": 4
        },
        {
          "text": "Hey, I don't want to outright encourage/discourage you but you should know what you're getting yourself into.\n\nThe miles game mainly works for those who really value sitting long haul business class flights, and have the patience to accrue said miles.\n\nFor example, SIN - SFO on SQ business saver costs 112.5K miles one way. If you spend 1k on a 4MPD card, you'd need slightly more than 28 months to earn enough miles. Then you'd need book ~1 year ahead since sin-sfo is a very popular route. So realistically, you'd only benefit from the miles game ~3 years in. This of course varies with distance to destination. Not to mention you'd be subject to policy risk if miles gets devalued.\n\nIf this doesn't put you off, welcome to the miles game!\n\nThere's some argument for using miles for economy flights but I believe the cashback rates should beat CPP for economy flights.",
          "score": 4
        },
        {
          "text": "For you, Citi rewards + uob PPV \n\nBasically, anything online, pay with Citi. Anything u paywave, use PPV. Transport, assuming ez-link, works for PPV too.\n\nThough keep in mind that PPV is only technically 600 per month limit for paywave.",
          "score": 3
        },
        {
          "text": "Citi Rewards for now",
          "score": 1
        },
        {
          "text": "or u can target those cards with high miles bonus on sign up. not sure if ur income can clear these.\n\nI'm not sure how true this is but if u cancel ur card with the bank, u are eligible for new bonus if u sign up again after 1yr.",
          "score": 1
        },
        {
          "text": "It’s scary. Fresh grad and just above 30k?",
          "score": 1
        },
        {
          "text": "Your salary is too low even for a fresh grad.\n\nAnyway, attack cards with sign-up bonuses first. Citi Premiermiles, UOB prvi miles, DBS Altitude. That's where you get the most bang for your buck.\n\nCheck out Singsaver and you may even get to pair with extra free gifts. Don't forget to cut eventually.\n\nThen get Maybank XL for 4mpd on all overseas spend (must hit minimum spend of $500).",
          "score": 1
        },
        {
          "text": "$500 contactless per month could get you 2000miles on HSBC revolution (4mpd). It’s not much but its something. Take note that the current accrual rate and ceiling is supposed to be until Mar 2026 only but they have extended this a few times iirc.\n\nAnother option is UOB lady’s card. With the basic card select dining as your category. But that restricts your miles accrual to just dining. So I’d say based on your spending pattern, HSBC revolution might be the best currently.",
          "score": 0
        },
        {
          "text": "Start early. Slowly focus on a card that has no expiry…took me about 15 years to accumulate 4 million miles. Just take your time, also help when you start earning more",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1r69h6n",
      "subreddit": "singaporefi",
      "title": "What’s everyone planning to do with their annual bonus ah?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r69h6n/whats_everyone_planning_to_do_with_their_annual/",
      "score": 0,
      "num_comments": 34,
      "created_at": "2026-02-16T21:22:06",
      "selftext": "Thinking what to do with mine, so come here kaypoh a bit..... share some inspiration leh.\n\n",
      "comments": [
        {
          "text": "No bonus here. Enjoy your bonus",
          "score": 49
        },
        {
          "text": "You guys have bonuses?",
          "score": 38
        },
        {
          "text": "Nice flex bro. Nice to be a bonus haver.",
          "score": 21
        },
        {
          "text": "Siambu s/",
          "score": 8
        },
        {
          "text": "Take 10 percent to splurge on something that will help you or someone else long term - try a new health hobby, take a vacation, buy new hobby items, give it to a struggling nephew or niece. Then 5 percent to splurge it on something stupid. Like take grab limousine for fun, try some expensive restaurant, buy new clothes you’ll only probably wear once, buy a camera and then realise your phone camera better, buy a ticket to Hong Kong to eat dim sum and fly back on the same day. \n\nInvest the rest",
          "score": 6
        },
        {
          "text": "Same thing as always. Pay bills, invest.",
          "score": 5
        },
        {
          "text": "What bonus?",
          "score": 5
        },
        {
          "text": "Save some for the family holidays in June and Dec. Invest the rest.",
          "score": 5
        },
        {
          "text": "siamdiu diao hua",
          "score": 4
        },
        {
          "text": "Pay mortgage for condo.",
          "score": 4
        },
        {
          "text": "Gonna buy a new watch",
          "score": 4
        },
        {
          "text": "What annual bonus?",
          "score": 3
        },
        {
          "text": "Buy the dip...",
          "score": 2
        },
        {
          "text": "No bonus. I envy you - I don’t have spare money that requires inspiration to spend on. Enjoy your bonus.",
          "score": 2
        },
        {
          "text": "pump into DBS",
          "score": 2
        },
        {
          "text": "Sorry bro no bonuses for me…",
          "score": 2
        },
        {
          "text": "V",
          "score": 2
        },
        {
          "text": "Prob doing some shopping at hermes",
          "score": 2
        },
        {
          "text": "Bought 4k VWRA for pass few days...will buy another 8k in the coming days....\n\nThe rest put into ssb....",
          "score": 2
        },
        {
          "text": "Just for my understanding, which sectors and companies give bonus in Feb/March? Usually I know a lot of companies give bonuses in December only right?",
          "score": 2
        },
        {
          "text": "How much first?",
          "score": 1
        }
      ]
    }
  ]
}