{
  "schema_version": "raw_scrape_v1",
  "report_id": "2026-02-01",
  "scraped_at": "2026-02-01T13:09:21.727390",
  "subreddits": [
    "singapore",
    "askSingapore",
    "SingaporeRaw",
    "singaporefi"
  ],
  "total_posts": 40,
  "total_comments": 712,
  "posts": [
    {
      "id": "t3_1qs6nd8",
      "subreddit": "singapore",
      "title": "A Hot Hideout mala chain co-founder, 26, diagnosed with stage 3 rare blood cancer",
      "url": "https://old.reddit.com/r/singapore/comments/1qs6nd8/a_hot_hideout_mala_chain_cofounder_26_diagnosed/",
      "score": 262,
      "num_comments": 15,
      "created_at": "2026-02-01T00:21:49",
      "selftext": "",
      "comments": [
        {
          "text": "26 wtf he’s younger than me. Terrible luck :(",
          "score": 118
        },
        {
          "text": "Hopefully he recovers",
          "score": 113
        },
        {
          "text": "Created one of the few successful Singaporean food chains in recent memory. Hope he gets better.",
          "score": 92
        },
        {
          "text": "Wahh Forbes list again. Seems like nothing good happens to people on those lists. Hope he make a full recovery",
          "score": 40
        },
        {
          "text": "What do u expect from Mothership? They got lazy and complacent ever since they started taking on govt sponsored posts.",
          "score": 25
        },
        {
          "text": "Dafuq is the article for? It literally paraphrases what he writes in his Instagram post.",
          "score": 20
        },
        {
          "text": "“Lee stated that his close friends know that he lost his younger brother to a similar disease. Hence, Lee has made it a point to live his life differently.” fuck man, insanely unfortunate. wish him and his family full health and fast recovery",
          "score": 19
        },
        {
          "text": "Man.  This hits hard.  26 is very young age to get cancer.",
          "score": 7
        },
        {
          "text": "This hot pot business could hold against HDL and 美人锅 Ntu student will remember the raydy bee hoon",
          "score": 5
        },
        {
          "text": "CONNECT THE DOTS",
          "score": 5
        },
        {
          "text": "He doesnt seem to need the insurance money, the business is good that he's able to double the number of outlets and revenue since opening Let's instead hope that there is a possibility of recovering from such a rare disease, yes?",
          "score": 5
        },
        {
          "text": "As a mum I can’t even imagine how his parents deal with this :(",
          "score": 4
        },
        {
          "text": "Very young only, hope he gets better cos he just rise succesfully recently",
          "score": 3
        },
        {
          "text": "hopefully got cancer insurance - huge payout will be helpful",
          "score": -16
        }
      ]
    },
    {
      "id": "t3_1qsjhox",
      "subreddit": "singapore",
      "title": "Water activities halted at 3 Sentosa beaches after crocodile sighting; search ongoing",
      "url": "https://old.reddit.com/r/singapore/comments/1qsjhox/water_activities_halted_at_3_sentosa_beaches/",
      "score": 171,
      "num_comments": 43,
      "created_at": "2026-02-01T08:38:59",
      "selftext": "",
      "comments": [
        {
          "text": "Nature is uhhhhh healing?",
          "score": 88
        },
        {
          "text": "Rather this type of news than halted due to oil spill",
          "score": 61
        },
        {
          "text": "That croc is going to get euthanised if it was caught. Previously there was a 3m long saltwater crocodile that was swimming near East Coast back in 2023 that was put down.",
          "score": 43
        },
        {
          "text": " Croc loki is here to save our timeline 11 more months for Avengers DoomsDay",
          "score": 33
        },
        {
          "text": "Run! Sentosa got buaya! 😉",
          "score": 18
        },
        {
          "text": "I took back my upvote so fast",
          "score": 18
        },
        {
          "text": "Knew something was up when you said Crocodylus Buayaris lol",
          "score": 16
        },
        {
          "text": "Hopefully it leaves sg waters",
          "score": 15
        },
        {
          "text": "For real, I've heard floridians calling gators \"swamp puppies\" or \"chicken of the swamp\" and are often percieved as food source and not danger (classic floridians) but you wouldn't hear australians calling crocs those",
          "score": 15
        },
        {
          "text": "Alligators =/ crocodiles. Crocs are bigger and way more aggressive.",
          "score": 14
        },
        {
          "text": "Then if somebody'a child gets bitten/eaten, pls dont change side and say croc should have been euthanised in the first place.",
          "score": 13
        },
        {
          "text": "The ones in Florida are very small creatures. An aggressive medium sized dog would be more scary than a Florida gator.",
          "score": 13
        },
        {
          "text": "Economy so bad Tony Stark need to take second job as supervillian.",
          "score": 11
        },
        {
          "text": "RIP crocodile.... Better luck next life 😢",
          "score": 6
        },
        {
          "text": "Tbf, crocs are much more dangerous than gators.",
          "score": 6
        },
        {
          "text": "Crocodile  He's waiting.",
          "score": 4
        },
        {
          "text": "🤣🤣🤣",
          "score": 3
        },
        {
          "text": "All crocodiles are dangeorus lol but yeah salties even more than fresh water ones",
          "score": 3
        },
        {
          "text": "Good",
          "score": 2
        },
        {
          "text": "They were on the beaches and now in the sea.",
          "score": 1
        },
        {
          "text": " The best Johto boy is here!",
          "score": 1
        },
        {
          "text": "Salties are dangerous.",
          "score": 1
        },
        {
          "text": "Probably escaped from one of those crocodile farms in our neighbouring countries and they just decided to diam diam.",
          "score": 0
        },
        {
          "text": "Then you have Florida where gators on golf courses and residential areas are just another Sunday",
          "score": -10
        },
        {
          "text": "give it BACK",
          "score": -16
        }
      ]
    },
    {
      "id": "t3_1qs1sek",
      "subreddit": "singapore",
      "title": "Video call scam targeting elderly",
      "url": "https://old.reddit.com/r/singapore/comments/1qs1sek/video_call_scam_targeting_elderly/",
      "score": 127,
      "num_comments": 15,
      "created_at": "2026-01-31T21:02:27",
      "selftext": "My 90-year-old mum just got a video call from someone in full police uniform with a Singapore flag backdrop. He claimed $2k was withdrawn from her account and got her to show her IC and bank card on camera. She nearly gave her password before getting suspicious. He hung up when she said she wanted to check with a neighbor first.\n\nPlease remind your elderly relatives or vulnerable family members.\n\nDisgusted scammers are preying on the elderly.",
      "comments": [
        {
          "text": "Said this multiple times. Scammers deserve death penalty. They completely lack any moral compass preying on elderly Singaporeans and cause similar or worse damage to society as drug traffickers.",
          "score": 76
        },
        {
          "text": "You may want to consider blocking anyone that is not in their contact list for seniors. This would minimise the risk by a lot.",
          "score": 49
        },
        {
          "text": "ScamShield brother",
          "score": 20
        },
        {
          "text": "The area gets grey when scam agencies kidnap and blackmail people into doing their bidding with no escape Nip the problem by the bud/educate the public and scams will reduce",
          "score": 19
        },
        {
          "text": "Will do that but she occasionally gets call from different healthcare providers.  Already locked up most of her funds in the bank before this happened.",
          "score": 16
        },
        {
          "text": "Since when the heck do cops give people a call when they commit a \"crime\"",
          "score": 12
        },
        {
          "text": "Yes there are some that are driven by fear but most of the people falling for scams are driven by greed themselves",
          "score": 10
        },
        {
          "text": "Totally agree, scamming is one of the worst crimes against humanity and should warrant capital punishment. Scammers take advantage of the kindness in people wanting to believe in the goodness of others, and then absolutely crush it. Being a victim of a scam can be extremely traumatising and I will never wish it upon my worst enemy. Be it an impersonation scam, or a pig butchering scam, scammers are spreading cynicism and making the world a darker place, where fewer people will take a chance on others. The impact ripples through the society as a whole whenever someone is scammed. In a world where trust is the most valuable currency, they are effectively doing the most harm to the world's economy and well-being. The lack of deterrence is concerning. “Please do not be cynical. I hate cynicism – it's my least favorite quality, and it doesn't lead anywhere. Nobody in life gets exactly what they thought they were going to get. But if you work really hard and you're kind, amazing things will happen.” - Conan O'Brien",
          "score": 6
        },
        {
          "text": "Being unlikely filters out the less gullible. And as added bonus help swindle the one that think themselves too smart when you target them in particular.",
          "score": 6
        },
        {
          "text": "Just don’t pick up unknown numbers",
          "score": 6
        },
        {
          "text": "Change the whatsapp settings to block unknown callers. Telegram is even better, you can totally block calls from people not in your contacts. Privacy -> Silence Unknown Callers",
          "score": 6
        },
        {
          "text": "Scamshield and block their phones from ringing when no contacts call",
          "score": 3
        },
        {
          "text": "got this kind of video call while was in the office before. we all had fun with the scammer after. on speaker mode. LOL we role played until we damn scare.",
          "score": 3
        },
        {
          "text": "Nah, if you got yourself into a scenario where you talk people into parting with decades of life savings?  It's on your own damn greed and willingness to take the easy way out. Sure, divulge the masterminds, then we can negotiate for a chance at redemption. You got in on the basis of your own bad decisions. This is the same spiel to dissuade execution of drug mules. Mercy to them is death to the righteous.",
          "score": -8
        }
      ]
    },
    {
      "id": "t3_1qrzbgd",
      "subreddit": "singapore",
      "title": "Woodlands Checkpoint officer dragged by motorist in ‘fuel gauge’ confrontation, Singapore court hears",
      "url": "https://old.reddit.com/r/singapore/comments/1qrzbgd/woodlands_checkpoint_officer_dragged_by_motorist/",
      "score": 87,
      "num_comments": 13,
      "created_at": "2026-01-31T18:51:19",
      "selftext": "",
      "comments": [
        {
          "text": "Ling, who is representing himself, was seen shaking his leg in the dock during the testimony. The dumb arse probably learnt nothing here from being so nonchalant.",
          "score": 45
        },
        {
          "text": "Regardless of what led to the confrontation, dragging an officer with a vehicle is extremely dangerous. Situations like this really show how quickly a routine dispute can escalate, especially at busy checkpoints. Hopefully the investigation clarifies the facts and everyone stays safe.",
          "score": 42
        },
        {
          "text": "Errr. The article is dated 10 Nov 2025. OP is kinda late",
          "score": 18
        },
        {
          "text": "Now is CNY peak season, so surely more rigorous check to prevent accident when they have to U turn, better don't try. This is one example it doesn't pay to try and get into big trouble.",
          "score": 13
        },
        {
          "text": "This!u/Annual_View3611might as well rename yourself to Late_View3611. 😛",
          "score": 13
        },
        {
          "text": "Should tie him by the hands to the back of TP bike then ride from pasir ris to tuas checkpoint.",
          "score": 12
        },
        {
          "text": "“Red hatchback”. Bet it has a spoiler",
          "score": 12
        },
        {
          "text": "Guy was convicted yesterday. Sentencing in March.https://www.channelnewsasia.com/singapore/steve-ling-drove-ica-officer-fuel-tank-5895966",
          "score": 5
        },
        {
          "text": "Checkpoint officer just doing his/her job. Dont have to do this & hurt other people. Actions have consequences!😠",
          "score": 3
        },
        {
          "text": "I was so sure I read this before. And yes, this news came out last year..",
          "score": 2
        },
        {
          "text": "Human trash. Because of $40 go and hurt people. Jail the cunt.",
          "score": 1
        },
        {
          "text": "Drivers like this really want officers to be like ICE; the moment you move your vehicle in the direction of the officer it justifies shooting the driver for assault with a deadly weapon?",
          "score": -7
        },
        {
          "text": "If not supposed enforce then what for such dumb rule. Let everyone break rule and pump petrol overseas and let taxpayers lose la",
          "score": -11
        }
      ]
    },
    {
      "id": "t3_1qskjvu",
      "subreddit": "singapore",
      "title": "Life after... finding out her father was hanged for drug trafficking when she was two",
      "url": "https://old.reddit.com/r/singapore/comments/1qskjvu/life_after_finding_out_her_father_was_hanged_for/",
      "score": 88,
      "num_comments": 10,
      "created_at": "2026-02-01T09:25:03",
      "selftext": "",
      "comments": [
        {
          "text": "I can only say it is a good thing that she only found out the full details when she was an adult, and the father was hanged when she was so young that she had no memory of it.\ni cannot imagine how a child would cope in school if classmates know her father was hanged. \nAs much as it is a sad story, I am still a supporter of the death sentence, having seen how drug addicts would do anything to get money to get drugs.",
          "score": 26
        },
        {
          "text": "Beautiful life of reconciliation on so many levels, so glad that there is a kinda happy ending to this beautifully reported story. Nearly teared reading on this Sunday morning",
          "score": 25
        },
        {
          "text": "This is quite a dumb comment. Considering the news about 2 teens ODing on meth just came out this week",
          "score": 14
        },
        {
          "text": "Small mercies.",
          "score": 2
        },
        {
          "text": "I've met her before in PFS. She is a very saintly person and has helped many families of prisoners. I didn't know anything about her family story until now.",
          "score": 0
        },
        {
          "text": "I hate drugs, but her father's fate, leaving behind a wife and young daughter to struggle through life, left me in tears. Glad she has found the truth and able to handle it in her adult years, and happy she has re-established a loving relationship with her mum. They both deserve better for the huge gap they have had to endure in their lives. Wishing Adeline all the best. Hope she continues to do good for society and God bless her and her mum always.",
          "score": 0
        },
        {
          "text": "Meth is very dangerous but cannabis is not. Virtually no one has died from cannabis anywhere in the world. More people have died from being executed for cannabis trafficking than they have died from taking cannabis. The death toll from taking cannabis in Singapore is zero.",
          "score": 0
        },
        {
          "text": "I'll be sure to tag you the next time there's a news about drugs destroying an innocent family.",
          "score": 0
        },
        {
          "text": "The real evil would have been letting this guy get away with smuggling 138g of heroin into the country. For context:\n- that would feed the addiction of 1600 drug abusers for a week based onCNB's estimates.\n-30mg of heroinis enough to kill you.",
          "score": 0
        },
        {
          "text": "The \"law\" has killed far more people than drugs, wonder which the real evil is...",
          "score": -30
        }
      ]
    },
    {
      "id": "t3_1qs39j1",
      "subreddit": "singapore",
      "title": "Pair of adjoining ground-floor HDB shops in Pasir Ris for sale at $11.68 mil",
      "url": "https://old.reddit.com/r/singapore/comments/1qs39j1/pair_of_adjoining_groundfloor_hdb_shops_in_pasir/",
      "score": 74,
      "num_comments": 19,
      "created_at": "2026-01-31T22:07:22",
      "selftext": "the property has a remaining tenure of 63 years and is available for sale with the existing tenancies.\n\nHe adds that the property will benefit from its proximity to the upcoming Pasir Ris MRT Station on the Cross Island Line, which is targeted to be completed in 2030. “Investors can expect sustained footfall and strong tenant demand, making this a defensive yet growth-oriented investment.”\n\nAs commercial properties, foreigners and corporate entities are eligible to purchase the shophouses, and no Additional Buyer’s Stamp Duty (ABSD) will be imposed.",
      "comments": [
        {
          "text": "As commercial properties, foreigners and corporate entities are eligible to purchase the shophouses, and no Additional Buyer's Stamp Duty (ABSD) will be imposed. I've always considered it wrong for HDB commercial properties to be sold to foreigners.",
          "score": 130
        },
        {
          "text": "Hdb commercial properties should be rented/leased. They are lazy.",
          "score": 29
        },
        {
          "text": "Noted. Can post property ad like that on Reddit?",
          "score": 22
        },
        {
          "text": "In before someone comment rental does not contribute to inflation bla bla bla. Notice exisiting rental is 7k plus, will likely hike to 10-12k to make up for it. HDB should really relook at these shophouse and do something about it.",
          "score": 20
        },
        {
          "text": "Can the purchaser even make back any money on their investment? $7,725 per month per shop would only break even, not even taking into account any manpower and supplies cost.",
          "score": 19
        },
        {
          "text": "“Here I come!!” shouts Mixue.",
          "score": 13
        },
        {
          "text": "I believe this was an old scheme many years ago. Now all newer commercial properties have to be rented. Similar issue at clementi where residents complained about the row of shady massage parlours. It's probably easier for them to let all the leases expire than to buy them back.",
          "score": 9
        },
        {
          "text": "Trickle down economy okay...",
          "score": 7
        },
        {
          "text": "Issue is there’s a lot of illegal subleasing of food store and HDB shophouse that’s happening and govt isn’t doing much. https://www.reddit.com/r/singapore/s/LlMakJDuli",
          "score": 4
        },
        {
          "text": "Used to be UOB",
          "score": 4
        },
        {
          "text": "Laundering",
          "score": 3
        },
        {
          "text": "Rising cost of living is a world issue, they said...",
          "score": 3
        },
        {
          "text": "Imagine a mixue under the block",
          "score": 3
        },
        {
          "text": "As commercial properties, foreigners and corporate entities are eligible to purchase the shophouses, and no Additional Buyer's Stamp Duty (ABSD) will be imposed. ARE YOU READY FOR ANOTHER MIXUE AND MALA SHOP?",
          "score": 3
        },
        {
          "text": "The economics of this price point just doesn't make sense. Wouldn't the opportunity cost be too high? Unless these 2 tenants could yield a net profit of more than 1.5 million annually, how is this an efficient deployment of capital compared to liquid index funds?",
          "score": 2
        },
        {
          "text": "The issue is that by allowing foreigners to buy HDB shop spaces, you drive up the property price and the rental cost because the new owners will want to have a fair return on their investments. The businesses that lease these shop spaces will then have to pass the high rental cost to the consumer. This is terrible for controlling the cost of living in the HDB heartland, especially in the mature estates where these shop spaces are found.",
          "score": 1
        },
        {
          "text": "Just be happy more Mala or aesthetic clinics for you ok",
          "score": 1
        },
        {
          "text": "I live in that area, didn't it just recently renovated into the shop it currently is last year? And it's already on sale?",
          "score": 1
        },
        {
          "text": "Ok.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qru2rz",
      "subreddit": "singapore",
      "title": "Anyone knows any places/websites in SG to donate old kpop CDs and posters?",
      "url": "https://old.reddit.com/r/singapore/comments/1qru2rz/anyone_knows_any_placeswebsites_in_sg_to_donate/",
      "score": 72,
      "num_comments": 23,
      "created_at": "2026-01-31T13:46:21",
      "selftext": "I must declutter this a ton of posters and CDs from a niche Kpop rock band called CNBLUE. Most of these are unopened and in mint condition. Anyone knows any Kpop interest groups who would appreciate taking these for free, or specific places/people in SG who collect these music paraphernalia? Thanks for any advice!!",
      "comments": [
        {
          "text": "Carousell give away free",
          "score": 100
        },
        {
          "text": "coming from a love live fan LMAOOO the call is coming from inside the house",
          "score": 54
        },
        {
          "text": "They're not thaaat niche 😂 I did the same for my fti and cnblue stuff on Carousell",
          "score": 41
        },
        {
          "text": "This is a very mean thing to say. Just because you don't like it doesn't mean nobody will. Looking at your profile, do you think you will be happy if I told you to go and burn and crush your anime figurines? If not, then why are you making a comment nobody wants to hear? Stop being so miserable and be kinder to others if you want it reciprocated.",
          "score": 37
        },
        {
          "text": "huh but your account is all love live merch 🤨 u burn and crush lo",
          "score": 19
        },
        {
          "text": "Carousell. I’m sure someone who loves CNBLUE would appreciate this :)",
          "score": 13
        },
        {
          "text": "Did you feel better about yourself leaving this comment? A bit rich hor considering your own account history",
          "score": 12
        },
        {
          "text": "Thanks this seems to be the main suggestion i’ll get to it",
          "score": 10
        },
        {
          "text": "You can try telegram groups, there should be cnblue group, or other K-pop related groups. I’ve seen people giving free or selling old albums as $1-10 and it got sold.",
          "score": 10
        },
        {
          "text": "Oh i wanted snsd fx or bigbang",
          "score": 10
        },
        {
          "text": "olio app",
          "score": 9
        },
        {
          "text": "I have some snsd merch if you'd like!",
          "score": 8
        },
        {
          "text": "Yeah CN blue was around since 2010/2011.",
          "score": 7
        },
        {
          "text": "Carousell is your best bet for 2nd gen merch, you can attempt to sell them or just do free giveaway. Otherwise it's tele groups but tele groups are generally more for GOs and 4th/5th gen groups",
          "score": 2
        },
        {
          "text": "Really",
          "score": 1
        },
        {
          "text": "Omg give to me pls 😭😭",
          "score": 0
        },
        {
          "text": "CN Blue was around when music was distributed via CDs?",
          "score": -22
        },
        {
          "text": "Blue bin",
          "score": -27
        },
        {
          "text": "Burn and crush lah. kns this garbage",
          "score": -91
        }
      ]
    },
    {
      "id": "t3_1qrxqyy",
      "subreddit": "singapore",
      "title": "Bangkok Post - Singapore a transit point for UK-bound cannabis from Samui",
      "url": "https://old.reddit.com/r/singapore/comments/1qrxqyy/bangkok_post_singapore_a_transit_point_for/",
      "score": 71,
      "num_comments": 12,
      "created_at": "2026-01-31T17:18:06",
      "selftext": "",
      "comments": [
        {
          "text": "“Border Security: Australia's Front Line” mentiob Singapore  is a high risk country for drugs and fresh produce smuggling into Australia therefore they pay more attention to flights from Singapore. Won’t be surprise if UK flag Singapore flights for more check if they share similar sentiment as Australia.",
          "score": 30
        },
        {
          "text": "Yes. Because the smuggler still brought it to Singapore land",
          "score": 29
        },
        {
          "text": "Of all countries they choose to transit through, they choose SG. But I guess it's because on the UK side, they won't check incoming SG flights so thoroughly for drugs.",
          "score": 25
        },
        {
          "text": "We literally had a case of drugs being trafficked to Austrailia from a transit flights from Singapore",
          "score": 25
        },
        {
          "text": "I mean, Singapore was used as a transit point for drugs. The authorities had intercepted cases before. In April 2025, CNB received information concerning freight parcels suspected of carrying controlled drugs. The parcels, transiting through Singapore, were believed to have originated from the US and were bound for New Zealand. https://www.channelnewsasia.com/singapore/cnb-drug-trafficking-syndicate-10kg-meth-seized-5361121 Based on preliminary investigations, the authorities found that the drugs were transiting through Singapore to another country. Investigations are ongoing. https://www.asiaone.com/singapore/over-500kg-cannabis-reportedly-transit-seized-pasir-panjang-scanning-station",
          "score": 23
        },
        {
          "text": "In a transit case, if caught, is the smuggler still liable and punishable under Singapore law?",
          "score": 18
        },
        {
          "text": "Pics or it didn’t happen.",
          "score": 18
        },
        {
          "text": "Now imagine if we don't have strict laws and enforcment. We are a transport hub, this is bound to happen, just to what extent",
          "score": 17
        },
        {
          "text": "Yes. Remember the case of Van Tuong Nguyen? He was arrested in transit to Australia from Cambodia. I remember a very questionable defense was that he was \"only in transit, therefore he was not in Singapore\". The problem is that transit is not extraterritoriality, if it was, then anyone can kill someone in a transit lounge and no one can do anything. It's a myth, like \"you cross a border and they can't arrest you\". No, you'll get arrested by the other side and sent back. These days, there is really no such thing as areas without government control.",
          "score": 13
        },
        {
          "text": "And I wonder how much drugs have went AROUND Singapore just to avoid the law. That can be a metric to measure effectiveness.",
          "score": 6
        },
        {
          "text": "Eh… it’s actually because of the strict laws that Singapore is now an active port for drug traffickers looking to transit their products to other countries. Nobody was going to look at a flight from Singapore as a potential risk.",
          "score": 5
        },
        {
          "text": "If singapore has strict laws against drugs, even importing drugs, why are they're using it as a \"port\" even though importing drugs is a capital offense?",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1qs5hqp",
      "subreddit": "singapore",
      "title": "Fantasy meets whimsy at medieval-themed renaissance fair Ren Faire SG",
      "url": "https://old.reddit.com/r/singapore/comments/1qs5hqp/fantasy_meets_whimsy_at_medievalthemed/",
      "score": 69,
      "num_comments": 10,
      "created_at": "2026-01-31T23:37:29",
      "selftext": "",
      "comments": [
        {
          "text": "That is something new...",
          "score": 17
        },
        {
          "text": "Was there yesterday and it was really fun! Weather got quite windy at times so it was not too bad to be in costume. The vibe was really there and the crowd was surprisingly not too bad, I still had pockets of space to walk around and chill. Saw a lot of people brought their picnic mats to sit around and watch the performances. Would be better if there were more finger food+drink vendors though; i ran out of water halfway through the event and i didnt see any drink stalls except for one selling espresso. Oh and better signages; I queued for almost 30 mins before finding out i bought the express queue tickets but there weren't any signage indicating where the express queue is.",
          "score": 17
        },
        {
          "text": "Props to those that dress up especially leather and armour ",
          "score": 14
        },
        {
          "text": "Quite impressed indeed, especially with our weather.",
          "score": 10
        },
        {
          "text": "there weren't any signage indicating where the express queue is I reached there around 2.45pm and they started sending staff out to ask people if they are express queue ticket holders. Though the queue was super long by then that a lot of people might not see the staff in charge of asking. The vibe and crowd was really nice though and it's kind of amusing that they have people dressed as rats putting 'plague' stamps on people for things like eating popsicles and so on. Sadly, a lot of stuff like the popsicle and sword props were sold out pretty quickly since the vendors weren't expecting such a big turnout.",
          "score": 8
        },
        {
          "text": "Almost 5000 tickets sold on the first day, and the organiser was hoping for 6000 to 8000 tickets sold over 2 days. Seems like the turnout is pretty good!",
          "score": 6
        },
        {
          "text": "Fair enough.",
          "score": 5
        },
        {
          "text": "Yeah, sword props were gone by 3.30pm (vendor only had 20 or so coz he didn't think it would be popular). Most of the popsicles were gone around 4.15pm so you might have missed the last few.",
          "score": 5
        },
        {
          "text": "Oh no wonder we didnt see any popsicles/sword props, my boyf wanted to see the sword props but we only reached around 430pm (wanted to avoid the sun...) so I guess it was sold out by the time we got in.",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1qsndxi",
      "subreddit": "singapore",
      "title": "Lift contractor allegedly insults Jurong resident who complained about lift, calls him 'bastard' & 'c*ck'",
      "url": "https://old.reddit.com/r/singapore/comments/1qsndxi/lift_contractor_allegedly_insults_jurong_resident/",
      "score": 66,
      "num_comments": 23,
      "created_at": "2026-02-01T11:34:06",
      "selftext": "",
      "comments": [
        {
          "text": "“Koh said her father joined them personally \"in good faith\" to assist them in identifying the source of the problem. During the appointment, the elder Koh provided suggestions to the team on how to rectify the lift issue, including a solution he said would cost about S$1,000.” Lol why do I have an inkling on how the convo probably went? Also, why is this news lmao",
          "score": 50
        },
        {
          "text": "A “cuck”? Or a “cock”?",
          "score": 17
        },
        {
          "text": "How are these contractors chosen anyway? Lowest bidder?",
          "score": 9
        },
        {
          "text": "I would be taking the stairs if I were the elder. Lift could kena sabo by that imbecile.",
          "score": 7
        },
        {
          "text": " The lift contractor must be James May /s",
          "score": 6
        },
        {
          "text": "elder Koh call the TC 8x?\nwhy TF do you need to call 8x.",
          "score": 6
        },
        {
          "text": "More like Clarkson with the ego, James would at least listen to feedbacks and would find a solution to the problem.",
          "score": 2
        },
        {
          "text": "Exactly my question",
          "score": 0
        },
        {
          "text": "Could go either way",
          "score": 0
        },
        {
          "text": "Don't think Sinkie older gen use \"cuck\", especially in everyday insults",
          "score": 0
        },
        {
          "text": "Yes but it would add an interesting new spin on the sorry, wouldn’t it",
          "score": 0
        },
        {
          "text": "Why be a smart aleck and tell the contractor how to do his job just because you're a former engineer. 🤣Contractor should also think of him as a lonely old man trying to relive his heydays and just let it go.",
          "score": 0
        },
        {
          "text": "How do we know he is a former engineer anyway? Seems like he is now working as a cleaner. So some rando cleaner comes up to me and tells me he has experience with my work and I must listen to him? I'd do the same as the contractor and tell him to fuck off.",
          "score": 0
        },
        {
          "text": "unfortunately, yes. low price wins out almost every time despite panels say otherwise",
          "score": 0
        },
        {
          "text": "Of course the winner will be the lowest bidder. Definitely not by spinning the lucky draw wheel.",
          "score": 0
        },
        {
          "text": "The elder Koh repeatedly replied that he was a qualified engineer. Erm so? There are so many types of PEs out there specializing in vastly different sectors. Main thing is are u the QP who signed off on the construction / design of these lifts? You give advice just based on sound alone, but do u know lifts can make all sorts of weird, harmless noises that don't affect its operations? Moreever u didn't look at the drawings nor could u have went into the lift shafts to investigate. Like that can anyhow teach people how to do their job? if the technicians really follow and the lifts plummets 12th storeys down w people inside, will u, the \"Qualified Engineer\" come out to bear responsibility? Stay in your lane la. Report 8 times already shown how overly zealous u are, unc",
          "score": 0
        },
        {
          "text": "Lucky number.",
          "score": 0
        },
        {
          "text": "Because certain areas in Jurong West are just like our MRT, the lift malfunctions half of the week and are always under maintenance or not working.",
          "score": 0
        },
        {
          "text": "So this cleaner goes around harassing lift technicians who are doing their job while claiming to be a former engineer? Got check if he is a siao lang or not?",
          "score": 0
        },
        {
          "text": "When you send in complaints and then start nagging and bossing at the service people correcting the problem … what do u expect?  LMAO well deserved… should just shaddap n let them do their job",
          "score": 0
        },
        {
          "text": "The real kock is elder Koh LOLOL step what smart",
          "score": 0
        },
        {
          "text": "Ah the male ego. How I wish elder Koh was staying in my block. I’m sure he has some stories to share and maybe I could learn something. As for the lowly tech, zip up, your ego is showing.",
          "score": -12
        }
      ]
    },
    {
      "id": "t3_1qs0kc9",
      "subreddit": "askSingapore",
      "title": "Will we ever have a local brand that Singaporeans stand behind?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qs0kc9/will_we_ever_have_a_local_brand_that_singaporeans/",
      "score": 225,
      "num_comments": 197,
      "created_at": "2026-01-31T20:00:52",
      "selftext": "I was thinking about how brands like Jollibee are so closely tied to Filipinos and a source of national pride that when it gets criticized(I believe there was a viral video from Benny blanco a couple of years ago where he criticized the food and basically Filipinos all rallied and descended against him). I guess you can say the same for Din Tai fung and Taiwan/taiwanese as well. Will Singaporeans ever have something that maybe not even all, but at least most Singaporeans are proud of?\n\nSIA is probably the biggest international name but Singaporeans openly criticize it for the current high prices and 'drop in standards'. I'm guessing something in the luxury segment like SIA is, will struggle to capture the mass population of singapore\n\nFood wise I can only think of Ya Kun and Tiger beer, but I don't think neither brand really leans into national pride and I also often see people ranting about how much the price of ya kun has gone up.\n\nOn the flip side, whenever there are new local business that start up, I often see comments like 'confirm close after a year'. Is this overall just a sinkie pwn sinkie mentality that prevents local brands from thriving and becoming something that most locals can be proud of?",
      "comments": [
        {
          "text": "Haven't kept up with them much but the old Creative was definitely SG pride back in the days",
          "score": 503
        },
        {
          "text": "I just got a pair of creative earbuds. Won’t lie I chose them because of Singapore pride.",
          "score": 91
        },
        {
          "text": "I mean nowadays their audio devices are still pretty good.. the only thing is that they lost their dominance in their best area (sound cards ,because most or if not all computers come with some sort of integrated sound card)",
          "score": 39
        },
        {
          "text": "Sim Wong Hoo was a real one, he held some charity drive thing that allowed us to buy cheap stuff, and his Creative soundblaster was damn good.",
          "score": 28
        },
        {
          "text": "Same. Got the Zen Air. Great value for the price paid",
          "score": 21
        },
        {
          "text": "The Aurvana series earbuds are all great. Zen earbuds are great too for the price. Katana soundbar remains best in class (but expensive). The only disappointment I had was their SXFI Gaming headsets. Their old X series gaming headsets imo outperform the usual big brands (Logi, Razer, HyperX) of the same price point.",
          "score": 20
        },
        {
          "text": "Yup. Their Pebble speakers is damn solid. Using one for 2 years now with zero issues.",
          "score": 19
        },
        {
          "text": "I need my MP3 back",
          "score": 12
        },
        {
          "text": "Yeah, I used to rock the Creative Nomad and then the Muvo as daily drivers. Man. Back when 128mb of storage was considered premium. And choosing a sound card used to be a big decision because you'd want as many good-sounding MIDI instruments as possible and enough 3.5mm ports for surround sound. And then Creative pioneered the soundcard breakout box with a physical volume dial that could sit next to the keyboard and some of the first affordable DACs with 1/4\" out so studio monitors could be properly used with PCs... How we take all of these for granted now! Creative used to also host and sponsor a local eSports tournament before Starhub brought cable to homes. Quake 3, CS, Tribes, maybe also 3 Corridors (the DOTA predecessor) but don't quote me on that. I still use Aurvana Ace 2 earpods as a backup!",
          "score": 10
        },
        {
          "text": "Same. Recently got the Creative Aurvana Ace 3.",
          "score": 9
        },
        {
          "text": "I have been using creative speakers for the last 15+ years. I like audio quality and value for money. Gotta say the life span of these products is dropping lately. My previous 2.1 speakers lasted me over 10 years. Next pair of 2.0 speakers barely lasted me a few years. Still stuck with their 2.0 speakers because I like the audio quality for a 2.0 speaker but new new pair has already started giving me issues. Also, the buds I bought had great audio quality but would keep losing connection to my phone while it was in my pocket. Switched back to Samsung eventually.",
          "score": 8
        },
        {
          "text": "I will choose Creative over Logitech for entry to mid level products. IMO Creative still have its moat.",
          "score": 8
        },
        {
          "text": "I remember the guy playing on the digital keyboard and he killed it. But even then I think it was a surprise to learn that creative was Singaporean, I don't really think they flew that flag as part of their branding",
          "score": 7
        },
        {
          "text": "I was in a bar in Melbourne and spotted someone wearing a Creative Tshirt. Went to to talk to them and they gave me a history lesson on Creative. Never felt so humbled at how a foreigner was more interested in a local brand than I was as a Singaporean.",
          "score": 5
        },
        {
          "text": "Creative is still my go-to every time I need pc speakers or earbuds.  They've scaled down their pc gaming stuff. If not, I'd get those from them too.",
          "score": 4
        },
        {
          "text": "fr",
          "score": 3
        },
        {
          "text": "I actually need one lol, it has sub out and the sound from it is not bad from what I hear",
          "score": 2
        },
        {
          "text": "maybe fiio or moondrop?",
          "score": 2
        },
        {
          "text": "pretty happy with my Zen Hybrid 2",
          "score": 2
        },
        {
          "text": "Nope, back in the day so many were dissing the Zen line against the iPods.",
          "score": 2
        },
        {
          "text": "I’m still using a Creative Amp. Soundblaster X3. Served me really well so far.",
          "score": 2
        },
        {
          "text": "same!! i’m using creative katana speakers the first version for the past 10 years and no signs of defects at all. considering upgrading simply because it’s 10 years alr and sound would probably be so much better. when i think of local pride brand, creative always comes to mind first.",
          "score": 1
        },
        {
          "text": "Yes I mean the sound cards nowadays are quite good but they’re targeted mainly at enthusiasts",
          "score": 1
        },
        {
          "text": "Your comment has been automatically removed because your account is relatively new or you have negative karma. I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns.",
          "score": 1
        },
        {
          "text": "Yup! Kept supporting (except the big ticket items) till Mr Sim said good bye…..;(",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qrxcr4",
      "subreddit": "askSingapore",
      "title": "Children misbehaving in public",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qrxcr4/children_misbehaving_in_public/",
      "score": 120,
      "num_comments": 41,
      "created_at": "2026-01-31T16:53:54",
      "selftext": "I'm here from America with my family for work for a few months, including 2 children under 5. The move has disrupted their routines and they have thrown the biggest tantrums I have ever seen almost on a daily basis since we arrived a few weeks ago. This is not how they behaved back in the states. Most of the time it is at home, but sometimes one will suddenly have a nuclear meltdown on the train platform or out to eat. Then I have to get them home as quickly as possible while they are screaming at the top of their lungs the whole way.\n\nFirst of all, I'm really sorry for this.\n\nSecondly, I really want to know how people navigate issues like this when you are constantly surrounded by people that have to suffer from your kid's outbursts. We've mostly gotten sympathetic smiles or at worst confused glances, but it is so embarrassing that I don't want to take my kids out anywhere to experience your amazing country.",
      "comments": [
        {
          "text": "Let them stay at home and acclimatise first. Take baby steps out, go somewhere near. If they are comfortable then go somewhere further. Go by taxi if buses/trains are too overstimulating",
          "score": 132
        },
        {
          "text": "Could they be overstimulated? Too much unfamiliar and unrecognised sights and sounds could do that.",
          "score": 72
        },
        {
          "text": "Try avoiding crowds and go to places during \"off-peak\" times. Avoid going out on weekends for a start, unless you know of some secret spots away from civilization. There are many parks and playgrounds in Singapore and they are incredibly quiet and empty during office hours on weekdays. The heartlands are a good refuge from the throngs of tourists. The malls are quiet and people generally friendlier. The eateries there are more chill and would tolerate kids melting down more so than downtown. The key is to go during off-peak hours. Slowly ease them in to the dense urban environment. Kids are adaptable and I'm sure they'll be fine after a few trying months. Good luck and welcome to the island. Tldr - find the right time and right place to avoid crowds",
          "score": 34
        },
        {
          "text": "It’s fine no need to apologise. Similar to adults, children need to adapt. You may feel uncomfortable but most sgpreans are actually very understanding n emphatic. Make time to bring them to places eg playgrounds or gardens they enjoy or children centric places eg. Jacob’s ballast children playground, Google ‘free outdoor children playground in Singapore, walk along the Mandai boardwalk and hang around with the animals it’s free… you may be stress as well so just go out have fun with your love ones n touch some grass",
          "score": 30
        },
        {
          "text": "this is right, don't be in a rush to get out of the house just because it feels better for you. it's easy to be overstimulated for kids in a crowded city. if they miss a nap, even worse.",
          "score": 28
        },
        {
          "text": "Yes if it's too many steps for them to catch up with mentally, go back to the basics and add one step at a time. \"I hear there are cool double decker buses here. I wanna go ride in one and sit upstairs. Wanna come?\" \"They use cool tap cards here to pay for buses! You guys want to try tapping the cards?\" Etc. etc.",
          "score": 25
        },
        {
          "text": "Almost certainly. But how do you get them to not be overstimulated other than keeping them cooped up at home forever? We are trying to establish dependable routines and familiar sights, tastes, etc. They have fun when we go out, but it goes from fun to the end of the world suddenly and unpredictably. My question isn't really about getting them to stop having tantrums (although that would be great) because we are doing what we can on that front. It is just that we have never had to navigate the messy part of being parents in such a visible stage before. Maybe I'm looking for solidarity or for someone to tell me I can't go out until we get their behavior under control.",
          "score": 20
        },
        {
          "text": "Usually people would be more sympathetic if they see that the parents are genuinely trying to console their children. Some parents don't care and will ignore their screaming children while scrolling their phones. So I'd say you're already doing better than most. And like everyone said, give your kids time to acclimate. They're not used to the new sights, sounds and the crowds. Try and stay close to home for the time being, so if they get upset by anything, you can bring them back to let them calm down in a familiar environment. If you need to take public transport, than do short distance trips first. Like 2-3 stops, which would be around a 10 minute train ride. Enough to get them slowly familiar with riding the train and it's a short enough trip that they won't get too overstimulated. Also bring them to more outdoor places, like parks and gardens. It'll be quieter and less crowded than a shopping mall. Plus most parks have a playground area so they can burn off energy and distract themselves with playing. Basically don't rush the process. Instead of doing full day trips with cranky children, do a shorter outing in the morning, go home to rest and nap in the afternoon (so you also avoid the worse of this heat), and then spend the evenings somewhere nearby. A few months is more than enough to experience what Singapore has to offer. So don't fret it.",
          "score": 17
        },
        {
          "text": "simply, stay home more and cut the sightseeing until a routine is established with a window of time everyday? not sure exactly how old they are but could well be overstimulation and over-tiredness. both combined can cause nuclear meltdowns especially in younger kids.",
          "score": 17
        },
        {
          "text": "Even I'm overstimulated when I go to malls. Visit some parks and playgrounds first. We have plenty of them. Just search \"best playgrounds in Singapore\" and check out the free outdoor ones. As a parent, I fully understand. People may purposely ignore you because this is how we try to make you less embarrassed. Some people may give you nasty looks - it's the same everywhere, just ignore them. I feel you. I've been there.",
          "score": 11
        },
        {
          "text": "Firstly don’t be embarrassed about youngster meltdowns they happen and everyone understands even though it’s difficult in the moment. \nSecondly the idea of taxis or grab is good. Maybe gradually extend time of outings etc and don’t go too far from home.\nThirdly figure out something they’d love and give them a choice. Family pass to the zoo is great and it’s all outside so you can exhaust them in a healthy way😂",
          "score": 10
        },
        {
          "text": "Have you tried visiting some of the playgrounds around where you stay / getting in some park time to help expand some of that energy? It also has the benefit of helping them get used to their neighbourhood / helping them establish some safe spaces where you can bring them out and also not feel pressured if / when they throw a tantrum. Start with baby steps: getting them used to the surrounding neighbourhood first, then once they're comfortable, going to more and more different places. My kids thrive on a routine, so we have park / playground time every evening and that helps with them staying regulated. Good luck!!",
          "score": 9
        },
        {
          "text": "It's important to establish a routine for young children. Limit outings to day time & keep it short. Children get crabby in hot weather & new environment. They can't articulate as well as adults & can't even understand why they are feeling this way, hence the tantrums. Be patient with yourself & them. Have a great time in SG. Keep cool! And try & put them in bed about same time.",
          "score": 8
        },
        {
          "text": "As an onlooker, (try to) stop caring about what other people think and just focus on helping your children regulate. My children all have special needs and when they were younger our situation was very much like this and my anxiety about upsetting others in public controlled the way I treated my children, and created so much unnecessary stress for myself as well them.",
          "score": 7
        },
        {
          "text": "err as long u dont bring them into crowded trains on peak hour weekends or weekdays and do nothing while your kids having their tantrums shouting at the top of their lungs and kicking other passengers..",
          "score": 7
        },
        {
          "text": "Most people are sensible to see if the parents are trying or not. Most understand it may be difficult but some parents don't care. That's an issue. Note the difference between the parent tell the kid off that you cry also no use vs those that just carry on their doom scrolling.",
          "score": 7
        },
        {
          "text": "where are you staying? in the heartlands or the near cbd? most neighbourhoods have quiet spaces like neighbourhood parks, if you are living in a newer estate, playgrounds are also a good way to exhaust all that energy. also, take the cabs instead of public transport, i hardly ever take my girl out on trains because of the crowd and some bus drivers are not kind to us because of strollers.",
          "score": 6
        },
        {
          "text": "They are tired and don’t like crowds. Eat at home instead.",
          "score": 6
        },
        {
          "text": "Yeaps. Pick options that allow you to keep the situation contained (avoid crowded places). Take the taxi instead of public transport - gives you less stressed since it is more private. Go to parks or outdoor playgrounds where sound is less contained. I will also opt for places closer to home so we can always activate plan B to head home if it gets too much (for the kids or adults alike).",
          "score": 5
        },
        {
          "text": "It happens to every parent. We understand.",
          "score": 5
        },
        {
          "text": "No need to apologize or be embarrassed. Young local parent here, have personally gone through similar or more severe meltdowns. The bare minimum is to keep the children away from physically disturbing others, try to limit the boundaries of the child's tantrums to around your personal space as much as possible. They'll look and stare, but most of the time, one or two will try to help with a smile or a wave to the child. You can't lock yourself and the children at home, you need to be reasonable to yourself as well. Having said that, you also need to put in the work to acclimate your child as much as possible. You're a parent after all.",
          "score": 5
        },
        {
          "text": "Right, if the parents at least try to manage their kids’ behaviour I would still be understanding. But most of the time those parents just leave their children be, annoying the shit out of people. I’ve had kids running around my table in a restaurant setting and the parents clearly dgaf on how loud and rampant their kids are.",
          "score": 5
        },
        {
          "text": "Please don’t be embarrassed of your children misbehaving, as we understand how difficult it is to be one. Your children can sense you are ashamed of them, so that might add to their frustration. They are having difficulty coping with the new environment. It would help if you could help them to identify their emotions, for example, asking them if they are frustrated, angry, sad, and sit with their emotions, acknowledging it. You can also pat their backs, sing to them gently or hug them, holding them close to see if it comforts them. Children’s prefrontal cortex are unlikely to be developed so they don’t have the logical part of their brains developed, as an adult, we help them to cope. Wishing you all the best in your parenting journey, and a lovely welcome to Singapore! Hope you meet nice people here!",
          "score": 4
        },
        {
          "text": "Patience and love. Explanation of reward system and keeping them engaged. Gentle parenting is hard. A misguided child growing to be a menace will be even harder. More communication between the adults will benefit the children…after all we are products of our environment. Keep at it.",
          "score": 3
        },
        {
          "text": "Tantrums usually happen when the kids are hungry or tired. Try to pre-empt these types of scenarios. The crowded situation on public tpt/public places would also contribute to the kids’ stress levels. And the humidity+heat is also a big factor for them to adjust to. Like the other parent-commenters suggested, do shorter trips. Bring them home to nap (if they are unable to nap in the stroller). Under-5s are really young and have short sleep/eat cycles. Some non-sugar snacks on hand may delay the meltdowns but just don’t push the hunger/tiredness limit. Have had to carry out the screaming toddler to a calmer zone a few times until i noticed this pattern.",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1qs1ijt",
      "subreddit": "askSingapore",
      "title": "Is NRIC presentation such a big thing in schools now?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qs1ijt/is_nric_presentation_such_a_big_thing_in_schools/",
      "score": 99,
      "num_comments": 47,
      "created_at": "2026-01-31T20:49:19",
      "selftext": "Asking as an uncle who just spoke to the kids of some cousins who got their NRICs this month. Turns out that for all of them, it is now a full ceremony done in the school hall with a speech from the principal about the value of their citizenship blablabla followed by each of them going up on stage individually to get their ICs which were enclosed in a folder plus decorated envelope.\n\nMakes me feel old considering how mine was all of us waiting in the parade square, in multiple haphazard lines with the school’s admin staff seated at the head of each line calling us by name, passing our respective ICs to us then being told to f*** off right after.\n\nWhat’s your experience?",
      "comments": [
        {
          "text": "They have a presentation now?? I just remember getting mine in an envelope and going straight to class for my next lesson after that hahahah haish",
          "score": 118
        },
        {
          "text": "Been a few decades so not much detail in my memories. We lined up and collected our NRICs in the school hall, like collecting exam results.",
          "score": 56
        },
        {
          "text": "wtf is nric presentationnnn",
          "score": 45
        },
        {
          "text": "for all of them You left out one information: Which schools?",
          "score": 26
        },
        {
          "text": "I dun rmb such thing, thot collect at ICA",
          "score": 25
        },
        {
          "text": "I don't think all. My girl in neighbourhood school got hers last year. The form teachers distributed in class.",
          "score": 15
        },
        {
          "text": "Glorified ceremony for nothing. I get that we should take pride in being Singaporean but this level of wayang and conditioning abit over the top. Really need to wayang until like this?",
          "score": 14
        },
        {
          "text": "Should be across most schools. Was in a neighborhood secondary school. Have NRIC presentation as well. Still remember teacher asking to cover the NRIC number when taking photo.",
          "score": 13
        },
        {
          "text": "everybody registers for their first physical pink IC card at sec 3. So alot of schools make it like somewhat of an elaborate ceremony when they give it to you because it's meant to symbolise a new stage of life.",
          "score": 13
        },
        {
          "text": "mine was done in class they follow by index numbers",
          "score": 8
        },
        {
          "text": "Kid, once upon a time even nric was a shitty piece of paper.",
          "score": 7
        },
        {
          "text": "24 years ago, we were told to collect by birth month at the general office🤣🤣🤣",
          "score": 7
        },
        {
          "text": "You think that's old? My time still have to go to ICA on Saturday or school holidays to apply.",
          "score": 4
        },
        {
          "text": "huh really ah?, mine one was js distributed in class, no fancy envelops no nothing, js the card itself, this was in 2021",
          "score": 4
        },
        {
          "text": "Same. I also went collect ICA.",
          "score": 3
        },
        {
          "text": "Eh, wasn't the laminated cardboard the bus pass? I remember getting that in P3 and it definitely bigger than regular cards. But IC was definitely in P6 my time.",
          "score": 3
        },
        {
          "text": "The government are spooked that Singaporeans are losing the pride which we used to have, so they start conditioning the young.",
          "score": 3
        },
        {
          "text": "20 years ago, i think i just collected from the school general office lol",
          "score": 3
        },
        {
          "text": "Ceremony now? Was distributed in the class like text book!",
          "score": 3
        },
        {
          "text": "I collect outside my sch office and fk off alr where got time for this rubbish",
          "score": 3
        },
        {
          "text": "How do you guys apply for nric now? Last time when turn 15 had to go ICA etc. And if everyone have different birthdays then how do they give out?",
          "score": 3
        },
        {
          "text": "I think that was up till '96?  I was in P6 in 1996 and got mine then. My 1yr younger brother got his in Sec 3.",
          "score": 2
        },
        {
          "text": "I recall used to be in primary school",
          "score": 1
        },
        {
          "text": "i dun even rmb how i got my ic prolly just teacher get envelop and pass down everyone in class lolololollllllllll",
          "score": 0
        },
        {
          "text": "Huh I got my IC in primary school. It barely fit in my wallet because it was a laminated piece of cardboard.",
          "score": -1
        }
      ]
    },
    {
      "id": "t3_1qrxesi",
      "subreddit": "askSingapore",
      "title": "First job after uni - iced out at work",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qrxesi/first_job_after_uni_iced_out_at_work/",
      "score": 100,
      "num_comments": 54,
      "created_at": "2026-01-31T16:57:19",
      "selftext": "I’m in a small team under a bigger division. When I first joined, I made the effort to be friendly and hang out with another team, the largest/dominant one. After some time, I realised I wasn’t really clicking (always felt a bit like a wall), so I stopped forcing it and just interacted with other colleagues instead. No dramas or conflicts\n\nOver time, things started to feel awkward and cold with that team. During a work event, there was a gathering and people from other teams were invited, which made it more confusing. I asked if I could join and was told no - felt quite paiseh and draining.\n\nWhat confuses me is that I’ve literally interacted with them before, am not a stranger. I genuinely can’t pinpoint what I did wrong lol. I have friends outside work and never really had this issue in previous roles, so this feels less like a personal social failure and more like office clique dynamics?\n\nIs this kind of thing normal in adult working life? Is it better to just focus on work and not expect much socially? Does not being part of the “inner circle” actually affect progression? Just trying to understand how to move forward, or is my work-social life here already doomed LOLL",
      "comments": [
        {
          "text": "You don’t realize it yet but not being invited to all these gathering or events is actually a blessing in disguise.",
          "score": 175
        },
        {
          "text": "Your priority is to your own team. Get to know them first and establish yourself there. Once that happens, intra teams can interact, but unless you are really charismatic, most teams are closed. You are an outsider to them. It is like this outside work, it’s just people are more polite in casual settings. You have to learn to read the room. You are a junior, an outsider. You won’t get an invite.",
          "score": 143
        },
        {
          "text": "You didn't hang with your own team even as a newbie, but tried to make nice with the more prominent team. I'm sure they see what's up.",
          "score": 121
        },
        {
          "text": "Sounds like u stepped on someone's toes",
          "score": 97
        },
        {
          "text": "Don’t worry, just come to work take salary. Workplaces are political and your colleagues are not your friends. People throw each other under the bus just to look good.",
          "score": 67
        },
        {
          "text": "Your such behavior can be easily misinterpreted and made use of in rumor mongering..be wise..",
          "score": 34
        },
        {
          "text": "It’s just a job. Do your work, and then go home",
          "score": 30
        },
        {
          "text": "Youre in a new place, there are many people who dont know you as a person, everyone has their friends theyre already comfortable with. I’d say give it time and dont try too hard to make friends. And dont only try to be friends with other teams, in corporate your own team is the dominant one. spend more time with others, slowly build connections, and if your personality is fire enough, people will eventually be drawn to you. Attract, dont chase.",
          "score": 25
        },
        {
          "text": "You tried to be friends with the other teams , but not your own, you pissed some people",
          "score": 22
        },
        {
          "text": "Imo you should have given it more time instead of immediately reaching out to other teams, they probably have a bad impression of you because of this. But you also can't appease everyone and there's no guarantee they might open up to you in the future either. Just work to earn money and not to make friends bah. If you do click with them, it'll come naturally with time. All the best!",
          "score": 21
        },
        {
          "text": "because half the conversations will be drama'you know A last time always hang out with us''ya lor then after that A don't want to hang out with us anymore''i heard he <insert rumour here>''ya did you see A's insta'blah blah blah blah blahrepeat for person B",
          "score": 17
        },
        {
          "text": "Still can't fathom what I did actually, was mostly a quiet NPC throughout lunches!",
          "score": 17
        },
        {
          "text": "Easy to say but at times you're forced to collaborate or communicate with one another. Unless OP's jobscope doesn't require her to deal with anyone. It'll definitely affect you to an extent even if you just want to tell yourself I'm here only for the salary.",
          "score": 14
        },
        {
          "text": "Sometimes it's wat u did not do",
          "score": 13
        },
        {
          "text": "But should start from there. You stepped on toes on both sides.\nNot everyone is keen to accept outside their team. The larger team may have folks that do not appreciate it",
          "score": 11
        },
        {
          "text": "Have you at least tried to invite or interact with your own team before going to the other team?",
          "score": 9
        },
        {
          "text": "More context needed: What is your relationship with your current team like ? Did you try to hang out with your current team before extending your network? Why are you only focused on the dominant team? By right you are not part of them and it is valid for them to reject you since they do not know you well enough yet. They probably viewed you as an intruder.",
          "score": 9
        },
        {
          "text": "Yep, for sure! Just wasn’t much opportunity in such a tiny team, so I ended up connecting with folks I actually clicked with 😅",
          "score": 2
        },
        {
          "text": "Please tell, why is it a blessing in disguise? 🙏🏼🙏🏼",
          "score": 2
        },
        {
          "text": "Yup I get why it might look confusing. My immediate team is reaaally small - so casual socialising internally isn’t really a thing. I naturally tried connecting with people in other teams I actually clicked with. Definitely wasn’t trying to intrude or be opportunistic, just navigating first-job social stuff",
          "score": 2
        },
        {
          "text": "How small? Both sides may see you as a bootlicker (to the dominant team) and don't trust you. It's not always about your intention, they do not read your mind.",
          "score": 2
        },
        {
          "text": "Oh dear. This is one heck of a newbie mistake. Casual lunches may not be your thing but that's the main way you bond with your own teammates. Once you've established a good bond with them, then you mix with other teams once in a while. You still need to hang out with your own team regularly. Every time there's a f-up, no one will ever take the side of someone else from other department over their own. You do not prioritise finding friends first in the office. You went OUT OF YOUR WAY to make friends with the known bigger team first rather than your own. Of course your own team will ice you out., they think you're sucking up to the bigger team. Tbh that other team prob found it weird that you kept going over and ignored your own team, so they're now putting some distance btw them and yourself. Imagine in sec sch, you have a kid from another class who keeps coming over to your class, while ignoring his own classmates. Your classmates will eventually find it strange when he asks to join your class activities. You're that kid, I'm sorry to say.",
          "score": 0
        },
        {
          "text": "You’re building a whole narrative out of things I never said :-) My team is small, lunches weren’t a regular bonding ritual, and I didn’t ‘ignore’ anyone. Talking to other teams isn’t some Machiavellian plot - it’s literally normal workplace interaction. The schoolyard analogy is cute, but it doesn’t apply here. I'm sorry to say, but re-read my post?",
          "score": 0
        },
        {
          "text": "I get why it might look that way! My immediate team is tiny and casual lunches aren’t really a thing, so I naturally tried connecting with people I actually clicked with - inter-team mingling is pretty normal anyway 😅",
          "score": -1
        },
        {
          "text": "Yeaah, I get why it might seem that way. My team’s super small and casual lunches don’t really happen, so I ended up just connecting with people I clicked with. Definitely didn’t mean to upset anyone!",
          "score": -2
        }
      ]
    },
    {
      "id": "t3_1qsa76c",
      "subreddit": "askSingapore",
      "title": "“Three levels of wealth” in Singapore",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qsa76c/three_levels_of_wealth_in_singapore/",
      "score": 86,
      "num_comments": 139,
      "created_at": "2026-02-01T02:32:13",
      "selftext": "I recently met up with a group of friends, most of them people who’ve been living in Singapore for years, and one discussion really stuck with me.\n\nThey explained what they jokingly (but half-seriously) call thethree levels of wealthin Singapore. I’m curious how accurate this sounds to locals.\n\nLevel 1: You own a dogHaving a dog in Singapore is expensive. Vaccinations, vets, permits, general upkeep, it all adds up fast. According to them, if you see someone walking a dog, that person is definitely not poor.\n\nLevel 2: You own a carCar ownership is on another level. They said it’s roughly two to three times more expensive than in Dubai. Import duties, insurance, and especially the licence to own a car make it prohibitive. We roughly calculated that a Mercedes E-Class could end up costing around USD 300k.\n\nLevel 3: You have two or more childrenThis was described as the real “wealth tier”. Education is extremely expensive, nannies are costly, and then you add extracurriculars, clubs, activities, camps, and so on. If you’re raising two or more kids in Singapore, you’re doing very well financially.\n\nDoes this way of looking at wealth in Singapore resonate at all, or does it sound off? How would you personally describe the so called levels of wealth?\n\nGenuinely curious to hear local perspectives.",
      "comments": [
        {
          "text": "I have a friend with 4 kids, a car and stays in HDB. \nHe is living paycheck to paycheck. \nYour assessment is inaccurate. It might apply to some but it's definitely not accurate at all.",
          "score": 509
        },
        {
          "text": "That sounds like poor people's idea of wealth. I have a friend with twins in Singapore. He is not \"next level\" wealthy.",
          "score": 284
        },
        {
          "text": "You can have all that shit and be in crippling debt. I know many people who have cars even though its a shitty financial decision for them. The real wealth is being rich enough so you’re able to do the following:",
          "score": 241
        },
        {
          "text": "Lol these are some of the worst indicators of wealth I've heard of.Everything you've listed are just expenses which most average people can afford and already have. There are plenty of families with many kids receiving financial aid from government. Are they top-tier wealthy then? People have pets, cars, nice houses but are in debt and have to hustle hard the rest of their lives just to pay those off. Is that wealthy? True wealth is complete financial freedom... when your time belongs to you. No fear of job loss, no stress about recessions, no decisions driven by money. Just the ability to live life on your own terms.",
          "score": 172
        },
        {
          "text": "3 levels of wealth in Singapore",
          "score": 116
        },
        {
          "text": "No, it’s youngsters’ idea of wealth, especially if they have no interest in kids. Cos they see it as goal 1 = dog, goal 2 = car, goal never = kids.",
          "score": 61
        },
        {
          "text": "thanksGPT",
          "score": 48
        },
        {
          "text": "Probably applies to foreigners. Kids school fee, medical expenses, extra curriculars, renting a large place all $$$.",
          "score": 43
        },
        {
          "text": "Education is expensive for citizens? for primary school, citizens pay $6 or $6.5 a month while pr pays 250 to 300 and foreigner pays 500+. definitely not expensive for citizens. And citizens got baby bonus too. I have to disagree with your logic. the rest I have no idea.",
          "score": 26
        },
        {
          "text": "Yup. You often hear of foreign exparts earning 20k/month and you think to yourself they're living the good life. But they're also renting an 8k condo, spending 2-4k per child on international school fees, having to buy private insurance for their whole family, and taking frequent flights back to their home country to visit family. And when you factor in all the other miscellaneous cost of daily living stuff, it really doesn't get them that far.",
          "score": 23
        },
        {
          "text": "Nah, I live in a HDB and most people here have at least two kids and have a car. This is normal. The TYPE of car and the kids’ school uniform, now those are what give a better indication of their wealth.",
          "score": 10
        },
        {
          "text": "underrated comment! indifference is one of the true markers of wealth, not whatever OP has said",
          "score": 8
        },
        {
          "text": "Those kids can brag they started off with nothing, like every CEO ever",
          "score": 4
        },
        {
          "text": "Yes! True wealth is one where I can have tons of optionality. One where I can decide eating a $4 meal or $40 meal without worrying about the price.",
          "score": 3
        },
        {
          "text": "And have properties in Singapore with ABSD paid",
          "score": 2
        },
        {
          "text": "I know quite a few people with cars living paycheck to paycheck, and they are in their 30s and 40s.",
          "score": 2
        },
        {
          "text": "This need to get higher vote.",
          "score": 1
        },
        {
          "text": "Yup, as long as can take loan, they will take loan.",
          "score": 1
        },
        {
          "text": "This is correct. For foreigners even with PR benefits. When kids into equation. 20k a month is a stretch; thus require above that to have some extra allowance for holidays, investment etc",
          "score": 0
        },
        {
          "text": "Agree on the second part",
          "score": 0
        },
        {
          "text": "This is a much better indicator than OP.",
          "score": 0
        },
        {
          "text": "i liek how dentally is seperate from physicallyyyyyyyyyy",
          "score": -36
        },
        {
          "text": "yeaaaaaa those r just varying levels of pooor tbh real rich hab private jetsssssssssssss",
          "score": -81
        },
        {
          "text": "Completely agree with you. That’s the real definition of wealth anywhere in the world. I was more asking aboutSingapore-specificsignals that make you think someone’s genuinely well off. In every country those can be a bit different. What are those that stand out in Singapore?",
          "score": -88
        }
      ]
    },
    {
      "id": "t3_1qs43yc",
      "subreddit": "askSingapore",
      "title": "Worth to own a car in SG with <4.5k a month pay?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qs43yc/worth_to_own_a_car_in_sg_with_45k_a_month_pay/",
      "score": 76,
      "num_comments": 100,
      "created_at": "2026-01-31T22:42:42",
      "selftext": "For context, I am a diploma holder, earning gross about 4k, and my work place is 1 highway away and if drive/grab its 20mins but public transport need transfer here and there totaling to more than 1 hour.\n\nMy job at times requires me to be going from 1 site to another, where I use phv because of time, as its usually lunch time that I go to different sites, and if I take MRT, by the time I get there I wouldnt have time to eat, so I use \"unclaimable\" phv.\n\nLastly, my mom requires bi-weekly medical checkups at hospital for spine, for at least till end of 2026, so every where she goes id prefer she gets car cus she cant walk, wheelchair is hell to get on on crowded buses especially medical appointments being in peak hour.\n\n1) Do y'all think its worth/justifiable i get a car? More so with gross under 4.5k.\nI try to save 1.5k a month, 300 on insurance and savings plan, spending about 1k with phv and food, the rest just misaleanous spending.\n\n2) Car owners, how much do y'all put into car a month? With petrol, insurance/road tax divided by 12, season parking, cash card etc.\nJust want a general idea.\n\nAs i am looking to get Japanese cars for longevity, as well as COE car just cus PARF cars are really old and hearsay from friend to not take the risk.\nThanks for taking the time to read!",
      "comments": [
        {
          "text": "Actually if the job requires you to travel they have to pay transport. Either by giving car allowance or cab charge. Personally I would rather not eat than use my own money for PHV but that’s besides the point. If you’re travelling between company sites it means it’s on the clock and they cannot deny you lunch hour. Lunch hour is mandatory. I would have just kept taking public transport and appearing late at the sites till they got the point about not providing transport.",
          "score": 322
        },
        {
          "text": "Frankly no. But if you really want to try out if its worth, can buy a coe expiring car like left either 2 years try. Frankly though, your company should pay for the transport la",
          "score": 118
        },
        {
          "text": "It’s not right if you don’t have time to eat and can only claim public transport. Don’t get a car. You will be in a very bad position if you lose your job, and you won’t earn more with the car.",
          "score": 90
        },
        {
          "text": "Nope. Rent a car first instead and see how it goes in terms of convenience and financial liabilities. Owning a car is more than just paying for the car loan, there’s added cost to maintain the car, car insurance, pump petrol and ERP and parking fees. Also if your mom needs transport to go for medical visits or treatments, there are medical social services that are available that can take your mom to for medical appointments for free. I think you can try googling or just ask the receptionists at the hospital/clinic.",
          "score": 81
        },
        {
          "text": "Whoever ask you get a car at this salary is crazy. You travel daily with grab is also cheaper. Book grab for your mum. Travel between sites shouldn't eat into your lunch hours. Car overall is for convenience, status, sales related job that require A LOT of travelling. Otherwise, it makes near 0 economical sense to get one.",
          "score": 54
        },
        {
          "text": "No.",
          "score": 33
        },
        {
          "text": "Car = $1.5 to $2k/month just for installments and usage. Is your current Grab more than that?",
          "score": 29
        },
        {
          "text": "If your work requires travel, your work should provide. If they don't provide, then you complain you can't do.",
          "score": 28
        },
        {
          "text": "If OP has difficulty finding time to eat + public transport, it's not so straight forward to grab a customer. I'm not sure. There will be increased cost from insurance at the very least, maybe higher interest rate for car loan as it's for PHV. Not sure if OP can cover the cost too. Gross 4-4.5k salary, take home maybe $3.2k+, with min $2k on a car, more than 50% gone already. Is it still worth it to work? Or maybe just get a car and drive grab suah? Maybe go back to root of the issue, thrash it out with the company.",
          "score": 19
        },
        {
          "text": "No point owning a car in Singapore unless you absolutely have to, eg. Elderly parents who cannot walk",
          "score": 15
        },
        {
          "text": "My friend, you can grab to and from work and your lunch transfer and also grab to take your mother to and from her medical check-up and you still wouldn’t be spending as much as you would on a car. Car ownership costs me around 2.5k  a month all in and I got a cheap car whe the COE was low",
          "score": 14
        },
        {
          "text": "Did you confuse COE car for PARF car? PARF car means less than 10 years old and COE car means over 10 years old. Typical spending bare minimum even for a COE car would be $1k per month on all expenses depending on how much you travel assuming only routine maintenance and that the previous owner did not leave you a ticking time bomb. I would assume a PARF car to cost much more than that, just my 2¢.",
          "score": 12
        },
        {
          "text": "Not worth. It’ll really impact your savings and future quality of life. If you’ve to travel, company should provide transport allowance. No allowance then just take public transport. If boss not happy, well that’s the best you can do.",
          "score": 11
        },
        {
          "text": "If you have to ask this question, you can’t afford it",
          "score": 10
        },
        {
          "text": "No you can't afford it, and the company should be paying for one for you if you need to move around that much",
          "score": 10
        },
        {
          "text": "My 2 cents is that you shouldn't... I'd argue that a grab xl would probably be a better option esp since it's till the end of 2026 for now. 4k isn't alot to play with esp if you hit a rainy day or have a month where everything breaks. my work place is 1 highway away and if drive/grab its 20mins but public transport need transfer here and there totaling to more than 1 hour. Sidetrack, but I feel you. Our public transport is great, but man our bus network needs serious improvements. The bus frequency problem needs to be addressed, because atm it's the problem slowing everything down. Waiting more than 15 mins for a bus, or sometimes even 25+ min is absurd. And ffs we should have signal priority for buses, and more full day bus lanes....",
          "score": 10
        },
        {
          "text": "Even if you double your salary at 8k, you need to think twice before owning a car. You need to set aside $1k a month for the recurring car expenditure, and that is not even including the car loan repayment.",
          "score": 9
        },
        {
          "text": "Can you provide a link with more information about jobs having to pay transport if it requires you to travel? Thanks",
          "score": 7
        },
        {
          "text": "I have friends making 10k+ thinking car is a few years away. Bro 4k is way too little. His yearly saving per his calculations is <20k. That’s not a lot… he needs to prep for buying home or marriage or smth more important than car.",
          "score": 2
        },
        {
          "text": "Not to mention if he gets in an accident with a Ferrari/Porsche/Lambo who owns the street when they drive",
          "score": 1
        },
        {
          "text": "bosses dont think like that. i left that company but i was constantly told off for lateness and how its was gonna affect my performance review. when i said i didnt have a car like my colleage then they said take cab or come earlier ;/",
          "score": 0
        },
        {
          "text": "Well if he is paying $1000 every month for PHV, any performance bonus given will be down the drain anyway.",
          "score": 0
        },
        {
          "text": "he wasn't EVEN. which is worst. anyway bosses wont think like that. its always why my employee not good enough.",
          "score": 0
        },
        {
          "text": "He made it up out of blue moon, there is no such thing. Want doesn't mean get.",
          "score": -1
        },
        {
          "text": "Can he not be a grab driven on the side on the way and  from work?",
          "score": -11
        }
      ]
    },
    {
      "id": "t3_1qs6zzm",
      "subreddit": "askSingapore",
      "title": "What are some underrated cafes in SG",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qs6zzm/what_are_some_underrated_cafes_in_sg/",
      "score": 68,
      "num_comments": 27,
      "created_at": "2026-02-01T00:34:55",
      "selftext": "Trying to find cafes to go to on dates and would love to collate a list of cafes that I should visit! Would love any unconventional recommendations too",
      "comments": [
        {
          "text": "Been there since their previous location. Coffee 10/10, but hate their 1h rule not properly enforced by the barista/waiter. Sat at the big table beside two older ladies who had their drinks half drank when we sat down. 50min, we finished our coffee and a dude came over to let us know our 1h limit is almost up. Both of us “??” And we later asked him during payment, then he said “oh, i’m just about to remind them”. I love their coffee, but that experience turned me away…",
          "score": 11
        },
        {
          "text": "W39 Bistro - Jln mas puteh Westcoast",
          "score": 10
        },
        {
          "text": "Ought in Jln Jurong Kechil. It’s a small hole in the wall. There’s only one bench that can maybe fit 2 people. Coffee’s fantastic. They serve beens from Prodigal Roasters. Usually only 1 person working and they’re typically very warm and friendly. Always willing to share more about the beans they’re serving that particular day.",
          "score": 9
        },
        {
          "text": "Cowpresso at Beauty World though there are many suggested that are in this area already 😅 have not tried their food before though A really cute backyard one at Bee Hoe, Joo Chiat for coffee too!",
          "score": 8
        },
        {
          "text": "Ground on the hill in sunset way",
          "score": 7
        },
        {
          "text": "Their food at the outlet is meh. Was hugely disappointed when I tried it recently. Design of the place was also bleh.  Don’t think they know how to run a cafe. I still buy their beans though",
          "score": 6
        },
        {
          "text": "Better Days!",
          "score": 6
        },
        {
          "text": "Olla in Clementi",
          "score": 6
        },
        {
          "text": "i really like Pocket near Tan Kah Kee MRT",
          "score": 6
        },
        {
          "text": "if ure a coffee enjoyer do check out apartment !!",
          "score": 5
        },
        {
          "text": "Yess and the yummy bakes next door at browned butter bakehouse, but only open Thurs-Sat",
          "score": 3
        },
        {
          "text": "Dawn kissa! (South bridge road). Excellent coffee and bakes (lady boss bakes them fresh every morning)",
          "score": 3
        },
        {
          "text": "Kobashi coffee - awesome lattes, full of smiskis",
          "score": 3
        },
        {
          "text": "Offsite in Beauty world! Omg - their banoffee pie is awesome!",
          "score": 3
        },
        {
          "text": "cIovelly at lorong chuan",
          "score": 3
        },
        {
          "text": "I used to enjoy their fresh pasta but honestly the quality has dropped lately",
          "score": 3
        },
        {
          "text": "Love this place",
          "score": 2
        },
        {
          "text": "Foreword coffee at esplanade almost nobody everytime but now with ROM there might be busy liao",
          "score": 2
        },
        {
          "text": "Okay lucky I didn't try the food but that's why for chillin and casual vibes I love that place for having no pressure 😭",
          "score": 1
        },
        {
          "text": "The smiskis sold me",
          "score": 1
        },
        {
          "text": "Super upvote, their goma latte is very nutty and aromatic very in love 😍",
          "score": 1
        },
        {
          "text": "Overtime bistro 101 in eunos ave 3!\nTheir food is amazing and can play 8 ball too",
          "score": 1
        },
        {
          "text": "My two favourites in the East are Coastal Settlement at Changi and Wild Seed cafe at The Summerhouse.",
          "score": 1
        },
        {
          "text": "Heh was waiting to see this",
          "score": 0
        },
        {
          "text": "Yakun.",
          "score": -4
        }
      ]
    },
    {
      "id": "t3_1qs8blb",
      "subreddit": "askSingapore",
      "title": "Is brainrot actually a thing among Singapore youths?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qs8blb/is_brainrot_actually_a_thing_among_singapore/",
      "score": 58,
      "num_comments": 31,
      "created_at": "2026-02-01T01:23:44",
      "selftext": "Context is someone mentioned \"tuff baby\" in a conversation last week and i stoned and i searched it but what came out is a creepy ai baby meme? Got me realised how illiterate I am in brainrot language(??\n\nI am curious: Is this form of brainrot contain an actual issue among students and youths in Singapore, or is it just adults panicking about new media forms again (reminded me of Gangnam style like 10 years back then)?",
      "comments": [
        {
          "text": "80s kids have our version of brain rot Remember happy tree friends? =) And thishttps://m.youtube.com/watch?v=LBjUh4bYF8w",
          "score": 70
        },
        {
          "text": "That stupid 67 thing is everywhere. I walk past playground got kids saying that so yes, brainrot is very much here.",
          "score": 61
        },
        {
          "text": "90s kid here, the difference is the stuff like happy tree friends and stick deaththenwas limited to 15-30 minutes max in the school computer lab or on the home 56k dial up. There was no mind cancer on demand. I’m in the education sector and I’ve worked with kids from 5-19 for a few years now. Ticktock, Roblox, and Instagram are a few examples of caustic mind rotting content. Kids will scroll shit worse than HTF, look for 3 seconds, then swipe. And their screen time can be upwards of 4 hours a day. Every “video” is actually two videos in one with a third voice over and a fourth soundtrack. Their minds are getting absolutely ravaged.",
          "score": 61
        },
        {
          "text": "Wait 2032, SG67",
          "score": 35
        },
        {
          "text": "I teach secondary school tuition, and yes, every single form of brainrot you've heard of is not just \"a thing\"; it's more like the brainrot supplanted normal language 67 is the main one. Then there's more outdated stuff like \"let me cook\", \"fanum tax\", \"skibidi\", \"sigma male\" and tungtungtung sahur. They start their sentences with \"bro thinks he's ... \" sometimes bro is replaced with \"blud\" or more recently \"vro\" They say \"cooked\" instead of screwed Cool things are said to have \"aura\" When they give up on something/lose their temper it's called \"crashing out\" And these are just the things I remember, there are so so many more examples with new ones coming up like every other week. There was once I mentioned \"still water\" and they exploded with laughter because apparently that became the latest meme....for a reason I still have not figured out. It's weird but tbh I just embrace it. Our generation had its own memes too.",
          "score": 33
        },
        {
          "text": "as an ex secondary school english teacher (left fairly recently, in Aug 2024) yes it is a thing, but i wouldn’t say it’s an issue. every generation has its slang and language trends! there were a few kids who would use ‘brainrot terms’/internet slang in their writing but it wasn’t so widespread that it was a serious problem, imo.",
          "score": 16
        },
        {
          "text": "Just use it to them as well. Bonus points if you say sixty seven instead of six seven.",
          "score": 14
        },
        {
          "text": "yes, the amount of times i heard 67 whilst in poly is one too many, hell one of my own project mates is speaking like one with brainrot",
          "score": 13
        },
        {
          "text": "brain rot ≠ memes. every generation has memes that prev generations may not understand but the issue is how some sg teens / or maybe children doom scroll for hours on TikTok / ig, being exposed to short-form, attention grabbing and over-stimulating content. It is detrimental to the brain as they consume too much information in too little time. as a result causes them to have practically no attention span, decreases mental capacity and cognitive function this is what “brain rot” is. 67 isnt brain rot imo, but the constant doomscrolling and consumption of such “content” prevalent amongst Singaporean youth is.",
          "score": 12
        },
        {
          "text": "Fastest way to derail a kids trend is when an adult uses it. If it makes mainstream media, even faster.",
          "score": 11
        },
        {
          "text": "Trends happen for every generation. And previous generation will always find it bad or cringe of the trend of the next generation.",
          "score": 10
        },
        {
          "text": "This. Kids nowadays really have a 3 second attention span which is a shuddering thought.",
          "score": 5
        },
        {
          "text": "I think a few like \"cooked\" and \"crashing out\" are actually AAVE that made it into the mainstream and have been adopted by Gen Z a lot. Sometimes I hear them speaking loudly on the bus and I'm like, why do they sound like they're trying to be African American? 🤨 Did a bit of \"research\", and it seems so!",
          "score": 5
        },
        {
          "text": "The fact that you said brainrot.",
          "score": 4
        },
        {
          "text": "To be fair, we watched Happy Tree Friends, but you dont watch us go around and scream \"AHHHHHHHHHHHHHHH\" because thats like the majority of the scenes in every video Also, we dont have a \"SIX SEVEEEEEEEEEN\" bullshit even when watching the brainrot-equivalents of the 97s",
          "score": 3
        },
        {
          "text": "Bro, I'm currently in Uni and one of my groups wanted to call our group 67, lol. You just can't escape this shit.",
          "score": 2
        },
        {
          "text": "Very curious to know why! Is it an identity thing, just fun? Or what. Also see people bringing the tung sahur keychain thing around them…",
          "score": 1
        },
        {
          "text": "Wait till they experience 96 or 85",
          "score": 1
        },
        {
          "text": "Yeah my point is that all generations have their versions of brain rot. I don’t see the moral high ground we have over the current generation . Kinda like the “during my time in army…” phrase that no one likes to hear We may complain about short tiktok videos sending current youngsters to overdrive, but I definitely recall similar warnings my parents gave to me when we first have YouTube and iPhone ( it’s poison, stop spending your time there) Ditto 2 generations ago repeating the same to our parents generation about TV",
          "score": 1
        },
        {
          "text": "Yea the declining attention span is a worrying trend. Most youngsters can't even sit through an entire video without fast forwarding every few seconds.",
          "score": 1
        },
        {
          "text": "Yeah, 67 is harmless, it's basically this generation's version of the Markiplier E meme.",
          "score": 1
        },
        {
          "text": "Your comment has been automatically removed because your account is relatively new or you have negative karma. I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns.",
          "score": 1
        },
        {
          "text": "I don't remember where was it, but the other day I saw somewhere they were selling cards or something with images of Tung Tung Sahur and I'm not sure what else (those are Italian brainrots)",
          "score": 1
        },
        {
          "text": "脑腐",
          "score": 1
        },
        {
          "text": "HAHA SIX SEVENNNN",
          "score": -2
        }
      ]
    },
    {
      "id": "t3_1qsl6ij",
      "subreddit": "askSingapore",
      "title": "Landlord cheated me. Please advise.",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qsl6ij/landlord_cheated_me_please_advise/",
      "score": 43,
      "num_comments": 77,
      "created_at": "2026-02-01T09:53:08",
      "selftext": "I recently visited condo to view a master bedroom for rental. The condo unit is owned by a husband and wife who didn’t appear together, so it was only the wife showing the room at the time. I had no idea that owners were married and I assumed the woman who showed me the room was an agent.\n\nShe shows me the room and tells me that the rent is $1350 excluding utilities and said that that I had to make the deposit immediately to hold the room as there were many others who were in line to view the room as well. Hence, due to FOMO I went home and immediately made the deposit at around 3.57 PM on the condition that I’d moving in on March 1st. But I thought about and I realised that I didn’t like the person, and she started telling me that there were extra charges to the monthly rent after I made the deposit. Immediately at around 4.15 PM I asked a refund saying that I was uninterested in the room as it exceeded my budget and she directed me contact her husband. The husband then says that deposit was non-refundable because he rejected another person and that the other potential tenant had already confirmed another room. Mind you, this was within 20 minutes of making the deposit. Then after enough begging and pleading, he told me that he would refund the deposit after finding a new tenant.\n\nToday he’s telling me that he’ll only refund half as the supposed new tenant that he found can only move in on 15 March. I wanted to ask reddit, if my deposit it forfeited even thoughI never signed a lease or was told that the deposit was non-refundable. Is it a good file a police report or just get the half.\n\nI understand that $1500 is not worth filing a police complaint, but I feel like it’s not right to just forfeit my deposit because I told them ‘no’ within 20 minutes. Please advise me.\n\n*****Edit*****\n\nI am a foreigner. I don’t want to be a trouble to the locals. I am only asking for help because I hate these kinds of landlords and they exist everywhere and I feel like it’s sensible to refund the $1500 since I requested it back within 20 minutes. Apologies for the inconvenience.\n\n****Edit 2****\n\nI saw that we need to pay deposit only after signing the agreement. But, I never thought about this. I thought it was standard practice to pay the deposit and then sign the agreement. I never tried to do anything under the table, because I know how some landlords can be dishonest.\n\nI just want to know should I simply get the half is offering now or apply for a civil case.\n\n****Update****\n\nI chose to receive half of the deposit since I realised I neither have enough proof nor eligibility to get the money back. Seems like I am in the wrong for not taking enough precautions and FOMO’ing. Thanks for the advice guys.\n\n****Edit 4****\n\nI have already mentioned in the update that I won’t be pursuing a case. But there’s one reddit user who is hellbent on berating me or anyone who has an opinion that doesn’t align with that reddit user. They are trying to judge my character and assume my nature, and the same goes for those who voice out their opinions. I kindly request you to only post constructive advice so that future renters can learn a lesson from my experience as I have. Thanks to those who have been kindly provided constructive advice.",
      "comments": [
        {
          "text": "Small Claims Court, can represent yourself and waste her time and mental effort dealing with you",
          "score": 100
        },
        {
          "text": "Just tell them that u will be making a police report if they did not refund u by end of today. But please still proceed with the police reporting as I suspect it may not be the first time they did this. Landlords like these need to be investigated.",
          "score": 63
        },
        {
          "text": "$1500 is worth filing a police report. There might already be a similar report towards the same people.",
          "score": 46
        },
        {
          "text": "Additional charges were not made known until deposit. This is just wrong.",
          "score": 22
        },
        {
          "text": "This is why for before you tranfer ask for a copy of the TA. If they refuse to give then its abit red flag already And in additional before transfer do up an LOI letter stating all you terms and requests, owner sign already then you transfer . If the owner cannot agree and does not issue to you the TA then they have to refund you the deposit Deposit is only to book the room , if no TA is signed then there is no deal Lesson learnt , go police no use this is civil matter and you did not do up any black and white to protect yourself",
          "score": 15
        },
        {
          "text": "as much as i hate it, that's the point of a deposit. refunding it is at landlord's discretion. you can argue it's only been 20 mins or the next tenant would move in 2 weeks, you can't argue that landlord'd lost 2 weeks of income if they fully refund. take the money and lesson learned not to be fomo for anything.",
          "score": 13
        },
        {
          "text": "Just curious, can a foreigner renting a house can represent himself?",
          "score": 12
        },
        {
          "text": "Yes",
          "score": 8
        },
        {
          "text": "Yes you can, but normally the opposite party(aunty in her 40s) has more time to spend than you if you’re at the busy stage of your life(20s/30s). My friend won the claim but it took her almost 1 year from the time of filing to the time of resolution for a mere 800$",
          "score": 7
        },
        {
          "text": "OP said it's rent + utilities which was stated in the ad. it's a bad situation but very honestly OP should not have put down a deposit on something they had no real intention of renting. the point of having a deposit is to discourage / punish this type of wishy washy behaviour.",
          "score": 7
        },
        {
          "text": "they added many charges post-deposit agreement, usually is rent agreed + utilities you pay according to what you use, from OP's side it seems more than that. They cheated her...",
          "score": 6
        },
        {
          "text": "And this is entirely correct, except for the extra charges which the OP has not detailed - they actually did not seems to have “cheated” him which he is wailing about.",
          "score": 6
        },
        {
          "text": "OP just said they agreed to pay a deposit and suddenly additional costs was tagged on which they failed to mention in the ads, i'm not sure why you're trying to interrogate people online when the answer is from reading? Seems to me you're the said landlord justifying why it's ok to tag on additional costs not in the listings.",
          "score": 5
        },
        {
          "text": "You can try the easier route first — either offer a lump sum to settle it or hire someone yourself to handle the repairs. Before you escalate to small claims court, make sure the landlord knows that’s where things are headed. A lot of landlords talk big, but as soon as they realize they’d actually have to put in time and effort, they tend to start treating you more fairly. As long as you have the time to go through with it, it’s worth pursuing. Also, my friend is a foreigner too (from China), so it should still be doable.",
          "score": 3
        },
        {
          "text": "In my case the landlord is a professor and I have really flexible hours of work. I just handed over my unit yesterday and my agent told me that my landlord might want to paint the whole house for some marks like these :https://imgur.com/a/bBmEelU(two of them are on the exterior balcony)\nI’m just contemplating my options if he charges a ridiculous amount",
          "score": 2
        },
        {
          "text": "Yes",
          "score": 2
        },
        {
          "text": "Are marks like this not considered fair wear and tear? Or that concept doesn't exist and the LL is free to bill you to make good?",
          "score": 1
        },
        {
          "text": "The 10 dollars each for wifi and cleaner? This is a joke is it not?",
          "score": 0
        },
        {
          "text": "Does this not make it an additional cost? I seriously cannot understand what's up with man.",
          "score": 0
        },
        {
          "text": "SCT has no jurisdiction for this",
          "score": -2
        },
        {
          "text": "extra charges were for wifi + cleaner, which she can opt out.",
          "score": -2
        },
        {
          "text": "Small claim.no use one. They can dont appear. Even courts rule in your favour, also can't enforce payment. Have to hire own debt collector to collect. Just take half , be wiser next time",
          "score": -5
        },
        {
          "text": "What were the charges? If this was the dealbreaker surely the OP should have stated what these were? And finally why so FOMO when you have so many rooms to rent? Sounds like rent was too good to be true?",
          "score": -5
        },
        {
          "text": "How do you know that? When the OP did not even detail what these were? You know the OP personally? The chain of events seems to show he is wrong, no? And is victim-playing now?",
          "score": -12
        },
        {
          "text": "Hmm, they didn’t do anything? He agreed to rent and now is backing out? So who cheated him?",
          "score": -29
        }
      ]
    },
    {
      "id": "t3_1qs2ymn",
      "subreddit": "askSingapore",
      "title": "Single working adults, how much do you spend in a week/month?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qs2ymn/single_working_adults_how_much_do_you_spend_in_a/",
      "score": 43,
      "num_comments": 46,
      "created_at": "2026-01-31T21:54:46",
      "selftext": "Hello! I’m starting my first FT job soon, and just wondering how much yall spend in a week/month! Tryna get a rough gauge 🤣",
      "comments": [
        {
          "text": "27 y/o, not renting, spend around ~1.1k per month. most expenditures are on food lol",
          "score": 47
        },
        {
          "text": "Depends what kind of lifestyle you are looking at. Just basic monthly costs. Public transport about $90-110 a month.\nPer meal at $5-6.\nGroceries depends greatly, if you getting with parents or for yourself, could range between $100-400. \nEntertainment about $100-300 depends where you go, what you do and your poison. That being said, i believe in saving 50% of salary if possible and put it towards investments, the rest for bills and insurance. Any leftovers for savings and/or investments (cuz it's worth putting money to run)",
          "score": 18
        },
        {
          "text": "Wah 2.5k per month what car you drive",
          "score": 13
        },
        {
          "text": "Mostly goes to my rent and insurance expenses.",
          "score": 12
        },
        {
          "text": "34yo. Still staying with parents. $1.5k to parents. \n$2.5k to car. \n$1.5k to spenditures. Any leftover I just dump into ssb.",
          "score": 12
        },
        {
          "text": "27 y/o also, would agree to this, if I’m eating out a bit more that month, it could go up to 1.5k but usually not more than that",
          "score": 10
        },
        {
          "text": "Everyone is different. I’m 28yo. My expenses is around $5-6k a month.",
          "score": 10
        },
        {
          "text": "9k a month thereabouts. Every 6 months about 2k more because of dental and medication Every 12 months +17k for my parents and my yearly insurance premiums which includes riders. Won’t include misc stuff like hanging out with friends, or travelling, shopping, etc,  cuz those are not necessities. I couldn’t imagine spending this amount in my 20s. But a decade later, adulting hits hard. U won’t even care about what ur food cost when dining out with ur family because u are paying for the entire bill anyway. U are paying $20 although all u are having is a plate of chicken rice and a teh-o. Responsibilities are responsibilities. And family comes first.",
          "score": 7
        },
        {
          "text": "Wow what do you spend on",
          "score": 5
        },
        {
          "text": "800 minimum spend for credit card cashback, 3/4 of them for household expenditure like utilities and groceries and dining (for fam dinners etc) Another 500-800 spending on ancillaries like activities/hobbies/essentials like healthcare etc",
          "score": 5
        },
        {
          "text": "It depends if u are eating with family and how often u eat out? Unless your parents are willing to pay their own share, usually children that do decently salary wise would treat, it maybe shouldn’t be counted for the OP who is getting a FT job for the very first time. Oso depends on the lifestyle you were brought up with too ofc, if rich can afford to eat HDL everyday then its going to seem out of this world anyways",
          "score": 4
        },
        {
          "text": "Yep. Since OP is single, I'm assuming no rent, mortgage or utilities bills to pay for.",
          "score": 4
        },
        {
          "text": "Being a miser and low spender works too.",
          "score": 3
        },
        {
          "text": "$2.5-$3k",
          "score": 3
        },
        {
          "text": "~30. 300 to parent. 600-2500 on food hobby travel",
          "score": 3
        },
        {
          "text": "3k I guess, mostly food",
          "score": 3
        },
        {
          "text": "How much do u usually spend in 1 meal? I only spend less than $500 on food so I'm trying to comprehend that amount",
          "score": 2
        },
        {
          "text": "Curious what kind of investments do you do",
          "score": 2
        },
        {
          "text": "You can do across bonds, etfs, dividend stocks for a start. I try and diversify as best as possible to spread the risk.",
          "score": 2
        },
        {
          "text": "I spend around $20/day on food (that’s including lunch, dinner, snacks).",
          "score": 1
        },
        {
          "text": "Great pkg",
          "score": 1
        },
        {
          "text": "$5-8, but i do spend maybe $20-$30++ once a week or so for a nicer meal… cause i love eating too much haha…",
          "score": 1
        },
        {
          "text": "$500 per month works out to be about $5-6 per meal if you have 3 meals a day. If all your meals are home cooked and prepped at home, it’s possible. But the majority of people who have to dabao or eat out would definitely exceed that amount, nowadays mixed veg rice also minimum $4-5 for 2 meat 1 veg Plus $500 per month means no buying of snacks or drinks or going out to cafes for sure",
          "score": 1
        },
        {
          "text": "wow so you actually save like 60% [20% + (0.5 * 80%)]  of your salary. Impressive.",
          "score": 1
        },
        {
          "text": "saving 50% of salary of take home salary? cos 20% savings is like mandated already anw.",
          "score": -1
        }
      ]
    },
    {
      "id": "t3_1qrz1h3",
      "subreddit": "SingaporeRaw",
      "title": "Mala Chain Hot Hideout founder diagnosed with stage 3 blood cancer",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qrz1h3/mala_chain_hot_hideout_founder_diagnosed_with/",
      "score": 407,
      "num_comments": 39,
      "created_at": "2026-01-31T18:34:53",
      "selftext": "",
      "comments": [
        {
          "text": "Hope he recovers against the odds. On a side note, this is further proof that Forbes 30 Under 30 is an absolutely CURSED list.",
          "score": 213
        },
        {
          "text": "One hotpot owner got cancer The other one got cancelled",
          "score": 173
        },
        {
          "text": "Please win",
          "score": 132
        },
        {
          "text": "The HOTPOT that deserves support",
          "score": 90
        },
        {
          "text": "babypot",
          "score": 47
        },
        {
          "text": "The only thing is I hope someone encouraged him to actually rest and relax during recovery :/",
          "score": 42
        },
        {
          "text": "Who the other one that got cancelled and why so?",
          "score": 23
        },
        {
          "text": "Oh now I understand. I thought yall meant the other 2 owners of Hot Hideout got cancelled",
          "score": 18
        },
        {
          "text": "This is a juncture to remind everyone to be thankful for what they have instead of sacrificing for the endless rat race. If he could choose between losing his business or getting cancer, he would definitely pick a healthy body. As the saying goes, if you are not willing to give up 4 limbs for a billion dollars, you are a billionaire.",
          "score": 15
        },
        {
          "text": "Worked a project mod with him in NTU and he seemed like a chill dude who was really busy with hall stuff. He was trying his hardest to juggle everything, from hall stuff to almost being late for the grp project presentation and then when i thought he was a straggler like me, he still manages to study smart and nail the finals.\nDidnt keep in touch but enjoyed the mala place he opened up later on. He really did live life TTM. GWS brotha",
          "score": 12
        },
        {
          "text": "All the best and speedy recovery",
          "score": 10
        },
        {
          "text": "He trusted alternative treatments over established science",
          "score": 8
        },
        {
          "text": "I think they won’t need an agency now, just use your motto can already. Very catchy, easy to remember.",
          "score": 8
        },
        {
          "text": "Omg",
          "score": 6
        },
        {
          "text": "Early stage blood cancer seems not much symptoms? Few years back got 1 girl influence got diagnosed with stage 4 blood cancer.",
          "score": 5
        },
        {
          "text": "Tell that to Steve Jobs",
          "score": 4
        },
        {
          "text": "He did win. He lived the life most people will never have for 56 years",
          "score": 4
        },
        {
          "text": "Yes, a terrible thing, when he could have potentially been cured. Anita Mui was another tragedy",
          "score": 3
        },
        {
          "text": "He was in and out of hospital frequently before the diagnosis. Wonder how come they didn't check for this cancer earlier on, and maybe catch it at an earlier stage? Or is it not able to be detected until it's at a later stage? Especially with a family history of his brother having gotten the same thing before.",
          "score": 3
        },
        {
          "text": "Hotpot somemore",
          "score": 3
        },
        {
          "text": "... And yet didn't live to see all his kids grow up. Depends on your definitions I guess.",
          "score": 2
        },
        {
          "text": "Not like they had a good relationship",
          "score": 2
        },
        {
          "text": "Same question. Stage 3 but not detecable till PET scan? Thats crazy",
          "score": 2
        },
        {
          "text": "Not for cancer.",
          "score": 1
        },
        {
          "text": "Suppot",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qs2jdq",
      "subreddit": "SingaporeRaw",
      "title": "So famous until appear in HongKong news 👀",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qs2jdq/so_famous_until_appear_in_hongkong_news/",
      "score": 325,
      "num_comments": 35,
      "created_at": "2026-01-31T21:36:25",
      "selftext": "",
      "comments": [
        {
          "text": "They finally take PLB internationally.",
          "score": 116
        },
        {
          "text": "I was watching some IG reel related to them yesterday, and some guy from Taiwan commented on the reel that this scandal news is circulating there as well..",
          "score": 60
        },
        {
          "text": "Bet the Hk news bash them badly",
          "score": 46
        },
        {
          "text": "Even Business times also report sia! These two sibei famous now, really jin satki manz!",
          "score": 46
        },
        {
          "text": "When Melvin said he wants PLB to go international, he really meant it 🤣🤣🤣",
          "score": 39
        },
        {
          "text": "Saw it circulating on Taiwan news too",
          "score": 34
        },
        {
          "text": "Well, that's one way to IPO. Must be part of the strategy",
          "score": 28
        },
        {
          "text": "So you're saying M didnt throw Sg guys face? M very handsome and upright is it?",
          "score": 23
        },
        {
          "text": "The only thing missing now is video leaks from either of their phones.",
          "score": 17
        },
        {
          "text": "Whole world now see how ugly Singapore girls are. Throw face to max",
          "score": 15
        },
        {
          "text": "Hong Kong also running out of news?",
          "score": 14
        },
        {
          "text": "Everybody needed a break from orange monkey news.",
          "score": 14
        },
        {
          "text": "The whole of Asia.",
          "score": 11
        },
        {
          "text": "Eh muddershit say we are not being kind... Liddat how? Cannot be the whole world in unkind leh.",
          "score": 10
        },
        {
          "text": "Wah PLB finally got public listed ! Publicly listed in many tabloids including overseas ones as well.",
          "score": 8
        },
        {
          "text": "Wah gg next martians in mars also put out news about these 2 lmao",
          "score": 7
        },
        {
          "text": "That circled photo. She looks like a gay cross dresser.",
          "score": 7
        },
        {
          "text": "The scandal appeared in Thailand news also",
          "score": 6
        },
        {
          "text": "“so famous until appear in HongKong news” - is that really how singaporeans speak?",
          "score": 4
        },
        {
          "text": "At least they're highlighting both of them",
          "score": 3
        },
        {
          "text": "Yo those are my real estate agents",
          "score": 3
        },
        {
          "text": "Ahem ahem",
          "score": 1
        },
        {
          "text": "There have been multiple duplicate posts regarding the PLB saga. Please continue the discussion in themegathread.",
          "score": 0
        },
        {
          "text": "CCP controlled.",
          "score": -7
        }
      ]
    },
    {
      "id": "t3_1qsmhwl",
      "subreddit": "SingaporeRaw",
      "title": "This was prominent in the newspapers when I was a kid",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qsmhwl/this_was_prominent_in_the_newspapers_when_i_was_a/",
      "score": 111,
      "num_comments": 10,
      "created_at": "2026-02-01T10:52:42",
      "selftext": "",
      "comments": [
        {
          "text": "Now people just leave less important things like their mobile phones and workplace door cards.",
          "score": 36
        },
        {
          "text": "Lmao just recently I ran into the toilet poster ones. The ones that used to be in school toilets. Nostalgia hit me with the most unexpected shit lol.",
          "score": 35
        },
        {
          "text": "Chew On It!",
          "score": 13
        },
        {
          "text": "Like unexpected shit (metaphor/colloquial use) or unexpected shit (literal)",
          "score": 6
        },
        {
          "text": "I miss these comics very much though I'm not ppap supporter. They have a local touch to it.",
          "score": 6
        },
        {
          "text": "Chew on It!",
          "score": 6
        },
        {
          "text": "Never seen this specific one before, it isn't very relevant by now with people using non-valuables to chope.The toilet ones though, remain relevant through to today (squatting on toilet bowls, not flushing, etc).",
          "score": 4
        },
        {
          "text": "Lmao metaphor. The shiting itself was completely expected, cos I had kfc mala chicken the day before.",
          "score": 3
        },
        {
          "text": "Still have in Chinese, 早报got a website with them. Only thing is, some need Chinese background lah",
          "score": 3
        },
        {
          "text": "I've seen someone use their debit/credit card before",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qslu33",
      "subreddit": "SingaporeRaw",
      "title": "Task Force Man more like Jiak Liao Bee Man?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qslu33/task_force_man_more_like_jiak_liao_bee_man/",
      "score": 104,
      "num_comments": 33,
      "created_at": "2026-02-01T10:22:16",
      "selftext": "",
      "comments": [
        {
          "text": "LOL 3 clowns who have never worked a single day in private sector nor have ever run any business or served any clients...telling u how to run a business ??",
          "score": 33
        },
        {
          "text": "Only know how to fearmonger by telling us we're facing turbulence, uncertainty amidst challenging times. Diam lah! Pay so much for you to tell things we already know? Spend more time giving us your plans and solutions. Imagine going to work everyday and updating your boss that this project is facing challenges and he must be prepared for the uncertainty of it ever being completed. And the only way to succeed is that we must be united, and together, we can.",
          "score": 26
        },
        {
          "text": "who did those commenters vote for?",
          "score": 15
        },
        {
          "text": "How about the jobs taken by FT villages? Nobody told them no more guaranteed jobs?",
          "score": 10
        },
        {
          "text": "As useless as his Useless friend wong",
          "score": 10
        },
        {
          "text": "They voted for... ",
          "score": 10
        },
        {
          "text": "<image>",
          "score": 9
        },
        {
          "text": "The AI part is soooooooooo true. Just type our questions in ChatGPT/Germini and we can get the answers immediately without having to wait for their PR team to draft/vet/copy-paste their signature and post about it.",
          "score": 7
        },
        {
          "text": "dont worry we have skills future",
          "score": 7
        },
        {
          "text": "fuck you understand. your party is the one with the growth at all costs policy, opening the flood gates for immigration while people were warning about job competition. Now that your plan has backfired and endless growth did not result in more local jobs, you use the same tune to warn singaporeans to adapt? Yes, we need to adapt and vote your sorry ass out!",
          "score": 6
        },
        {
          "text": "ChatGPT gives better responses.",
          "score": 5
        },
        {
          "text": "why you all kpkb, this was expected the moment they won... Before errection, talk dragon talk phoenix, after mandate talk cock.",
          "score": 5
        },
        {
          "text": "Tell us something we don't already know...",
          "score": 4
        },
        {
          "text": "Not true. You don’t need to be a barber to know whether a haircut is good or bad. Likewise, I don’t need to have political experience to know that the comments directed to me are useless",
          "score": 3
        },
        {
          "text": "what is the plan when storm comes GKY: \"East Coast Plan.\"",
          "score": 3
        },
        {
          "text": "And need I ask, what is your job then? Isnt your job LITERALLY to lessen/narrow that statistic? That issue?",
          "score": 3
        },
        {
          "text": "Thank you! Exactly my point. So while we have every right to criticise politicians, we shouldn’t regard all their ideas as worthless simply because they didn’t come from the same industries they have now have purview over.",
          "score": 2
        },
        {
          "text": "I love that you mentioned not just FT but foreign talent VILLAGES. Literally all it takes is just one FT to be the head and they will just keep bringing/hiring their own. I’m going to call it, true blue SGP going to be the minority soon if it isn’t already",
          "score": 2
        },
        {
          "text": "Don't create fear how to make people vote for them? Just look at last year snap election. When there is peak fear people flood to stability.",
          "score": 1
        },
        {
          "text": "GKY worked in private sector before though.",
          "score": 1
        },
        {
          "text": "Gan Kim Yong was in private sector.",
          "score": 1
        },
        {
          "text": "Well, by that logic, people who have never worked a single day in a political office nor have ever run any countries or served any constituencies should not tell politicians how to run a country.",
          "score": 1
        },
        {
          "text": "Also CDC vouchers",
          "score": 1
        },
        {
          "text": "Sad Singaporeans adopt so slow. I wonder if before I die I will see opposition as majority in parliament",
          "score": 1
        },
        {
          "text": "<image>",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qslpfa",
      "subreddit": "SingaporeRaw",
      "title": "Melissa Chen, the former Amos Yee advocate claims to have a PhD from MIT. A Redditor searched the MIT alumni directory and found no records of her ever attending",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qslpfa/melissa_chen_the_former_amos_yee_advocate_claims/",
      "score": 46,
      "num_comments": 19,
      "created_at": "2026-02-01T10:16:16",
      "selftext": "It struck me that the US organizations don’t do background check even though it should a very quick easy verification. Like how did she get away with this for so many years? would this kind of fake claims fly in SG?",
      "comments": [
        {
          "text": "That last image is the textbook definition of cringe.",
          "score": 45
        },
        {
          "text": "White worshipper traitor",
          "score": 18
        },
        {
          "text": "Her wedding cost spiraled out of control until her dad no longer funds it. North of 500k SGD IIRC which was crazy in a time when most 3rm condo cost less than 1mil.",
          "score": 8
        },
        {
          "text": "Oxford study",
          "score": 7
        },
        {
          "text": "Super bridezilla until famous wedding planner sue her. Her marriage didn't work out also",
          "score": 7
        },
        {
          "text": "How to check if one graduated from a certain school?🤔",
          "score": 7
        },
        {
          "text": "Many schools have their students Masters and PhD theses accessible. Here I found MIT’s PhD thesis database. https://dspace.mit.edu/handle/1721.1/131022 (Link repaired by me)",
          "score": 7
        },
        {
          "text": "<image> Also let’s not forget the wedding of the year - the reason she changed her last name to hide her past",
          "score": 5
        },
        {
          "text": "She is a good looking charlatan who happened to be lucky enough to be borned into a good Singapore family with money",
          "score": 3
        },
        {
          "text": "What’s the story on this?",
          "score": 2
        },
        {
          "text": "Wtf. 500K for a wedding. Guess it makes sense that the marriage didn’t work out.",
          "score": 2
        },
        {
          "text": "Call the school registrar. That’s the easiest. Also alumni have access to the alumni directory to check",
          "score": 2
        },
        {
          "text": "she quite rich? no need work in life",
          "score": 2
        },
        {
          "text": "In this episode of daily simping...",
          "score": 2
        },
        {
          "text": "definition 'good looking' is doing a lot of heavy lifting here",
          "score": 1
        },
        {
          "text": "Most likely when she studied she use her Chinese names. Even for westerners, their legal name might be completely different from their preferred name. This along with middle name and second family name helped to be a identification document A lot of Singaporeans will be called Melissa, Jane, Jason. But their legal name will be Tan Meiying, Lee SoonChin, Kok Wunlai. But currently there is no mentioned of her PhD in her wikipedia. So meaning this is probably something she made up",
          "score": 1
        },
        {
          "text": "https://singaporedesk.blogspot.com/2011/03/daddy-big-bucks.html sounds like typical entitled liberal leftist rich kid who lives in a bubble",
          "score": 1
        },
        {
          "text": "Siao.",
          "score": -3
        }
      ]
    },
    {
      "id": "t3_1qrvow4",
      "subreddit": "SingaporeRaw",
      "title": "Govt working with Warong Nasi Pariaman to explore options after its closure announcement: URA",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qrvow4/govt_working_with_warong_nasi_pariaman_to_explore/",
      "score": 23,
      "num_comments": 23,
      "created_at": "2026-01-31T15:14:06",
      "selftext": "",
      "comments": [
        {
          "text": "Lmao how is this different from socializing costs and privatizing profits?",
          "score": 33
        },
        {
          "text": "Local businesses are dying a death by a thousand cuts. Labour, raw materials, rental and everything just keep getting more and more costly while prices cannot go up much or the businesses risks having no customers. The government needs to take a holistic approach instead of offering piecemeal support here and there. Otherwise, they are just prolonging the inevitable.....many of these local businesses are already on life support. All the authorities need to do is just ease off on their cost pressure and these businesses can survive on their own.",
          "score": 28
        },
        {
          "text": "Government is the biggest landlord in Singapore. Government is the problem. The \"support\" will only incentivise landlords to raise rental prices....again. Taxpayers should not be socialising the cost of government policy failures. Let all these businesses fail and those areas turn into food deserts. I should not be footing the bill for mismanagement in Arab street or elsewhere if I don't live in that area.",
          "score": 18
        },
        {
          "text": "Government help kpkb. Replaced by PRC eateries/landlord also kpkb. Probably need to start sucking angmoh dick.",
          "score": 10
        },
        {
          "text": "Ms Fauzia Rani, who helps run VSS Varusai Mohamed & Sons, her family business supplying Islamic and Haj-related goods, said despite the Government’s efforts, some feel it may be too late. She said: “So many businesses are already gone.” The horse has left the barn, unfortunately - with the China funds sweeping up all the major neighborhood malls and introducing all the major ChinA food chain, all that the PAP can comment in Parliament when questioned is market forces will sort things out. So be it, lolz.",
          "score": 9
        },
        {
          "text": "isnt our culture erosion already evident yeah increase GDP, yeah increase competitiveness",
          "score": 7
        },
        {
          "text": "Hawker stalls and restaurants with decades of history don't count as heritage businesses? Why gahmen never come to their rescue? What optics is the gahmen showing off this time? Carl Zeiss? Why only treat the symptoms instead of reigning in imported inflation at its source to prevent rent from skyrocketing in the first place?",
          "score": 7
        },
        {
          "text": "Nasi Padang dishes usually are more complex in terms of ingredients and prep, thus more expensive because it takes more time and cost to make.",
          "score": 5
        },
        {
          "text": "It's hard to find Nasi Padang stalls these days, and it's a pity. They really should be protected, but at the same time, they also need to adapt. They always charge premium prices, and with increasing costs and health conscious people, the people that still go to them are simply repeat customers or creatures of habit. Even if they want to continue to charge premium prices, they should really consider offering \"healthier\" options or marketing or something else. It will be a tremendous lost were they to disappear.",
          "score": 3
        },
        {
          "text": "Yeah i love nasi padang but honestly most of the stalls are overly expensive. But understandably so because they dont scale as well as cai png. End result, i only eat it once every 2 weeks.",
          "score": 3
        },
        {
          "text": "Nasi padang is more expensive because a lot of the dishes are very time consuming to make. Singaporeans just need to come to terms with pricing these days.",
          "score": 2
        },
        {
          "text": "Hey, don't tell me.",
          "score": 2
        },
        {
          "text": "To quote a retired MP with 10 or 11 directorship: \"you expect  me to work for free?\"",
          "score": 1
        },
        {
          "text": "They come to terms by not patronizing the stalls. It's one thing being proud of the craft, provided they can first survive as a business.",
          "score": 1
        },
        {
          "text": "Those \"Nasi Padang\" dishes take a long time to prepare and make correctly. They are getting more expensive because labour is also getting more expensive (and also rent). You are paying for the time it takes to prepare these dishes. Try to cook a batch of beef rendang (or any rendang) at home and see what happens. And don't use the \"instant\" method that caterers use.",
          "score": 1
        },
        {
          "text": "This is theatre only lah. The people running the joint are old and want to retire. That’s all. Can’t force them to continue",
          "score": 1
        },
        {
          "text": "All the best to the businesses in the area and other areas that are affected by rising costs too. Thanks for your hustle.",
          "score": 1
        },
        {
          "text": "The PAP would do all this kind of nonsense for optics, but won't impose rent control orrestrict subletting.",
          "score": 1
        },
        {
          "text": "Lol buying votes from that community again. Ironically that community don't eat this nasi frequently because it's priced above what they normally eat.",
          "score": 1
        },
        {
          "text": "Stupid. It was a commerical desicison. The state should not intervene.",
          "score": 1
        },
        {
          "text": "That's the thing, right? Why can't they scale like cai png? Is it because they can't or they don't want to?",
          "score": -1
        }
      ]
    },
    {
      "id": "t3_1qsm6hj",
      "subreddit": "SingaporeRaw",
      "title": "10 Worst Singaporean Foods for High Cholesterol | DigitalHealth.sg",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qsm6hj/10_worst_singaporean_foods_for_high_cholesterol/",
      "score": 12,
      "num_comments": 9,
      "created_at": "2026-02-01T10:37:55",
      "selftext": "",
      "comments": [
        {
          "text": "Unless you suffer from Familial cholesterolemia or other health issues. Dietary cholesterol is no longer seen as a major contributor to poor cardiovascular health.",
          "score": 10
        },
        {
          "text": "https://health.clevelandclinic.org/why-you-should-no-longer-worry-about-cholesterol-in-food",
          "score": 4
        },
        {
          "text": "Eating food with higher cholesterol doesnt affect most people with cholesterol. Its mostly genetic. Be a good patient and take your statin every night.",
          "score": 2
        },
        {
          "text": "Wah, kway chap not in the list, guess i can check out the new stall today.",
          "score": 1
        },
        {
          "text": "causes diabetes, more sugar than you think",
          "score": 1
        },
        {
          "text": "Damn guess I'll die",
          "score": 1
        },
        {
          "text": "Seriously, living and not allowed to eat what you love eating? It's not like one dies eating something right away, though. Then what's the purpose of living? The trick is eating in moderation rather than not.",
          "score": 1
        },
        {
          "text": "The article is also an ad. I might as well go health hub to read up on this.",
          "score": 1
        },
        {
          "text": "Can change title to my favourite local food.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qskrok",
      "subreddit": "SingaporeRaw",
      "title": "Chilli crab, VivoCity, zoo: K-pop star Sandara Park enjoys Singapore trip",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qskrok/chilli_crab_vivocity_zoo_kpop_star_sandara_park/",
      "score": 8,
      "num_comments": 4,
      "created_at": "2026-02-01T09:34:39",
      "selftext": "Kpop support our local food over PRC chain!",
      "comments": [
        {
          "text": "A lot of other celebrities and non-celebrities have been to Singapore and enjoy local food too, I don't see why her trip has to be featured particularly. Is she paid to be an ambassador or something?",
          "score": 1
        },
        {
          "text": "I think they want to draw the STB attention. STB will pay celebrities to perform here. Much like the MTV's that uses Singapore as the background.",
          "score": 1
        },
        {
          "text": "Technically if you are a foreigner, you did be looking for local food… I won’t be going to Japan for mala…",
          "score": 1
        },
        {
          "text": "Pretty sure this applies to basically any artiste who comes here. I'm only familiar with K-Pop artists and they all come here and tell the fans the exact same thing every single time. Chilli crab, Chicken Rice, Kaya toast. This has no link to any \"PRC food takeover\". sidenote: Dara should really just keep to herself. This is the lady who groomed a 14 year old when she was 19.",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qsjt0y",
      "subreddit": "SingaporeRaw",
      "title": "Singapore Food Agency recalls two more Dumex infant formula batches after tests detected cereulide toxin",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qsjt0y/singapore_food_agency_recalls_two_more_dumex/",
      "score": 2,
      "num_comments": 0,
      "created_at": "2026-02-01T08:52:45",
      "selftext": "",
      "comments": []
    },
    {
      "id": "t3_1qso43y",
      "subreddit": "SingaporeRaw",
      "title": "Hot weather coming back",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qso43y/hot_weather_coming_back/",
      "score": 1,
      "num_comments": 7,
      "created_at": "2026-02-01T12:08:51",
      "selftext": "How r u coping",
      "comments": [
        {
          "text": "It’s still very windy at my area",
          "score": 2
        },
        {
          "text": "Good for cycling",
          "score": 2
        },
        {
          "text": "Ah for me yesterday it started to get hot alrd. The past few nights I didnt even need to turn on fan. Just open window can alrd",
          "score": 1
        },
        {
          "text": "Oh which area are you at? I’m still sleeping without aircon hahahah",
          "score": 1
        },
        {
          "text": "Hide in aircon places",
          "score": 1
        },
        {
          "text": "I want my cold weather back..",
          "score": 1
        },
        {
          "text": "Hot in the day is ok as long as cool at night, which is perfect. Clothes dry easily in the day and less need for air con at night",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qrwz7j",
      "subreddit": "singaporefi",
      "title": "Gold sinks to $4,900, silver crashes 25% as precious metals trade unwinds",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qrwz7j/gold_sinks_to_4900_silver_crashes_25_as_precious/",
      "score": 132,
      "num_comments": 41,
      "created_at": "2026-01-31T16:30:52",
      "selftext": "Monday will be interesting.",
      "comments": [
        {
          "text": "Where is the person that wanted to investing their and their mother's money into gold.",
          "score": 164
        },
        {
          "text": "Update: He is doing grab nao",
          "score": 60
        },
        {
          "text": "This is the part where if you are into Gold and Silver, investment you enter",
          "score": 52
        },
        {
          "text": "There's always people convinced that this time the top is really in and they want to score a Big Short-style win. This guy is just the one who got the timing right.",
          "score": 52
        },
        {
          "text": "Did anyone here managed to short gold before the drop? Saw a post onr/wallstreetbetsthat someone was all in shorting gold like 1 or 2 days before this happened. Like how did he know.. did anyone here saw this coming?",
          "score": 36
        },
        {
          "text": "And those selling their mothers to invest in silver because \"gold is overpriced\" ...",
          "score": 34
        },
        {
          "text": "More like comex and Shanghai exchange upped margin requirements and then people started getting liquidated due to over leveraged.",
          "score": 32
        },
        {
          "text": "Because a new Fed Chair was nominated.",
          "score": 16
        },
        {
          "text": "RIP to sinkies who chased and bought the top LOLLLLL",
          "score": 15
        },
        {
          "text": "Literally everything experiences correction after reaching all time highs. Oxymoronic statement",
          "score": 14
        },
        {
          "text": "he just sold his mother",
          "score": 10
        },
        {
          "text": "Gold yes, silver can wait",
          "score": 9
        },
        {
          "text": "You saw one post; you haven’t seen 10k others that probably were shorting from way lower. How he know? You didn’t know if he was killed 100 times shorting from a lower level. Take whatever you read with a pinch of salt. But if what you see is true; you see the insanity of the rally, a pullback is only to come. How you manage your risk and profit from that is another question. And are the metals really going to crash from here? It bounced off a strong support; if you are so certain it will go down more, we shall see.",
          "score": 9
        },
        {
          "text": "Unlikely the main reason. Sliver has delivery concerns with contracts that expire in march, it’s simply banks trying to cover their losses or force contracts holder to settle the contracts at lower prices. Also it is worth noting that these metals closed +13% for gold and +18% for silver in Jan 26 alone. Adding to that, gold is only down -1.85% from this week’s open. So if this week’s open was a good price, I don’t see why today’s prices isn’t. I’m sure that there is a serious valuation concern here rather than just an exchange increasing margin requirements.",
          "score": 9
        },
        {
          "text": "The sentiment has always been that it is due for correction. If not this week, then next week. But i bet many people dont expect such significant drop",
          "score": 6
        },
        {
          "text": "Ok..dismissing the question asking you to justify your valuation..I get that maybe it’s truly a difficult question for gold enthusiasts",
          "score": 4
        },
        {
          "text": "Blow off top movement in silver market",
          "score": 3
        },
        {
          "text": "There is a serious valuation concern, that was triggered by the margin requirements and then the cascading effect happened. Classic over leveraged meltdown. this week’s open was a good price The issue is futures are all traded on margins. It’s not about absolute price but marginal difference. Now that a large chunk of specs have been burned you don’t have the same specs buying in because they are out of cash after being margin called on Friday.",
          "score": 3
        },
        {
          "text": "Silver still can wait. Anyways, it’s quite a risky product which its movement is unpredictable.",
          "score": 2
        },
        {
          "text": "What’s the valuation of gold? Just like bitcoin it’s value is imaginary",
          "score": 2
        },
        {
          "text": "Yeah the market can stay irrational longer than you have money to short.",
          "score": 1
        },
        {
          "text": "It does have industrial and decorative value but that is far lower than its price and also far lower than its speculative value, building on your point.",
          "score": 1
        },
        {
          "text": "Why don't you tell us then? Even you don't know the answer because Gold cannot have a valuation. Originally it was a hedge against inflation and to preserve your purchasing power....until recently.",
          "score": 1
        },
        {
          "text": "Ur argument is perfect bc by induction everything is imaginary. Thank you for ur contribution!",
          "score": -4
        },
        {
          "text": "Nothing new. History has shown gold and silver always experience correction after reaching all time highs",
          "score": -7
        }
      ]
    },
    {
      "id": "t3_1qs11kl",
      "subreddit": "singaporefi",
      "title": "Is it still realistic for CS grads nowadays to expect a $7k starting pay like before?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qs11kl/is_it_still_realistic_for_cs_grads_nowadays_to/",
      "score": 87,
      "num_comments": 196,
      "created_at": "2026-01-31T20:25:27",
      "selftext": "Hi all, I’m asking on behalf of my cousin who doesn’t use Reddit. He’s currently a JC2 student and has a strong interest in coding. However, after seeing the wave of tech layoffs in recent years, he’s starting to reconsider pursuing Computer Science (or IT in general), especially with the narrative that AI may replace entry  to mid level software engineers.\n\nGiven the current landscape, is it still realistic for CS graduates to expect starting salaries around $7k like in the past? How achievable is that today? From what I understand, CS intake is still among the most competitive, comparable to engineering courses. Would appreciate insights from people in the industry.",
      "comments": [
        {
          "text": "For the last time: CS is NOT a field to join if your goal is to chase money. It pays well if you’re good at what you do and can keep improving as things change. Look from the company’s perspective and ask yourself why they would hire a fresh graduate for 7k. What magical concepts of software do you have that an existing developer with experience cannot do at a lower salary? Do you really think that piece of paper you call a degree is going to magically allow you to do the work that needs to be done?",
          "score": 276
        },
        {
          "text": "Just to add on, many MNCs like mine also have Dev hubs in India and China. Why would we ever want to hire a sinkie fresh grad for $7k ?",
          "score": 175
        },
        {
          "text": "Honestly, the 2017-2022 tech market won’t return. The negative interest rates are gone, nobody is there to invest in competitors/disruptors anymore and the need for more people is gone. This peaked in 2020-22 because of the pandemic. We are in shareholders economy now. This is what killed it, not AI. Tech will continue to be incredibly lucrative but it will be closer to what other fields are — talent will always make huge money, even with AI in the picture. The top 10% will be even better paid than now, the top 1% will be extremely well paid, the top 0.1% will be ridiculously paid. The 90% under them will suffer a lot, most will exit the industry. More or less, it will become like Sales, Real Estate etc.",
          "score": 112
        },
        {
          "text": "even the Sg dev positions are taken by foreigners.",
          "score": 37
        },
        {
          "text": "Case competitions, internships, personal projects - which CS kid doesn't have all of these? Having these things are now the norm and not the exception.",
          "score": 32
        },
        {
          "text": "For the exact same reasons why we as a country haven't collapsed yet. Silicon Valley is more than just SWEs. There's a whole eco system there, VCs ancillary services, design. And the experienced SWEs there already pivoting to AI type work. Its the junior / entry level roles that have been  decimated.",
          "score": 29
        },
        {
          "text": "Your comment is an extremely good example of why CS grads are struggling to find jobs. In the process of overvaluing your degree, you take offense at me diminishing the effort you put in to completing it but you fail to notice my main point. Your degree does not do anything for an employer beyond giving them a certain level of confidence that you’re not a total newbie they need to give lessons to - it’s merely a step in the vetting process. There is a reason technical interviews are less forgiving nowadays. If anything it increases my costs vs the amount I earn from delivering a feature to the client. You can believe what you want to in terms of how much value it holds, but if you’re not competent in terms of skills/experience based on what the company needs you’d be weeded out during the interview process/probation period regardless.",
          "score": 22
        },
        {
          "text": "I think you're ridiculously out of touch with reality and placing too much emphasis on university degree. I went to a local U and I can outright say university education is almost worthless. People can succeed without it, so what makes university education standout? It was the path to success during our parents time, but when something becomes a commodity - it's not special anymore. To also prove a point: I pivoted into tech with a totally unrelated degree - meaning my degree is a worthless piece of paper. Given that I can get into tech without a CS degree, a degree is not as important as you think. Also your earlier points: had been exposed to many different case studies needed to be solved accumulating internship experiences in the relevant field, plus participating in competition / case summit in the relevant field who doesn't have this la dude? you are just 1 student, every single one of the few thousand students have this. what makes you so special? please get in touch with reality. Just because something irks you / makes you uncomfortable does not mean that the person was wrong and you're right - which in this case you're clearly wrong.",
          "score": 19
        },
        {
          "text": "You are wrong. Even the downvoting has been outsourced.",
          "score": 10
        },
        {
          "text": "Feels like average finance vs high finance. Average used to be extremely well paying decades ago when accounting was a thing. Now its just, meh.",
          "score": 9
        },
        {
          "text": "They're expensive because some of them are actually really, really good compared globally. But the main reason is that it's the local office that's hiring, and the cost of living is so ridiculous that you HAVE to be willing to fork out that amount if money or no serious candidates will entertain your posting. Median home prices (in USD) in the area:\nSunnyvale and Mountain View = $2M\nCupertino = $2.8M\nLos Gatos = $2.5M You're talking average houses, not great, and not in the best locations.",
          "score": 7
        },
        {
          "text": "Well said. Everyone against your points are basically the reason why foreign company no longer pay us high wages, they are too damn duff to understand the reality. AI will also wipe those people out, and all they probably will blame on is the government.",
          "score": 4
        },
        {
          "text": "They import from India etc.. you will be amazed by how many foreigners in Silicon Valley.",
          "score": 2
        },
        {
          "text": "Agreed with u . Those who managed to switch jobs/careers during that period were lucky. Need to adapt with new era now",
          "score": 2
        },
        {
          "text": "Yes, the point at which my friends went from working in tourism or construction industry to earning way above the median salary after a single coding bootcamp, it started being very suspicious. They did put a lot of work, but 6-9 months for a career change (while you still work full time) and you end up multiplying your salary, this is the definition of a market bubble.",
          "score": 2
        },
        {
          "text": "There is no relevance between having a degree and pivoting. I could take my degree and try applying for law school / med school / business school and would be asked to start all over again. When I pivoted, I started on a clean slate. There is absolutely zero correlation between having a degree and pivoting.",
          "score": 2
        },
        {
          "text": "exactly, many people think this is unique to SG, come on it's happening in every developed country",
          "score": 1
        },
        {
          "text": "Ecosystem and access to investors who understand risk and exits.  Also, close to major market, easier to get marketing people who understand their audience and the engineers under the same roof. The next best markets for that would be India and China. Singapore had some success with China washing Bytedance and other Chinese tech companies, as well as being a tax haven for regional HQs for Meta et al.  But that’s going away fast. There’s no organic reason for a Singapore Silicon Valley to exist, just like there’s no reason for Qatar to be a tourist hub. Once the government money tap is switched off, the companies will move on as demonstrated by our failed attempts to import industries (Dyson, Lucasfilm, all the various game companies etc). The ones that stick are manufacturing due to access to markets (Pharma, oil etc), but we’ve stupidly thrown away our manufacturing lead by chasing all our support industries away.",
          "score": 1
        },
        {
          "text": "You do you.. Having a degree clearly and definitely have made a positive difference in my case.",
          "score": 1
        },
        {
          "text": "Agreed and salty sinkies downvoting you",
          "score": -4
        },
        {
          "text": "It is easier to pivot because you had a degree. Likewise, I have had more career opportunities when I have a degree than when I had only a diploma.",
          "score": -8
        },
        {
          "text": "Guess your very last sentence can be applied to yourself.",
          "score": -8
        },
        {
          "text": "If what you say is true, then why Silicon Valley has not collapsed yet? The engineers there is so damn expensive and India software Engineers in India already exist for decades, why hasn't Silicon Valley disappear?",
          "score": -15
        },
        {
          "text": "Omg of course I know. Again, my point is that degree is not just a piece of paper, but how the earlier comment which I replied to, said that \"... that piece of paper you call a degree ...\" really irks and makes one uncomfortable when reading this. It also sounds like someone who never went to local U, or someone who does not value his/her degree at all.",
          "score": -27
        },
        {
          "text": "A degree cannot only be a paper, especially local U degree. While I was pursuing my local degree, I had been exposed to many different case studies needed to be solved, accumulating internship experiences in the relevant field, plus participating in competition / case summit in the relevant field, etc. throughout the four years. It is not about just sitting down listen to lecture and then get a piece of paper. I have learnt sooo many things from the university years that workplace could not bother to teach. While I am not saying someone must get 7k, but my point to your comment is to not be this under-estimating of the local U degree and the experiences and opportunities your local U had sourced for you. They had been useful resources. And I am not talking about private U degree.",
          "score": -57
        }
      ]
    },
    {
      "id": "t3_1qrxpq0",
      "subreddit": "singaporefi",
      "title": "JP Morgan Investment Funds 11% dividend - what’s the catch?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qrxpq0/jp_morgan_investment_funds_11_dividend_whats_the/",
      "score": 37,
      "num_comments": 30,
      "created_at": "2026-01-31T17:15:56",
      "selftext": "I invested 80k plus in JP Morgan Investment Funds as its unbelievably high 11% pa dividend is very attractive. Started July last year and I indeed have been receiving close to the promised amount every month - refer to the 3rd and 4th screenshots from my FSMone account.\n\nWhat’s the catch though? It feels too good to be true and I’m a bit anxious that there might be a trouble brewing *touchwood*\n\nYes I’m aware that the measly 0.20% growth is probably one of the downside but honestly I don’t think it’s that bad? As a comparison my VWRA has always been in red around -0.5% to -1.5% the past few months.",
      "comments": [
        {
          "text": "You happened to buy it at a very very good time for bonds. Basically there was a bond bloodbath in 2022 when interest rates were jacked up (so older low interest bonds inside bond funds lost value. Then as the Feds have been cutting interest rates over the past one year plus, those bond funds are regaining value because the old, high interest bonds inside are better than the newly issued ones. You should also know that there are 2 versions of this fund. Yours is “icdiv” and there is another “irc”. https://www.ifastgm.com.sg/igm/admin/buy/highlight/highlightJPM139.pdf Dividends paid by “(irc)” share classes are further adjusted, up or down for, respectively, an estimated positive or negative interest rate carry.\nDividends paid by “(icdiv)” share classes are expected to include a distribution from\ncapital as well as the gains of the Share Class. It sets a predetermined percentage\nrate that is not linked to income or capital gains. During periods of negative performance, the dividend will normally continue to be paid and the value of the investment may fall more rapidly. The overall returns of the two versions are the same (can see on your FSM), but the “irc” dividend yield is only 6+%, while the NAV went up 5%. So I think the “real” dividend is 6%, and when the bond prices went up, your version “icdiv” gave out that gain as extra dividends to maintain the price. I would not expect this fund to continue to perform this spectacularly in the future.",
          "score": 61
        },
        {
          "text": "This sub loves dividends but dividends aren't \"free\"   the company pays these from their profits because they can't reinvest in other areas thus hindering growth.  It may be 11% this year and it may be 1% next.  The stock price can also go down cutting into your investment. If you didn't care about your initial investments and just want a monthly, quarterly, yearly payout, you'd explore annuities.",
          "score": 28
        },
        {
          "text": "Learn the basics first: Total Shareholder Return = Capital Gains + Dividend, don't focus on one over the other, and both are the same dollars to your wallet.",
          "score": 26
        },
        {
          "text": "But this mutual fund is still better than going through agent and getting ILP. So let him buy it",
          "score": 16
        },
        {
          "text": "This is the only correct answer in the thread so far.",
          "score": 11
        },
        {
          "text": "From the Product Highlights Sheet: WHO IS THE PRODUCT SUITABLE FOR?\nThe Sub-Fund is only suitable for investors who: – seek income through exposure to a range of asset classes; and – are looking to use it as part of an investment portfolio and not as a complete\ninvestment plan. The principal of the Sub-Fund may be at risk. <= this is the “catch” .",
          "score": 6
        },
        {
          "text": "Look at South American O&G companies like Petrobras or Ecopetrol, these are well managed companies with extremely low PE and super high dividend yields (10-15% pa over past few years).\nThey’re that cheap because there is a (manageable) political risk. But honestly I’ve owned them for several years and never was worried about governance",
          "score": 6
        },
        {
          "text": "This thread emphasizes that, generally, this sub doesn't know anything about fixed income. (Not everyone, there is one correct answer below.)",
          "score": 5
        },
        {
          "text": "Did you read OP and check that some of the underlying is bonds, not stocks?",
          "score": 4
        },
        {
          "text": "Tbf annuities are very different to dividend paying. Annuities are structured from “non-productive” assets, while dividend paying companies are productive. It does tend to carry equity risk, so you need to also be aware of that. That being said funds that pays high amount of dividend tend to be red flag, either it contains junk or it pays from its own capital.",
          "score": 3
        },
        {
          "text": "i mean as an income fund, it will definitely underperform your usual index. Just like PIMCO, it may eat into your NAV if they cannot generate enough distributions",
          "score": 3
        },
        {
          "text": "NAV erosion, even high yield bonds can't sustain this high of a dividend payout.",
          "score": 3
        },
        {
          "text": "Yea in layperson speak - it’s basically\n receive ‘contractual’ income from gains if there is any otherwise pay down principal/ capital. Assuming the fund generates lifetime returns of 0% gross, and income is not reinvested, your investment will approach 0 at some point.",
          "score": 2
        },
        {
          "text": "Anything js better than an ILP. \nLikely the strongest option is a global etf or a usa focused etf.",
          "score": 2
        },
        {
          "text": "6.8% of the fund is in another JPM fund and the expense ratio of OP's fund is a whooping 1.45%! https://secure.fundsupermart.com/fsmone/etf/factsheet/109599268/JPM-Nasdaq-Equity-Premium-Income-Active-UCITS-ETF-USD-Dist",
          "score": 2
        },
        {
          "text": "It is also stated that: The risk is particularly higher for investors in (icdiv) share class(es) given its higher distribution rate relative to other share classes.",
          "score": 2
        },
        {
          "text": "Could be HY bonds. Could be eroding the NAV. 11% is non IG territory.",
          "score": 2
        },
        {
          "text": "the catch is that u lose on capital depreciation",
          "score": 2
        },
        {
          "text": "Curious..the dividends, is tax exempt for Singapore residents?",
          "score": 2
        },
        {
          "text": "You obviously did not read the post, as he is obviously not holding bonds directly. Stop LARPing.",
          "score": 1
        },
        {
          "text": "Yeap saw the factsheet, ~76% of the bond portfolio is rated <BBB",
          "score": 1
        },
        {
          "text": "Yes. This is a unit trust, and it’s a bond fund.",
          "score": 1
        },
        {
          "text": "The catch is that sometimes the principal is drawn down to pay the dividends. Maybe it was also affected by the USD depreciation. Better to check if they buy junk corporate bonds or Mortgage backed securities too.",
          "score": 1
        },
        {
          "text": "Bonds dont pay dividends.",
          "score": 0
        },
        {
          "text": "Uhm VWRA is up more than 10% since July last year (in both USD and SGD), which is a 20+% annualised gain in comparison.",
          "score": -2
        }
      ]
    },
    {
      "id": "t3_1qs0iy3",
      "subreddit": "singaporefi",
      "title": "Losing 20k due to a bad decision - cut losses now or suck it up",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qs0iy3/losing_20k_due_to_a_bad_decision_cut_losses_now/",
      "score": 26,
      "num_comments": 39,
      "created_at": "2026-01-31T19:59:00",
      "selftext": "Trusted a friend from many years back and bought an ILP last year, need to pay for 5 years (20k per annum) with lock in period until 8th year. Understand surrender value is 100% for first 2 years. Was promised 7% growth yearly, which i found out later refers to dividend growth and not capital growth. Was also told its capital guaranteed and turns out its only capital guaranteed upon death and not otherwise. Yes, I know I made a mistake. Should I surrender now before paying the Y2 premium or treat this as a forced savings plan instead?",
      "comments": [
        {
          "text": "20k per annum man. Sponsoring your friend vacation and siam diu flower expenses.",
          "score": 96
        },
        {
          "text": "Nah, OP himself also greedy af. See big numbers from just back of napkin calculations then likely sign without thinking that just because you got 1.6k a month free now doesn't mean you don't need it later",
          "score": 14
        },
        {
          "text": "do you have details on what was the invested underlying assets or there was none disclosed ? cos u can probably check the value of the underlying assets then see if the funds u purchased bgt any units or was it completely unknown",
          "score": 13
        },
        {
          "text": "Don't phrase it like that man. You are paying exorbitant fees. The Agent is the one who should have a duty to keep you updated.",
          "score": 13
        },
        {
          "text": "If you have only paid the first year of premiums, you can probably still be ahead if you surrender and invest yourself. After the second and third year, it's not so clear.",
          "score": 10
        },
        {
          "text": "Was \"capital guaranteed\" the actual words used or did he mention upon death? Cause you can report him for false information and get your money back. Also, im assuming the fund he recommended is Allianz's dividend and growth fund?",
          "score": 9
        },
        {
          "text": "if u are still buying ILP in 2026 u are asking to get scam.",
          "score": 9
        },
        {
          "text": "AIA global adventurous income fund. Yeah yeah the underlying fund is Allianz lol. Seems like your friend dosent know how a NAV reducing dividend fund works. Yeah he said capital guaranteed. Any avenues for recourse? Submit a request to FIDREC and see what they can do about it. Worse case is you suck it up and keep the policy since you are unlikely to lose money with that fund if you keep reinvesting the dividends.  But make sure to make your agent go drink kopi. We don't need such agents around.",
          "score": 7
        },
        {
          "text": "Never trust insurance agents and financial advisors . lesson learnt",
          "score": 5
        },
        {
          "text": "AIA global adventurous income fund. Yeah he said capital guaranteed. Any avenues for recourse?",
          "score": 3
        },
        {
          "text": "Your friend earn big for the first 2 years, might as well bite the bullet n just continue till 8 years",
          "score": 3
        },
        {
          "text": "Your friend driving new lambo",
          "score": 3
        },
        {
          "text": "1.6k per month damn",
          "score": 2
        },
        {
          "text": "Undisclosed. FA told me he would manage fund switching and follow up actively but within 1 year only fund switched once. Wasn't updated and I fell quite ill during 2nd half of last year hence I also did not do my due diligence to follow up.",
          "score": 2
        },
        {
          "text": "Did you sign a consent to allow him to manage fund switching ? Personally - i dont recall there is such a form to allow FA to manage this. it does sound dubious . But it is good evidence (if you have it on record ie whatsapp etc) cos it means you can go the insurance company and show proof of mis selling if you did not consent. Regardless - just ask the FA to stop doing the funds switch - ie you withdraw your consent and then ask him to disclose the underlying. Write it and not verbal. Then there is some duty for him to do this by certain working days etc. Then from there u can start mapping out the necessary",
          "score": 2
        },
        {
          "text": "He said he guarantees this is NOT an NAV reducing dividend fund",
          "score": 2
        },
        {
          "text": "Lol so he promised 7% growth + dividend on top? I can tell you that even people in this sub will queue up to sign up for such an investment plan.",
          "score": 2
        },
        {
          "text": "Well if that is true and you have a record of it (else, try and see if you can tease it out of him/her), you should definitely try to speak to FIDREC and also file an official complaint with the insurance company. You should be able to get a full refund in the context that you were misled to purchase the product.",
          "score": 2
        },
        {
          "text": "Treat this as a forced saving plan, report that friend now if your friend is an FA.",
          "score": 2
        },
        {
          "text": "Complain to mas that you were conned.",
          "score": 2
        },
        {
          "text": "Sounds like platinum wealth venture - overall return is 7+ % Reinvest the dividends and keep is my suggestion",
          "score": 2
        },
        {
          "text": "Idk about some other companies but usually you’ll have access to which funds have been purchased. Thats my experience with Manulife and GE at least. From there you can see which are the funds, how much the fees are and whether you should continue. Unpopular opinion but dividend funds are not all bad, especially if you’re super new and need to see tangible returns, or if you’re retiring and have a short runway for investing, and just want to withdraw expected amounts regularly. This sub is very much against going thru FAs but they’re not all inherently bad. Disclaimer: I’m not an FA, just someone who have met some very good FAs",
          "score": 1
        },
        {
          "text": "Platinum wealth venture grew 20+% from inception until now, S&P grew 50% at the same time. It’s quite a shit plan",
          "score": 1
        },
        {
          "text": "Learnt your lesson and move on",
          "score": 1
        },
        {
          "text": "Lol boss. I told him from the start I am not investment savvy. He said this the best plan for such people because it is capital guaranteed and it pays minimum 7% dividends quarterly. I've already been uncomfortable for 1 year about this. I am not okay with taking a more risky or aggressive approach, hence I am digging in my heels about it. I also instructed him to reinvest the dividends but he did not do so.",
          "score": -16
        }
      ]
    },
    {
      "id": "t3_1qs4jw1",
      "subreddit": "singaporefi",
      "title": "Is achieving $100k in your mid 20s difficult?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qs4jw1/is_achieving_100k_in_your_mid_20s_difficult/",
      "score": 26,
      "num_comments": 60,
      "created_at": "2026-01-31T23:00:53",
      "selftext": "I feel like everywhere I see there are many people that complain achieving $100k net worth is only achievable if your parents support you. Is that really the case or are there actually many people in their 20s that have already achieved that milestone?",
      "comments": [
        {
          "text": "Depends on your definition of \"difficult\". If 10% of fresh grads can achieve it, is that considered difficult? 100k is just saving 1k a month for 8 years or 2k a month for 4 years. But to be honest, this is the first time i hear people complain about not achieving 100k in the 20s lol. And also what's the definition of parent support? Is living in parents' house rent free considered as support? What about secondary school allowance? Cny ang pao? Edit: people usually talk about 100k by 30, not 100k by mid 20s",
          "score": 85
        },
        {
          "text": "$100k by mid 20s is child play for this sub. The majority of ppl here are gunning for 1m by 30.",
          "score": 76
        },
        {
          "text": "Mid 20s can be difficult. Late 20s definitely can.Then suddenly need money for marriage, BTO, and reno. Start all over again.",
          "score": 50
        },
        {
          "text": "Mid 20s just graduate tho. the 100k come from where sia",
          "score": 36
        },
        {
          "text": "Most people here  draw 100k a month",
          "score": 31
        },
        {
          "text": "Yeah i don’t get how some people are flaunting their 100k wealth in their 20s like it is a permanent feature and easily achievable by all to the point one would be considered a failure if they cannot achieve it. I’m like so what? I got to 100K and then then immediately have to settle marriage and housing in my late 20s. Boom half of it was gone and had to rebuild. It was painful. Even more painful for my married friends who choose to have kids immediately thereafter. There is simply little to no opportunity to save up meaningful wealth. There’s honestly no point in harping on a target number that is 100k. As you reach life milestones, big ticket expenses have to be dealt with and the reality is net worth will fluctuate from year to year. As long as you set aside a decent proportion in your investment portfolio (read: for retirement) that you do not need to draw down from, continue sustaining a monthly contribution to this portfolio throughout the big ticket spending period, AND ensure that your CPF is on track to meet FRS/ERS before 55, you’re good already.",
          "score": 21
        },
        {
          "text": "60k is slightly below median income (of all age group) eh, and you forgot CPF, don’t stress people out lah",
          "score": 19
        },
        {
          "text": "lmfao 100k a month thats peanut to me",
          "score": 15
        },
        {
          "text": "if you do the math, its easily achievable if the person did not go uni",
          "score": 13
        },
        {
          "text": "And also what's the definition of parent support? Is living in parents' house rent free considered as support? What about secondary school allowance? Cny ang pao? The definition is: \"whatever i get from my parents isnt considered as parent support. Whatever others get from their parents that exceed mine, is considered as parent support.\" /s",
          "score": 8
        },
        {
          "text": "Sir, everyone here 100k a week",
          "score": 8
        },
        {
          "text": "1 year lets say around 60k, spend sub $1k per month (esp if living with parents), 2 years 100k already. Ladies can achieve that around 25yo, guys maybe 26-27. Maybe give a while more cause tax reduce a bit.",
          "score": 7
        },
        {
          "text": "If you are self-funded, paying for your own school fees / no scholarship, then ya you will naturally be set back 20-40k naturally. Also depends if u r giving money to ur parents as well. For me, my aim at first two years of work was to pay back all loans and have zero debt. Then, 3rd and 4th year was to save so that I can live off 1 year of savings - after that then I started investing. This was on top of giving my parents + other charity works + insurance spending ~2k/month. Most impt is to do well at work also. I started with a 65k/yr salary, after 5ish years of promotions, my annual is around 110k/yr at 31. Still a ways to go to reach 100k in savings + investments yet but I can afford to live very comfortably. Once wedding and reno comes that will take a huge hit 🤣🤣🤣",
          "score": 7
        },
        {
          "text": "Yeah i honestly don’t get how some people are flaunting their 100k wealth in their 20s like it is a permanent feature and easily achievable. I’m like i been there done that and then you have to settle marriage and housing by your late 20s. Boom half of it was gone and had to rebuild. It was pain I wont say its painful. The money is being used exactly for what its for. Funding you as you're moving to a different phase of life. AND ensure that your CPF is on track to meet FRS/ERS before 55, you’re good already. Great on you for saying this. I have beef with Internet influencers who portray FIRE as something that is achievable for any tom, dick or Harry. Leading to a generation of men who feel aggrieved that they can't achieve something which has always been available only to a small, small minority.",
          "score": 6
        },
        {
          "text": "Achieved it while in college. Tbh I think this is super person dependent for my case it was primarily online tutoring (high profile IB tutoring which paid pretty well per hour), internships (consulting, finance and tech internships pay well) and aggressive investing (I invest heavily in tech and crypto which has done well on a YoY basis despite short run volatility). if you have a marketable skill that pays well per hour it’s definitely viable without a silver spoon.",
          "score": 6
        },
        {
          "text": "It depends when you start work and what large expenses you have planned. I hit 100k after working 3 years after graduating. I acknowledge that I had life easier than most people even though my family was lower income. My personal experience was that saving money was more impactful to my first 100k than my investment returns. It's easier to save $500 off an impulse buy, than to get $500 in the short time. My budget has loosened up a lot since my first 100k. Now I focus more on how to make more money than how to save money. But that first 100k remains the biggest transformation of my financial literacy.",
          "score": 5
        },
        {
          "text": "Sir it's 10k a month",
          "score": 4
        },
        {
          "text": "Depends, I guess. If you can land a $230k job within two years of working for the same company then $100k is easily doable.",
          "score": 3
        },
        {
          "text": "It was hard for me.. I had $2k savings and $25k loan  when I guaduated at 23 years old. Then I went on to get married and buy a 4 room HDB at 28 years old. It was already good that I wasn't in huge debt, much less having $100k",
          "score": 3
        },
        {
          "text": "This needs to be the top comment.",
          "score": 2
        },
        {
          "text": "Unfortunately I dont have a shortcut to hit 230k/year with 2 years of experience, maybe someone can teach the ways",
          "score": 2
        },
        {
          "text": "I think not just parental support should be counted, but also parental obligation/allowance, as part of the whole equation, from your early to late 20s If every month, you save aggressively and can funnel all your savings after expenses into investments, you can hit 100k pretty fast after a few working years. But if you have to pay off your student debts without a single cent from your parents, and also have to give them allowance and pay for the household expenses, then definitely your runway to 100k will be slower and require a few more years than those without these obligations.",
          "score": 1
        },
        {
          "text": "Sir, this is a Wendy's",
          "score": 1
        },
        {
          "text": "Also decreasing your spend definitely helps. I think the good thing about working for most hours of the day is that you naturally rest less and have less time to spend money haha",
          "score": 1
        },
        {
          "text": "i hope you are not joking when you say this, because 1m by 30 is a very realistic goal",
          "score": -6
        }
      ]
    },
    {
      "id": "t3_1qsn3hw",
      "subreddit": "singaporefi",
      "title": "STI sets new records above 4,900, JPMorgan lifts 2026 target to 6,000",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qsn3hw/sti_sets_new_records_above_4900_jpmorgan_lifts/",
      "score": 10,
      "num_comments": 5,
      "created_at": "2026-02-01T11:20:17",
      "selftext": "",
      "comments": [
        {
          "text": "Not vested but this should be an overall good sign if it lasts right?",
          "score": 4
        },
        {
          "text": "Good for boomers I guess. For peasants just means price of everything going to rise as usual",
          "score": 4
        },
        {
          "text": "JPM is also an appointed manager under the EQDP program. There is of course complete objectivity in their statement",
          "score": 2
        },
        {
          "text": "Agree with you bro, better cash out soon",
          "score": 1
        },
        {
          "text": "top signal, local banks going to crash",
          "score": -3
        }
      ]
    },
    {
      "id": "t3_1qsntci",
      "subreddit": "singaporefi",
      "title": "First time working in a stat board here — previously from the private sector",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qsntci/first_time_working_in_a_stat_board_here/",
      "score": 8,
      "num_comments": 5,
      "created_at": "2026-02-01T11:54:17",
      "selftext": "Just curious how performance bonuses typically work for civil/public servants. Is there a rough range depending on grade or performance? And when are bonuses usually paid out during the year?\n\nTrying to calibrate expectations coming from private industry. Appreciate any insights",
      "comments": [
        {
          "text": "March - PB/Promotion\nJuly - Variable bonus, normally 0.5 month \nDec - AWS + variable bonus For PB, depends on your ministry/agency/rank. \nBut rank and file normally: C is 1 month, B is 1.5 month, A is 2 months. First year have this thing called the “Default C” ranking, unless you are scholar or highly favoured by management.",
          "score": 5
        },
        {
          "text": "PB is your performance bonus based on your work appraisal. Variable bonus is the bonus that’s usually announced in the news",
          "score": 3
        },
        {
          "text": "Depends on the stat board, some may have a different bonus structure like AWS + PB or just Corp Bonus",
          "score": 2
        },
        {
          "text": "Whats the difference between PB and variable bonus?",
          "score": 1
        },
        {
          "text": "Typical public servant system: Performance bonus is given out in end-March or early April based on performance evaluation conducted at the end of the year. There is a grading system with “bell curve” (a skewed one). More than half have to get C or “good” aka satisfactory. Very few have to go into unsatisfactory. Only a certain percent can get B or A (or very good or excellent). There can be B+ C+ as well but not many. So the problem is that usually too many managers will give their staff higher ratings, then there is a system for the managers to get together and work it out to force the performance ratings at each job grade level to fit the required proportions. Some exceptions can be made but they need strong justification for upper management to approve. Unfortunately, being “first year in grade” means a default “satisfactory” rating, and strong justification is needed to give anything higher. Number of months of bonus is tied to performance rating.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qs7877",
      "subreddit": "singaporefi",
      "title": "Where to park money",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qs7877/where_to_park_money/",
      "score": 7,
      "num_comments": 16,
      "created_at": "2026-02-01T00:43:25",
      "selftext": "Hi all. Like to hear some opinions. Have about 8-10K cash of kids’ ang pao money lying around sitting in pathetic interest bank. Suggestions where I can a located the money to? Average to low risk and long term. I think FD really cannot make it. The money was in FD for a year previously. Also what do your think about Mari gold for quick returns? Thank you so much.",
      "comments": [
        {
          "text": "I vwra in ibkr under separate account under my name. Plan to give my kid when they are both financially savvy and need it.",
          "score": 9
        },
        {
          "text": "Hmm gold price may be choppy. If you are really targeting long term you can just choose indices. Your kids would thank you in the long run.",
          "score": 5
        },
        {
          "text": "Markets just crashed last week. If you haven't been piling into the big tech names, you shouldn't be investing.",
          "score": 1
        },
        {
          "text": "Define what is \"average to low\" risk to you. To me, buying gold at high is defined at extremely high risk. And then OP disappeared.",
          "score": 1
        },
        {
          "text": "SG Savings Bonds maybe ?",
          "score": 1
        },
        {
          "text": "Have you looked at the price of gold over the past week? Mari Income still possible to consider.",
          "score": 1
        },
        {
          "text": "T bills.",
          "score": 1
        },
        {
          "text": "I throw all the kids money (their ang bao and pocket money savings) in vwra",
          "score": 1
        },
        {
          "text": "Why downvote? Genuinely curious. Vwra pretty much moves like s&p but slightly less volatile",
          "score": 1
        },
        {
          "text": "Not sure why you’re down voted. Buy DBS and dont withdraw until they are 15-18. Reinvest whatever dividend you receive per year (during dips in price). If your kid is 15 and dbs is in bad shape, sg as a country will probable be in bad shape too. Got other things to worry about liao.",
          "score": 1
        },
        {
          "text": "Not sure why but don't really care. My youngest kid at 13 started to use his money to buy DBS shares already and happily receiving quarterly dividends. Honestly, it is better to get them involved with the process so that they can learn how to manage their emotions. My children are vested in DBS, ISAC and VWRA.",
          "score": 1
        },
        {
          "text": "can throw inside their CPF? since want long term and low risk..",
          "score": 0
        },
        {
          "text": "Uh. No man.",
          "score": -1
        },
        {
          "text": "Dbs\nEs3\nVWRA Choose one",
          "score": -2
        },
        {
          "text": "I brought 5k worth of SSB for future CDA matching and the rest in FWRA lump sum and forget it until next cny",
          "score": -3
        },
        {
          "text": "S&p500",
          "score": -3
        }
      ]
    },
    {
      "id": "t3_1qsa62m",
      "subreddit": "singaporefi",
      "title": "Generative World Models could trigger a massive deflationary event in the digital entertainment sector",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qsa62m/generative_world_models_could_trigger_a_massive/",
      "score": 6,
      "num_comments": 2,
      "created_at": "2026-02-01T02:31:09",
      "selftext": "The release of LingBot World and Project Genie signals a shift where the marginal cost of producing interactive 3D environments approaches zero. By treating game engines as data generators rather than production tools these models allow for the automation of physics and logic coding. This technological leap suggests a future oversupply of digital content and significant labor displacement for technical artists and gameplay programmers similar to what we are seeing in the graphical asset market.",
      "comments": [
        {
          "text": "So you think itll trigger the deflationary event by vibes then...",
          "score": 2
        },
        {
          "text": "gen ai porn has been around as long as ai. conventional porn industry is still healthy and people are still watching good ol’ porn. Nothing is going to change",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1qrztwg",
      "subreddit": "singaporefi",
      "title": "Choices of Home loan repricing",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qrztwg/choices_of_home_loan_repricing/",
      "score": 7,
      "num_comments": 10,
      "created_at": "2026-01-31T19:20:38",
      "selftext": "My situation is - I will be locked in till mid May 2026 at current fixed rate at 2.9% 😅\n\nChoice 1 : the current bank offers me 1.5% with two months less lock-in time , and then 1.5% for 3 years. No conversion fee but no futere free conversion\n\nChoice 2: another bank offers 1.55% for 3 years\n\nWhich one would be better ? I thought 1 is a better choice obviously but did I miss anything ?\n\nCheers !",
      "comments": [
        {
          "text": "Just switched from 2.9 to 1.4 fixed 2 years too",
          "score": 7
        },
        {
          "text": "Now 1.4% alr bro",
          "score": 5
        },
        {
          "text": "You also need to consider additional costs of lawyer fees if you switch to another bank. It seems clear to me too that staying with your current bank is better.",
          "score": 4
        },
        {
          "text": "You probably want to consider what you want to do within the 3Y. My assumption is that you are not looking to sell or not able to sell in the 3Y, and if that's the case, between the 2, choice 1 seems better just because of 0.05% lesser in interest rates. Free conversion or not, it also depends whether you get it in 12m, and if the market situation gives you better than 1.5%. If others are already getting 1.4%, perhaps you can use this to find mortgage brokers to see if they can give you closer to that range.",
          "score": 2
        },
        {
          "text": "The 1.55% should be DBS. Quite widely advertised",
          "score": 2
        },
        {
          "text": "Didn‘t mention my loan is around 800 k now. How’s yours ?",
          "score": 1
        },
        {
          "text": "1M",
          "score": 1
        },
        {
          "text": "Thank u !",
          "score": 1
        },
        {
          "text": "Either choice is fine, but choice 1 gets the carrot dangling for the current year though. See how you value the free conversion as part of the costs down the road",
          "score": 1
        },
        {
          "text": "Which bank? Switch to fixed ASAP, the longer the better and try to get free conversion (or waiver due to sale) just in case you gotta sell.",
          "score": 1
        }
      ]
    }
  ]
}