{
  "schema_version": "raw_scrape_v1",
  "report_id": "2026-02-18",
  "scraped_at": "2026-02-18T13:13:59.513746",
  "subreddits": [
    "singapore",
    "askSingapore",
    "SingaporeRaw",
    "singaporefi"
  ],
  "total_posts": 38,
  "total_comments": 392,
  "posts": [
    {
      "id": "t3_1r760ql",
      "subreddit": "singapore",
      "title": "Lohei turned into food fight: PropertyLimBrothers draws flak for flinging food during yusheng toss",
      "url": "https://old.reddit.com/r/singapore/comments/1r760ql/lohei_turned_into_food_fight_propertylimbrothers/",
      "score": 410,
      "num_comments": 106,
      "created_at": "2026-02-17T21:29:10",
      "selftext": "",
      "comments": [
        {
          "text": "You would be surprised at how common this is. It's not just NTU and PLB.\n\n\nThe media is just throwing whatever brings views ",
          "score": 552
        },
        {
          "text": "I loathe these type of people.\n\nYes, you're supposed to toss the food high. Yes, sometimes it gets everywhere. But you shouldn't purposely chuck it on the floor or someone else. That's scum behaviour and you're wasting good food.",
          "score": 219
        },
        {
          "text": "Let them celebrate lah, recent events must’ve been a load off their back 😂",
          "score": 180
        },
        {
          "text": "How old are these people?",
          "score": 100
        },
        {
          "text": "The people at PLB seem overly fond of tossing salads",
          "score": 76
        },
        {
          "text": "They are throwing their luck away. Let them.",
          "score": 64
        },
        {
          "text": "The gift that keeps on giving ..",
          "score": 56
        },
        {
          "text": "I'm secretly upset when colleagues toss the lohei messily as i like eating it. The veggies, the crunch and sauce are a very good combo. Salmon is optional.",
          "score": 42
        },
        {
          "text": "Could be worse, at least it's not bodily fluids",
          "score": 23
        },
        {
          "text": "So who’s going to counsel them? Can’t be the boss since he’s having marriage counselling…",
          "score": 19
        },
        {
          "text": "They are very loud. Must be a top-down strategy.",
          "score": 6
        }
      ]
    },
    {
      "id": "t3_1r75gdl",
      "subreddit": "singapore",
      "title": "S'pore Muslims to mark start of fasting month of Ramadan on Thursday, Feb. 19, 2026",
      "url": "https://old.reddit.com/r/singapore/comments/1r75gdl/spore_muslims_to_mark_start_of_fasting_month_of/",
      "score": 288,
      "num_comments": 24,
      "created_at": "2026-02-17T21:04:06",
      "selftext": "According to astronomical calculations, the crescent of the month of Ramadan is not visible above Singapore's horizon at sunset this evening (Feb. 17, 2026), because the moon set four minutes earlier than the sun.\n\nThe Mufti said:\n\n&gt;",
      "comments": [
        {
          "text": "As always, looking forward to it. Trying to lose 5-8kg this month.  \n\nIt's the busiest month of the year for me in terms of answering questions from my non-muslim friends/colleagues, usually to dispel misconceptions. Interestingly enough, I don't tire of it.  \n\nMost common things I end up telling them:  \n\\- No need to feel bad eating near me or talking about food. It literally has no effect. I understand why some still apologize and just accept it anyway  \n\\- No need to eat extra to compensate for missed meal. In fact, that defeats the whole purpose.   \n\\- Yes, we can and should still do our work to the same expected standard. If your employer opts to give you an easier time during Ramadan, be grateful.  \n\\- \n\n",
          "score": 178
        },
        {
          "text": "It’s the 8th Ramadan for me 🥹every year I still get nervous about fasting. The worst feeling is having to “restart” the fast when time of the month ends during Ramadan. Lol",
          "score": 46
        },
        {
          "text": "No difference for me cus I have been doing intermittent fasting for the past year.\n\nJust need to survive with the lack of my 2pm coffee…",
          "score": 42
        },
        {
          "text": "As a muslim, I am curious what's gonna happen to Chinese Muslim celebrating CNY next year knowing that it will be on Ramadan month especially the CNY delicacies including the tossing tradition? Idk what's it called but it's the one you guys using the chopsticks",
          "score": 37
        },
        {
          "text": "Some sects of Islam will set the calendar by visual observation of the moon, some others will use astronomical calculations.",
          "score": 11
        },
        {
          "text": "It's start of Lent for Christians too",
          "score": 5
        }
      ]
    },
    {
      "id": "t3_1r7n7a2",
      "subreddit": "singapore",
      "title": "Big tree falls and blocks off one-way road at Pipit Road",
      "url": "https://old.reddit.com/r/singapore/comments/1r7n7a2/big_tree_falls_and_blocks_off_oneway_road_at/",
      "score": 233,
      "num_comments": 16,
      "created_at": "2026-02-18T08:00:18",
      "selftext": "",
      "comments": [
        {
          "text": "all the buses that pass by pipit rd are cooked 😹",
          "score": 46
        },
        {
          "text": "There must be many TP around directing traffic and blowing their whistles going Peeepeeettttt!",
          "score": 35
        },
        {
          "text": "Live just down the road. Hope no one was hurt.",
          "score": 31
        },
        {
          "text": "Tree: ORD loh",
          "score": 22
        },
        {
          "text": "It’s ok, tree is just taking a break. It will leaf later.",
          "score": 7
        },
        {
          "text": ",😖",
          "score": 3
        },
        {
          "text": "Hope no one’s hurt🙏",
          "score": 2
        },
        {
          "text": "Rip tree, fall proud you were strong",
          "score": 2
        },
        {
          "text": "Nice playground!",
          "score": 2
        },
        {
          "text": "Original comment deleted as perhaps I didn't phrase it properly and people kept misunderstanding it. Just stay safe from poorly planted and maintained trees, especially after prolonged rain.",
          "score": -35
        }
      ]
    },
    {
      "id": "t3_1r723p0",
      "subreddit": "singapore",
      "title": "About 23,000 community care sector employees could get at least 7% pay raise as part of new salary guidelines",
      "url": "https://old.reddit.com/r/singapore/comments/1r723p0/about_23000_community_care_sector_employees_could/",
      "score": 165,
      "num_comments": 19,
      "created_at": "2026-02-17T18:04:07",
      "selftext": "SINGAPORE: About 23,000 community care organisation staff members could see at least a 7 per cent pay increment as part of new salary guidelines, \n\nHealth Minister Ong Ye Kung said on Tuesday (Feb 17).\n\nNoting that an increase in salary for staff members would translate to an increase in operational costs, Mr Ong also said that there will be a first tranche of support of S$100 million (US$79 million) to help defray the cost of the higher salaries.",
      "comments": [
        {
          "text": "Yes please do. The amount of essential work they perform is well deserving of visibility and remuneration.",
          "score": 99
        },
        {
          "text": "Used to work with a nursing home at my previous job. The nurses (mostly foreigners) are SO wonderful. They learned to speak mandarin, some dialects and malay to better communicate with the residents, and they know every resident so well. Can tell us who likes what, who doesn’t get along with who so that we can accommodate them better during activities, what cheers them up etc.\n\n7% isn’t much if you do the calculations but hopefully the new salary guidelines ensure better increments for them in the years to come.",
          "score": 50
        },
        {
          "text": "Finally a good thing with impact to recognise essential workers instead of claps.",
          "score": 28
        },
        {
          "text": "These are jobs with real impact. And only 23,000 employees are given at least 7% raise. \n\nFor good comparison, the news reporter should be asking how this compares to raises given for paper pushers in the public service especially those whose job don’t show real impact",
          "score": 26
        },
        {
          "text": "A 7% bump isn’t life-changing, but for community care staff who’ve been stretched for years, it’s at least some recognition.\n\nAlso the S$100M support matters, otherwise orgs would struggle to sustain it.\n\nStill… with rising costs everywhere, I wonder if 7% is really enough long term.",
          "score": 19
        },
        {
          "text": "u/kopisiewsiewdai do let us know what your boss say this time round. \n\nhttps://www.reddit.com/r/singapore/s/Q3FDG54YKt",
          "score": 14
        },
        {
          "text": "Guess I have something to probe HR and executive mgmt at the earliest opportunity.\n\nCommunity care is still lagging behind in salary for its healthcare workers when compared to public healthcare institutions. It's honestly a lot more work to keep people out of hospital then it is to care for them inside. ",
          "score": 10
        },
        {
          "text": "better this than bank and tech ceo (and god forbid, ministers/mayors)",
          "score": 7
        },
        {
          "text": "Being from the sector, I can only say many if not most CCOs still pay below each year's recommended salaries. Unlike public/government/semi-government care providers like restructured hospitals, CCOs are mostly charities with the discretion of deciding whether or not to follow the guidelines, and many don't. Every time we see such news our first thought would be it's just another performative recommendation with no real impact on our income (many of us are at the reference point of the salary range in terms of qualifications and experience but draw less than even the entry point).",
          "score": 5
        },
        {
          "text": "Good",
          "score": 4
        },
        {
          "text": "Not bad. At least 7%.\nI recalled for the last year increment, it was up to 7% with majority receiving the lower end - can't remember was it 3 or 4%. Noted that those who stayed in the system or performing better got the least. \n\nMust say that still far all from the average, especially those community care",
          "score": 2
        },
        {
          "text": "Does this include AIC employees",
          "score": 1
        },
        {
          "text": "Second tranche of support will be from patients bills",
          "score": -2
        },
        {
          "text": "Are they underpaid by 7%",
          "score": -11
        }
      ]
    },
    {
      "id": "t3_1r6ywh7",
      "subreddit": "singapore",
      "title": "AFC confirms Tampines Rovers awarded 3-0 win over Công An Hà Nội in AFC Champions League Two",
      "url": "https://old.reddit.com/r/singapore/comments/1r6ywh7/afc_confirms_tampines_rovers_awarded_30_win_over/",
      "score": 140,
      "num_comments": 26,
      "created_at": "2026-02-17T14:44:50",
      "selftext": "",
      "comments": [
        {
          "text": "Vietnam team penalised in match in Singapore because they fielded a man named China from Brazil. Make it make sense",
          "score": 82
        },
        {
          "text": "tampines wei",
          "score": 65
        },
        {
          "text": "How tf is this happening again",
          "score": 41
        },
        {
          "text": "The irony here is that Công An means police in Vietnamese. Vietnamese Police breaking the rules is nothing new. After all, Vietnam has the best police force that money can buy.",
          "score": 30
        },
        {
          "text": "WE ARE SO BACK PARK THE DAMN BUS",
          "score": 28
        },
        {
          "text": "This feels familiar",
          "score": 26
        },
        {
          "text": "Time to 马到成功",
          "score": 17
        },
        {
          "text": "PARK THE BUS 291 293 65 and 67",
          "score": 13
        },
        {
          "text": "Marks the beginning of greatest comeback",
          "score": 7
        },
        {
          "text": "Sanfrecce 2.0 lets go! Time to park the buses from Tamp Bus Interchange.",
          "score": 2
        },
        {
          "text": "Sg pools how. If we bet tampines rover win 3-0, huat lots now?",
          "score": 1
        },
        {
          "text": "We seem to get lucky with these self pwns. Hope Tampines make the most of it in the second leg!",
          "score": 1
        },
        {
          "text": "Can repeat till the final?",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r7s2lk",
      "subreddit": "singapore",
      "title": "S'pore Tourism Board invites single Americans to look for love with ‘aunties, not algorithms’",
      "url": "https://old.reddit.com/r/singapore/comments/1r7s2lk/spore_tourism_board_invites_single_americans_to/",
      "score": 104,
      "num_comments": 43,
      "created_at": "2026-02-18T11:30:38",
      "selftext": "",
      "comments": [
        {
          "text": "&gt;Under the campaign of \"Aunties, Not Algorithms\", the tourism board is looking for singles to submit their profiles for \"auntie-led matchmaking\"\n\nMisread the headline, thought they meant they want single Americans to date aunties. ",
          "score": 243
        },
        {
          "text": "Evolution of passport bros. Algo Aunties",
          "score": 76
        },
        {
          "text": "taxpayer money going into this passport bro validating shit is wild.",
          "score": 69
        },
        {
          "text": "Singapore attracting passport bros???",
          "score": 32
        },
        {
          "text": "We are an aging population. There are more aunties than XMMs.",
          "score": 21
        },
        {
          "text": "Shut this shit down. Misogynistic/racist passport bro oxford study type of rubbish. Can't believe it's organized by the government.",
          "score": 20
        },
        {
          "text": "I dk about you but i dont wanna visit a place with an itinerary curated by aunties. No thanks, that just doesnt say \"cool\" about the place",
          "score": 4
        },
        {
          "text": "I never knew there is an Aunty match making specialty service in SG. Are these aunties good at it?",
          "score": 3
        },
        {
          "text": "Instructions unclear, look for aunties for love instead",
          "score": 3
        },
        {
          "text": "Sbs bus aunties?",
          "score": 2
        },
        {
          "text": "Still colonised in the mind, I see.",
          "score": 1
        },
        {
          "text": "What the fuck is this marketing campaign?   \nUnorthodox for sure, but did someone in management get invaded by brain bugs?",
          "score": 1
        },
        {
          "text": "A Japanese American matchmaking Americans in Singapore? Who approved this shit",
          "score": 1
        },
        {
          "text": "First date featuring an exclusive Singaporean cooking class with Michelin-starred Chef Malcolm\n\nRound-trip flights to Singapore with a stay at a centrally located hotel\n\nAn auntie-approved itinerary and spending stipend\n\n——\nState sponsored foreigner breeding program. Locals aren’t gold enough i guess .",
          "score": 1
        },
        {
          "text": "why americans? how about other nationalities ",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r7epz5",
      "subreddit": "singapore",
      "title": "Fire broke out at chinatown shop house.",
      "url": "https://old.reddit.com/r/singapore/comments/1r7epz5/fire_broke_out_at_chinatown_shop_house/",
      "score": 58,
      "num_comments": 3,
      "created_at": "2026-02-18T02:42:06",
      "selftext": "Fire broke out at chinatown shop house. I was awaken by my brother when he told me there's a fire at one of the shophouse, the smoke was blown facing our block and have to on the fans to air out the smell.",
      "comments": [
        {
          "text": "Cursed CNY night. 🤐 👇🪵\n\nRemember that the same area had the infamous Tanjong Pagar crash, also on CNY.",
          "score": 20
        },
        {
          "text": "🐴🔥",
          "score": 9
        },
        {
          "text": "Year of the Fire Horse in Chinese astrology. Dunno if it’s a coincidence but many occurrences of fire over CNY lately. Recently a Bak Kwa shop also caught fire.\n\nhttps://www.straitstimes.com/singapore/fire-breaks-out-in-bak-kwa-shop-in-little-india",
          "score": 7
        }
      ]
    },
    {
      "id": "t3_1r7qbdb",
      "subreddit": "singapore",
      "title": "YouTube down for users in US, Singapore",
      "url": "https://old.reddit.com/r/singapore/comments/1r7qbdb/youtube_down_for_users_in_us_singapore/",
      "score": 50,
      "num_comments": 14,
      "created_at": "2026-02-18T10:12:51",
      "selftext": "",
      "comments": [
        {
          "text": "Maybe the overaggressive ads every three minutes during videos finally broke the camel's back.",
          "score": 67
        },
        {
          "text": "Rip my cny playlist",
          "score": 23
        },
        {
          "text": "It's back up...",
          "score": 10
        },
        {
          "text": "how do i entertain my non-existent toddler now?? :(",
          "score": 6
        },
        {
          "text": "Huh? Since when I still can use it tho just perfectly",
          "score": 3
        },
        {
          "text": "Rip",
          "score": 1
        },
        {
          "text": "Working fine here",
          "score": 1
        },
        {
          "text": "Back up. Heng ",
          "score": 1
        },
        {
          "text": "Back to normal liao.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r76afk",
      "subreddit": "singapore",
      "title": "How landscape architect Cathy Hang is shaping Singapore’s most loved public spaces",
      "url": "https://old.reddit.com/r/singapore/comments/1r76afk/how_landscape_architect_cathy_hang_is_shaping/",
      "score": 43,
      "num_comments": 9,
      "created_at": "2026-02-17T21:40:40",
      "selftext": "",
      "comments": [
        {
          "text": "Honestly, I think Jurong Lake Gardens is a bit too 'sculpted' and doesn't let nature just be nature. It feels like it was built to maximise Instagrammable moments.",
          "score": 24
        },
        {
          "text": "Nice but No big deal imo.. If someone can build us a 3D multi-storey forest then I'd be impressed.\n\n(Afternote: we are a garden city. As a consumer, I am pretty used to our green spaces. I truly want to see something different and technologically advanced and out of this world.. a multi-storey carbon capturing forest is something I would want in our landscarce island.. and frankly something the world would need too).",
          "score": -43
        }
      ]
    },
    {
      "id": "t3_1r7b7sy",
      "subreddit": "singapore",
      "title": "Platform 1932: A documentary on Tanjong Pagar Railway Station.",
      "url": "https://old.reddit.com/r/singapore/comments/1r7b7sy/platform_1932_a_documentary_on_tanjong_pagar/",
      "score": 41,
      "num_comments": 4,
      "created_at": "2026-02-18T00:42:51",
      "selftext": "",
      "comments": [
        {
          "text": "Throughout much of Asia, colonial era railways remain as a time warp within the 21st century. Must of these countries bought in the American model of car centric development, neglecting rail for expressway. \n\nSuch thinking is becoming obsolete. Fast forward to 15 years later, electric trains now traverse from the north to the south, from the Thai border at Padang Besar, to the doorstep of Singapore at Johor Bahru.\n\nFor better or worse, everything depicted in the documentary is now gone. First they pulled back  to JB, now they retreated into history.",
          "score": 8
        },
        {
          "text": "Loads of memories. Always loved trains. Used to head to the stations to watch trains. Took my first solo journey by train at age 15 years to Penang and back. There used to be a massive workshop and trains yards next to Kampung Bahru and Blair Plain. KTM had many housing blocks for railway workers. Malaysian immigrations and custom staff also lived in similar blocks. \n\n",
          "score": 5
        },
        {
          "text": "Cantonment MRT is right at this spot. I hope they invite the station master when it opens",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1r6xnp4",
      "subreddit": "askSingapore",
      "title": "What’s a Singapore opinion you’ll defend even if the whole kopitiam turns against you?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r6xnp4/whats_a_singapore_opinion_youll_defend_even_if/",
      "score": 605,
      "num_comments": 526,
      "created_at": "2026-02-17T13:35:55",
      "selftext": "I'll start. Aircon too cold is worse than too hot. Fight me. ",
      "comments": [
        {
          "text": "Prices shown on menus should include GST. I don't like eating somewhere and then seeing a higher price on the bill than expected.\n\nLike we don't have different GST rates like how the US is for different states, so what is the problem of showing a slightly higher price? Does that actually deter people from going there?",
          "score": 768
        },
        {
          "text": "10% service charge shouldn’t be levied for QR code ordering",
          "score": 745
        },
        {
          "text": "Restaurants charging $ for tap water should be hanged drawn and quartered",
          "score": 641
        },
        {
          "text": "Breadtalk and toastbox are horrible and bringing down our standards, fight me",
          "score": 503
        },
        {
          "text": "CPF is not perfect, but it is necessary to prevent irresponsible people from being a burden to society.",
          "score": 398
        },
        {
          "text": "Please do not have kids if you don't earn much...",
          "score": 385
        },
        {
          "text": "govt should intervene more directly in preserving stuff like hawker culture and old traditional shops\n\nCoffeeshops/hawker centers should have maximum rental amounts. Not just whatever the landlord desires. It serves the community and shouldnt be for profit. \n\nIf the foreigners from a certain country that love to buy properties complain so be it, its high time they learn to invest in something other than properties",
          "score": 342
        },
        {
          "text": "bcm have to eat dry version.",
          "score": 296
        },
        {
          "text": "Wedding ang bao should come from the heart not hotel rate",
          "score": 140
        },
        {
          "text": "Kaya toast, egg + kopi should not be more than $4 (i did the maths)",
          "score": 139
        },
        {
          "text": "People should not be allowed to profit exorbitanty from flipping their BTO/HDB. Public housing is a social necessity and the idea of treating it like an investment doesn't sit well with me. Any sale should be done solely with HDB, and HDB should regulate the prices.",
          "score": 87
        },
        {
          "text": "Cai fan pricing should be labeled and transparent. I'm tired of ordering veg and being charged meat price.  Or meat and being charged \"Special\" dish price.",
          "score": 62
        },
        {
          "text": "If you asked me to order from a QR code, you shouldn't charge me service tax.",
          "score": 32
        }
      ]
    },
    {
      "id": "t3_1r74oyj",
      "subreddit": "askSingapore",
      "title": "Introverts, how are you surviving CNY visits in SG so far?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r74oyj/introverts_how_are_you_surviving_cny_visits_in_sg/",
      "score": 243,
      "num_comments": 72,
      "created_at": "2026-02-17T20:28:28",
      "selftext": "After reunion dinner and a whole day of visiting extended fam/friends etc, my social battery is drained and all I want to do is curl up in my bed, shut the door, and not speak to anyone ☠️ PLEASE SEND HELP 🆘🏳️🚑",
      "comments": [
        {
          "text": "My cousin's husband is a legend to me. He shows up at almost every gathering, doesnt talk throughout the gatherings, goes home. Fking legend. Even i have the need to talk. He has been doing this for 14 years",
          "score": 299
        },
        {
          "text": "As you age, you will have fewer friends and eventually zero friends, so the friends' side is solved.",
          "score": 159
        },
        {
          "text": "The 26°C weather all day long helped immensely!",
          "score": 109
        },
        {
          "text": "&gt; my social battery is drained\n\nNo energy to socialise in person but got energy to socialise on reddit 😂",
          "score": 75
        },
        {
          "text": "I want to go home, but I’m already home 🥲",
          "score": 50
        },
        {
          "text": "I’m trying to be more extroverted, took the chance to strike up conversations with extended relatives and talk cock 😂",
          "score": 26
        },
        {
          "text": "\"what are you working as now?\"  \n\"i am not working now. it's chinese new year holiday.\"\n\n\"are you married?\"  \n\"i am not inviting anyone.\"\n\n",
          "score": 26
        },
        {
          "text": "Whole family of introverts and only have 1 place to visit. The rest of relatives are either estranged or dead.",
          "score": 22
        },
        {
          "text": "i have enough energy to fake a smile and say happy new year to collect the angpao 😂 after that i just sit down and hope nobody talks to me",
          "score": 17
        },
        {
          "text": "The cold empty roads are healing my soul",
          "score": 13
        },
        {
          "text": "I'm playing police and thief with my cat. My cat is the police 🚨 \n\nNow I'm hiding at the 4th floor praying he doesn't sees me ...pls send help",
          "score": 13
        },
        {
          "text": "I stayed home until 7pm, got my ass off to my grandmother's house to show face, arrived at 8pm, and at 8.30pm had enough and just went downstairs to read Reddit by myself lol",
          "score": 13
        },
        {
          "text": "I will avoid the extrovert narcissist and stay close with a fellow introvert. Paring up is better than facing the extrovert alone.",
          "score": 8
        },
        {
          "text": "Werking, opps the company  has manpower shortage for CNY. Sry i can't make it",
          "score": 7
        },
        {
          "text": "Intj but also highly adaptable, I just pretend.",
          "score": 7
        },
        {
          "text": "I have found my people!",
          "score": 6
        },
        {
          "text": "Wah u all got so many ppl to visit, i only have own fam reunion dinner, old man grumpy 😒 , then 1 house visiting. To OP, dun u feel happy getting many angpows or no?",
          "score": 4
        }
      ]
    },
    {
      "id": "t3_1r74qos",
      "subreddit": "askSingapore",
      "title": "What are some quirky local superstitions or beliefs that Singaporeans still follow today?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r74qos/what_are_some_quirky_local_superstitions_or/",
      "score": 90,
      "num_comments": 88,
      "created_at": "2026-02-17T20:30:39",
      "selftext": "Growing up in Singapore, I’ve always been fascinated by the various superstitions and beliefs that seem to permeate our culture. From not sweeping at night to avoid sweeping away wealth, to the belief that certain numbers bring luck or misfortune, these quirks add a unique flavor to our daily lives. I’d love to hear from fellow Singaporeans about any quirky superstitions you've encountered or still practice. \n\nAre there specific rituals or sayings that you find particularly interesting or amusing?   \nDo you think these beliefs influence how we live our lives or interact with one another? ",
      "comments": [
        {
          "text": "It will rain if you wash your car",
          "score": 202
        },
        {
          "text": "Knock on hotel room door before entering",
          "score": 134
        },
        {
          "text": "Every Singaporen needs to carry a bagua (octagonal shape object) because the tunneling of our MRT damaged the positive feng Shui of Singapore. \n\nHence the $1 coin was created in 1987 to counter this.",
          "score": 128
        },
        {
          "text": "At work, cannot say very free. Cannot say very quiet. The old uncles will bash you, especially if suddenly all sort of bad things happen after you said these",
          "score": 79
        },
        {
          "text": "Not opening an umbrella indoors, as it is thought to \"rain in\" bad luck and invite spirits to hide under it. It makes ZERO sense cuz most of the time you open your umbrella outdoors and fold your umbrella only when you're under shelter.\n\nThe other one that made me laugh so hard is people saying not to clip your nails at night because you might attract spirits 😂",
          "score": 58
        },
        {
          "text": "Back then when i was a pri schl kid, I was cleaning the classroom with the broom and i swept a Chinese kid foot. He started literally crying. Later that a teacher told me that it was bad luck or i swept away his luck by sweeping the broom on his feet.",
          "score": 44
        },
        {
          "text": "Try not to swim in the sea after sunset, it’s not “clean” due to spirits that previously drowned at the beach",
          "score": 43
        },
        {
          "text": "Do not step or kick on offerings especially during 7th Month aka Ghost Month. \n\nIf you did accidentally kicked/Stepped on the offerings, apologize immediately.\n\nDo not pee outdoors especially on vegetation and at trees, ask for permission and apologize first.",
          "score": 38
        },
        {
          "text": "Don't point at the moon, it will cut your ear.",
          "score": 36
        },
        {
          "text": "My Tenant didn't bathe the whole of CNY first day. The thing is she can only bathe on CNY eve before midnight and after midnight of CNY first day. I asked her why, she says it's tradition. Luckily it was really a cool day. \n\nA joke: I always knock on the fridge door before opening; because there may be a salad dressing inside. ",
          "score": 30
        },
        {
          "text": "Knock on hotel door before entering.\n\nRoll pineapple in a new BTO before moving in.\n\nDon't swim at night during seventh month.",
          "score": 29
        },
        {
          "text": "Roll pineapple when entering your new house",
          "score": 29
        },
        {
          "text": "Stock price will drop once u buy",
          "score": 26
        },
        {
          "text": "Don't share pear with your spouse because it sounds like 分离 (separation) 🤡",
          "score": 16
        },
        {
          "text": "Don’t walk under the blocks 'cos you never know when something might fall on your head. I’ve had someone’s spit land on me before 🤮",
          "score": 16
        },
        {
          "text": "Paying a lot of money to someone to tell you how to arrange your furniture or what to name your child.",
          "score": 14
        },
        {
          "text": "Nurses don’t eat bao (steamed buns) during shift.",
          "score": 10
        }
      ]
    },
    {
      "id": "t3_1r7bftn",
      "subreddit": "askSingapore",
      "title": "Do u guys give parents allowance? Why or why not?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r7bftn/do_u_guys_give_parents_allowance_why_or_why_not/",
      "score": 65,
      "num_comments": 53,
      "created_at": "2026-02-18T00:50:06",
      "selftext": "Part time student ft worker but my mum assume i am just studying, n working pt for day to day expenditures\n\nDo u give ur parents allowance and how much?\n\nI was speaking to my mum recently n she casually say when are u gonna graduate, come n help me\n\nShe always say she is tired n want to retired soon but I dont think that's possible \n\nMy dad passed without leaving anything n we still have our hdb mortgage every month to pay (which we are thankful for our tenants, the monthly rental cover our utility n mortgage) \n*for some reason we didn't have hps, yes we've checked, rmb to check urs\n\nMun was a SAHM for the most of her life until dad fall sick n she found a job aa a cleaner, she is not educated \n\nI feel the burden on me, my mum does not save, she only have to pay the monthly conservancy fees, and her mobile plan which amount to &lt;100\n\nBut idk where her money goes every single month, she always asking me to borrow her money before payday \n\nI am sick n tired of it, she earn 1800, take back ard 700 each time.  She get pay twice a month.\n\nWhat do i do? She is definitely not eligible for cpf life, she did not \"work\" her whole life therefore she cant hit even the basic retirement sum\n\nBut she is demanding this and that for me n tell me let stop renting the room out, n have this house to ourselves? U think i dont want that?\n\nBut we cant afford it, without the rental we will be out on the streets. I was scared to death when we couldn't find a tenant for 2 months the previous cycle \n\nCounting down our mortgage 13year 6 months\n\nI am scared, scared of those red letter from gov agencies telling us we own them money n threatened w our utility being cut\n\nBut mum well she is a kid I have to mother \n\nShe is demanding I give her money but honestly idw to give it to her. She is just gonna waste it on useless shit, or spam it on 4d hoping she hit it big \n\nI can't control her money but I can control mine, even though it not much\n\nShe keep on saying oh once u graduate i am gonna retired, I am so tired of working \n\nWell mum i am tired too\n\nI am on the fence, am I unfilial for letting her suffer?\n\nMum is in her early 50s",
      "comments": [
        {
          "text": "For starters... Get rid of that near $100 mobile plan. Nowadays who have that, just get a $10 plan and whenever you need a new mobile phone the costs is still cheaper than getting a contracted plan over time\n\nDoes she cook for u guys? I must say groceries and fruits are actually damn ex in sg. I spend on average about 800/mth for 2 kids",
          "score": 54
        },
        {
          "text": "You can try to sit down and calculate the expenses and ask why she needs so much. If it doesn't work, then do what is right to keep the house going",
          "score": 43
        },
        {
          "text": "When you do get a full time job, PLEASE DO NOT reveal to her your actual pay. Even if got bonus or payrise dont reveal. If not she's going to ask for them as well. \n\nThats what I did to my own mum.",
          "score": 23
        },
        {
          "text": "Nope. Parents are doing very fine themselves and have saved enough for retirement. Giving them \"allowance\" doesn't make sense realistically unless you're blindly following the tradition for the sake of it. Crippling yourself financially while not adding value to anything other than displaying typical asian values.\n\nBut of course I will still support them in other areas like bills, or groceries, etc.",
          "score": 11
        },
        {
          "text": "Used to give my mum monthly allowance ($300 per month) but she used it for Toto and 4d so I stop giving. Only CNY then I pack her $888 one shot",
          "score": 8
        },
        {
          "text": "I didn't give my folks any allowance the first few years of work. Firstly, I was using a bulk of my salary for my part-time studies. Secondly, I was building up my savings. Thirdly, my folks were still working and they had enough income to sustain themselves. After I was done with studies only then I started giving. \n\n\nWhen your mum said she'll retire once you have graduated, it is kinda worrying. Do you have savings of your own? What if you have other financial plans like marriage, BTO, renovation, etc in the future? Cos when you move out after marriage and getting a BTO, you can't be paying for both the current house and your BTO expenses. Is it possible to downsize your current home?\n\n\nYour home currently has three sources of income. If that's still not enough then will need to track where every dollar is going to. ",
          "score": 5
        },
        {
          "text": "sit down with her and lay things out for her together.   \n  \ndon't think she is thinking enough about maintaining a household cause she hasn't been when your dad is around obviously.\n\nno idea how but don't make her feel like she's at fault. older people like to feel like they are being victimised when you point out things that can put them in the spot.\n\nyou guys obviously need that rental to keep things going. try to cook more cause outside food 3 meals a day is going to eat up your savings / wages / monthly budget.\n\nkeep an excel sheet. so things can be very clear. make the fonts big size also. if needed, start a family savings and spending account. and both of you can dump some money there each month. so whatever she spend on is her own business but she still need to contribute to that co-fund that can be used to pay family things. i'm assuming you are the only child.\n\nand you guys obviously need that tenants. cause there's morgage to be paid. there's no CPF to leverage right?\n\nand it's not about earning or earning more now. to me, it's really about CANNOT FALL SICK. start exercising so won't lose muscles that easily. you see a lot of older people they are limping either because they hardly exercise. (muscles get stiffed and useless over time)",
          "score": 5
        },
        {
          "text": "My mom is SAHM, when I was making around 2k take home I gave 200 a month. I consider it as my \"house bill\" haha",
          "score": 5
        },
        {
          "text": "I give around 8-10% to my parents since my NS.\n\nAs a young adult, it is very hard to balance your own dreams as well as actual family state. Even harder if you think she’s not managing her money properly.\n\nHer efforts are clear as she too has to move out of her comfort zone and having a cleaner job to put up with the mortgage and perhaps your school fees. It’s not your fault, but I think it’s a burden that all members of the family have to shoulder what they could.\n\nI do think your contribution is necessary, but the amount should be reviewed. Ie you should also set aside for your future studies, rainy days etc. \n\nHaving a tenant puts up inconveniences for everyone in the home, not just her. If the rental could cover her mortgage a utilities, it sounds like the major issue is solved. Also, the house is to her name/ownership.\n\nIf the family requires other expenses, the outlay should be put forth and then worked out a contribution share. The fact that your job is part time only should be considered.\n\nThere’s also a potential risk that your mother does not have proper health insurance, a bad health event can set you back to zero.",
          "score": 5
        },
        {
          "text": "Nope, I’m already paying for majority of the household bills + gave them a spare CC for household groceries. Only time when I “give” money to them is during CNY and when I bring them out for meals\n\nEdit: also if it’s just the 2 of you, and since you haven’t gotten a job yet, go speak to your MP and see if there’s any financial aids which they can help you to apply for. \n\nhttps://supportgowhere.life.gov.sg/schemes/COMCARE-SMTA/comcare-short-to-medium-term-assistance-smta",
          "score": 4
        },
        {
          "text": "My family wasn't very well off until I graduated and more recently found a better job. When I started off, I didn't give them allowance since my dad was still working, and they didn't ask me for allowance either. Gradually I started paying for utilities and online shopping expenses. When I had a better job more recently, I topped up their MA/RA/CPF Life 8k in total for both parents (since they haven't hit min. sum or top up limit considering they were low income) and I took on more big ticket purchase (since at this point I was already earning much more than my parents)\n\nPersonally I am also not great in dealing with family conflicts but I guess both of you need to sit down and understand what your mother is potentially excessively spending on.\n\nSorry to hear about what happened to your family too. Considering your past, I would also think speaking to social worker or counsellor or any external help, might also aid both of you in family planning and relationships + applying for any grants/support. Perhaps certain emotions and thoughts can be better resolved in that process. Personally I also had troubles trying to resolve and change certain habits or tension within the family by myself too\n\nOne point to note in the future when you start working - when I started earning more income from an originally low income family, we gradually lost eligibility for various grants or vouchers meant for low income. But in actual fact, my family financial situation isn't great either since I barely had a few months / year with decent income (for my age) to support my family and my own needs. Job market isn't stable either. Hence, I low key also felt the squeeze of a low-medium income level family.\n\nAll the best and hope things get better for you!",
          "score": 3
        },
        {
          "text": "I would say to work out your own financial and give her a % that works for you. \n\nWhen I first started working, my pay was $2.2k before cpf and I gave my mum $300. That’s the max I can give at that point of time. \n\nBut I’ve been self sufficient so I pay for everything else myself except for food at home, utility bill etc.\n\nWe are called the sandwich generation because our parents generation (most) think that having kids is their retirement plan. This is true for 80% of Asian families. \n\nGet a support system, speak to MP or town council and seek help. Take care of your own mental health and try to spend time away from your mum. \n\nEOD she need to help herself too.",
          "score": 2
        },
        {
          "text": "My relative is a caretaker for a family member that is pretty similar to your situation, where due to being in less well off situations for an extended period, that family member tend to spend well above their means as soon as they get their salary and tend to buy fairly expensive (but impractical) things to get a sense of being able to afford things to feel better about themselves. 4D and Toto is just a means to get out of that situation by getting a big windfall, but due to lack of self control, the money doesn't last beyond a few days \n\nYou need to take the reins over your family's fiscal situation and transfer a portion of your mum's salary into an account that has controls (e.g. a joint account which needs both of you to be present to be able to withdraw money from).\n\nMy relative had to fight to manage her family member's salary and give an allowance instead, otherwise it'll all be spent within 1-2 days. Due to not having enough money for the rest of the month, that family member will just borrow from friends, other relatives, or legal money lenders which leads into more debt that's harder to get out of, or just find things to \"spoil\" (say the fridge or something big) to get access to the money but spend it on anything else but the fridge. The excuses about partial payment etc are all exactly the same as what your mum uses.\n\nHang in there... It will take a lot of convincing that this is the best approach, that you're not out to scam your mum of her money and home, and it will take a lot of patience and explaining. Please don't contemplate dropping out of school and working! Education is the biggest salary equaliser, and it's almost impossible to get back to institutional learning at certain levels just due to the way the educational system is structured in SG.\n\nBudgeting wise, you can check the bill to see where the usage is the most. If she's using a lot of time on voice calls to other relatives, then adjust her plan accordingly.",
          "score": 2
        },
        {
          "text": "As all Chinese aunties and uncles almost alot of their income goes to Singapore pools.",
          "score": 2
        },
        {
          "text": "Set a fixed amount each month to give her. If u have to, then just say u are paying insurance endowment every month for your own saving so u dont have spare to give her. U need to set the impression that u are committing your money elsewhere so this forces her to rmb that you cannot give her more than $xxx amount each month. ",
          "score": 2
        },
        {
          "text": "Understand your struggle, you want to help but the uncertainty of where your mum is spending the money or the demand of it is not helping you to support wholeheartedly. \n\nYou cannot control how she's going to spend the money eventually. The most straightforward way is for you to take care of money matters perhaps using an account for household payments, and you giving the allowances. But you also mentioned she is not willing to, so guess that is out. \n\nWhat can also be done is taking care of the bills, one at a time. For example, ask her to give you the bills for conservancy and mobile, or rental if you can, and pay them off. Because you paid these bills, you will not be giving her allowances. As time goes by, talk to her to see if she can then pass a portion of her salary, for you to pay off each household related bills. \n\nOne of the ways that has helped me was also to save first, 15-20% of monthly. Many people prefer to save after all expenses/bills paid. But if you realize you do have some to spare from the initial way, reverse it. Take a portion out from the start and keep it in a bank account that you do not usually access. Invest a portion of it if possible. ",
          "score": 2
        },
        {
          "text": "Don’t give if they are not short of $$ and also work less focus on your studies , doing more intern and network with people who can get you a better job.  You are more educated, smarter. Instead of giving her $ , open an account put into s&amp;p for her, next time when she is in need of $ she can use you as her backup.",
          "score": 2
        },
        {
          "text": "i used to, until i learnt all the money i gave was to fund family trips that i wasnt involved in, and parents went on to have just a couple thousands in bank account, because they wanted to enjoy without hardship.",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1r71kuy",
      "subreddit": "askSingapore",
      "title": "Is it me or is it harder to arrange food for Cny day 1?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r71kuy/is_it_me_or_is_it_harder_to_arrange_food_for_cny/",
      "score": 52,
      "num_comments": 27,
      "created_at": "2026-02-17T17:31:40",
      "selftext": "last time ah ma cook can cook for so many.\n\nnowadays no one confident to host and cook.\n\norder options limited.\n\nwhat are you guys eating? who cook for extended family gathering?",
      "comments": [
        {
          "text": "Steamboat is an easy option.",
          "score": 121
        },
        {
          "text": "Everyone cook one dish",
          "score": 53
        },
        {
          "text": "All the aunties still want to cook when we say we will order catering. They say catering not nice to eat. Well it's true.. catering sucks. But to make it easier, now split the dishes or all the aunties will go to one location to cook together so easier.",
          "score": 48
        },
        {
          "text": "Steamboat + bbq, no need know how to cook just put in pot and hot plate",
          "score": 36
        },
        {
          "text": "Since 3 years ago, we ordered catering. No choice. Parents and uncle auntie are in their mid 60s to 70s. \n\nEveryone just enjoy the gathering, the food we close eyes.",
          "score": 36
        },
        {
          "text": "Now… maids cook.",
          "score": 13
        },
        {
          "text": "Hard to find food?? This might be true in the 80s or 90s.   \nBut certainly not now.\n\nI use grab , browse the available options and the food arrived. Last time i still have to manually go to each location to try my luck.",
          "score": 9
        },
        {
          "text": "steamboat. \n\n",
          "score": 7
        },
        {
          "text": "Steamboat. Everyone bring something. \nCatering is too expensive now",
          "score": 5
        },
        {
          "text": "Potluck, everyone contributes and brings at least 1 CNY dish.",
          "score": 3
        },
        {
          "text": "It is precisely because I felt it was important to continue the tradition of home cooked food during gatherings, that I took up the challenge of learning to cook.\n\nI've been in charge of making yusheng and the main part of reunion dinner the past few years. \n\nEasy enough to start with small tasks daily and do a steamboat every now and then, and suddenly hosting a few more people for CNY isn't as big a challenge as it seems.",
          "score": 3
        },
        {
          "text": "Most of my family have helpers so helpers cook. There is this thing, day one one eldest son got to host , day 2 second son gotta host , and so on and so on. \n\n\nSo all of them got helpers to take care of all the food for them.\n\n\nSame with grandparents place. \n\n\nBut between my brother and I, let's say if our parent passed, we will always choose to order in or eat at a restaurant. Plus we both prefer western cuisine to chinese cuisine. \n\n\nWe cook for Christmas but will probably order out for New year. ",
          "score": 2
        },
        {
          "text": "Pizzahut delivery",
          "score": 2
        },
        {
          "text": "my extended relatives been ordering buffet for the past few years. previously was cooked by my grandma’s sis. not sure how early was the buffet ordered in advance though.",
          "score": 2
        },
        {
          "text": "Everyone bring one dish. Or steamboat, everyone bring one ingredient. Easy.",
          "score": 2
        },
        {
          "text": "We cater Malay or Indian food",
          "score": 2
        },
        {
          "text": "My mom cooks with my sisters’ helper. And we mix it up with some premade stuff like xiao long bao that we just steam/ bake in oven.",
          "score": 1
        },
        {
          "text": "Shilifang Hotpot ",
          "score": 1
        },
        {
          "text": "If I host I usually just cook it all myself, 15 people at most.\n\nLike a normal weekly cooking with a few extra dishes so nothing really special for CNY.",
          "score": 1
        },
        {
          "text": "Order non-chinese food. No surcharge and still taste yummy. This is one of the pros of living in Singapore!",
          "score": 1
        },
        {
          "text": "order buffet",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r7bmah",
      "subreddit": "askSingapore",
      "title": "What is the most craziest/serious thing you ever reported using LifeSG application?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r7bmah/what_is_the_most_craziestserious_thing_you_ever/",
      "score": 44,
      "num_comments": 56,
      "created_at": "2026-02-18T00:56:02",
      "selftext": "I will start first. I have been reporting the scavengers at my estate who make a mess of the items at the bulky refuse bin and the blue recycling bins, such as tearing the trash bag and just generally indiscriminately discarding trash that they don’t want instead of putting it back properly. It gotten worst in the lead up to CNY cause of discarded items from spring cleaning.",
      "comments": [
        {
          "text": "My blk lifts.\n\nAt my parents estate, if both lift are at the ground floor, 1 lift will automatically ‘home’ at a certain floor after idling for a few minutes. At my estate, both lifts can stay at the ground floor for a certain period of time.\n\n\nI’ve noticed an inefficiency in the elevator's dispatch logic. When a high-floor request is made, the system assigns a single car to handle all subsequent intermediate calls in that direction, even if a second car is idling. This results in excessive 'nuisance stops' for high-floor residents. The secondary lift only engages when there is a request from a floor above my current position, which seems like a flaw in the load-balancing algorithm.",
          "score": 69
        },
        {
          "text": "People shitting inside an underpass tunnel. Every Monday or weekday after a holiday, there’ll be a strong smell of human feces. After raising on the app, I don’t encounter it anymore.",
          "score": 40
        },
        {
          "text": "A tree grew inside my rubbish chute. Literally a full branch with leaves",
          "score": 27
        },
        {
          "text": "I had an argument with a scavenger uncle recently regarding this. \n\nHe made a huge mess at the void deck from tearing open the plastic bags. Children at the void deck were picking up rubbish and playing with them, which is worrying because we do not know what the rubbish are. They could include discarded medicine, broken items and such. \n\nI went on my knees to clear the rubbish and re-bag the trash that were strewn all over the floor. 3 times. And each time the uncle would tear open and cause a mess. \n\nFinally, after my final time clearing the mess, I caught the uncle in the act. I knew me saying anything wouldn’t get to him, but I still had to vent my frustration. \n\nIn the end, he was like “I’m old. Let me do what I want”. And I just lashed out “I don’t care if you want to take the trash. But at least don’t leave a mess. Don’t tear open the trash bag.” \n\nThey don’t realise that when they tear the trash bag, it is almost impossible for the cleaners to lift the trash bag into the bins without the trash bag totally giving way and making a huge mess.",
          "score": 16
        },
        {
          "text": "A lorry carrying eggs spilled all over the main road in our estate. Picture a mess of broken eggs and residents scrambling to retrieve unbroken eggs (lorry had long gone by then).",
          "score": 16
        },
        {
          "text": "I've seen alot of stupid feedback.\n\nhomeless people sleeping. feel concern about women safety.\n\npet urination in public.\nscavaging blue binz or the clothes bins",
          "score": 12
        },
        {
          "text": "PMDs blocking my blks staircase entrance, which wasn't solved for months, in the end i called fire hazard report hotline and was done within days",
          "score": 11
        },
        {
          "text": "No action is gonna result from this though. Scavenging is not a crime",
          "score": 6
        },
        {
          "text": "I was in my car in the HDB MSCP and had just turned on the engine, when the car directly in front of me had moved off. A next car came in, wanted to park at the lot that was just vacated, so I waited for the car to park first. \n\nShe went in normally, then after she had gone in (and parked her car perfectly, might I add), the car on her right also left. Before I could move off, she moved forward to readjust her car - and here’s the part where it’s report worthy in lifesg/oneservice. Since the lot on her right is empty now, she moved her car toward the right and slightly over the line. I suspect this is to prevent anyone from parking beside her since the MSCP is quite old and the lost are smallish. \n\nI waited for her to leave first before I went down to take pictures and sent in to report her. It’s one thing to be a bad parker, it’s another to deliberately park badly just so that others wont park beside you. I also had everything caught on my dash cam and offered the video to HDB but they never asked for it.",
          "score": 5
        },
        {
          "text": "Parking illegally like grandpa/grandma road.",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1r7ot8q",
      "subreddit": "askSingapore",
      "title": "Why is the “CNY Surcharge” on services and food a thing here?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r7ot8q/why_is_the_cny_surcharge_on_services_and_food_a/",
      "score": 44,
      "num_comments": 88,
      "created_at": "2026-02-18T09:09:05",
      "selftext": "I understand that the employees are paid double during but we all know the amounts collected highly surpasses what they give to them, is it just another way for companies and businesses to milk the holiday to boost their revenue?",
      "comments": [
        {
          "text": "Yes. For small hawkers I don't mind, they're sacrificing their holidays after all but for many businesses and chains they will just take the opportunity to slap on a surcharge whenever they can.",
          "score": 153
        },
        {
          "text": "F&amp;B during holidays- okay. Barbers that start surcharging 3 weeks before holidays- not okay.",
          "score": 102
        },
        {
          "text": "Supply and demand. It's one of the few days where demand outstrips supply.\n\nBusinesses are in it to make a profit. It's ridiculous how many people think prices are based on a cost plus model instead of charging what the market will bear.",
          "score": 100
        },
        {
          "text": "Why do people keep asking the same questions over and over again ? If you’re not willing to, then don’t engage their services during this period of time. If you open a business would you not do the same if everyone is?",
          "score": 76
        },
        {
          "text": "So far the ones I've encountered have posted signs informing of the increase $ and duration posted in advance. They're not unreasonable, and I think most will self regulate/police so they don't go viral.\n\nYou can always choose not to patronise them.",
          "score": 53
        },
        {
          "text": "let me give u some perspectives.\n\n1) Business owners tank the price increase of ingredients during festive seasons, especially near CNY periods.. all farmers want \"大费年“ \n\n2) Employees are mostly unhappy to work during CNY. as most of the F&amp;B stalls are closed, there will be significant amount of people will definitely have \"no choice\" but to dine in at your eatery. resulting in more busier time, lesser manpower, more angry customers etc.\n\n3) Business owners also need to take a huge risk of the ingredients., u order more, u need to make sure your storage is enough to keep the ingredients FRESH for the next 2 days or more.. because alot of suppliers are closed not just the 2 public holidays, but throughout the week.\n\n  \nso u think the surcharge is fair? i leave it to you to decide. and its your money, u CAN choose not to patronise the business and shaft macdonald or any fastfood 3 meals down your throat throughout these few days.\n\n  \n",
          "score": 45
        },
        {
          "text": "Supply and demand\n\nSupply low, demand high -&gt; surge",
          "score": 19
        },
        {
          "text": "It’s not just CNY.. many of them add surcharges during major holidays. The hairstylist I go to started adding surcharges during Christmas, which continued onto CNY. I try and avoid by planning early.",
          "score": 15
        },
        {
          "text": "Sydney even worse, 10-20% restaurant surcharge every Sundays",
          "score": 14
        },
        {
          "text": "So that the staff gets paid proper wages and extra operating costs",
          "score": 8
        },
        {
          "text": "Ask you to go back office to OT now and give you 1 day off in lieu, then you tell us whether you want to go or not. Or will you demand at least 5 days.",
          "score": 6
        },
        {
          "text": "It turns out to be higher prices profiteering for less or inferior rushed impatient service by inadequate frustrated grumpy and unwilling staff, hastily cooked food with less ingredients thrown together in a fancy name menu, and rushed through in a sitting to make way for the next sitting.",
          "score": 4
        }
      ]
    },
    {
      "id": "t3_1r7e0eo",
      "subreddit": "askSingapore",
      "title": "Thinking of applying for Police Force at the age of 30",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r7e0eo/thinking_of_applying_for_police_force_at_the_age/",
      "score": 41,
      "num_comments": 26,
      "created_at": "2026-02-18T02:18:05",
      "selftext": "Male, 30, has a stable finance -related job, degree holder. Served fulltime NS as a storeman with a PES C9.\n\nWas considering to switch career to SPF as an inspector. What are your honest thoughts?\n\n1) Noted that the requirement is to have PES A/B1. am I able to up my PES and how can I go about doing so?\n\n2) Will I be doing basic training (e.g. stay in) for the first 9 months? How's my career progression gonna be like?\n\n3) is 30 too old to join the police force?",
      "comments": [
        {
          "text": "Was a junior officer but resigned, so take my comments with a pinch of salt as I am not up to date on things.\n\n1. See a doctor to write memo for your review with CMPB.\n\n2. Yes, 9 months of stay in training with attachments to NPC to follow ground officers. Progression and ceiling depends on your degree, local uni your ceiling is higher, progression will depend on your work performance and grading. You have 3 main foundation postings, after training is a 6 months attachment to be Ground Response Force officer responding to 999 calls and related duties. Your 1st posting will be a 2 to 3 years of being an IO at division. After IO, you will be posted back to NPC as a Team Leader also for 2 to 3 years, maybe longer. After TL posting, you will be posted to do staff work, aka office role. So that will be nearly 10 years of your career, subsequent posting depends already.\n\n3. No I had supervisors that did mid career switch as well, you get higher pay than fresh grads that applied so not too bad in terms of pay.",
          "score": 41
        },
        {
          "text": "If john nolan could do it so can you!",
          "score": 28
        },
        {
          "text": "I can only answer your first qn\n\nCall up cmpb to ask for the reason behind your C9 pes so you know what to rectify unless you already know, afterwards just work on getting specialist memo (doesnt matter where you decide to go to or how much you spend on, specialist is specialist), once you officially get your specialist memo then can consider gg to ehealth and schedule a medical review to apply for uppes\n\nMay have to open your secondary UG options and factor in the retirement age and limited career progression due to age of said options",
          "score": 21
        },
        {
          "text": "no idea about the first 2, but just want to share that I had a reservist campmate who switched careers from shipping logistics to police force at 31.\n\nif you feel that becoming a police inspector is your calling then I would encourage you to give it a shot now while you're still young",
          "score": 14
        },
        {
          "text": "im not a regular but i think your chances are rather slim given that you served 2 years NS with perm PES C9.\n\nthis PES status might work against u for wanting to join a uniformed group.\n\n1. need to see a specialist to write memo to refer u to SAF Medical Board to up PES. may not be a smooth process.\n2. for sure u need to stay-in few months at Home Team Academy @ Tengah. if u local big 3 uni grad, most likely u start off as INSP (inspector). if u atas scholar, most likely start of as ASP (assistant superintendent).\n3. dont think so since most male degree holders graduate at 25 to 26yo.",
          "score": 6
        },
        {
          "text": "Why though? Anyway for PES status I think you have to  inform your reservist unit and do another med review. Might be wrong.",
          "score": 5
        },
        {
          "text": "1. Not sure if it will affect, but a medical examination is part of the interview. This is at the end of the interview process. You can expect the 9 months training to be physically demanding as there will be a lot of running. It is a promotion criteria to achieve minimally a IPPT Silver once you have graduated. Gold is a must during training. \n\n2. 9 months training, 2 years Investigation branch, 2 years Team Lead, then staff posting. \n\n3. No. Manpower is pretty bad as many DEIs leave after their bond. Oldest in my batch was 35 years old. However, have seen newer batches with 38 years old. \n\nDuring the interview process, they focus heavily on leadership experiences and general knowledge (especially with local news). Many do not pass the last panel interview because of the lack of knowledge of local news/politics or the way you articulate your answer. \n\nSPF is very public facing and would highly recommend for you keep a neutral stance in your answers. If you skew to a certain end, best to have evidence/research to back up what you have said.\n\nAll the best, if you’re applying 👍🏼",
          "score": 3
        },
        {
          "text": "Since you are currently in finance related job, I assume is a related degree? Why not consider direct commercial affair officer. ",
          "score": 2
        },
        {
          "text": "Can check for your PES status history in OneNS mobile app.\n\nIf unclear, speak with CMPB and find out more\n\n1. Get medical review to help see if can move things up to PES B1 at minimum.\n\n2. Yes I guess so, take it as another BMT like Tekong.\n\n3. Not too old but take it lightly, 30 is not like 20s or late 10s, don’t injure yourself too much.",
          "score": 1
        },
        {
          "text": "Hey man, just throwing an idea here.  \nFrom my perspective for your age, PES and career progression inquiry.  \nHave u thought of joining SAF **Digital and Intelligence Service**?  \nI am not from there in case u are wondering. This formation looks interesting to me.",
          "score": 1
        },
        {
          "text": "If I did managed to get my PES up to B1 but failed to get into SPF, will I get posted to a different unit for my reservist? Was from ammo depot during my NS days, for reservist was posted to ammo HQ at KC3.",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1r73kki",
      "subreddit": "askSingapore",
      "title": "What do you do with your stationery from schooling days?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r73kki/what_do_you_do_with_your_stationery_from/",
      "score": 35,
      "num_comments": 42,
      "created_at": "2026-02-17T19:30:30",
      "selftext": "Hope it’s not a niche question. I used to be a stationery hoarder from primary to jc. I have hundreds of new pens, boxes of mild liners, highlighters, pencils etc. Almost comparable to Popular’s offerings. And yes they still work I’ve tried them all. I have also hundreds of notebooks, some free but most were purchased. I think they average $10 each as some are the moleskin notebooks. Also have tons of sticky notes, post its, files of all sorts etc.\n\nAs an adult now, what do you do with these leftovers? Are there ways to use them up myself without throwing them out? Like for example, would you start writing things down instead of using the notes app on phone? \n\nI just think it would break my heart if I gave it all away as I skipped many meals to save up to buy them and I can remember buying most of them and the joy I felt back then. \n\nOr any suggested space efficient ways to store them? They take up a whole cupboard at the moment. ",
      "comments": [
        {
          "text": "Things are meant to be used, and people are meant to be loved. Don’t make the mistake of doing the opposite.\n\nUSE THEM. Don’t wait for some special occasion to use them. Use them in your everyday life so your everyday becomes special and joyful. I use one notebook a year, I can take one from you LOL. Or curate a little gift pack for interns in your company when they leave. Or pack for your colleagues if you fancy, etc Xmas present or sthg.",
          "score": 33
        },
        {
          "text": "keep a few - the rest give away to your relatives or sell on carou, uty. or donate to schools/kindergartens maybe? not sure if they need/want. no harm asking if ur feeling generous!",
          "score": 28
        },
        {
          "text": "yeah you could use it for notes. \n\nhow about drawing? you could make small doodles",
          "score": 5
        },
        {
          "text": "I used them because I became a teacher. But of course the stash refills every September.. \n\nWhen i quit, i gave them to my students as gifts, gave them to colleagues, or just gave them away for free on carousell. However, your stuff sounds way more premium than mine! \n\nI usually finish up the expensive stationery, leaving the not so great ones for last, and gradually i moved to Taobao so it's pretty good quality without the hole in the wallet. So i was okay to part with them",
          "score": 4
        },
        {
          "text": "Give to juniors",
          "score": 3
        },
        {
          "text": "Keep those I really love, sell/donate the rest. I find that throwing it away can be wasteful when it can be used by someone else who will treasure and use it well.",
          "score": 3
        },
        {
          "text": "I give on Olio app for free, use old highlighters by doing word search, or use the pens to write down random stuff at work.",
          "score": 3
        },
        {
          "text": "I worked for a company where you had to sign out for every piece of stationery that you took and had to provide justification as to why you needed more than say, 1 pen. \n\nThe boss's view was to cut costs here and there, so people just bought their own stationery instead of being named and shamed for having too many pens and not being able to afford pens on the salaries we were paid.\n\nI dug out my old pencil case, and all my old uniball pens were still working, so just use them since the ink were still good (the ink doesn't die!).\n\nPeriodically I'll still need things like those compasses and triangles rulers to do stuff or draw things for DIY work, but otherwise they've mostly sat in a drawer waiting to come save the day when I actually need to write something on paper.",
          "score": 3
        },
        {
          "text": "If you are planning to have kids, keep a few and wait till they are old enough to use them. That’s exactly what I did… still have stationery from my pri sch days and I’m a geriatric millennial",
          "score": 2
        },
        {
          "text": "offer to the nearest family service centre or children and youth charity. these can become back to school gifts or small prizes for kids.",
          "score": 2
        },
        {
          "text": "If you are willing to give it away, I know of a few ground up initiatives and charities that would want them",
          "score": 2
        },
        {
          "text": "Honestly, now i find that writing things down at work is more memorable to me than typing it down somewhere. \n\nIn my line of work as a systems analyst, it helps for me to jot down notes so I have a reference point later.\n\nYou could try experimenting and see if writing notes down at work helps for you!",
          "score": 2
        },
        {
          "text": "Happy to take some notebooks off you. \nI used to be a stationary collector and also loads of first-edition story books like Enid blyton stuff, and my mum packed and got rid of them when I moved out of Singapore for work. \n\nBut if you want to store them , then yeah best keep them in airtight bags, or pay for storage? Get those plastic boxes and store under your bed?",
          "score": 1
        },
        {
          "text": "keep it, now i realise i actually need some stationaries.",
          "score": 1
        },
        {
          "text": "i donated to thrift shops",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r73mk6",
      "subreddit": "askSingapore",
      "title": "Engineering fresh grad looking for advise",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r73mk6/engineering_fresh_grad_looking_for_advise/",
      "score": 30,
      "num_comments": 14,
      "created_at": "2026-02-17T19:33:39",
      "selftext": "Hi all I am an Mechanical Engineering student graduating this year. Personally I know me and a bunch of my friends are still looking for roles, but there seems to be so many types to choose from (maritime, semi con, manufacturing, construction and government that has many ranges). Does anyone here have any advice that can help point us fresh grads into the right direction, maybe share the industry that they are in(job scope), remuneration(base pay and increment) and also the benefits that the sector usually provides. If anyone is more open to me dming them to discuss their experiences I am open too!  ",
      "comments": [
        {
          "text": "First qn you need to ask yourself is if engg is what you want to do - if yes then its more of the industry that you want to focus on as its hard to lateral across industries since your work experience is largely different.\n\nIts going to take very long to answer this qn so i’ll try my best:\n\nConstruction - SG does the whole end to end value chain (design of houses, circuits, hvac to construction and procurement etc). You have to decide if houses are mainly your thing … if not,\n\nSemicon -the value chain in SG is more towards fabrications, so the offices across SG are more fab houses. There is some design focus somewhere in certain companies but thats not their main focus here. Note when its fabrication, most work here is arobd process engineer related work - you make sure that the fabrication of chips are produced on time and with littlento no quality issues\n\nMaritime - it really depends. You can vary from working in a port to working in a shipyard. Port really depends… you can do operations to figuring out whay aspects of the port require maintenance work and you engage with subcontractors to make sure that these faults or regular maintenance work is conducted. For shipyard, its no different than houses just that you are building and repairing ships.\n\nThe last one is gov - so think of gov as the regulatory body across all these industries to make sure that houses have little to no quality issues, or defence bodies that ensure that the SAF has proper equipment and products to have an efficient fighting force. So you can think of yourself as the gatekeeper to make sure that all products used across these sectors are functioning and safe.\n\nAll in all - WLB wise, gov bodies give you the best wlb and pay, albeit more red tape and bureaucracies. Construction and shipyard are 6 days a week, sometimes 7.\n\nIn an engineering related jobscope, the most impt question you should ask yourself is - which industry gives you the most excitement to get you out of bed to work?",
          "score": 29
        },
        {
          "text": "Was in private sector and managed to pivot to public. If you're planning to have a family, public sector is the way to go. Granted you'll never be a billionaire but it's stable and wlb is wonderful. Public sector pays median salary.\n\nIf you'd like to join the public sector, best move is to get someone within to refer you. Referrals almost guarantee an interview.",
          "score": 8
        },
        {
          "text": "Try aerospace. We actually need mech eng in aerospace industry. And it pays well.",
          "score": 5
        },
        {
          "text": "If you hate your life, join semicon.",
          "score": 4
        },
        {
          "text": "Medtech is an option.",
          "score": 1
        },
        {
          "text": "Honestly you are cooked. Companies now prefer to hire junior engineers from overseas than locals. u/groundnut666 is a good example. https://www.reddit.com/r/askSingapore/comments/1r76k4m/singapore_pr_difficulty_for_malaysians/",
          "score": -5
        }
      ]
    },
    {
      "id": "t3_1r762aa",
      "subreddit": "SingaporeRaw",
      "title": "Happy Lunar New Year 2026!",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r762aa/happy_lunar_new_year_2026/",
      "score": 347,
      "num_comments": 178,
      "created_at": "2026-02-17T21:30:58",
      "selftext": "",
      "comments": [
        {
          "text": "In Singapore, we have the Vietnamese and Korean community who join in the celebration as well. So in order to be inclusive and respectful to all, we call it Lunar New Year.\n\nBut growing up in Singapore, we switch around between CNY and LNY but nobody cares. Now suddenly there PRC comes over and suddenly the Vietnamese and Koreans in Singapore are not allowed to celebrate this festival in Singapore. Simply WTF...\n\nAnd then you have these ccp trolls defending the CNY term as though Singapore is 坡县",
          "score": 102
        },
        {
          "text": "Happy Chinese New Year.",
          "score": 83
        },
        {
          "text": "Happy Chinese New Year All",
          "score": 69
        },
        {
          "text": "to think our country survived racial riots in the early days, strived for a multi-cultural society to succumb to this shit",
          "score": 57
        },
        {
          "text": "Why is sg a triangle",
          "score": 32
        },
        {
          "text": "Huh I don’t get it. Singaporeans have been using Chinese New Year quite happily between locals, it is an ethnic Chinese tradition. And mainland Chinese don’t have issues calling it the same in Singapore. \n\nLunar New Year is confusing because every country celebrates theirs different day and locals only use them to appease idiot angmohs and weirdo ABCs\n\nIt’s not a Deepavali vs Diwali issue.",
          "score": 30
        },
        {
          "text": "China uses Spring Festival more commonly actually.",
          "score": 20
        },
        {
          "text": "Fuck all those non-Chinese bad actors who pretend to be all for inclusion when they are just plainly trying to diminish the soft power of the ethnic Chinese altogether because of “muh anti-~~China~~ Chinese rhetoric”. \n\nHappy CNY!",
          "score": 17
        },
        {
          "text": "Malaysia calls it Tahun Baru Cina or Chinese New Year in Malay, not LNY.\n\nhttps://preview.redd.it/ux3tm52rn2kg1.jpeg?width=1076&amp;format=pjpg&amp;auto=webp&amp;s=d49088cd17b24241f865562d899cce3ba0077611\n\nOP is changing the facts to rage bait.",
          "score": 16
        },
        {
          "text": "[deleted]",
          "score": 16
        },
        {
          "text": "Let’s follow what MOM call this PH, Chinese New Year.",
          "score": 11
        },
        {
          "text": "do people in all these countries really call it Lunar New Year?\n\nPhilippines is not a Chinese country and calls it Chinese New Year. They use Cantonese greetings even if there are few Cantonese in that country.",
          "score": 9
        },
        {
          "text": "This is the first time I've seen \"LNY\" used as an acronym, I don't think it's a thing. Happy CNY everyone!",
          "score": 7
        }
      ]
    },
    {
      "id": "t3_1r6yhhq",
      "subreddit": "SingaporeRaw",
      "title": "Everybody Huat ahhhh",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r6yhhq/everybody_huat_ahhhh/",
      "score": 348,
      "num_comments": 16,
      "created_at": "2026-02-17T14:20:52",
      "selftext": "",
      "comments": [
        {
          "text": "马 nigga",
          "score": 62
        },
        {
          "text": "https://preview.redd.it/j0911lpi60kg1.jpeg?width=768&amp;format=pjpg&amp;auto=webp&amp;s=b672241acdbc5c42290445dfcc19335aaf40c435",
          "score": 35
        },
        {
          "text": "![gif](giphy|ZqlvCTNHpqrio)\n\n",
          "score": 33
        },
        {
          "text": "Ah yes, the huattable horse\n\nWhy yes I read right to left like a pure blooded Chinese, how could you tell?",
          "score": 22
        },
        {
          "text": "It means mother fucker omg",
          "score": 8
        },
        {
          "text": "Huat Lah!!",
          "score": 3
        },
        {
          "text": "Waiting for the next Snake year 🐍 \n\nIt’s gonna be 🔥",
          "score": 3
        },
        {
          "text": "This one 可以",
          "score": 2
        },
        {
          "text": "That's funny.. Huat",
          "score": 2
        },
        {
          "text": "https://preview.redd.it/k54pywzt01kg1.jpeg?width=1024&amp;format=pjpg&amp;auto=webp&amp;s=3a2b14ffaa5adde1afdfc13420d5d2eff3c68625\n\nhahaha. ",
          "score": 1
        },
        {
          "text": "Happy lunar new year everyone! Fuck CCP!",
          "score": -1
        }
      ]
    },
    {
      "id": "t3_1r74tfa",
      "subreddit": "SingaporeRaw",
      "title": "Raining heavily and have to take phv for visitation with my elderly parents, kana smoker car.",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r74tfa/raining_heavily_and_have_to_take_phv_for/",
      "score": 121,
      "num_comments": 32,
      "created_at": "2026-02-17T20:34:25",
      "selftext": "As soon as we got into the car, I regretted booking it. The smell of smoke was overwhelming, like someone had been puffing away in there just before we got in. The stench was so bad that it made us all fall silent. I'm pretty sure the driver had been smoking in the car right before our ride. To make matters worse, it was pouring outside, so we couldn't just get out and catch another ride, especially not with my elderly parents. I couldn't help but feel frustrated with myself for not being able to afford a car.\n\nTada app. \n\nWe need a smoke free car ride option for all PHV apps. ",
      "comments": [
        {
          "text": "Driver are not allow to smoke in PHV car even without passenger. Just report it to platform and NEA",
          "score": 133
        },
        {
          "text": "Never book Tada - they’re all grab/gojek rejects. It’s almost certain you will kenna what they were blacklisted for",
          "score": 93
        },
        {
          "text": "Next time tell driver u exiting. Just say who who who asthma cant stand the smell.",
          "score": 26
        },
        {
          "text": "It is an offence for PHD and Taxi Drivers to smoke in their vehicles.\n\nReport to LTA",
          "score": 20
        },
        {
          "text": "Yes this is very annoying . Can we ask grab to make sure they smoke OUTSIDE THE FKING CAR",
          "score": 16
        },
        {
          "text": "Drivers smoke a quick one and hop onto car. His breath is also as carcinogenic. Then the car recycle the air within. Unlucky on the first day. Hard for companies to enforce.",
          "score": 7
        },
        {
          "text": "1 star",
          "score": 5
        },
        {
          "text": "Report this kind of drivers pls. Thank you and sorry for ur unfortunate experience",
          "score": 2
        },
        {
          "text": "That’s what happens when population in Sg exploding. You can guess who’s the culprit. ",
          "score": 2
        },
        {
          "text": "They not suppose to smoke when driving this phv",
          "score": 1
        },
        {
          "text": "Please report. Thanks for your service.",
          "score": 1
        },
        {
          "text": "normal bah, even Ryde and Grab also have. Worse when i was booking PHV to being my dog out. 1 out of 10 times kana smoker car. ",
          "score": 1
        },
        {
          "text": "Indeed best to avoid smoke if preg, i mean look at the kids these days they r much much healthier than those born in eras where parents exposed to cig smoke and heavy vehicle pollutants. Also much less allergies and weirdness! Take care op.",
          "score": 1
        },
        {
          "text": "Cannot afford a car? Normal…",
          "score": 1
        },
        {
          "text": "A smoke free toggle would honestly solve half these complaints. Right now passengers are just gambling every booking",
          "score": 1
        },
        {
          "text": "Just unlucky. I’ve seen a lot of taxi drivers smoking inside car too.",
          "score": 1
        },
        {
          "text": "JB grab also alot like that ",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1r6ydku",
      "subreddit": "SingaporeRaw",
      "title": "Before election: “We need the taskforce man.”. After election: “We can live with it.”",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r6ydku/before_election_we_need_the_taskforce_man_after/",
      "score": 97,
      "num_comments": 58,
      "created_at": "2026-02-17T14:14:49",
      "selftext": "",
      "comments": [
        {
          "text": "Punggol voters got played",
          "score": 50
        },
        {
          "text": "He is not called gan bo yong for nothing. \n\nY'all dumbasses suck it up, you voted for this.",
          "score": 42
        },
        {
          "text": "Just proved how dumb Punggol residents are. Time and again kena conned",
          "score": 38
        },
        {
          "text": "https://preview.redd.it/gegw8k77i0kg1.jpeg?width=846&amp;format=pjpg&amp;auto=webp&amp;s=664afcb6ff4d8306c757bb6b48ba65edf76a7d11",
          "score": 25
        },
        {
          "text": "PSP LMW and TCB were right after all, despite all responses/comments criticising them of taking the issue lightly at that time.",
          "score": 23
        },
        {
          "text": "Kumgong then believe",
          "score": 20
        },
        {
          "text": "Before voting say we need him to help in tariffs. After election he tell you gdp growth dosent gurantee jobs.\n\nWhat is this tbh. Than next time will tell u no job not my fault cause you never go for ai course.",
          "score": 14
        },
        {
          "text": "Sinkie fault really. We never give 100% mandate",
          "score": 14
        },
        {
          "text": "&gt;Before election: “We need the taskforce man.”. After election: “We can live with it.”\n\nSounds like\n\nBefore election: “With you, for you, for Singapore.”. After election: “F**k you.”",
          "score": 14
        },
        {
          "text": "I mean, it was such an obvious ploy.  GKY has never been known to be efficient at producing results.\n\nAnd if you actually believed in this Taskforce BS and voted for him…. you know who you are.",
          "score": 12
        },
        {
          "text": "Punggol residents are stupiak. I know quite a few who lives there ",
          "score": 10
        },
        {
          "text": "Talk so much, 5 years later still vote PAP 🤷‍♂️",
          "score": 6
        },
        {
          "text": "Did they ask us citizen about 20% increase for tobacco and 45% decrease in ARF? 😆",
          "score": 5
        },
        {
          "text": "Voters have short memories. Next elections come along, same results. Worse still, you have more of these snakes and morons coming here to use Singapore as a springboard to other countries. In the meanwhile, the housing prices get inflated like crazy and the “PRs” just bail whenever it’s convenient. Horrible.",
          "score": 3
        },
        {
          "text": "Really played us real good. Punggol residents kena scammed hais",
          "score": 3
        },
        {
          "text": "How did the “strong mandate” matter to the negotiations? It’s totally unrelated. They didn’t even dare to say that Gan is a great negotiator.",
          "score": 3
        },
        {
          "text": "I think the phrase I'm looking for is.... I told you so",
          "score": 3
        },
        {
          "text": "Fear mongering from day 1 kids. We’ll never learn and forever live in regret. \n\nhttps://www.reddit.com/r/singapore/s/b4RWxXLgiZ",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1r70fj0",
      "subreddit": "SingaporeRaw",
      "title": "SG felt less crowded these few days yet things are functioning as per normal",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r70fj0/sg_felt_less_crowded_these_few_days_yet_things/",
      "score": 91,
      "num_comments": 80,
      "created_at": "2026-02-17T16:17:44",
      "selftext": "This shows that we do not need that many foreigners to be begin with",
      "comments": [
        {
          "text": "Because half of our population go back to their hometown Malaysia 🤣",
          "score": 169
        },
        {
          "text": "Once they fly or drive back in, you’ll be hit again by the public transport meltdown.",
          "score": 50
        },
        {
          "text": "GDP over happiness",
          "score": 48
        },
        {
          "text": "Good thing we're all able to enjoy other local delicacies like nasi ayam, mee goreng, nasi brani, mee rubus, roti prata, mee siam, teh tarek, milo dinosaur, etc. 😋 Rem support local delicacies/brands, dun buy those foreign food/brands ya👍⭐❤️ ",
          "score": 17
        },
        {
          "text": "We need more foreigners to function because by virtue we also had more foreigners. If we remove them, we will be back to our greatest",
          "score": 13
        },
        {
          "text": "None is too many.",
          "score": 6
        },
        {
          "text": "Think about it, if we dont have them..we will be over taken by another type...",
          "score": 2
        },
        {
          "text": "Our secret sauce is 3rd world wages for blue collared workers with first world profits for asset owners. \n\n\nEveryone else gets a middle class existence. ",
          "score": 2
        },
        {
          "text": "All the FnB i went done by malaysians bro, what u smoking HAHAHA",
          "score": 1
        },
        {
          "text": "[ Removed by Reddit ]",
          "score": 1
        },
        {
          "text": "All pack up go home...Singapore is like company..lol",
          "score": 1
        },
        {
          "text": "...huh?",
          "score": 0
        },
        {
          "text": "Uh… you aren’t in the industries that’s hit the hardest by the lack of foreigners.\n\nThat, and people planned for work to be done before/after CNY.\n\nThe effects take time to come in and make you feel the hurt.",
          "score": -3
        },
        {
          "text": "I only support maintaining of CMIO",
          "score": -11
        },
        {
          "text": "Still surprised to see all these hatred comments and thoughts here by the Singaporeans. All these racism and stereotypes hidden behind the smiley faces at its best",
          "score": -13
        }
      ]
    },
    {
      "id": "t3_1r7rkqh",
      "subreddit": "SingaporeRaw",
      "title": "ABC and Valu$. A consistent cheap discount stores chain.",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r7rkqh/abc_and_valu_a_consistent_cheap_discount_stores/",
      "score": 68,
      "num_comments": 17,
      "created_at": "2026-02-18T11:08:04",
      "selftext": "**Please read the article attached from 2016**\n\nIts been 10 years this article published but the pricing from them has gradual increase which we can accept\n\nHOWEVER, during the same time, fair price and the Govt increase cost of living so much from GST 7-9% and many others.\n\nTo Radha Exports, thank you for offering great deals to us working class for a long time.\n\nYou are a better company than the party in power now increasing cost of living year after year ever burdening the citizens.\n\nOr even Fairprice which isnt fair in its pricing.\n\nhttps://www.businesstimes.com.sg/companies-markets/radha-exports-expansion-trail",
      "comments": [
        {
          "text": "Thanks. Interesting read. A product I usually buy from them used to cost 2 then went to 2.5 and now 3. But bloody ntuc has been charging 50% more or double throughout the times.",
          "score": 37
        },
        {
          "text": "Nice la! Finally a respectable CECA (2nd gen SG) doing great things for our country.\n\nCorrection. He was born in Singapore in 1962. Shouldn't even consider him as CECA. He is a true blue Singaporean Indian!\n\nAlso OP what the heck you necro-ed a DECADE old article...",
          "score": 37
        },
        {
          "text": "Unfortunately, the BCRS program will cause inflation on the drinks soon.",
          "score": 9
        },
        {
          "text": "still good they exist because competition keeps everyone else in check. Without them prices would probably rise even faster",
          "score": 4
        },
        {
          "text": "Eh. Parallel import. Most are non perishables.\n\nOk? Good business from some types of consumers.\n\nBut for most of the people, it’s still going to be FairPrice, Sheng Siong etc.",
          "score": 4
        },
        {
          "text": "&gt;Or even Fairprice which isnt fair in its pricing\n\nYou can ask all those uncles and aunties what they think about Fairprice, and chances are, they say it's gahment to make the groceries cheap cheap.  \nHowever, Fairprice's aim is not to slash prices for essential goods. Doing so will only lead to a price war which is beneficial to consumers in the Short Run (every supermarket, market stall owners, etc, lower their prices drastically), but in the Long Run, suppliers in the market will leave, causing a more oligopoly-like situation where the few remaining big players can determine prices more easily with less choices for the consumers.  \nRadha exports also have a different business from Fairprice. The former is known for selling parallel imports and stocking a lot on excess inventory and thus, able to sell much more cheaply than Fairprice.  \nFairprice caters to a much larger and varied consumer base with varying purchasing power.",
          "score": 3
        },
        {
          "text": "It's so confusing and infuriating why the gov allows their brainchild NTUC to maintain such monopolistic-like dominance in the supermarket sector, where they can just unilaterally increase prices and promote nonsense 1 cent discounts, without any pushback whatsoever. Nothing about it shows fair free market competition.\n\nIn places like Australia their consumer rights commission is actively trying to fight price gouging, already having fined supermarkets and taking another to court rn..",
          "score": 2
        },
        {
          "text": "Godsend use it to buy food and some toiletries",
          "score": 1
        },
        {
          "text": "ABC means Always Be Cheating",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r71nqk",
      "subreddit": "SingaporeRaw",
      "title": "Bus accident in Yio Chu Kang road. Ppl got down to take photo for 4D.",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r71nqk/bus_accident_in_yio_chu_kang_road_ppl_got_down_to/",
      "score": 55,
      "num_comments": 21,
      "created_at": "2026-02-17T17:36:35",
      "selftext": "All who took the photos were passengers. who alighted quickly to take number plate photos to take 4D. also, a bit weird that no one rushed to check if everyone is ok. I wasn’t the passenger; was waiting for bus, but did go to check on bus driver who was frantic. anyway, glad nobody got hurt. ",
      "comments": [
        {
          "text": "Huat la…",
          "score": 16
        },
        {
          "text": "wait so what's the number plate? (asking for a friend)",
          "score": 12
        },
        {
          "text": "This is literally the best demonstration of the worst coolie gene mentality of Sinkie Chinese , or indeed NANYANG Chinese (Malaysian Chinese + Sinkie Chinese) when it comes to wealth, gambling, and seeking to profit off anything and everything even if it is off someone else's misfortune and misery. \n\nYou will never see this kind of behaviour elsewhere. Truly disgraceful lowbrow stuff. ",
          "score": 7
        },
        {
          "text": "The thing is... Suay got knock and kana accident... So why the need to waste $ on such numbers",
          "score": 3
        },
        {
          "text": "Sickos",
          "score": 3
        },
        {
          "text": "who bang who? which at fault again?",
          "score": 2
        },
        {
          "text": "and you didnt manage to take the photo of the plate to share?",
          "score": 2
        },
        {
          "text": "Must be singaporean driver because foreigner driver balik kampung",
          "score": 2
        },
        {
          "text": "Driver who drives annually",
          "score": 0
        },
        {
          "text": "why OP never take photo of the bus plates?!",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1r7r32n",
      "subreddit": "SingaporeRaw",
      "title": "Tan Kin Lian agrees with CSJ that CDC Vouchers is giving people water to put out a fire (Raise Cost of Living) which ) they (Government) Had started.",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r7r32n/tan_kin_lian_agrees_with_csj_that_cdc_vouchers_is/",
      "score": 41,
      "num_comments": 12,
      "created_at": "2026-02-18T10:45:47",
      "selftext": "Link to the original video by Doctor Chee:\n\n  \n[https://www.facebook.com/share/v/1DPWweqQWp/](https://www.facebook.com/share/v/1DPWweqQWp/)",
      "comments": [
        {
          "text": "I agree also. Can also say it’s drip feeding just enough to placate the masses from waking up.",
          "score": 15
        },
        {
          "text": "Question to the finance/economics initiated:\n\nIs it still hard to summarise and explain the overall capital flows? What TKL and CSJ highlight is obvious imo, but it seems that there got to be a better way to present a more complete picture that links to the macro.\n\nI guess what I'm asking is that is there a better way to comprehend the interdependencies between important factors with minimal jargons?",
          "score": 8
        },
        {
          "text": "CDC vouchers is not enough to cover the high cost of living. \n\nIntroducing Foreigners into the labour work force, drives down the wages for the locals. \n\nMany are stuck will low paying jobs of 1.6k to 2k+. Many are also doing food delivery or PHD as full time and even part time to supplement their income. \n\nCosts of HDB has also skyrocket tremendously since the 80s. I understand inflation but from 30k (4 room) to 350k and above for 4 room flat now with lesser square metre. It is crazy!",
          "score": 4
        },
        {
          "text": "They need to give more to put out the fire.",
          "score": 3
        },
        {
          "text": "they are over-estimating the size of the bucket or underestimating the size of the fire.",
          "score": 3
        },
        {
          "text": "It's to offset gst increase for poorer folks. \n\nWhich in fact the math works out. Poor folks get more cdc voucher than gst they pay\n\nIt does make gst regressive instead of being progressive.",
          "score": 2
        },
        {
          "text": "The ppl who are most impacted are those earning as a household around 70-120k per year which will likely be spending around they will likely be impacted by gst by around 3-5k of tax based upon 9%. Their vouchers will not offset the vouchers by very much",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r6xgcy",
      "subreddit": "SingaporeRaw",
      "title": "China embassy in Singapore warns its citizens against gambling after MBS casino death",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r6xgcy/china_embassy_in_singapore_warns_its_citizens/",
      "score": 28,
      "num_comments": 28,
      "created_at": "2026-02-17T13:25:10",
      "selftext": "SINGAPORE, Feb 16 — The Chinese embassy in Singapore has urged its citizens to avoid gambling, following the death of a Chinese national at the Marina Bay Sands casino.\n\nAccording to AsiaOne, the individual reportedly fell to their death after gambling, prompting the embassy to assist the family with after-death arrangements. \n\nThe embassy did not provide further details on the incident.\n\nThe statement also noted that in recent years, several gambling-related deaths involving Chinese nationals have been reported in Singapore. \n\nAhead of Chinese New Year, the embassy reminded tourists and residents to comply with laws and avoid gambling, which is banned in mainland China.\n\n“Overseas gambling violates national laws, and embassies cannot provide consular protection for illegal activities,” the statement said. \n\nChina’s Ministry of Public Security has also set up a platform for reporting suspected illegal gambling activities.",
      "comments": [
        {
          "text": "More people jump off buildings buying china A shares",
          "score": 25
        },
        {
          "text": "Aiyah China, just donate and install a giant Winnie the Pooh statue at every entrance of MBS then problem solved 🤣",
          "score": 8
        },
        {
          "text": "Play stupid games win stupid prizes",
          "score": 3
        },
        {
          "text": "Gai de",
          "score": 2
        },
        {
          "text": "Means the regulated gambling business in sg is strong (house odds)",
          "score": 1
        },
        {
          "text": "He has only his lack of self-control to blame.",
          "score": 1
        },
        {
          "text": "虫国人输不起 then don’t play",
          "score": 1
        },
        {
          "text": "I feel very sad this is the legacy of LHL, the worst PM in our history in my opinion. Since MBS casino started how many suicides had occurred involving nationalities from all over the world. Sadly, this Chinese national would not be enjoying any reunion dinner with his/her loved ones anymore.\n\nSinkies may not care but it is a stain on us all. We may ignore the bird shit that landed on our faces as if it doesn't existed but the smell and sight will ridicule us still. \n\nWe took the easy way out with the casinos, with HDB asset enhancement, with massive immigration, with not investing in indigenous technologies and capabilities, with boosting GDP through family offices and so on. Every time, Singapore decided to take the easy way out, we get addicted, become short-sighted and failed to see the danger of quick solutions. We cursed ourselves and the future generations.\n\nEdit: [read this post and the comments](https://www.reddit.com/r/askSingapore/s/BPIBX2fHcd) to see how we ended up cursing ourselves with sinkies pwn sinkies. This is the result of a *\"beggar thy neighbour\"* mentality and *\"you die your own business\"* attitude.",
          "score": -8
        }
      ]
    },
    {
      "id": "t3_1r70ph1",
      "subreddit": "SingaporeRaw",
      "title": "My blk 34 Teban fire",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r70ph1/my_blk_34_teban_fire/",
      "score": 26,
      "num_comments": 13,
      "created_at": "2026-02-17T16:35:49",
      "selftext": "",
      "comments": [
        {
          "text": "Cuz you know, there were a lot of orders for Bak Kwa. Then people were saying why my orders late, later my boss never give me bonus cuz I didn't gift him. So we rushing out the orders and working 247. So there were a lot of charcoal. Then I told the scdf you must remove the charcoal!",
          "score": 15
        },
        {
          "text": "i heard from someone that HDBs are built so that if there's a fire, it will be contained within that unit and not spread to other units, is that true? if so that's incredible and very well done",
          "score": 7
        },
        {
          "text": "https://preview.redd.it/ulkrk9s1p0kg1.png?width=1342&amp;format=png&amp;auto=webp&amp;s=a4f31dad43e78b2ff2e8b8de41040352c92b3ce1\n\n",
          "score": 5
        },
        {
          "text": "CNY offering until offer the entire house as offering.",
          "score": 3
        },
        {
          "text": "Welcoming the year of the fire horse literally",
          "score": 3
        },
        {
          "text": "What happened",
          "score": 1
        },
        {
          "text": "Looks like a regular kitchen fire. ",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r7fkz1",
      "subreddit": "singaporefi",
      "title": "Advice/info on inheritance",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r7fkz1/adviceinfo_on_inheritance/",
      "score": 4,
      "num_comments": 24,
      "created_at": "2026-02-18T03:12:07",
      "selftext": "Hello all, I will be receiving about $240k in inheritance next year (when i turn 21) and am wondering what is the best way to grow that money safely. Are T-bills a good way? Feel free to give some advice to a young lad. Would rather hear from people than end up researching wrongly haha. Thanks!",
      "comments": [
        {
          "text": "T-bills are horrible in my opinion, i would dca that 240k over a span of maybe 2 years into CSPX or STI, basically any good ETF, since you have a long runway you should be taking some risk and playing the long-game.\n\nAlso wow congrats on the windfall.. or sorry for your loss..",
          "score": 15
        },
        {
          "text": "You need to understand what \"safe\" means. You have at least 30 years before you are close to retirement. \"Safe\" means equities generally go up in 30 years, far more than fixed income.\n\nInvest in a broad equities ETF (see pinned post here) and forget about it for 30 years.\n\nThe comments teaching you about fixed income are completely wrong because they are ignoring your age.\n\nCongratulations!",
          "score": 8
        },
        {
          "text": "Was the amount held in trust for you until you turned 21?",
          "score": 3
        },
        {
          "text": "Before anything... Read the pinned post and https://www.reddit.com/r/singaporefi/s/Kb8NEI78oj\n\nThese will enlighten you to think about what you should do and what type of options you have",
          "score": 2
        },
        {
          "text": "Split them into ETFs",
          "score": 2
        },
        {
          "text": "all in on 0dte spy options, got chance to make a million",
          "score": 1
        },
        {
          "text": "I think... take time to read up and read widely on personal finance and how to invest prudently. Even if you miss one year, out of 50 years of investing, it is okay. Even if you manage to catch a good dip and invest, you will still have to learn to stay invested. \n\nGenerally, the way to accumulate wealth or to preserve wealth is to invest in a broadly, diversified basket of equities, that consistently rejuvenate on its own. There is a range of returns, but if given enough time horizon, you can build wealth decently.\n\nHowever, the negative about equities is that it can be rather volatile, and if a person needs money soon, the investment might still be negative. \n\nHence, for those who have shorter term financial goals, usually it is better to invest in a more cash/fixed income allocation.\n\nIf all these sounds very foreign to you, it means, its better to start learning. \n\nIf not what will happen is that you listen to someone you think its trusted, then you invest, then later you learn more only to realize that was suboptimal advice. So why not just learn more. \n\nAlso each of our situation is different. \n\nYou may likely to plan for marriage, banquet, home renovations in the next 10 years, and so the money may be needed. \n\nSo this is why its important to learn about personal finance.",
          "score": 1
        },
        {
          "text": "$240k and with no salary, then the only one you can do is break it up and buy STI ETF, QQQ and SPY. If you like china, buy something from HK like 2800 or 2823.\n\nIf you want to dabble in individual stocks, then just allocate a portion to this. You need to prove yourself first before you put more money into individual stocks.\n\nFor index, you can close your eyes and high probability it will trend higher over the next 10 years , even if there's a big crash incoming between them.\n\n  \nBecause you are 21 years old, your runway is too long to buy bonds. Don't make that mistake.",
          "score": 1
        },
        {
          "text": "At 21 your biggest edge is time, not short-term safety.\n\nT-bills preserve capital, but after inflation they’re weak growth assets. If you don’t need this inheritance for 10+ years, investing for long-term compounding is the rational choice.\n\nA single global ETF like VWRA gives exposure to thousands of companies across the world in one fund. You’re buying global economic growth. That level of diversification removes most single-country and single-company risk while capturing the long-run equity premium.\n\nOn lump sum vs DCA: markets have a positive expected return. Because of that, investing immediately beats spreading it out roughly 2/3 of the time. DCA mainly reduces emotional stress. It doesn’t maximize expected returns.\n\nSimple rule:\nMoney needed within ~5–10 years → keep safe.\nTrue long-term money → invest in equities.\n\nThe bigger risk at your age isn’t volatility. It’s being too conservative and missing decades of compounding.",
          "score": 1
        },
        {
          "text": "Keep to T-bills first, can take a look at Endowus for DIY investing via their flagship portfolio",
          "score": 1
        },
        {
          "text": "Ifa here. Looking at the timeline and possible scenarios. Tbills can be an option.   \n\n1. You mentioned grow safely (which is fantastic to be prudent).   \n2. I suggest putting a portion, not all. Keep some liquid in case market tanks, you have bullets to enter the market.    \n3. Tbills or fixed D so that when you start working, you are one step closer to buyinf first property (and if there is no immediate need for housing, rent it out).  \n4. If or when you enter the market, get some bluechips for dividends. Recommend starting with sg bluechips.   \n\nThats as far as i can think of.   \n\nI personally got a small inheritance when i turn 21 from my granddad’s trust. I bought a property. If i can turn back time, i probably would carve out my inheritance into a few vehicles for diversification and returns. Plan based on objectives not returns.",
          "score": 0
        },
        {
          "text": "Amzn, meta and chill. VWRA cuz it's mandatory in this sub",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1r7njsr",
      "subreddit": "singaporefi",
      "title": "When Is HDB Loan Quantum Finalised for BTO &amp; How Is Excess CPF OA Treated?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r7njsr/when_is_hdb_loan_quantum_finalised_for_bto_how_is/",
      "score": 2,
      "num_comments": 3,
      "created_at": "2026-02-18T08:14:43",
      "selftext": "Hi all, I’ve been reading the HDB website but can’t seem to find a clear answer, so hoping someone here can clarify.\n\n1. When is the HDB loan amount finalised?\nIs the loan amount only confirmed at the signing of the Lease Agreement (around 6–9 months after selecting the unit)? Or do we need to indicate/lock in the exact loan quantum earlier?\n\n2. CPF OA usage before taking an HDB loan\nHDB states that buyers can retain up to $20,000 in their CPF OA, and the remaining OA balance must be used to pay for the flat before taking an HDB housing loan.\n\nExample scenario:\n\n- OA balance: $100,000\n- Retaining: $20,000\n- Downpayment required: $50,000\n\nAfter paying the $50k downpayment from OA, there is still $30k left (since only $20k can be retained).\n\na. Will this remaining $30k automatically be used to offset the purchase price before HDB grants the loan?\n\nb. Or can this $30k remain in OA to be used for future monthly loan repayments instead?\n\n3. CPF transfer question\nIf that $30k can remain in OA for future monthly loan repayments, can it still be transferred to the Special Account (SA) when loan repayment starts? \n\nWould appreciate if anyone who has gone through the BTO + HDB loan process can share their experience.",
      "comments": [
        {
          "text": "a. Yes\n\nb. No. If you want to, you need to “shield” that 30K by making a CPF-IS investment before key collection. You can sell that investment after the mortgage starts.",
          "score": 6
        },
        {
          "text": "Actual loan amount to be taken is only confirmed upon key collection, after wiping up CPF OA (leave up to $20k each). HFE shows the max loan based on credit assessment, but actual loan is subject to LTV and the above mentioned..",
          "score": 2
        },
        {
          "text": "Your downpayment will increase and loan amount decrease. Your HFE states the max loan amount but doesn’t mean they have to loan u that amount. They will loan u the balance after wiping out the OA.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r7tm10",
      "subreddit": "singaporefi",
      "title": "VWRA vs ISAC",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r7tm10/vwra_vs_isac/",
      "score": 1,
      "num_comments": 5,
      "created_at": "2026-02-18T12:44:10",
      "selftext": "Anyone knows aside from the TER (ISAC is cheaper) and number of holdings (VWRA has more), what’s the main difference between VWRA and ISAC? Why does everyone on this sub recommend VWRA but I don’t see anyone writing about ISAC (tracks ACWI)? Is there a downside of ISAC I am missing? ",
      "comments": [
        {
          "text": "liquidity. \n\n  \nVWRA's liquidity or the difference between the bid ask spread will be small,but. ACWD or other smaller funds might not be as liquid therefore the cost of entry or exit might be worse, unless you use VWAP entry options from IBKR ",
          "score": 2
        },
        {
          "text": "I recommend ACWD.",
          "score": 1
        },
        {
          "text": "are you sure the TER% of ISAC is lower? I googled and it showed 0.20% compared to VWRA's 0.19%\n\n",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r7apz8",
      "subreddit": "singaporefi",
      "title": "How do I handle taxes as a full-time trader?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r7apz8/how_do_i_handle_taxes_as_a_fulltime_trader/",
      "score": 0,
      "num_comments": 9,
      "created_at": "2026-02-18T00:26:41",
      "selftext": "I know capital gains taxes are not taxable but trading gains are taxable.\n\nHowever, my account is mixed with short term trades and long term investments.In total, over a thousand trades last year.\n\nHow do I optimise paying the least tax legally?\n\nHow do you even define, which trade is taxable and which trade is capital gains and thus non taxable?\n\nCan an experienced trader help? ",
      "comments": [
        {
          "text": "Iirc frequent trades are income while long term are not. You have to separate them, at least on paper if they ask you for proof. \n\nDon't listen to the rest about not paying. The G will come after you for cpf and tax if one day you make it big. Also in the future if you need to buy any big ticket items they will need your NOA as well  Just declare whatever you earn minus expenses. If you are not earning much taxes will be low. It's the cpf contribution that will hurt though.\n\n\nEdit: this is only if it is your full time income. If it's your side hustle, you decide.",
          "score": 5
        },
        {
          "text": "it just means to the govt and banks, officially you're not employed lor.",
          "score": 1
        },
        {
          "text": "Didn’t know income from trading is taxable",
          "score": 1
        },
        {
          "text": "This is a grey zone.\n\nIf you argue that you trade for yourself and not run it like a business, trading gains is generally not considered income. It is capital gains, since it is not income, it is not taxable (no income tax chargeable).\n\nThe only part that is taxable is your dividends, if you receive any.",
          "score": 1
        },
        {
          "text": "if you are an American, you are still subjected to all of IRS's wonderful gifts including capital gain taxes even if you reside in SG and is SG tax resident.\n\nIf you are a Singaporean, do nothing.  If you want to declare trading as your means of income, that's on you.",
          "score": 1
        },
        {
          "text": "You won't get taxed unless you have a 8 figures fund running thousands of trades per month.\n\nOr you suddenly put a 10m down payment for a GCB without any other income source.\n\nDont think so much and enjoy your CNY.",
          "score": -6
        }
      ]
    },
    {
      "id": "t3_1r71hdj",
      "subreddit": "singaporefi",
      "title": "Miles game",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r71hdj/miles_game/",
      "score": 0,
      "num_comments": 47,
      "created_at": "2026-02-17T17:25:31",
      "selftext": "Hello! Fresh grad here earning slightly more than 30k annually. Thinking of getting into miles credit card as I’m someone who loves traveling, and can travel during non-peak periods. My spending is roughly &lt;$1k a month. \n\nRough breakdown:\n\n\\- tithe: $200\n\n\\- food (paywave, scan qr code): $500\n\n\\- gym: $98\n\n\\- transport: $100\n\n\\- others: $100\n\nWhat credit card would you recommend? Can you also share what credit cards on your different purchases to collect miles? ",
      "comments": [
        {
          "text": "honestly at your current earnings, a cashback card might be better",
          "score": 49
        },
        {
          "text": "Which Uni, what degree and job now? The 30k annual is abit disconcerting as it seems low. Would focus on raising this first rather than thinking about playing miles game at this point..",
          "score": 40
        },
        {
          "text": "Hey, I don't want to outright encourage/discourage you but you should know what you're getting yourself into.\n\nThe miles game mainly works for those who really value sitting long haul business class flights, and have the patience to accrue said miles.\n\nFor example, SIN - SFO on SQ business saver costs 112.5K miles one way. If you spend 1k on a 4MPD card, you'd need slightly more than 28 months to earn enough miles. Then you'd need book ~1 year ahead since sin-sfo is a very popular route. So realistically, you'd only benefit from the miles game ~3 years in. This of course varies with distance to destination. Not to mention you'd be subject to policy risk if miles gets devalued.\n\nIf this doesn't put you off, welcome to the miles game!\n\nThere's some argument for using miles for economy flights but I believe the cashback rates should beat CPP for economy flights.",
          "score": 22
        },
        {
          "text": "read up milelion for the most appropriate cc for miles.\n\nbut based on your expenditure now, i think you should be opting for cashback instead",
          "score": 19
        },
        {
          "text": "With such low spend, better to earn cashback",
          "score": 11
        },
        {
          "text": "Just get citi reward and call it a day. Most of the expenses you've listed here are not eligible for 10x rewards or even any miles at all.",
          "score": 9
        },
        {
          "text": "For you, Citi rewards + uob PPV \n\nBasically, anything online, pay with Citi. Anything u paywave, use PPV. Transport, assuming ez-link, works for PPV too.\n\nThough keep in mind that PPV is only technically 600 per month limit for paywave.",
          "score": 8
        },
        {
          "text": "I stopped playing miles cos the goalposts keep shifting... And then you gotta redeen flights like 1 year in advance to get the best rates",
          "score": 2
        },
        {
          "text": "Citi Rewards for now",
          "score": 1
        },
        {
          "text": "or u can target those cards with high miles bonus on sign up. not sure if ur income can clear these.\n\nI'm not sure how true this is but if u cancel ur card with the bank, u are eligible for new bonus if u sign up again after 1yr.",
          "score": 1
        },
        {
          "text": "It’s scary. Fresh grad and just above 30k?",
          "score": 1
        },
        {
          "text": "Your salary is too low even for a fresh grad.\n\nAnyway, attack cards with sign-up bonuses first. Citi Premiermiles, UOB prvi miles, DBS Altitude. That's where you get the most bang for your buck.\n\nCheck out Singsaver and you may even get to pair with extra free gifts. Don't forget to cut eventually.\n\nThen get Maybank XL for 4mpd on all overseas spend (must hit minimum spend of $500).",
          "score": 1
        },
        {
          "text": "Too low for miles game",
          "score": 1
        },
        {
          "text": "If you have a KrisFlyer account, go search for the routes that you want to travel in.\n\nIf you can redeem tickets at Saver prices, you know that the miles game is good for you. If it's mostly Advantage, or even worse, Access, be prepared for the world of pain that most of us are going through.\n\nSingapore Airlines doesn't guarantee redemption seats for each flight, and does stealth \"devaluation\" by lowering the number of Saver and Advantage seats or raising Access prices whenever they feel like it.\n\nI don't recommend anyone just starting out collect KrisFlyer miles anymore. (Sadly, Cathay is the other widely-available programme in Singapore, and it's probably even more difficult.)",
          "score": 1
        },
        {
          "text": "Save money and dont travel lah. Travelling is overrated anyway.",
          "score": 1
        },
        {
          "text": "Uob PPV - contactless $600, online spend $600",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r7aixo",
      "subreddit": "singaporefi",
      "title": "IBKR SGD to USD money exchange or different tactic?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r7aixo/ibkr_sgd_to_usd_money_exchange_or_different_tactic/",
      "score": 0,
      "num_comments": 6,
      "created_at": "2026-02-18T00:20:24",
      "selftext": "What do you think is the best way to change 600k sgd to usd and send to US. \n\nMy plan is to exchange all 600k SGD to USD using the manual method to only pay $2. I read the $300 preview is an overestimating. Then use the USD and purchase a \"stable\" US etf and hold for 6 months. After 6 months I would then cash to a US bank account.\n\nAny thoughts or issues you see with this method? if you have any suggestions for any other more stable methods than an ETF I would love to hear. thanks",
      "comments": [
        {
          "text": "Why are you checking fees but not exchange rates?",
          "score": 4
        },
        {
          "text": "I'm not sure if you want to link your ibkr to your us account: 1) FBAR reporting 2) tax 3) us bank anti laundering threshold (8-10k) would trigger checks for sure.",
          "score": 1
        },
        {
          "text": "Got 600k and can't even be bothered to pay for expert advice and come here ask redditor. \nLmao",
          "score": -4
        }
      ]
    },
    {
      "id": "t3_1r7a6t5",
      "subreddit": "singaporefi",
      "title": "IBKR money exchange or other options?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r7a6t5/ibkr_money_exchange_or_other_options/",
      "score": 0,
      "num_comments": 5,
      "created_at": "2026-02-18T00:09:16",
      "selftext": "What do you think is the best way to change 600k sgd to usd and send to US. It seems like using IBKR would be a good idea if im willing to hold US stock for 6 months or greater.\n\nMy plan is to use IBKR to convert SGD to USD. Then use the USD to buy a \"stable\" US etf. After 6 months I would cash out to a US account.\n\nI would love to hear anyone's thoughts on what etf or what would they buy with this plan? and if they feel that 6 months is enough to not raise any alarms with IBKR. I would ideally be making one trade but wouldn't mind buying etf for 3 months. For example buying 200k worth of etf every month for 3 months. ",
      "comments": [
        {
          "text": "Wtf is a stable USD etf?",
          "score": 1
        },
        {
          "text": "Boxx etf for risk free",
          "score": 1
        },
        {
          "text": "Banks are required to report for transactions over a certain amount. Your account might be flagged for money laundering",
          "score": 1
        },
        {
          "text": "Nobody knows what exactly will trigger IBKR’s flagging system. \n\nWith such a large sum can’t you just negotiate a preferential rate with a bank, and even get them to trigger when the rate is favourable (like a limit order), rather than take on risks?",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r7b0nv",
      "subreddit": "singaporefi",
      "title": "HDB rejected HFE letter due to overseas property",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r7b0nv/hdb_rejected_hfe_letter_due_to_overseas_property/",
      "score": 0,
      "num_comments": 5,
      "created_at": "2026-02-18T00:36:20",
      "selftext": "I am divorced with two kids from my abusive ex-husband three years ago due to physical violence.\n\nMy ex-husband and I bought a property overseas, which costs less than SGD 70,000. We purchased the overseas property because he wanted to retire abroad at the time.\n\nDuring the divorce, my ex-husband declared the property as part of the assets jointly owned by us. \n\nAs a result, both of us are unable to buy an HDB flat, either BTO or resale, because HDB rejected my applications for an HFE letter, despite assistance from an MP.\n\nWe sold our resale matrimonial flat, and 80% of the proceeds from that sale went into our Ordinary Account. I have been trying to sell the overseas property for three years, but there have been no buyers.\n\nAre there any similar cases where HDB approved an HFE letter despite an overseas property? My OA account has sufficient funds to purchase a 5-room resale flat, but I am unable to do so because of the overseas property.\n\nMy applications have been rejected multiple times, and I am very tired. My kids and I are struggling with housing. Can anyone provide the best advice on what I should do in my situation? Please help.",
      "comments": [
        {
          "text": "just rent in the mean time and quickly dispose of the junk abroad. i'm sure there are buyers if you are willing to drop the price ",
          "score": 11
        },
        {
          "text": "Transfer the property overseas to a relative at a relative price and move on with life",
          "score": 4
        },
        {
          "text": "It might be allowed if there is an elderly relative living in that overseas property and they are dependent on you and you can’t transfer ownership to them because they have no income and can’t qualify for a mortgage. I have heard of successful appeals along these lines.\n\nBut if you have been trying to sell for 3 years and can’t sell, it sounds like your asking price is too high. You and your ex could agree to sell it dirt-cheap, or even look into donating it or giving it away, since the problem affects him too? Better to write off 35k each than be unable to buy HDB.",
          "score": 2
        },
        {
          "text": "appeal to MP?",
          "score": -1
        }
      ]
    }
  ]
}