{
  "schema_version": "raw_scrape_v1",
  "report_id": "2026-02-25",
  "scraped_at": "2026-02-25T11:42:10.362189",
  "subreddits": [
    "singapore",
    "askSingapore",
    "SingaporeRaw",
    "singaporefi"
  ],
  "total_posts": 40,
  "total_comments": 493,
  "posts": [
    {
      "id": "t3_1rd92qf",
      "subreddit": "singapore",
      "title": "Pritam Singh calls for full disclosure of billions in public spending amid record surpluses",
      "url": "https://old.reddit.com/r/singapore/comments/1rd92qf/pritam_singh_calls_for_full_disclosure_of/",
      "score": 874,
      "num_comments": 160,
      "created_at": "2026-02-24T14:45:39",
      "selftext": "",
      "comments": [
        {
          "text": "Gone for the bloody nose there👍The number 1 question on everyone’s mind. What do you plan to do with a 15 billion surplus?",
          "score": 551
        },
        {
          "text": "&gt;Mr Singh also questioned whether the formula used to determine ministers’ bonuses remains appropriate, in light of Deputy Prime Minister Gan Kim Yong’s earlier remarks that [GDP growth may no longer translate into jobs for Singaporeans](https://www.channelnewsasia.com/singapore/economic-strategy-review-jobs-gdp-growth-ai-5895496).\n\nSounds like it's time for PAP to move the goalposts",
          "score": 504
        },
        {
          "text": "Actually, this Pritiam comments are all on point hahahahaha. Just look at the state of Skillsfuture Singapore funding - how to guage efficiency?",
          "score": 253
        },
        {
          "text": "My man came back with a vengeance.\n\nDude be like \"Fuck it, We ball\"",
          "score": 167
        },
        {
          "text": "This has been on my mind after Covid, there was a draw out from the reserves of 100B. Has it been accounted for who gets what? A big chunk of it went to the GLCs.  I heard small businesses that got the bail out has to return the money.",
          "score": 123
        },
        {
          "text": "That motion alone is worth supporting Pritam's wp.  It's time we scrap the wasteful 3m1s framework and have proper universal health care.\n\nAnd it's not just the spendings we need to have insight into. Every year the pap's budget forecasts a low surplus or even a deficit just so they can justify new taxes. But in the end if we have more surpluses than forecasted, the extra is happily shoved into the reserves. Together with the revenue from land sales. \n\nWhat they do with our reserves nobody knows. For starters I want to know how much they're paying folks to manage gic and temasek.",
          "score": 100
        },
        {
          "text": "Me think this man should be considered as leader of opposition, should such an appointment exits",
          "score": 92
        },
        {
          "text": "I wont be surprise if a few years down the road, the concept of dynamic cdc voucher payouts(more vouchers if you have more member of household) get introduced albeit refined under different parameters. ",
          "score": 91
        },
        {
          "text": "I think this is very important.\n\nA government is not a business or person.\n\nFor businesses and people, saving a lot of money and spending little is good.\n\nFor a government, it just means they are taxing and taking from citizens while not efficiently using the monies they took.\n\nA surplus is good but when it is clear that there is an over-surplus or a frequent surplus every year, something is clearly wrong.\n\nThis is not the case of person A earns $100 and spends only $30 to keep $70 as savings.\n\nThis is the case of person A's parent taking $30 each from person A and his sibling and then using the collected monies to just spend $5 for each child, claiming the remaining $25 per child is to save for rainy day. Then repeat and repeat year after year without even telling the children how much they already accumulated in this \"rainy day fund\".\n\nAt some point, any logical person will question what is the money for and minimally wants to know how much is it or what % is actually used for them instead of god knows what.",
          "score": 82
        },
        {
          "text": "Please give us the Seletar MRT line soon.",
          "score": 13
        }
      ]
    },
    {
      "id": "t3_1rd9uzt",
      "subreddit": "singapore",
      "title": "Ordered butter kaya baguette at Killiney . They gave me the whole baguette lol. Uncle my mouth isn’t that big 😮",
      "url": "https://old.reddit.com/r/singapore/comments/1rd9uzt/ordered_butter_kaya_baguette_at_killiney_they/",
      "score": 653,
      "num_comments": 91,
      "created_at": "2026-02-24T15:32:48",
      "selftext": "",
      "comments": [
        {
          "text": "With the current trend of serving 1 slice of bread cut into 4 or more with paper thin butter in between.. what you got is considered a steal already lo.\n\nDabao eat for dinner and tmr morning breakfast. 😬",
          "score": 477
        },
        {
          "text": "steak is too juicy, lobster is too buttery",
          "score": 188
        },
        {
          "text": "This is hilarious. At least cut the baguette slice in half, and put the kaya inside..",
          "score": 149
        },
        {
          "text": "I hope it was worth the price lol",
          "score": 81
        },
        {
          "text": "TIL they sell a footlong kaya toast.",
          "score": 38
        },
        {
          "text": "give you big bread also complain.. Not happy then don't eat mah",
          "score": 23
        },
        {
          "text": "I actually prefer my baguettes whole.",
          "score": 18
        },
        {
          "text": "This is the classic case of how impt presentation is",
          "score": 17
        },
        {
          "text": "Pass the ball if you don't wanna play",
          "score": 11
        },
        {
          "text": "![gif](giphy|xAG8Hr3TxhoD7GR6g1)",
          "score": 11
        },
        {
          "text": "Damn gd le",
          "score": 6
        },
        {
          "text": "uncle saw something we didn’t 🤣",
          "score": 6
        },
        {
          "text": "The only sin in the pictures are the baguettes weren't semi-halved in the middle, and then the inside toasted nicely. Otherwise, lucky you.",
          "score": 6
        },
        {
          "text": "Honestly that looks delicious. Was it crispy too?",
          "score": 5
        },
        {
          "text": "Why are we complaining bout too much food now 🥀🥀you really want less food for same price ah",
          "score": 4
        },
        {
          "text": "Your mouth isn’t that big YET.",
          "score": 3
        },
        {
          "text": "how much did you pay?",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1rdbzfn",
      "subreddit": "singapore",
      "title": "Almost 24,700 couples in Singapore said ‘I do’ in 2025, lowest since 2020",
      "url": "https://old.reddit.com/r/singapore/comments/1rdbzfn/almost_24700_couples_in_singapore_said_i_do_in/",
      "score": 376,
      "num_comments": 175,
      "created_at": "2026-02-24T17:47:10",
      "selftext": "",
      "comments": [
        {
          "text": "Cos now is \"How I do?\"",
          "score": 346
        },
        {
          "text": "Guess not every issues can be solved by handing out CDC vouchers",
          "score": 333
        },
        {
          "text": "Everything so expensive, economic uncertainties, AI, upskill etc etc not hard to see why.\n\nBy the next decade i think 50% of people living here are foreigners already.",
          "score": 273
        },
        {
          "text": "Look at the resale prices I also scared",
          "score": 199
        },
        {
          "text": "How to get marry when everyone seems to be so so preoccupied with just surivial. The main issue is the cost of living had increase so much (thanks to back to back GST increase and inflation).",
          "score": 130
        },
        {
          "text": "honestly I'm surprised we even hit 24k lmao, was expecting 20k\n\ngodspeed to them, life is fucking hard.",
          "score": 65
        },
        {
          "text": "Why marry when you are happier and richer as single 😂",
          "score": 52
        },
        {
          "text": "Could it be more of a shift in societal norms as well? More people staying as partners rather than getting legally married?",
          "score": 49
        },
        {
          "text": "I think Singapore more or less give up le. Immigration is the way",
          "score": 15
        },
        {
          "text": "everyone here saying no money but i see all the ahbengs driving up prices in pokemon💀",
          "score": 13
        }
      ]
    },
    {
      "id": "t3_1rd5qbe",
      "subreddit": "singapore",
      "title": "Manulife S'pore sells record S$380 million life insurance policy to single client",
      "url": "https://old.reddit.com/r/singapore/comments/1rd5qbe/manulife_spore_sells_record_s380_million_life/",
      "score": 247,
      "num_comments": 99,
      "created_at": "2026-02-24T12:32:06",
      "selftext": "",
      "comments": [
        {
          "text": "Wow the agent sure enjoying his CNY to the max",
          "score": 267
        },
        {
          "text": "Waits  for the headline ‘Manulife single client dies in suspected fall, wife claims insurance’",
          "score": 110
        },
        {
          "text": "Beyond a certain level of wealth, this kind of insurance is just not really sensible. You are already a billionaire. If you die or become disabled, your heirs get paid another $380m. What's the point?",
          "score": 57
        },
        {
          "text": "I assume the client is a multi-billionaire?",
          "score": 55
        },
        {
          "text": "People are assuming that the client is a Singapore resident. Just because the policy was booked under Manulife Singapore, does not mean that the client is a Singapore resident. I am also not saying it is not but I do know of many HNWI from countries in the region who buys insurance in Singapore.\n\nFor certain insurance policies, the premiums are cheaper in Singapore due to higher life expectancy here. \n\nThere might also be tax benefits, especially if you are from a country with estate taxes. You can structure a Variable Universal Life to defer or avoid certain taxes as well, which is especially useful for succession planning. It could also be for liquidity management if their assets are tied up in property or business interests.",
          "score": 40
        },
        {
          "text": "&gt; Nearly seven in 10 of these fortunes are self-made.\n\nsure bo?",
          "score": 16
        },
        {
          "text": "sounds like a policy they never intend to pay out. when shit happens and the claim comes, why would they pay when the legal fees to fight it out in court is so much less.",
          "score": 10
        },
        {
          "text": "Definitely come with kickback for the deal. Just not in the usual proper channels.",
          "score": 8
        }
      ]
    },
    {
      "id": "t3_1rdfre6",
      "subreddit": "singapore",
      "title": "Tim Hortons Singapore is now officially halal-certified",
      "url": "https://old.reddit.com/r/singapore/comments/1rdfre6/tim_hortons_singapore_is_now_officially/",
      "score": 223,
      "num_comments": 164,
      "created_at": "2026-02-24T21:07:30",
      "selftext": "",
      "comments": [
        {
          "text": "Some people don't realise, Timmie's has had Muslim staff since launch, and the food has always been halal. It was only a matter of time till they get cert",
          "score": 171
        },
        {
          "text": "Why not restaurants operate both halal and non-halal versions. Understood gyg don’t have pork in the menu at T.hub and does well. Malaysia has both kind dtf",
          "score": 51
        },
        {
          "text": "For one I'm still glad the likes of MOS Burger and CoCo Ichibanya are still holding the fort.",
          "score": 46
        },
        {
          "text": "Thats odd. I thought they all got Halal cert on their first day of launch here in Singapore.",
          "score": 33
        },
        {
          "text": "When this news came out, I could almost smell the same old comments talking about the food quality dropping etc etc.\n\nIt happened with Subway. I'm pretty sure it happened in the past, way back with the likes of McD, KFC, Delifrance, Pizza Hut and so on.\n\nAnd I'm sure the same old comments will appear again in future when other restaurants decide to get halal certified.\n\nCome on lah...the horse has died multiple times over...no need to beat it anymore",
          "score": 29
        },
        {
          "text": "Love the maple cinnamon latte",
          "score": 9
        },
        {
          "text": "Why are people mad\n\nIt's a coffee shop, who is eating pork there",
          "score": 6
        },
        {
          "text": "Not interested since Tim Hortons was sold BK to form RBI. When it was still in the family, TH was good",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1rdagdg",
      "subreddit": "singapore",
      "title": "The Room That Changed the Most in Singapore Homes: What Happened to Our Kitchens?",
      "url": "https://old.reddit.com/r/singapore/comments/1rdagdg/the_room_that_changed_the_most_in_singapore_homes/",
      "score": 191,
      "num_comments": 62,
      "created_at": "2026-02-24T16:09:24",
      "selftext": "",
      "comments": [
        {
          "text": "Only reflects the falling number of families who do real cooking at home. Many choose to eat out, or order food delivery. So, when space comes under pressure, kitchen space is first to go.",
          "score": 179
        },
        {
          "text": "I have a friend staying in the Mountbatten old flats area, I've been to his house once and was shocked at how ridiculously huge the entire kitchen was compared to the entire house. \n\nFor scale, you could fit 1 and a half bedrooms in there.",
          "score": 67
        },
        {
          "text": "This pisses me off and I have sworn off on purchasing newer BTOs and Condo. We do a lot of heavy cooking and there is simply no room to place all the cooking utensils and do any meaningful preparation unless you only plan to cook instant noodles. \n\nOlder flats are the only affordable option in this space",
          "score": 65
        },
        {
          "text": "I dunno what's up with the recent trend of putting the bomb shelter / kitchen / bathroom at the entrance. When I open the door, what I really want to see is the nice cosy relaxing living room. Not the messy kitchen or crappy toilet / closed storeroom door in my face.",
          "score": 58
        },
        {
          "text": "Seriously I eat at home and bring lunch to work, the size of the kitchen is really cramped. \n\nI’m old enough to miss the spacious layouts of HDBs and Condo units from the late 80’s to mid 90’s. \n\nAnd if I ever see that Mabok Tan…",
          "score": 25
        },
        {
          "text": "Like many other things in Singapore, cooking has been outsourced to foreigners",
          "score": 24
        },
        {
          "text": "Can we just do away with having an inner corridor (i.e. rooms directly attached to the hall)? And maybe also the bomb shelter, go back to a design where each stack has it's own underground bomb shelter.",
          "score": 19
        },
        {
          "text": "I don't know man. The balcony seems to be something that went from 0 to 2 real quick. That's an infinite increase on a percentage basis. In exchange, the yard and HS went from 1 each to 0.",
          "score": 14
        },
        {
          "text": "It's good to have a variety of layouts. We don't cook so tiny kitchen is perfect. But I can understand why another family wants a full kitchen with plenty of preparation and cooking space. Maybe HDB can have modular designs so ppl can adjust size of kitchen Vs living/dining/study, adjust bedroom sizes/layouts etc.",
          "score": 11
        }
      ]
    },
    {
      "id": "t3_1rdz5tb",
      "subreddit": "singapore",
      "title": "‘SEAblings’ v Korea: Online spat reveals long-buried racial tensions",
      "url": "https://old.reddit.com/r/singapore/comments/1rdz5tb/seablings_v_korea_online_spat_reveals_longburied/",
      "score": 179,
      "num_comments": 92,
      "created_at": "2026-02-25T09:17:01",
      "selftext": "",
      "comments": [
        {
          "text": "Kdrama/Kpop is the biggest magic trick Korea pulled on the world.\n\nIn the context of Asia and probably globally, they are among the most racist and toxic societies around.\n\nNo, I don’t say this as some casual traveller who goes to Myeongdong but as someone working in a Northeast Asian-centric industry and has been to Seoul at least 8 times in the past year alone.\n\nWhen it comes to business negotiations, tempers will always flare. But it’s always civil and professional with the Chinese, Japanese and Taiwanese. The Koreans? It gets personal and you get vulgarities thrown at you and other microaggro stuff.\n\nHonestly found it weird as my industry is abit of a musical chairs so yes I’ve ended up as colleagues with some of them after. And they wonder why people give them a weird look and try to distance themselves.\n\nGot a contract with a Korean company and their ka kia screws up? To save his skin, he’ll go full aggro on you as a counterparty to try to absolve himself of any blame.\n\nKnow any brokers with Northeast Asian clients? Yeah sure, you get tiko Chinese, Japanese and Taiwanese clients who try to idk, pressure you into some quid pro quo arrangement. Koreans? Borderline SA-ish.\n\nIn many ways, the Koreans are more like what the world views/stereotypes the Chinese as.",
          "score": 218
        },
        {
          "text": "I saw this happening on my TL\n\nSingapore caught a lot of strays lmao.",
          "score": 180
        },
        {
          "text": "This is purely anecdotal but my wife works in a SK entity and nothing she witnesses invalidates the stereotype of racist Koreans.",
          "score": 100
        },
        {
          "text": "I knew Koreans were assholes since my diablo2 days lol Knn always come to game first thing is press the hostile button",
          "score": 53
        },
        {
          "text": "Nothing about this surprises me\n\n\nI have visited many Asian countries. China. Malaysia. Japan. Korea. Cambodia. Thailand etc.\n\n\nThe rudest of them all?\n\n\nThe South Koreans",
          "score": 47
        }
      ]
    },
    {
      "id": "t3_1rdf7bs",
      "subreddit": "singapore",
      "title": "Budget 2026 debate: Eileen Chong on how AI should not just improve productivity, but liveability",
      "url": "https://old.reddit.com/r/singapore/comments/1rdf7bs/budget_2026_debate_eileen_chong_on_how_ai_should/",
      "score": 137,
      "num_comments": 36,
      "created_at": "2026-02-24T20:41:53",
      "selftext": "",
      "comments": [
        {
          "text": "The key to using AI as i have found is - use it to help your work, but don't tell your bosses or colleague about it. \n\nOnce you tell your bosses and it actually works, it just spread through the team and eventually becomes part of the SOP. It becomes the BASELINE and everyone is expected to deliver more.\n\nI developed my own AI solution and kept it to myself and complete my task in less than half the time. I spend half the week on my WFH days sleeping because I'm already done with that week's deliverables.",
          "score": 280
        },
        {
          "text": "When has anything that's been touted as time-saving or \"make your work/life easier\" has been to our benefit? We just get more work added on top.\n\nEvery person in the world could have been learning the violin or the piano or learn to paint a masterpiece or writing their magnus opus with the amount of \"time-saving\" invention us humans have invented since the dawn of time, but we just get more work assigned to us lol.",
          "score": 185
        },
        {
          "text": "When asked whether she tried to learn AI, Indranee said she’s got no time. AI for thee,no need for me.",
          "score": 96
        },
        {
          "text": "This is a conversation that needs to happen globally, not just SG.  \nUnfortunately, I don't see a way out.",
          "score": 41
        },
        {
          "text": "So glad she spoke about this. AI is not going to be good for average workers, it will just be another way for capitalists to extract more value from us while paying us the same. It will widen inequality and needs to be properly governed and regulated.",
          "score": 33
        },
        {
          "text": "Well articulated and well said\\~often we feel we have to chase the growth and progress in AI era and it becomes a rat race",
          "score": 9
        },
        {
          "text": "it's true. nowadays we need to do things faster, and in turn it has led to doing a lot more things everyday. because we need to justify doing a lot more things to fill up our time. compared to the past where you try to achieve smaller number of objectives per day. the mental load is extremely high",
          "score": 6
        },
        {
          "text": "Eloquently delivered and well articulated, quite hearten to hear a differing and more realistic, grounded views - instead of just blindly agreeing and supporting along the focus on AI. \n\nTIL 44hrs work per week w/o OT time, puts us as one of the most overworked places among developed countries. \n\nTotally supports that “liveability” in SG needs to be a factor for AI Council’s consideration. With the time saved from being more productive with AI, it shouldn’t be more work loads but quality time and more room for breather. This seems like a possible outcome and opportunity to balance work and life in our fast pace environment. \n\nReally need to reset and focus on the people, instead of prioritising employers interests, profits and GDPs.",
          "score": 6
        },
        {
          "text": "exactly. but unfortunately it will be that way. SG is pro business after all.",
          "score": 3
        },
        {
          "text": "My boomer boss thinks AI is constantly “hallucinating” and refuses to even use Copilot or learn the basics of prompting. I’ve long stopped trying to convince him and just finish my work in half the time",
          "score": 3
        },
        {
          "text": "Jevons paradox, anyone?",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1rddunn",
      "subreddit": "singapore",
      "title": "Man thinks coast is clear at Punggol HDB staircase, defecates, gets caught on camera, resident makes police report",
      "url": "https://old.reddit.com/r/singapore/comments/1rddunn/man_thinks_coast_is_clear_at_punggol_hdb/",
      "score": 135,
      "num_comments": 32,
      "created_at": "2026-02-24T19:36:43",
      "selftext": "",
      "comments": [
        {
          "text": "poonggol",
          "score": 44
        },
        {
          "text": "Punggol:\n\nLook at me, I'm the Yishun now",
          "score": 31
        },
        {
          "text": "Now every mother father dog move to Punggol until the weirdos also managed to sneak in",
          "score": 30
        },
        {
          "text": "Too eager to defecate until forget to check for CCTV?",
          "score": 12
        },
        {
          "text": "I kind of get urgency, but man had tissues on hand and it did not occur to him to shit on the tissues themselves?",
          "score": 12
        },
        {
          "text": "Someone needs to interview him to know what exactly went through his mind to decide to defecate there",
          "score": 3
        },
        {
          "text": "GROSS",
          "score": 2
        },
        {
          "text": "Bro wanted to save the 10c toilet fee at hawker centre",
          "score": 2
        },
        {
          "text": "Ok seriously why though? Some kind of fetish or what?",
          "score": 1
        },
        {
          "text": "Haha... funny. Because these guys think about security that much.",
          "score": 1
        },
        {
          "text": "[ Removed by Reddit ]",
          "score": 1
        },
        {
          "text": "Should go punggol coast instead after reading the headlines ",
          "score": 1
        },
        {
          "text": "Someone did that at my corridor too. I went to buy lemon spray and wipes to clear. Smell yuck too. ",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rda8bl",
      "subreddit": "singapore",
      "title": "Singapore confirms measles case in 11-month-old girl; first involving child in preschool since stepped-up measures",
      "url": "https://old.reddit.com/r/singapore/comments/1rda8bl/singapore_confirms_measles_case_in_11monthold/",
      "score": 126,
      "num_comments": 39,
      "created_at": "2026-02-24T15:55:39",
      "selftext": "",
      "comments": [
        {
          "text": "I understand in America that vaccination is a political and polarizing issue rather than a scientific and medical one, but we don't have this issue in Singapore right? I assume everyone who is medically fit will be required to be vaccinated, and they cannot voluntarily withdraw from being vaccinated for any reasons? Or is my assumption wrong?",
          "score": 68
        },
        {
          "text": "They should bring back vaccination records in passports. Bar people from entering the island unless you have your vaccines (unless medically exempt). If they're too stupid to get the vaccine, we don't need them.",
          "score": 45
        },
        {
          "text": "i wonder where this kid caught the measles? ",
          "score": 27
        },
        {
          "text": "Sidetrack: Do people send their sick or barely recovered kids back to school still? I feel like there are 2 camps. One camp damn careful, the other camp fkin dump their kids sick in school give teachers and classmates headache",
          "score": 9
        }
      ]
    },
    {
      "id": "t3_1rdb91z",
      "subreddit": "askSingapore",
      "title": "Why did my tutee’s parents give me such a big angpao?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rdb91z/why_did_my_tutees_parents_give_me_such_a_big/",
      "score": 530,
      "num_comments": 156,
      "created_at": "2026-02-24T17:00:23",
      "selftext": "I’m a uni student and my pt job is giving tuition to primary sch children. They just gave me a really thick red packet, and when I got home and opened it, it was $2888. Anyone knows if it could be an accident? Should I mention to the parent that it’s too much? The amount is so high that I’m completely taken aback. Do I just do nothing and have lessons as usual? Or are they expecting something in return? So lost and anyone who has experience in Chinese customs or something pls enlighten me thanks!",
      "comments": [
        {
          "text": "My advice is to cross check with parents as it’s absolutely not a common amount.",
          "score": 699
        },
        {
          "text": "Double check with the parents whether they’ve given you the correct angpao. If yes, just thank them. If you don’t feel comfortable accepting it, then just return back the angpao. Because in this world, there’s no such thing as a free lunch.",
          "score": 437
        },
        {
          "text": "Did the kid’s grades improved from F to A+? $2888 is unusual.",
          "score": 284
        },
        {
          "text": "I think you should reflect what did you do to this child that is so life changing that you receive such a big angbao. 2888 is like buying an entire table of 10 at a wedding leh. Pls check with the parent",
          "score": 222
        },
        {
          "text": "i think its better to check. Honesty and integrity goes a long especially they are still your customer and word-of-mouth is extremely important in your line.",
          "score": 210
        },
        {
          "text": "Do they need an art therapist? Could you bring me in?",
          "score": 120
        },
        {
          "text": "The house is semi-d or 3 room flat?",
          "score": 109
        },
        {
          "text": "Totally check with the parents. They also would have a higher respect of you whether or not it was meant for you.",
          "score": 65
        },
        {
          "text": "Had a friend who was teaching indo kids. She used to get 2k plus every time about 7 years back.\n\nThey owned mines in Indonesia and were crazy rich",
          "score": 43
        },
        {
          "text": "UPDATE!!",
          "score": 38
        },
        {
          "text": "They wanted to give you a leg up in life as you're starting out as you're helping their kid level up too.  \nIf you want to double back and say thanks, just say thanks and that you'll put the money to good use.",
          "score": 27
        },
        {
          "text": "Are they a rich family, or from China? Some China people are used to giving large angpaos. ",
          "score": 24
        },
        {
          "text": "Double check. If it’s wrongly and they paisey this is the chance for them to take back. If they meant to give you $2888 say thanks and ask why so much and hear praise from them on why you deserve it.",
          "score": 20
        }
      ]
    },
    {
      "id": "t3_1rdavon",
      "subreddit": "askSingapore",
      "title": "Why is it harder for guys to find a partner as compared to girls?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rdavon/why_is_it_harder_for_guys_to_find_a_partner_as/",
      "score": 265,
      "num_comments": 364,
      "created_at": "2026-02-24T16:36:02",
      "selftext": "Based on statistics generated in 2025, there is a relatively equal proportion of guys and girls in singapore, with approximately 107 to 109 males for every 100 females. With no huge disparity in gender ratio, why do guys find it much harder to get a partner in singapore?",
      "comments": [
        {
          "text": "From a demographic standpoint, 109 men to 100 women is actually a massive disparity.",
          "score": 377
        },
        {
          "text": "Men finding partner is like finding drinking water in a desert, while women finding partner is like finding drinking water in a swamp.\n\nJust because something is easier to find doesn't mean happiness is garunteed.",
          "score": 302
        },
        {
          "text": "Answer is obvious.",
          "score": 235
        },
        {
          "text": "Weirdly I have girlfriends who r above average looking and have no guys reaching out to them, but the very average looking girlfriends have many suitors… how does that work and anyone has a theory",
          "score": 136
        },
        {
          "text": "So you open with a statistic then make an assumption that less men attached than girls?",
          "score": 122
        },
        {
          "text": "Strangely as a guy I find there are more single girls than guys.",
          "score": 114
        },
        {
          "text": "Don’t have a single male friend by choice. All attached or married besides the happily gay ones. \n\nAbout half of my female friends are single.",
          "score": 107
        },
        {
          "text": "Look at the lists of standards of the average guy and girls.",
          "score": 92
        },
        {
          "text": "in general guys accept lower, girls look for higher\n\neven the below average girl have guys hitting on them",
          "score": 87
        },
        {
          "text": "Hypergamy. SG women are smart and are well paid. What value does a man bring to the relationship when the woman is earning more, keeping herself fit, well-travelled etc",
          "score": 70
        },
        {
          "text": "A lot of 4/10 guys think they are going to bag that 10/10 girl. And many average women think that 10/10 handsome boi with $$$ and an amazing future is somehow going to date  them. Hello, men like that are swarmed by women, many far beyond average. They got choices, you dont. You not even on the radar. \n\nAnd for men, sure, maybe if you have cash and wish to be with someone who only values your financial worth,  you do you. Both consenting parties understand what is really going on there, go for it, and I know people who have somehow found joy in that. I dont understand how, but whatever works for them. \n\nBut for the rest of us, the biggest problem is expectation management.\n\n\"But, I deserve what I am worth!\"\n\nSure, you deserve someone who respects, loves you, wants to see your grow, grow old together blah blah blah.  But let us be perfectly honestly here, what you really saying is you want chiobu with big tits as your trophy wife while you are ...average. \n\nAnd most of us are average. For women, easier to get out of that, to marry \"up\" . For men, I am sorry, you got to find women who are also average and are happy with average. And before you have a mental fit, I am not saying average is bad. But we all tend to fantasize about ourselves as being such hot fucking catches when the reality is often more dull. \n\nAnd that is ok. Ok to be \"average\".",
          "score": 68
        }
      ]
    },
    {
      "id": "t3_1rdg4yi",
      "subreddit": "askSingapore",
      "title": "Should all public schools in Singapore be made fully secular, or should Christian affiliated public schools be required to be more accommodating to non-Christian students?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rdg4yi/should_all_public_schools_in_singapore_be_made/",
      "score": 246,
      "num_comments": 116,
      "created_at": "2026-02-24T21:24:04",
      "selftext": "I overheard this conversation at the bus stop today. A kid from my neighbourhood got off the bus and immediately burst into tears as she hugged her grandmother. She told her that her classmates had made fun of her for believing in gods “that are not human.” She said she wanted to convert to Christianity and that she hated her current religion because her classmates told her that “only low-class people” believe in it.\n\nI was honestly shocked to hear this coming from kids, although perhaps I should not be. I attended the same primary school in this neighbourhood 20 years ago, and this was already the culture back then. As a child, I did not know how to articulate my discomfort, so I just shrugged it off. It is disheartening to see that the same environment seems to persist two decades later.\n\nI am not sure what the culture in other Christian schools is like now, but in my school back then (20 years ago), we had compulsory weekly chapel sessions for everyone except Muslim students. All of us had to sing Christian songs, and some teachers would even single out those who did not sing and make them sing in front of them. It was also common for everyone to say “May God bless you” at the end of every lesson. I still remember Christian classmates telling me daily that I was going to hell because I did not believe in their religion. These experiences were the reason I deliberately chose a secular secondary school, and things genuinely improved after that.\n\nSome of you might argue that non-Christians can simply opt for secular schools. However, a quick search shows that there are about 30 out of 147 secondary schools in Singapore, which is roughly 20.4%, are Christian affiliated. When cut off points and location are major factors, it becomes nearly impossible to avoid considering a Christian school during the selection process.\n\nIn my view, the culture in my primary school at the time of forcing non-Christian students to participate in Christian activities may have encouraged children to say cruel things and to internalise a sense of religious elitism. The encounter I witnessed today suggests that the effects of such a culture may still be hurting children now.\n\nShould all public schools be made fully secular, or should Christian affiliated public schools be required to be more accommodating to non-Christian students? Non-Christians who attended Christian affiliated schools, please share your experiences.\n\nI won't say which school this is, but it's located in the east.\n\nEdit: Many of you are right, it was a protestant school. I didn't know that catholic and protestant school culture could be so different. What I shared was my own personal experience of that particular school 20 years ago. I'm not sure if there's any changes since so I can't fully comment on that. At least now I know which schools I can tell my friends and relatives to avoid. ",
      "comments": [
        {
          "text": "My experience in a Catholic school was that any non-Catholic could opt out of chapel. Not just Muslims.",
          "score": 168
        },
        {
          "text": "After I read the part about “May God bless you”, I knew which school you’re talking about. I attended that school in the 90s. It’s the one with the circles 🫧\n\nThe practices you’re describing may have happened to you 20 years ago, but it’s not the case anymore. My (atheist) dad was a relief teacher there up until Covid. He says the kids don’t have to sing or pray if they don’t want to. There are also a lot more non-Christian students now. \n\nAs for the kid you overheard, all I can say is that ignorant and unkind children are everywhere. Bullies will always find a way to single out their target. If it isn’t religion, it’s something else like your appearance, your results, or your pencil case.",
          "score": 114
        },
        {
          "text": "I went to a Catholic primary school and tbh it was so chill. You can choose to attend Mass or not, if you do then obviously you can’t receive holy communion but I attended cos my friends were Catholics and I wanted to hang out with them. There’s also cathecism (?) class which again you can choose to attend or not. If you don’t then you attend something like moral education which is secular in nature. There were prayers during assembly but again you don’t have to pray and no one will single you out. \n\nThis is of course my own experience and I’m sure there are kids being bullied. It’s very unfortunate but I think it also depends a lot on the school’s leadership. Luckily for my school our principal was Catholic but she never made it seem like only that religion was the best, she was very welcoming of other religions too.",
          "score": 91
        },
        {
          "text": "religious people making fun of other religions will forever be peak comedy",
          "score": 75
        },
        {
          "text": "Eh. I used to study in a secular primary school and I was also made fun of by Protestants. And mind you, I was a practicing Catholic then. And they really parroted a lot of stuff which were so wrong about Catholicism that I'm sure they either got from their parents or their church leaders. Ironically I also used to attend a Catholic school and it was a lot more tolerant because there were a lot more non-Christian kids among the student body. My sibling also attended a different Catholic school and there was like, minimal religion stuff. In fact most kids in the school weren't even Christians, so nobody actually cared. And even when I was in freaking uni, in my course there was this highly visible chunk of Protestants and they'd always be talking about their cell groups and prayer meetings and you just can't really be friends with them because they don't have time for much else. \n\nSo. Two things. One, kids are cruel and it's good to teach kids from a young age how to handle these situations. Secondly, a lot of our Christian friends really need to examine how their behaviour can come across as really non-inclusive.",
          "score": 71
        },
        {
          "text": "I’ve noticed an increasing trend of ragebait ~ish content by newish accounts in the sg subreddits of late. Their content appears to have also become increasingly less obviously ragebait/aided by AI in a matter of just weeks, by the insertion of vivid details and intimate knowledge of local culture. \n\nI’m starting to wonder if sg redditors are being used for some sort of testing. Or if some nefarious actors are trying to stoke internal divisions. Or just some people nothing better to do. \n\nThis child’s outburst, all caught in a brief overheard bus stop encounter, seems to have covered a lot of ground in such a short time - not human, low class people, hatred, and instantly decided to abandon own religion. \n\nMaybe I’m overthinking it. But the encounter doesn’t sound entirely convincing to me. That said, I think there’s value in diversity in the types of public schools we have. My own school song from a secular school here featured Greek gods and magic, lol.",
          "score": 49
        },
        {
          "text": "As a non christian that attended a Catholic primary, secondary and Christian JC never felt pressured to conform lol to participating in any jesus stuff or whatever. \n\nJust happy our government does not have any laws enforcing any religious beliefs.",
          "score": 38
        },
        {
          "text": "Studied at Catholic High as a free thinker. Never felt pressured or compelled to convert. ",
          "score": 37
        },
        {
          "text": "I feel like the issue might be that particular school's culture rather than Christian schools in general.\n\n\nI was in one (pri and sec) decades ago, think maybe 70-90% of students were Christian? We used to have chapel once a week. Around the time I was graduating I think it was made optional for non-religious students (although I don't remember the alternative). That and morning prayer at assembly were the only religious stuff. Nobody really talked about religion outside of that. The culture (during my time at least) in general was quite peaceful, bullying like you described would've been too lowbrow.\n\n\nIn JC there was one lesson where class was split between Christian teachings and... I think general secular stuff? ",
          "score": 33
        },
        {
          "text": "Over half of the cabinet is Christian (Catholism included). Fat chance that any real change will happen.",
          "score": 31
        },
        {
          "text": "ex-christian from a christian school in secondary sch. I wld agree that yes the schools could be more accomodating towards non-christians. But wow this school is fucked lmao\n\nNobody in my school was forced to sing during chapel or pray during devotion. Though God bless you was a greeting at the end/start of class.",
          "score": 29
        },
        {
          "text": "Sounds total bullshit?\n\nI was in a catholic secondary school and nobody forced us to do anything. \n\nOther than the morning prayers and occasional events, it literally functioned like every other secondary school.",
          "score": 23
        },
        {
          "text": "I was from a catholic secondary school, am not a catholic or even christian. We were never picked out and forced to say or do anything like that? There are morning hymns, short prayer after recess - everyone just kind of join in because you hear it so much. \n\nEvery class has to organise a mass in sec 4, the Catholics will take charge. We are also told that if you are not baptized, you cannot receive communion etc, and are not obliged to do anything except sit with your class.\n\nThe most memorable part of sec sch with all these Catholics is fridays where they should not eat meat, so everyone keeps swapping burgers for my filet o fish on fridays.",
          "score": 21
        },
        {
          "text": "Catholic schools are pretty chill. It’s the Protestant ones that are the problem",
          "score": 19
        },
        {
          "text": "1.\t⁠We actually have Buddhist public schools in Singapore, although there are very few of them. Maha Bodhi, Manjusri, Mee Toh. In addition to the Catholic and Protestant schools and the Madrasahs (although they’re under MUIS, not MOE). The long association between religion and schools in this country, when some of the earliest schools here were established by missionaries, means it’s going to be very tough to make all schools secular, as much as it’s a noble idea. You’re right that Christian schools should be accommodating and respectful towards all religions their students are of. This is a fundamental principle that underpins education. From what you described, it seems certain Christian schools here still have a long way to go.\n2.\t⁠I’m quite taken aback by the number of Protestants here who see it fit to disrespect and demonise other religions and tell others that Christianity is the only road to salvation otherwise they go to hell. Granted they do not represent Christianity, but I’ve come across enough of them to worry what has become of them. As a Christian myself I take a very dim view of my brethren who do just that.\n3.\t⁠I have to say, I wonder if this phenomenon has to do with the way Christianity, especially American-style evangelicalism and megachurches, is spread here since the 60s/70s. I lived in England, I didn’t see as much of this, even within the supposedly evangelical circles. They were more respectful when it came to promoting Christianity, even if they had faults. How this phenomenon is seen so often in Singapore is something I struggle to understand.",
          "score": 16
        },
        {
          "text": "I went to a Methodist (aka Protestant) primary school and Catholic secondary school. Both definitely had some religious things going on (chapel class once a week, sing hymns, listen to Bible stories, go for Mass in the Catholic school). Pretty much everyone had to go but it didn't feel super forced down my throat either. Catholic school was definitely more chill, the Catholic classmates as well - never had a single one tell me to join their church etc while I had a few Christian ones ask me.\n\nDespite being brought up in a Taoist household I don't think I was really uncomfortable tho. Maybe it's just cos I ended up being an atheist/agnostic so lots of it just bounced off me. I feel a lot of it is what you make of it as well. I didn't mind learning the hymns cos some of the songs were nice, for example. \n\nI do agree that they should have things \"opt in\" rather than \"opt out\" but I think it's too much to ask for all schools to be fully secular. Even in a secular school, Christian kids might still try to convert their classmates or say those things to other non-Christian students. I feel like it's on the kids' parents to teach them how to deal with such things instead of mandating rules that will be difficult to enforce anyway.",
          "score": 11
        },
        {
          "text": "Had the experience of going to a Christian sch as a kid. Enjoyed the free biscuits, grape juice and storytime. Peers and teachers were p chill about it too. I think in hindsight everyone was glad we could take a break from class and enjoy some a/c. I think this could really boil down to the culture of a particular batch / cohort.",
          "score": 7
        },
        {
          "text": "I'm firmly in the religion needs to fuck off camp— schools, governance and public service in Singapore must be STRICTLY secular. \n\nMuslim students have this thing called a Madrasah, where they can go to an extracurricular class to learn about their religion. It's usually held after school or on weekends. If Christians want to indoctrinate their kids, they can do it Madrasah style.\n\nReligion must be kept out of public schools.",
          "score": 6
        },
        {
          "text": "Sounds like St. Hilda's",
          "score": 4
        }
      ]
    },
    {
      "id": "t3_1rdvyit",
      "subreddit": "askSingapore",
      "title": "Anyone takes PHV to work daily?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rdvyit/anyone_takes_phv_to_work_daily/",
      "score": 219,
      "num_comments": 153,
      "created_at": "2026-02-25T07:06:15",
      "selftext": "I take PHV to work about 3 times a week. Each trip costs around $20 to $35. Most people around me think it’s a waste of money to spend that much just getting to work, but I see it differently.\n\nTo me, it’s still way cheaper than owning a car in Singapore (COE, insurance, petrol, parking, ERP, maintenance etc.).\n\nThe main benefit is time and mental space. Taking PHV saves me about 30 minutes compared to the usual walk, train, bus, walk combo. That extra time (and not squeezing in peak hour) gives me peace to think through my morning meetings and start the day calmer.\n\nI usually take public transport home, unless I have dinner plans, then I’ll PHV back to get more rest time. If i end work slightly earlier, I'll also PHV to the gym so that i can avoid the peak hour crowd. Only time I feel buay song is when surge hits $45+++… but that’s quite rare for me.\n\nCurious if anyone else also pays for time and sanity?",
      "comments": [
        {
          "text": "We all have things we splurge on. No need to try so hard to justify it",
          "score": 249
        },
        {
          "text": "Back when i lived at hougang and work at yishun, that's 1.5 hours of public transport vs 25 mins of phv, i took phv to work daily\n\n20-30 dollars to have extra hour of sleep\n\nAnd yes, much cheaper than owning a car",
          "score": 190
        },
        {
          "text": "I have a few Grab Hitch drivers saved in my contacts, as my journey is between Punggol and Boon Lay. 2 hours on public transport vs 45 minutes, and having shift allowance to offset this is “manageable”",
          "score": 100
        },
        {
          "text": "It always depends on how much you're earning. $10k/mth you can afford that luxury. $2k/mth you actually can't afford to do that.",
          "score": 61
        },
        {
          "text": "Going by car prices now, your option gets you peace of mind , some good rest - things you value. Moreover there is no need to justify as how you spend is your choice.",
          "score": 41
        },
        {
          "text": "I’m sure your co-workers go for a few drinks after work and don’t bat an eye, but same impact on budget. \n\nI have a car, but usually let my wife take it. I actually prefer a 45-min door-to-door bus rider vs 30-min bus-train-walk. I sit and plan my day the full 45-mins vs. up/down walking where I just rush for 30-mins. Win the morning, win the day.",
          "score": 33
        },
        {
          "text": "You do you, man. Generally people will see tangible outcome only. PHV = costs more money. They can't quantify your sanity. Do what makes you happy. ",
          "score": 27
        },
        {
          "text": "How much are you earning every month to be comfortable with spending close to $100 per week on PHV rides?",
          "score": 26
        },
        {
          "text": "It’s definitely worth spending on time imo. If your budget allows of course. I ride a motorcycle for the very reason. Assuming i spend 2 hours daily on public transport, that can add up to 200+ hours of time saved per year doing something else. I’m paying only about 3-4k a year for this time. Worth.",
          "score": 18
        },
        {
          "text": "Yeah I mean it’s perfectly sensible. With parking fees and gantry fees and maintenance fees it’s just seriously not worth in my view.",
          "score": 8
        },
        {
          "text": "You don’t need validation if you know what you are doing",
          "score": 8
        },
        {
          "text": "I had a teacher friend who did. \nStays at Bukit Batok (not near MRT), teaches at AMK (no clue how that got assigned). \n\nHave to reach school well before 7am, if take public transport have to wake up at 4.30am. Decided sleep is more important and so pay $20-40 per day everyday. Pay to go to work 🤔 Sucks when it rains and sucks when need to go school for short 2-3 hours. \n\nAfter awhile, finally found one grab driver who stay nearby willing to make that trip every morning, they arranged it informally. So less stressful finding phv every morning and cost, though moderately cheaper, is still high. \n\nLike one of the commenters said, everyone has things they splurge on. As long as you do due diligence, don’t need to justify externally",
          "score": 6
        },
        {
          "text": "It makes total sense to me; I’ve been doing this for a few years now. Taking a PHV to and from work saves me about 2.5 hours every day, which I get to spend relaxing and doing things I enjoy outside of work. \n\nOf course, most people I work with, as well as my family and friends, think I’m a little crazy. But as long as it’s justifiable to yourself and you’re able to manage the finances well, I think it’s perfectly fine. In fact, compared to owning a car, being a passenger allows me to catch up on work, reading, or anything else instead of focusing on driving; that’s actually bonus time too.",
          "score": 5
        },
        {
          "text": "Cheaper than owning a car in Singapore -&gt; This statement is true so no judgment here.",
          "score": 4
        },
        {
          "text": "A lot of people will pay for time and sanity, they just don't post on reddit to justify it to themselves because the money spent is worth it to them.\n\nPersonally, if taking PHV/taxi saves 30 min or more, I think it's worth it. If you can find a colleague who lives near you to share the ride with, it's even more worth once you split the bill. If you live in certain places, it can take 30+ min just to take a bus to the mrt, and that one and only bus is packed like sardine with people who didn't shower in the morning...",
          "score": 4
        },
        {
          "text": "i live next to the mrt station. a mrt ride takes me 1h10mins including walking, a phv ride takes me around 1 hour no thanks to the major jam on TPE everyday :( \n\nit’s enough reason to stop me from taking phv. paying $30 more for 5-10 mins of extra sleep..?",
          "score": 4
        },
        {
          "text": "I would say it boils down to whether one can afford it.",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1rd8yt8",
      "subreddit": "askSingapore",
      "title": "What is one residential area in Singapore that you will not recommend staying in?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rd8yt8/what_is_one_residential_area_in_singapore_that/",
      "score": 146,
      "num_comments": 263,
      "created_at": "2026-02-24T14:39:21",
      "selftext": "Is there any area that you will actively avoid when you are house hunting? Need your honest opinions pls",
      "comments": [
        {
          "text": "If you can't handle kids, don't move to Sengkang/Punggol/ESPECIALLY Bidadari",
          "score": 314
        },
        {
          "text": "A specific part of Bt Gombak. Unless u really enjoy lots of young punks blasting music and lots of neighbours that have no civil mindedness.\n\nHighly recommend during house hunting not to just depends on your agent viewing. After shortlisting preferred option, take some weekend morning and evening time go spotcheck to see if dysfunctional neighbors being noisy in morning and evening. Some are unbearable. Such spotcheck helps alot. If WFH then also go on weekdays day time.\nJust my serious personal recommended actions coz am suffering due to failure to do this previously. And police can't help much for such scenarios tbh",
          "score": 206
        },
        {
          "text": "Anywhere too far from your office",
          "score": 192
        },
        {
          "text": "I feel that commuting time is a huge aspect of QOL, and when your workplace/school requires 1 hour of daily commute, it can really take a toll on your mental health. For that reason, places in the far-flung north-west like CCK, Yew Tee are very undesirable to me since offices tend to be located in city or central SG. These areas, unlike Punggol, Woodlands, or Bukit Panjang, do not have a straight line down to city/CBD (technically they do but tolerating the whole redline detour from kranji onwards is crazy), so you typically need to change to other lines to reach town.\n\nI stay in Keat Hong but there was a straight bus to NUS back when I was still studying and a straight bus to my first workplace in the west so it wasnt that bad. Currently, my office is located near city and having to change multiple lines PLUS needing to take feeder bus is exhausting. Not too many pros here except for the Mcdonalds downstairs my block.",
          "score": 98
        },
        {
          "text": "Punggol. Especially the shore area that overlook Pasir Gudang. Good luck with the air quality there. ",
          "score": 87
        },
        {
          "text": "Changi Village. Sounds good on paper. Live near the sea, can go Ubin on weekends, quiet corner of the island, plenty of food places nearby. \n\nBut it takes forever to get anywhere, even with car.",
          "score": 76
        },
        {
          "text": "Avoid living near by CTE, PIE or similar where there are no noise barriers..\n\n  \nNow that so many Malaysians are coming to work in Singapore, their modified exhaust motorbikes, speeding cars are giving nightmares at night..",
          "score": 73
        },
        {
          "text": "Sentosa Cove. \n\nGetting in and out is a pain. God forbid if you forget your resident access card, or for some reason you need to get in/out without a private vehicle. Or your kids or friends.\n\nAlso good luck with calling Grab either for transport or for delivery. \n\nWaiting for the shuttle bus takes 30-40 mins.",
          "score": 52
        },
        {
          "text": "This question can be pretty biased as where you stayed when you were a kid highly influences which area you think is “bad”. I stayed in the Central Area for most of my life even though I work nowhere near which is in the far east, but I loved where I stay for its conveniences. I told myself I’ll never move to places like Seng Kang , but guess where I’m staying now.",
          "score": 51
        },
        {
          "text": "Sengkang; esp if u need to take LRT in\n\nTravel to sec sch 30-45min  \nTravel to jc 1hr  \nTravel to uni 1.5hrs  \nNow travel to office 1hr  \nMeetups in town? At least 1hr  \nMeetups in the East (e.g. Paya Lebar, IKEA) also 1hr! Why?? I'm alr in the East-ish??\n\nHonourable mention to the crazy purple line crowd during peak hours 🥲",
          "score": 37
        },
        {
          "text": "right above the kopitiam. big ass exhaust fan can be fucking loud and hdb would say the noise level is acceptable and within the range and do nothing. the fan will turn on from 7am till over 11:30pm.",
          "score": 17
        }
      ]
    },
    {
      "id": "t3_1rdb5w4",
      "subreddit": "askSingapore",
      "title": "Is there a growing trend of individuals “settling” in terms of marriage?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rdb5w4/is_there_a_growing_trend_of_individuals_settling/",
      "score": 64,
      "num_comments": 44,
      "created_at": "2026-02-24T16:54:24",
      "selftext": "I’ve noticed a growing number of individuals in my social circles who seem to have settled for their spouses. I once met an acquaintance who only meets their partner once a week (didn’t see a need to meet more often), and couldn’t give a definitive answer as to what they value in their partner. They ended up getting married 1-2 years on anyway. \n\nThen there’s shotgun marriages where I believe both parties settled for each other despite knowing each other for less than a year. I believe this is a prerequisite to unlock paid maternity leave.\n\nIs this increasingly prevalent in our society since our policies are centred around families and couples (eg. housing)? ",
      "comments": [
        {
          "text": "Your social circle is weird, time to get out of your well",
          "score": 117
        },
        {
          "text": "you dont love your plant when you first got it, but everyday you keep watering it, checking the soil, and making sure temperatures are right, after 5 years would you say you \"settled\" for the plant or you love it?",
          "score": 111
        },
        {
          "text": "just your social circle. \n\nhm or maybe its because how this generation was raised? practicality over dreams. ",
          "score": 63
        },
        {
          "text": "Errrr it's not quite clear from your post but how well do you know these people anyway? Most people don't know 80% of what goes on in their friends' relationships. Even close friends. I only met my hubby once a week when we were dating because we texted each other all the time and okay la we had known each other forever. You can meet each other 5x a week but if it's not meaningful, then also no point. \n\nMy point is, how do you know these people are \"settling\"? If you meet the right person, and you click together, and you share the same philosophy towards marriage and family, and you're not going to kill each other if you see that person every day for the next 30 years, is that \"settling\"? The Hollywood idea that there is Some Perfect Person out there for you and like this relationship is going to be your everything is .. a myth. And tbh, unsustainable.",
          "score": 47
        },
        {
          "text": "Just your social circle. In my circle, more people are opting to stay single instead of settling.",
          "score": 19
        },
        {
          "text": "Never heard of that in my social circle, but also maybe some cases are lavender marriages. Gay people need affordable housing too",
          "score": 19
        },
        {
          "text": "i don't quire understand how your examples are categorised as settling...?\n\nif people want bio kids, especially women, they have a biological clock. there is no perfect person and waiting doesn't mean anything because time doesn't determine the success of a relationship - it's expectations, values, goals, and the willingness to put in the work.",
          "score": 17
        },
        {
          "text": "I don’t like the concept of “settling or reaching” marriage is really hard. End of the day we want someone committed and kind to us. Sometimes people forget when everyone is gone and grown, our spouse is the one we face till we die. Maybe your friend cannot give you a definitive answer because some relationships are so easy and simple that you just simply value everything about them. You just genuinely like this person and it’s so natural that no words can explain it. \n\nAlso who are you to say they settled for each other because ultimately they are the ones in the marriage. You need to look beyond the surface",
          "score": 16
        },
        {
          "text": "Marriage no longer seems like it’s for eternity. Now people get married because life as a couple is easier than being a single since can bto.",
          "score": 16
        },
        {
          "text": "Yes.. I see this too. It’s probably exacerbated by the BTO system and the desire to fit into the typical singaporean mould",
          "score": 10
        },
        {
          "text": "Most likely explanation is that you and your social circle are getting older, so of course the likelihood of settling goes up. But it doesn't mean that 5 or 10 years ago, people who were the same age back then were less likely to settle.\n\nIn fact, settling was probably more common in the past because the stigma of \"old maid\" was higher, match-made marriages were also more common. \n\n",
          "score": 6
        },
        {
          "text": "From your logic/judgement, they are settling or they told you they settled? That is a huge difference. ",
          "score": 6
        },
        {
          "text": "No there’s no growing trend. Each year you’re getting older, so you’ll see more individuals in your same social circle “settling”",
          "score": 6
        },
        {
          "text": "I have a few friends in my circle like this too. Almost 100% of the cases I see are guys who very obviously love themselves a lot more than their partners + girls too afraid to break up cos of biological clock 🫠 very sad.",
          "score": 6
        },
        {
          "text": "still better than arranged marriages in the past ",
          "score": 6
        },
        {
          "text": "What’s wrong with meeting once a week?\n\nLife so busy already\n\nI also feel that we are restricted by BTO.\nGetting married because want to buy house.",
          "score": 5
        },
        {
          "text": "I know someone who kept saying two of our acquaintances \"settled\" for their partners. The person has been harping on this for more than a decade; the two acquaintances are still happily married and have grown their families, while person is still single. \n\nTrust people to make the right choices for themselves.",
          "score": 5
        },
        {
          "text": "A relationship is a huge time and financial investment. It is hard to find someone you can get along with.\n\nReal life is not a disney or hollywood movie where true love is the end-all and be-all. Finding a compatible partner is already winning. If you are madly in love with them is a bonus. \n\nJust because you love each other does not mean you are compatible.\n\nLove can come in many forms and it can grow in different ways. \n\nKings and queens and the elites of society don’t care one bit about love, for a reason.",
          "score": 4
        }
      ]
    },
    {
      "id": "t3_1rd83wl",
      "subreddit": "askSingapore",
      "title": "Where in SG can I learn some conversational Hokkien",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rd83wl/where_in_sg_can_i_learn_some_conversational/",
      "score": 57,
      "num_comments": 36,
      "created_at": "2026-02-24T13:54:29",
      "selftext": "SG millennial hopeless Chinese here, I realised I can’t connect with my ageing parents as much as I’d prefer. Sometimes they speak to each other in Hokkien and pivot to me to continue the conversation and I have zero context. Sometimes it’s just nice to understand their comments on random things outside or on the TV. Or maybe try to get in on their humour.\n\nIf possible I want the coffeeshop/SG/M’sian style, I’m not even sure if that’s the right way to put it. I mean as opposed to ‘original’ mainland china style.\n\nAny ideas where to begin?\n\nAlso, what about Hainanese? Our PM is Hainanese, I’m mildly curious\n\nEDIT to add: thanks everyone for the suggestions. I'm gonna just whack it. Just memorise a few everyday phrases and get started talking. Wish me luck!",
      "comments": [
        {
          "text": "sorry to say this but if you didn't pick up from your parents conversing with each other, then it's almost impossible to learn through classes. Min-nan is known in China as one of the most complicated dialect to learn. My daughters attended the hokkien clan classes. not much use as expected.\n\n  \ni foresee hokkien and most dialects will die off within 2-3 generations",
          "score": 43
        },
        {
          "text": "the hokkien huay kuan runs courses from time to time",
          "score": 38
        },
        {
          "text": "From your parents",
          "score": 17
        },
        {
          "text": "Learning is one thing. Using is another. My grandmother spoke only in Hokkien. I think she passed away when I was aged 3 or 5. Can't remember. By then, I was semi fluent in Hokkien. Spoken only. Ask me to read lyrics from Taiwan songs that are in the Min language, I don't know how to translate to Hokkien. \n\nMy dad spoke only Cantonese. I became fluent in Cantonese without taking classes. Again, ask me to read, maybe I CMI.\n\nIMO, languages is not about taking classes. You need to also use it so that you can get to master it. The structured way of how sentences are taught might not be what you use in street conversation too.",
          "score": 17
        },
        {
          "text": "From Wang Lei",
          "score": 15
        },
        {
          "text": "There's a learndialect.sg I keep seeing their ads but have never tried it. They have online classes Maybe it'll be convenient for you. \n\nMaybe can also learn from friends or volunteers? \n\nHokkien is pretty similar to what they use in the Taiwanese soap drama (that lasts for years). My aging parents always follow the shows on ch8.",
          "score": 13
        },
        {
          "text": "SAF, free lessons some more lmfaooo",
          "score": 7
        },
        {
          "text": "Can try watching content from yitinggoyt on Tiktok, she's the hokkien girl on Tiktok. She banters with her parents sometimes and you can get an insight on understanding what kind of conversations can happen in Hokkien and what kind of jokes you might be able to learn from her.   \n\n\nIt would be abit more slice of life vibes that would allow you to get more insights on how such conversations happen and what kind of humour you can consider trying with your parents.",
          "score": 5
        },
        {
          "text": "There are different associations or clans for the various dialect groups in Singapore. Unfortunately language is mostly learned through practice and socialisation - the only reason I am able to speak 3 different dialects is because I had no choice but to learn if I want to communicate with my grandparents.\n\nChinese serves as a very good starting point - my advice is to try and get fluent in mandarin first, that will form the baseline and serve as a reference for the other dialects. The moment you are able to translate chinese to dialect and vice-versa, you will pick things up much faster.\n\nFYI my chinese sucks too, but after having to converse with clients from mainland China, it just starts improving over time. Dialects in Singapore are unique in the sense that they evolved more for easy communication among fellow countrymen - so that's exactly what you have to do, try to converse (even if very poorly at first).\n\nMusic also helped a lot for me - for hokkien specifically you may look at Taiwanese artists (although there may be slight differences) like EggPlantEgg, the singer has very good enunciation which helps for clarity, the MVs are subtitled with the hokkien pronunciation with mandarin characters so you get to learn the meaning and how to pronounce at the same time",
          "score": 5
        },
        {
          "text": "If you live with them, then can try to converse with them in Hokkien more? Listen and dont be afraid to speak. My parents use to tease me when I speak hokkien but then I continue and now I can chitchat with my parents in Hokkien, no doubt some pronounce is very funny. lol.    \nMy hub can also speak hokkien, so its our secret language when we talk in front of my kids.   \nMy kids sadly, although see their grand parents almost everyday did not really pick up Hokkien. My mum will speak chinese to them and sometimes simple hokkien, like have they eaten, or tell them the food is hot. ",
          "score": 5
        },
        {
          "text": "There are some Hokkien shows on Mewatch! One that I recall is 没马跑. You just need to select the original one as it was recently dubbed to Chinese.",
          "score": 3
        },
        {
          "text": "Maybe refer to Taiwanese dramas and listen to Taiwanese music eg Wu Yue Tian? Haha but others have already mentioned the classes at the huay kuan. I think there are old Singaporean movies that also use Hokkien eg Jack Neo movies, though I can’t say I really enjoy the humour.",
          "score": 2
        },
        {
          "text": "honestly i picked up my hokkien from home and im the only one in my generation to be able to understand and speak hokkien, my cousins are not able to speak and barely understand. honestly my uncles’ wives cant speak too but understand hokkien. its important to be able to practice, otherwise you may end up understanding but not able to speak. (i think there are radio channels in hokkien and some  ch8 dramas in hokkien too, not too sure but ive briefly seen and heard it before)\n\ni get to practice because at home i get to speak hokkien with my grandparents and previously when i volunteered and worked with elderly i get to speak in hokkien (and cantonese). \n\nnot related to hokkien but i picked up my cantonese from watching TVB dramas and practiced with my friend who is super fluent in canto, get to speak with old folks and sometimes practice with my mum since she speaks a little canto. so i’ll say watch dramas in hokkien accompanied by chinese subs (easier for me but english sub works too) to understand. \n\ni learn dialects and languages pretty quickly so i dont take up classes for it and i always learn via watching shows.",
          "score": 2
        },
        {
          "text": "Tekong.\n\nJust kidding, you should try to approach the Hokkien Huay Kuans",
          "score": 2
        },
        {
          "text": "Go to old residential estates. Hang around void decks and food/wet markets and make friends with the elderlies there. Plenty of them hang right downstairs their house because they dont venture very far away from their homes. They speak in chinese dialects and not mandarin. Or you can try those bird singing places. Alot of elderlies bring their birds for competitions too",
          "score": 2
        },
        {
          "text": "Hougang",
          "score": 1
        },
        {
          "text": "Go Chinatown talk to the old folks hanging out in public spaces",
          "score": 1
        },
        {
          "text": "Speak Mandarin campaigns were rampant in the 70s and 80s until all TV programs were dubbed in Mandarin.\n\nGrowing up in a Cantonese family, I learnt the dialect from young speaking to parents and relatives. As for Hokkien, most of my childhood and teenage friends are from that dialect group so naturally picked it up along the way. \n\nDuring NS, picked up the Malay language as well. \n\nDue to work as I was stationed in Bangkok for a couple of years, I managed to pick up the Thai language.\n\nMy elder child is fluent in Cantonese but my younger child's command of the Cantonese language is half past six. \n\nI also noticed that those Gen X onwards, majority don't speak their dialects as their parents either converse with them in Mandarin or English. Same goes for their friends. All these lead to the \"extinction\" of various dialects. \n\nAs for OP, try to befriend an elder person, listen and then speak with them. Over a period of time, you should be able to pick up the dialect but it will take time and practices.",
          "score": 1
        },
        {
          "text": "There’s a Singapore Hokkien Meetup where people meet to chat.\n\nOr you could just befriend your neighbourhood kopitiam uncles.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rdjq8q",
      "subreddit": "askSingapore",
      "title": "how is it like living in changi village?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rdjq8q/how_is_it_like_living_in_changi_village/",
      "score": 58,
      "num_comments": 23,
      "created_at": "2026-02-24T23:46:05",
      "selftext": "curious to hear from anyone living there, isn’t it terribly inconvenient for everything?",
      "comments": [
        {
          "text": "Best if you travel for work, nasi lemak and supper or breakfast.",
          "score": 52
        },
        {
          "text": "Omg I’ve always thought about this too. It’s a little village on its own and I really love the laid-back vibes, but I can’t imagine myself staying there before retirement as it’s really quite far from everywhere else, and I’m saying this as an east-sider who has a straightforward route to that place via bus. Nonetheless, it’s such a charming and unique place in Singapore. Changi beach is a gem.",
          "score": 47
        },
        {
          "text": "There's wet market, eateries, basic amenities, bus services there. Better than most of the new BTOs.",
          "score": 43
        },
        {
          "text": "Surrounded by plethora of eateries, just by the beach, a quick boat ride away to another island. pretty dope, tbh.",
          "score": 30
        },
        {
          "text": "Lunch there is easy but until hawker centre closed for spring cleaning, harder to find something else to enjoy.\n\nSo you have ever travel further or find eateries near SPS or Changi Airport. Glad I’m not working there anymore.\n\nBut love lor mee and the two uncles.",
          "score": 18
        },
        {
          "text": "Grew up in the estate nearby. It was like living in the countryside ",
          "score": 16
        },
        {
          "text": "Had an retired uncle who used to live there. Definitely not for families as there's no school nearby and far away from every part of Singapore.\n\nHowever it's like it's own little town. Extremely laid back, quiet and near lots of nature and lots of good food so I guess there's that.",
          "score": 14
        },
        {
          "text": "It’s a wonderful place if you like a more cozy, rustic vibe. However, bear in mind the current mrt road works, which will last till 2029 (not 100% sure) which causes a lot of extra travel time due to rerouting of the roads. That said, post the works, the mrt will be up and it will be exponentially faster.",
          "score": 7
        },
        {
          "text": "It's inconvenient now but there is the cross-island line which is currently under construction which will link to Changi Village.",
          "score": 4
        },
        {
          "text": "One thing for sure , it is the only place I tink where u don't have fast food near the 500m vicinty .\n\nEven tengah oso not so bad.\n\nSo if u like fast food thn u gonna be very sad",
          "score": 4
        },
        {
          "text": "Left my backpack for 10 minutes in C.Village and it was stolen. Found it in a nearby bin with my toddlers food removed (fruit and crackers), milk bottle was thrown into a nearby hedge. Nope, I wouldn’t fancy living there.",
          "score": -4
        },
        {
          "text": "Worst place to live, avoid if you can.",
          "score": -17
        },
        {
          "text": "[deleted]",
          "score": -24
        }
      ]
    },
    {
      "id": "t3_1rd4f41",
      "subreddit": "askSingapore",
      "title": "What is SQ Cabincrew salary for the 4 ranks?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rd4f41/what_is_sq_cabincrew_salary_for_the_4_ranks/",
      "score": 42,
      "num_comments": 15,
      "created_at": "2026-02-24T11:55:13",
      "selftext": "Does anyone know how much the cabin crew for the different ranks earn?\n\nBlue: Most junior\n\nGreen: Leading\n\nRed: Chief\n\nPurple: In flight manager",
      "comments": [
        {
          "text": "Blue : 4-5k\n\nGreen :5-6k \n\nRed: 6-7k \n\nPurple: 7-9k \n\nAfter CPF. But all depending on roster. Some months maybe more some maybe less",
          "score": 57
        },
        {
          "text": "All the cabin crew i speak to swear they make 10k",
          "score": 3
        },
        {
          "text": "[deleted]",
          "score": -129
        }
      ]
    },
    {
      "id": "t3_1rdkv7a",
      "subreddit": "askSingapore",
      "title": "Are you still in contact with your childhood friends? How things changed over the years for you guys?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rdkv7a/are_you_still_in_contact_with_your_childhood/",
      "score": 40,
      "num_comments": 18,
      "created_at": "2026-02-25T00:27:15",
      "selftext": "Back in early 2000s, some days we would be playing block catching while other days we would be playing pokemon or yugioh cards or playing TV console games at their place. The corridor was filled with our noises on almost daily basis. Some days we would be playing football at void deck or scooter/cycle to parks around our estate. Thankfully no one complain or scream at us for being noisy back then and we really had so much fun together. We were all from the same primary school so we would walk home together daily and had much fun diverting our route to explore random places around the neighbourhood.\n\nAfter we move on to secondary school things start to change as we have our own group of school friends and all the BGR stead situations (you can guess how old I am already for saying this) but we still meet up regularly to go LAN shop together when it was popular back in the days. Experienced our first neighbour family moving out during that period too. The last neighbour friends/family moved out 10 years ago and it was very sad for me. Till today when I walk past their units I would still subconsciously look at their window (those along corridor) because it always remind me of my childhood times when they will be asking me over the window to come in and join them for games. It's all different now. Sad to say I've lost contact with both families/friends because I don't know why we just did not exchange our contact number back then.\n\nHow about you guys, are you all still in contact with your childhood friends or what happened along the way when you guys grew older?",
      "comments": [
        {
          "text": "I’m so blessed to still in touch with two childhood friends that I can safely call my sisters (not in an ah lian way)! One I’ve known through a family friend since I was born. We even lived together for two years when I was growing up. Though we don’t meet up often for the past 15 years or so (once a year and text here and there), I know she’ll always be there for me and vice versa. Though we both grew up in the church and she went on to be a pastor while I “backslided” she never treated me any different and recently she served as the solemniser for my wedding which was extra special! Our families are also still in touch :) \n\nMy other childhood bbf and I have been super close ever since we met in secondary school. We would hang out and text very often though we went to different polys, she studied overseas, diff job industry etc. During our teenage years we would hit the clubs, double o, phuture, rebel and always have weekend sleepovers (with chick flick movie marathons!) We both have seen each up at our best and worst, boyfriends, break ups, marriages, divorces, family issues etc.\n\nWe had a misunderstanding a decade ago and went no contact but found our way back to each other again since then. Over the last 5-6 years, we make it a priority to meet up often, like once every 1-2 months. Our catch ups always recharge me and there really is something special about hanging out with someone who has seen you through many seasons of life!. \n\nThank you for asking this question to prompt reflection! I love my girls sooooo much and thinking about our history makes me feel so happy and blessed!!!",
          "score": 28
        },
        {
          "text": "My childhood friend became my life partner",
          "score": 23
        },
        {
          "text": "Just had a CNY catch up and hangout with my life-long friends where we met in primary school and did sec sch together as well. We've been friends for around 24-26 years, meeting on school busses or in our first CCAs, through every life stage like major exams, army, uni, work life and covid, and being groomsmen. This past few years we've held Xmas dinners at our friend's HDB home. It's pretty nice :) ",
          "score": 10
        },
        {
          "text": "I've lost contact with most of my childhood friends... Everyone is busy with their own lives and don't bother keeping in touch...",
          "score": 5
        },
        {
          "text": "I’m still in contact with my childhood best friend (we met in pri sch when I was p4 and she was p3). We coincidentally ended up in the same uni and graduated together and now she owns her own coffee business which she’s slowly growing until she can open a physical cafe. I’m super super proud of her and I know she’ll go far cuz she’s always been an incredibly hard worker.",
          "score": 4
        },
        {
          "text": "I wish... By not being able to pick a side, i lost both sides of my childhood friends. And also no phone back then too",
          "score": 3
        },
        {
          "text": "Haha I’m still in close contact with my St Andrews classmates from 67-78. A big bunch of us too!",
          "score": 3
        },
        {
          "text": "Still daily contact with 3 fellers from secondary 1, we're in our 40s now. \nAll of us married have children, 3 divorced. \nI'm the one who listens to the wife 🤣",
          "score": 2
        },
        {
          "text": "Pri sch yes, sec and poly ones nearly all gone\n\nI acknowledge that there were a lot of growing pains from me (depression, undiagnosed adhd rawdogging life for more than 2 decades that also affect socializing), but people change over the years and I find myself unable to accept the changes (immature world view, insensitivity, lack of compassion and understanding, always not engaging back etc)\n\nI'm not perfect but I'm getting older and I'm also tired of constantly masking and going out of my way to preserve friendships who don't do the same back to me 🤷‍♀️ I'll just stick with the other friends I made instead who do reciprocate my energy and understand me for who I am",
          "score": 1
        },
        {
          "text": "Same situation probably even similar age. Not everyone had a phone back in my days, had mine only in sec sch. Ngl though, lasting through the years was never expected to be easy anyways and childhood is something that will never come back either. But u kinda understand, why childhood friendship is so special, because there was no judgement, no bulls, just the more the merrier and have fun. Whatever friendship you start later especially now in our lives likely would never get to that level of companionship and joy",
          "score": 1
        },
        {
          "text": "Nope, totally lost contact for the majority of them :/",
          "score": 1
        },
        {
          "text": "I have a group of childhood friends that grew up together playing football, basketball, etc. \n\nLike OP, we all went to different Secondary schools. Each of us, has a different path in life.\n\nWe get invited to each other's wedding and now attending our children's weddings, along the way, we also attended funerals of each other's parents. \n\nWe still have at least once yearly dinner gathering to keep in touch. We are in our mid and late 50s now.",
          "score": 1
        },
        {
          "text": "I am currently renting out a place with my wife and my secondary school friends. I think it's changed from not giving a fk about the future and living in the moment, to regretting certain life decisions and feelings the pinch of money sucking rentals.",
          "score": 1
        },
        {
          "text": "I still meet my primary school friends regularly whenever I'm back in Singapore. Also my secondary school, high school and poly friends.",
          "score": 1
        },
        {
          "text": "Had a good primary school friend from P4/P5 that I lost contact with after PSLE as we went to different secondary schools. Got reconnected a few years ago after I made a post in an interest group on Facebook and he happened to be in the group as well and reached out. Recently attended his wedding.",
          "score": 1
        },
        {
          "text": "Still in touch with my P5 friend all these years and we still talk frequently as well as go out for meals together since we live near each other\n\nTbh I feel like nothing much has really changed over the years for us in terms of how we interact with each other, in fact I'm still the most comfortable around her and feel like I can really be myself\n\nBut it does get harder to plan things with our different work schedules and whatnot",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rdis6n",
      "subreddit": "SingaporeRaw",
      "title": "There is nothing to look forward to",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rdis6n/there_is_nothing_to_look_forward_to/",
      "score": 135,
      "num_comments": 39,
      "created_at": "2026-02-24T23:11:11",
      "selftext": "I'm not close to my family, I feel lonely with my friends, I'm not attached to anyone. Work is stressful, I don't feel like I do well, and there is no motivation to do better. After work, it is just me, myself and I. What and who do I have to spend on? Even if it is holidays or weekends, I don't have someone mutually in mind who wants to travel together. I can't exercise cause I over-exerted and injured parts of my bodies, life lowkey feels handicapped. Yes, I feel very demoralised. I genuinely feel that I have lived enough, I don't have any more goals to fulfil. I rather the stress and the pain stop than to get anymore fleeting happiness. Just thinking the fact that I'm hitting 30, and I'm going to be alone on my death bed hurts lmao. I wonder how many Singaporeans here feels the same in terms of life, be it unfulfilling in life, work or social relationships.\n\n\n\nBefore anyone comes at me: Have tried a lot of social events, school life, sports, ranting to friends, self-journal, taking walks, counsellors etc to get out of self-spiral. I don't deny I could be the problem.\n\n\n\nI want to whine with a little more context: it's annoying to be gay. When I'm looking for friends in the straight circle, not everyone can understand me. I have to pretend, and there is always a chance that I fall for a nice straight guy because I'm lonely. When I'm looking for friends in the gay scene, things become muddy cause some wants physical, some wants love, and the friendship could never last due to such reasons.",
      "comments": [
        {
          "text": "If you haven't hit 30 why not try a working holiday in Australia or New Zealand. At least something to look forward to. Meet new people in the world. If you just hit 30 then you can't apply anymore. \n\nIf got chance to work outside, do it. If not then save up and go a very long road trip like 3 months in Europe or Japan or something.\n\nSpend some time for yourself.",
          "score": 90
        },
        {
          "text": "I am sorry. \n\nSingle, middle class, LGBTQ are death sentences in Singapore.  \n\nPay everything and get nothing. You need to migrate, like now",
          "score": 80
        },
        {
          "text": "Don’t get trapped in the Singapore bubble, travel somewhere with a vastly different culture or literally anywhere for &gt;3 months. Keep an open mind, once you see people living different lives you will see there is much more to life. \n\nThis country is safe, clean and efficient but linear and suffocating.",
          "score": 46
        },
        {
          "text": "You need to leave Singapore AS SOON AS possible. Thailand, Taiwan, Australia, New Zealand, UK. \n\nLook really HARD now because the longer you stay in this Shitapoor,  you will become bitter because there WONT be any happy endings for you. Nothing! \n\nYou will see once you entered a REAL first world nation with a LGBTQI+ scene. the community is huge and vibrant! \n\nMany of the gays are since left for better life overseas.",
          "score": 37
        },
        {
          "text": "as a singaporean, your role is to work till u die. since the day you were born, your whole life was dictated to be that way.. compulsory education, and then work. indulge in some distractions along the way like those senseless events like cny, christmas, now even halloween wtf. Also, senseless indulgence like holidays to the typical same few destinations, overpay for popular food so u can call yourself a foodie.. what else? i guess what im getting at is that as Singaporean commoners, our lives are rather meaningless. Just take in whatever they feed you and be happy",
          "score": 13
        },
        {
          "text": "i was in a similar situation recently. trapped in a negative loop, and really didn’t look forward to anything much.\n\none day, youtube algo recommended me some books to read and i managed to borrow a spiritual book which really shifted my perspective and gave me a bit more to think about. if you are keen, feel free to reach out and i can share the name of the book (not a sales pitch!!)",
          "score": 5
        },
        {
          "text": "Migrate out of Singapore. The country will never ever treat LGBT as equal peoples. There is so much more to the world than teeny tiny toxic Singapore, look into Australia or NZ.",
          "score": 5
        },
        {
          "text": "You can exercise, but you need to find an exercise that is suitable for your condition. No doctor will tell you not to exercise even if you are wheelchair bound.\n\nExercise is not just good for physical health, but mental health.\n\nThe best thing to do is to save your money. We live in a capitalist world, and capital (money) is king. The more capital you have, the more options you will have in the future.",
          "score": 2
        },
        {
          "text": "Unfortunately I do not have any close gay friend that I can link you up with to their community. I believe they still exists they keep inviting me to their parties in the past, it is just that they do not often publicise it. He did mention that if you know you know, there is like hidden clues that they leave to signal to another gay that they are into that. \nTo be honest they are all hiding in plain sight, when I was out chilling with them you probably cannot tell who is who, we just looks like the rest. Based on my friend I was the only straight person there beside a bi in that group. \nSo yes it is tougher in Singapore since they prefer to hush hush not because Singapore do not allow, they just prefer to not draw attention. \nWhere I stay there is this old gay couple, everyday hold hand go out, never once I see people weird out or say anything. It is just a small minority making tons of noise on this. \nWell you cannot get bto but same goes for singles until we have enough supply going. Society first as always.",
          "score": 1
        },
        {
          "text": "Move somewhere. See a therapist. Pursue a hobby.",
          "score": 1
        },
        {
          "text": "Thank you for sharing, I say this from heart because sharing something like this takes guts. I do not know if you have tried it but you can opt for retreats - like yoga or spiritual or travel where you would not have access (or limited access ) to your phone and social media. I say this because sometimes we pressure ourselves looking at other people's perfect lives. I am not saying you are wrong to feel alone, just that you can use it as a privilege and discover your interests while you can.",
          "score": 1
        },
        {
          "text": "leave sg",
          "score": 1
        },
        {
          "text": "Change countries. Save up, go NZ, Aussie, Indo, Philippines, Malaysia, Thailand... Go anywhere but Singapore.\n\nSolo, this country is tough to get through. Nothing to do, nothing interesting going on, hardly any leisure.\n\nGo to any of the countries I mentioned? Walks in the park are clean, you can head to a mountain trail or go for a hike, you can see legit rivers and lakes... makes a world of difference.\n\nThings are, of course, better with a partner. But you can always find one overseas too",
          "score": 1
        },
        {
          "text": "You need to find female friends then.",
          "score": 1
        },
        {
          "text": "You seem to have no problems finding friends from what I read, maybe try focusing more on friendship than romance atm, so u wont feel lonely since u have close friends and might even have a better shot of a romantic relationship in the future",
          "score": 1
        },
        {
          "text": "Could be undiagnosed autism",
          "score": 1
        },
        {
          "text": "Go overseas and dont look back.",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1rd9eo1",
      "subreddit": "SingaporeRaw",
      "title": "Pritam Singh questions if GDP growth should determine ministerial bonuses amid job concerns",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rd9eo1/pritam_singh_questions_if_gdp_growth_should/",
      "score": 111,
      "num_comments": 37,
      "created_at": "2026-02-24T15:05:23",
      "selftext": "Credits to Source:\n\n  \n[https://forums.hardwarezone.com.sg/threads/pritam-singh-questions-if-gdp-growth-should-determine-ministerial-bonuses-amid-job-concerns.7190234/](https://forums.hardwarezone.com.sg/threads/pritam-singh-questions-if-gdp-growth-should-determine-ministerial-bonuses-amid-job-concerns.7190234/)",
      "comments": [
        {
          "text": "Citizen should ask why minsters so shameless dare to ask for pay raise when performing medicorely",
          "score": 97
        },
        {
          "text": "What is gdp growth if it only benefits wealthy asset owners and not majority of citizens. Then again we voted for this.",
          "score": 30
        },
        {
          "text": "For the longest time, we had our doubts whenever our leaders boosted how wonderful our economic growth is, how high our GDP and GDP per capita are. The simple reason is that our quality of life is NOT improving!\n\nSo far, the only person in parliament that is saying this fact out loud is Mr Singh. Sad that the ones in charge of running this country aren't even talking, discussing or debating on this matter.",
          "score": 22
        },
        {
          "text": "Finally asking the tough questions. Get ready for \"fixing\" 3.0.",
          "score": 19
        },
        {
          "text": "Cut the $300 million founders memorial which nobody asked for and there you have it , your pay raise. ",
          "score": 15
        },
        {
          "text": "GDP GDP GDP, thats almost all they have every year in their report card from so many multi-million dollar ministers. This year's budget is beyond pathetic. Citizens brought up 2 major concerns, COL and jobs and as expected, we get last minute can't be bothered responses. Whenever we bring up issues, they always choose the easy way out regardless of impact to the citizens. Its so obvious they can't be bothered.",
          "score": 15
        },
        {
          "text": "https://preview.redd.it/4u7akvsqhelg1.jpeg?width=846&amp;format=pjpg&amp;auto=webp&amp;s=df38c56d868fee4e39782ef431713b536f65e8e6",
          "score": 8
        },
        {
          "text": "Sg had the chance to vote one incompetent minister out but didn’t, fucking Jalan kayu really kayu",
          "score": 6
        },
        {
          "text": "Just fire those saf generals la, buffoons and donkeys. Generals my lanjiao, general trash that cant be recycled. Nominated a bird also more useful, at least it can do no wrong",
          "score": 6
        },
        {
          "text": "GDP so easy to fake, if dinkie organized a shit eating competition, and pay 1M to those shitting and 1M to those eating the shit, GDP would have increased by 2M, but the economy none the better.",
          "score": 5
        },
        {
          "text": "ASK THE QUESTION ABOUT POPULATION. avenge LMW.",
          "score": 5
        },
        {
          "text": "we need better leadership when times are bad",
          "score": 4
        },
        {
          "text": "Many people without jobs, then they keep invite ft and want pay increase",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1rd4ntz",
      "subreddit": "SingaporeRaw",
      "title": "caishengye gone rogue?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rd4ntz/caishengye_gone_rogue/",
      "score": 102,
      "num_comments": 23,
      "created_at": "2026-02-24T12:02:18",
      "selftext": "",
      "comments": [
        {
          "text": " I will not use that table",
          "score": 29
        },
        {
          "text": "Confirm jhk",
          "score": 26
        },
        {
          "text": "Any how alter the tradition, this is what you get. Just like PLB throwing lohei. ",
          "score": 16
        },
        {
          "text": "This Caishenye ownself havent huat, NEA huat first - summon tickets on the way.",
          "score": 12
        },
        {
          "text": "I 🤣 😂 🤣 when caishengye fell",
          "score": 8
        },
        {
          "text": "Tis one is caishendou",
          "score": 8
        },
        {
          "text": "财神倒",
          "score": 8
        },
        {
          "text": "To much money inside pocket till fall",
          "score": 6
        },
        {
          "text": "This want confirm father mother never teach from young that why can dance on the table.",
          "score": 5
        },
        {
          "text": "Cai Shen Nahhhh",
          "score": 5
        },
        {
          "text": "Economy so bad that CSY need to dance on a table because no pole",
          "score": 5
        },
        {
          "text": "Cai Sheeyannn",
          "score": 4
        },
        {
          "text": "must be doing tiktok",
          "score": 3
        },
        {
          "text": "HUAT AH…. WindFALL indeed!!",
          "score": 3
        },
        {
          "text": "Times are tough... even caisen got to work it",
          "score": 2
        },
        {
          "text": "Needs more twerk",
          "score": 1
        },
        {
          "text": "gone wilddd",
          "score": 1
        },
        {
          "text": "Tweeeerrrrkkk",
          "score": 1
        },
        {
          "text": "Hope Caishenyeh is fine...",
          "score": 1
        },
        {
          "text": "I am so glad about the traditions dying.\n\nThroughout this whole new year, I have only heard 1 lion dance.\n\nIt's so peaceful I love it.",
          "score": 1
        },
        {
          "text": "Disgusting behaviour\n\nWhat difference compared to 👉 [https://packaged-media.redd.it/5q6wf88v9g0f1/pb/m2-res\\_854p.mp4?m=DASHPlaylist.mpd&amp;v=1&amp;e=1771290000&amp;s=6c25e587c04d1802fc88dd3a2ccee1baee0cd799](https://packaged-media.redd.it/5q6wf88v9g0f1/pb/m2-res_854p.mp4?m=DASHPlaylist.mpd&amp;v=1&amp;e=1771290000&amp;s=6c25e587c04d1802fc88dd3a2ccee1baee0cd799)",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1rd9dbd",
      "subreddit": "SingaporeRaw",
      "title": "Pritam Singh calls for full disclosure of billions in public spending amid record surpluses",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rd9dbd/pritam_singh_calls_for_full_disclosure_of/",
      "score": 94,
      "num_comments": 38,
      "created_at": "2026-02-24T15:03:08",
      "selftext": "Will the full disclosure take 30 accounting years to produce?",
      "comments": [
        {
          "text": "Pritam is wasting his time. They’ll just lie about and say “I say one so it’s correct”.",
          "score": 41
        },
        {
          "text": "He is absolutely right. Just as everyone’s job is measured by KPI and data, these PAP ministers should be measured by what they have brought to the table for Singaporeans rather than focussing on GDP growth that is too broad based and does not accurately capture gainful employment for Singaporeans.",
          "score": 32
        },
        {
          "text": "The reply might be. Why you ask this question ?",
          "score": 25
        },
        {
          "text": "They will just tell him to go fly kite",
          "score": 20
        },
        {
          "text": "Even if disclosed the boomers voter base also won't understand the accounting documents",
          "score": 12
        },
        {
          "text": "Record surpluses need to be seen as poor performance.\n\nAccurate forecasting is what we need. \n\nClearly the GST increase was absolutely unnecessary, it will be interesting to see how they manage this.",
          "score": 10
        },
        {
          "text": "seems like Singaporeans were overtaxed, and where are these extra taxes collected goes to",
          "score": 9
        },
        {
          "text": "The question is how much of the billions is the 2% GST increase? \n\nIf without the GST increase still have billions of surplus, their reason is not justified.",
          "score": 7
        },
        {
          "text": "The hero we don’t deserve.",
          "score": 6
        },
        {
          "text": "More excuses than actual disclosure. He got the iron",
          "score": 6
        },
        {
          "text": "It will take 40 years to make a full account of this ...... \n\n/S",
          "score": 5
        },
        {
          "text": "Not president or prime minister no use, we know it is money out somewhere and then later own pocket, especially construction on road",
          "score": 3
        },
        {
          "text": "Correct me if i'm wrong but wont individual ministries will post their annual financial report publicly via AGC or something?",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1rdihfp",
      "subreddit": "SingaporeRaw",
      "title": "Fine for Bui Zai caught vaping inside MRT train",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rdihfp/fine_for_bui_zai_caught_vaping_inside_mrt_train/",
      "score": 61,
      "num_comments": 19,
      "created_at": "2026-02-24T23:00:13",
      "selftext": "SINGAPORE – A man’s vaping offences came to light after a video of him vaping in an MRT train went viral online.\n\nTay Choon Loong Aloysius, 37, was fined $2,200 on Feb 24 after he was convicted of one count of possession of an imitation tobacco product, and another count of buying an imitation tobacco product.\n\nThe court heard that officers from the Health Sciences Authority (HSA) searched Tay’s home on April 22, 2025, after they were informed about a TikTok video of Tay vaping in an MRT train.\n\n[https://www.straitstimes.com/singapore/courts-crime/fine-for-man-caught-vaping-inside-mrt-train?ref=top-stories](https://www.straitstimes.com/singapore/courts-crime/fine-for-man-caught-vaping-inside-mrt-train?ref=top-stories)",
      "comments": [
        {
          "text": "It’s either Bui Kia, or Fei Zai\n\nDon’t mix the dialects leh",
          "score": 63
        },
        {
          "text": "Bbfa in its natural habitat",
          "score": 22
        },
        {
          "text": "https://preview.redd.it/fvk6vkvnxglg1.jpeg?width=493&amp;format=pjpg&amp;auto=webp&amp;s=2fb74c56798ae9f5d42a66e4ae7438073c1b87c6",
          "score": 10
        },
        {
          "text": "https://preview.redd.it/tsdwgs5pmhlg1.png?width=1248&amp;format=png&amp;auto=webp&amp;s=e6f84b4a53376850e668778649d63bafa8303021\n\n",
          "score": 6
        },
        {
          "text": "Vape until tao nao pai",
          "score": 5
        },
        {
          "text": "Face of an alloy do stupid calloy",
          "score": 2
        },
        {
          "text": "back alley vapes lol.",
          "score": 2
        },
        {
          "text": "Want to do illegal things, do it in a quiet and private place. Doing it in a Public place especially inside a MRT train is \"yong lan ka tao\"",
          "score": 2
        },
        {
          "text": "whats an imitation?",
          "score": 2
        },
        {
          "text": "No jail ah?",
          "score": 1
        },
        {
          "text": "One look at the guy and you just know he will call you ‘bro’.\n\nI also think sometimes the amount being fined is a joke.",
          "score": 1
        },
        {
          "text": "The apperamce of the typical Sg guy, ...then they ask \" why i cannot get girlfriend ?\"  Lol",
          "score": 1
        },
        {
          "text": "You can tell he is quite a looking fella. But now is a bloated corpse from Singapore river",
          "score": -2
        }
      ]
    },
    {
      "id": "t3_1rddwzz",
      "subreddit": "SingaporeRaw",
      "title": "If education is national defense, why are we penny-pinching on class sizes?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rddwzz/if_education_is_national_defense_why_are_we/",
      "score": 63,
      "num_comments": 43,
      "created_at": "2026-02-24T19:40:23",
      "selftext": "We call people our greatest resource, yet we track a teacher's 52-cent debt with more precision than we do their burnout. While we approve billions for defense without public scrutiny, we frame smaller class sizes as \"fiscally radical.\" A system that treats its primary human investors as administrative overhead isn't efficient-it's complacent. We are penny-wise and talent-foolish.\n\nDo you agree? Share your views!",
      "comments": [
        {
          "text": "Coz nobody want to become teacher. My kids' school always have teachers resign every year.",
          "score": 20
        },
        {
          "text": "Great article",
          "score": 14
        },
        {
          "text": "Workload is not evenly distributed. Some subjects need lots of lesson prep and marking.\n\nSome teachers get inequitable timetables, especially the Language teachers who mark incomprehensible composition or essays. The number of hours in teaching, lesson preparing, corrections and Marking.\n\nIn primary school, they've to correct every error, not like JC or university where they just give comments. Every sentence has an error.\n\nThere are many old teachers who decided to be parttime or Adjunct teacher... because workload + admin + monitoring + all the other things MOE want them to do now is Unsustainable... \n\n(e.g.\n- check and track EVERY student's family life/wellbeing/mental health as an 'initiative\" by CCE department in pri and secondary schools,\n- being responsible for personality, character and everything about every child... Show in reports, be like a parent to 30 to 40 in form class\n- many reports demanded by Level Head, Subject Head or HOD who want to show off in their review/ * EPMS * that they did stuff,\n- more Projects by Level head or HOD that are useless,\n- lesson observation,\n- contact tracing during covid, etc.).. They should cut down to stuff teachers find are REALLY useful",
          "score": 10
        },
        {
          "text": "The government does not want the Singapore population to be too well educated.\n\nWell educated people tend to be harder for the government to trick and manipulate.",
          "score": 7
        },
        {
          "text": "Because education is the least corruptible of the government services. Any corruption is immediately reflected with poor test results and poor student outcomes (That is not to say there is no corruption, but much of it does not directly affect students).\n\nHarm the children and people get furious instantly.\n\nSo of course they will penny pinch and use the \"savings\" to enrich their kakis and cronies in other areas of government spending that are more opaque with results that are less visible (I.e., Migrant work dormitories, refuse centres, etc).\n\nIn every authoritarian regime. Military spending is the most corrupted part of government expenditure.",
          "score": 6
        },
        {
          "text": "i would have applied if the class size was smaller with reasonable workload and compensation.\n\nthe whole class size argument that bigger class means each teacher teach less (class of 40 teach once vs class of 20 teach twice) doesn't make sense. liddat we should get the best teacher of each subject and make him/her teach the entirety of sg in a massive lecture theatre. ",
          "score": 3
        },
        {
          "text": "The answer is simple. You need to remember the true purpose of structured formal education is actually.. in economics, to create the right workforce. Thats it.\n\nAnd what do you think is worst, high unemployment, or high numbers of unemployed tertiary educated adults?\n\nSo once you see this... you'll understand why having too many kids making it into uni becomes actually a bad thing for a gov struggling to create employment. At some point, having kids drop out to take a manual or entreprenurial path becomes the hidden agenda.",
          "score": 3
        },
        {
          "text": "Because students, their parents, and the school all bully their own teachers until they miserable.  \n\nPay is lousy, workload is absurd. Ends up being seen as a job for people with a degree that couldnt go further in academics.",
          "score": 2
        },
        {
          "text": "He put out a bunch of soundbites and hasn’t actually made an argument. How to respond?",
          "score": 2
        },
        {
          "text": "One of the most toxic and mentally destructive education systems in the OECD. No amount of money will fix this society's ingrained kiasu crabs-in-bucket rat race culture.",
          "score": 2
        },
        {
          "text": "I also don’t know.",
          "score": 1
        },
        {
          "text": "good article, you can’t say people are your greatest asset while stretching teachers thin and calling it efficiency, because if education is truly “national defense,” then class size isn’t a cost, it’s infrastructure.",
          "score": 1
        },
        {
          "text": "All schools are good school, but some are just more equal. ",
          "score": 1
        },
        {
          "text": "simple. because they don’t want nepobabies and cronies who can’t afford tuition to succeed.\n\nas for talents they can always import fakes from india. after all, what’s important is to earn the short term money and stash in switzerland. who wants to do r+d?\n\nas long as pap get voted in by sinkies who are extremely short sighted, nothing will change until the wall comes in to bang them lol.",
          "score": 1
        },
        {
          "text": "We only spend on hardware, not software. \n\n\nThe only ones getting a pay increase are the ministers. \n\n\nBut they will tell you no budget to hire more teachers. ",
          "score": 1
        },
        {
          "text": "Because, why spend so much for so many years when you can import foreigner talents and UHNIs and their families to boost GDP immediately? \n\nActions speak louder than words, and truth hurts. If you want to know a person's intention, watch what he does, not listen to what he says.\n\nStill thinking of having kids? If you're not from a UHN family, good luck to you.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rdmsuj",
      "subreddit": "SingaporeRaw",
      "title": "Why are they burning offerings at 1am when people are sleeping?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rdmsuj/why_are_they_burning_offerings_at_1am_when_people/",
      "score": 63,
      "num_comments": 58,
      "created_at": "2026-02-25T01:35:59",
      "selftext": "The whole family is asleep and suddenly the house smell like smoke. We usually leave a small gap in our windows for ventilation. Didn’t expect people will be burning offerings late at night. Why do they do that at this timing?",
      "comments": [
        {
          "text": "Hokkien tradition of worshipping the Jade Emperor (aka Heavenly Duke). Usually starts on 11pm of the night of the 8th day of CNY",
          "score": 128
        },
        {
          "text": "First time in SG? My block got people burn at weird timings. 1am, 3am, 5am, 11pm, midnight, all got kenna before. My family christian, so we just assume there's some religious reason behind it. Cuz it's not like they suka suka burn at midnight. Only certain dates and time of the year they do it.",
          "score": 64
        },
        {
          "text": "初九拜天公",
          "score": 24
        },
        {
          "text": "u just came to sg long term? its a common tradition.\n\nday 1 cny, 1st incense offering of new year then today is jade emperor birthday. I used to see my family do it for years. ",
          "score": 22
        },
        {
          "text": "Oh no wonder smoke smell so strong right now",
          "score": 17
        },
        {
          "text": "In bedok now. Strong smell of burning. I am like somebody is making an offering. Close the window and its all sorted. We live and let live.",
          "score": 13
        },
        {
          "text": "Smokers be like - well that amount of smoke is my 1 years quota....",
          "score": 13
        },
        {
          "text": "As long don't burn anyhow and get away with mess.. That's a shitty behavior never clean up after burning",
          "score": 5
        },
        {
          "text": "Woke up coughing :(",
          "score": 4
        },
        {
          "text": "Everybody gotta chill. Only happens once a year.",
          "score": 4
        },
        {
          "text": "I hope the jade emperors can jam their openings with jade buttplugs.",
          "score": 3
        },
        {
          "text": "pai ti gong bro",
          "score": 2
        },
        {
          "text": "![gif](giphy|1HyLYH2dSGHlLjdn7j|downsized)",
          "score": 2
        },
        {
          "text": "Otherside working night shift or timezone difference",
          "score": 2
        },
        {
          "text": "My parents got woken up in the middle of the night thinking the house was on fire because people were burning at such hours.",
          "score": 2
        },
        {
          "text": "They did use the bins though. Unless noisy then it's a  concern.",
          "score": 2
        },
        {
          "text": "The same clowns that will complain about Indonesia haze but go and burn all this nonsense themselves and polute the air",
          "score": 2
        },
        {
          "text": "Jade Emperor Day lor. Plus Singaporean Hokkien do it excessively. It mark the day Hokkien group hidden inside sugar cane planation midnight avoiding the Rising Sun massacre during WWII. That why they burn sugar cane adding stronger smoke than burning paper. One of the day Reddit Singaporean hate most.",
          "score": 2
        },
        {
          "text": "people sleep..ghosts awake",
          "score": 1
        },
        {
          "text": "No day or night in the underworld",
          "score": 1
        },
        {
          "text": "and they said just tolerate, it's only once a year, ",
          "score": -6
        }
      ]
    },
    {
      "id": "t3_1rd4b5m",
      "subreddit": "SingaporeRaw",
      "title": "New scam, wow so scary! /s (ps don't tell the scammer the mistakes they made, otherwise they know where to improve)",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rd4b5m/new_scam_wow_so_scary_s_ps_dont_tell_the_scammer/",
      "score": 46,
      "num_comments": 33,
      "created_at": "2026-02-24T11:52:07",
      "selftext": "",
      "comments": [
        {
          "text": "Lol joke. If SPF have evidence of such on you. They won’t be sending you a letter or email. They’ll be knock on your door liao loooo.",
          "score": 53
        },
        {
          "text": "Our SPF using ***outlook*** email! \n\n![gif](giphy|JQpfMV9dkmw37riCcw)\n\n",
          "score": 25
        },
        {
          "text": "Seems like they may have copied most of it from a real warning letter. ",
          "score": 21
        },
        {
          "text": "The scammers are smart to use CP possession as an allegation here.",
          "score": 9
        },
        {
          "text": "The CP is outdated. Plus use a proper spf email, not outlook.com email",
          "score": 8
        },
        {
          "text": "Outlook wtf",
          "score": 7
        },
        {
          "text": "anything unsure just meet at cantonment to lim kopi.",
          "score": 6
        },
        {
          "text": "Is there even a sex offender registry in Singapore",
          "score": 5
        },
        {
          "text": "What stamp is that? It looked like something a foreign country with a constitutional monarchy would have.",
          "score": 4
        },
        {
          "text": "Veil veil veil.",
          "score": 3
        },
        {
          "text": "I wonder how many Reddit Singaporean gotten scam by this.",
          "score": 3
        },
        {
          "text": "Since when CP send letters for such stuff? Not the relevant head meh?  \nPolice don't ask you to email statement. Because the \"offender\" would not know what to type. They would ask you to go down and do a short and friendly Q&amp;A. Send email / letter before approaching the offender risks the suspect running away.",
          "score": 2
        },
        {
          "text": "Looks legit Amos Yee",
          "score": 2
        },
        {
          "text": "When the CP gets impersonated, who does the CP lodge a report with? Himself? LOL",
          "score": 2
        },
        {
          "text": "Need to use outlook.com email?",
          "score": 2
        },
        {
          "text": "gg, you watched winnie the pooh corn. Now tio from the tiongs liao",
          "score": 1
        },
        {
          "text": "singapor lan por",
          "score": 1
        },
        {
          "text": "Why Mr Hoong stamp look like British Royal look? Dear Mr Scammer, please lah…",
          "score": 1
        },
        {
          "text": "Been getting many calls from \"agents\" of CSA recently too, block one number, another one calls again. \n\nWonder where these scammers are getting our phone numbers from.. I once screamed STOP SCAMMING PEOPLE LAH before disconnecting the call and blocking+reporting the number. Buay tahan.\n\nSigh.  ",
          "score": 1
        },
        {
          "text": "At the rate they are going, I wouldn’t even believe if the officers came to my door. When is this going to stop.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rdch4u",
      "subreddit": "SingaporeRaw",
      "title": "Cai Shen Ye also couldn't afford a car in SG, thanks to the COE",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rdch4u/cai_shen_ye_also_couldnt_afford_a_car_in_sg/",
      "score": 46,
      "num_comments": 3,
      "created_at": "2026-02-24T18:16:55",
      "selftext": "",
      "comments": [
        {
          "text": "Elmo shirt dude has good taste in shirts",
          "score": 3
        },
        {
          "text": "Brother has fortune and flexing and his lack of need of car",
          "score": 1
        },
        {
          "text": "That’s what she said",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rdl6kr",
      "subreddit": "SingaporeRaw",
      "title": "Boss said MC isn’t an entitlement",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rdl6kr/boss_said_mc_isnt_an_entitlement/",
      "score": 38,
      "num_comments": 31,
      "created_at": "2026-02-25T00:38:45",
      "selftext": "Didn’t know MOM rebranded statutory rights as ‘benefits.’ \n\nMedical leave = company generosity now? \n\nWhat’s next? Annual leave is a privilege? ",
      "comments": [
        {
          "text": "Always a balance.\n\nSome boss fucking cb take one MC kpkb.\n\nSome colleagues fucking cb sneeze one time take 3D MC. \n\nAnyways now is employers market, unless you are irreplaceable no choice need to tahan. \n\nLeft and right people looking for jobs, AI automating your roles, CECA stealing your rice bowl.",
          "score": 53
        },
        {
          "text": "Employment is a \"opportunity\"! \n\nHard /s",
          "score": 42
        },
        {
          "text": "Does anyone clear their MC? I was quite surprise I have a gen z colleague said he would be clearing MC. How the hell do you clear MC? Today diarrhea tomorrow menstrual clamp?",
          "score": 22
        },
        {
          "text": "let me rephrase what you are saying: you mean you are entitled to get sick? hmmm",
          "score": 9
        },
        {
          "text": "the moment someone say “clear mc”, i lost all respect for that person.",
          "score": 8
        },
        {
          "text": "I don’t blame companies for doing shit like this when employees are doing shits like clearing MC as if it is AL.",
          "score": 7
        },
        {
          "text": "You take MC or you _clear_ MC. \n\nThere is a difference",
          "score": 6
        },
        {
          "text": "Just use your MC if you need.",
          "score": 5
        },
        {
          "text": "Just take only",
          "score": 4
        },
        {
          "text": "Report them to MOM and TDAM. See them wet their pants when our supreme leaders is informed",
          "score": 4
        },
        {
          "text": "Mom is spineless pro business ministry",
          "score": 4
        },
        {
          "text": "Record your boss saying that and send to MOM.",
          "score": 3
        },
        {
          "text": "Unless you're a non-confirmed staff (in your probation period) MC is not a benefit or entitlement.\n\nIt just is.  It's a law. Every employer must pay you for being sick.\n\nI suspect there's employers putting pressure on the SG govt to change this and I hope that they fail.",
          "score": 3
        },
        {
          "text": "Depends how often OP took MC lor. Can give us context on why your boss said that? \n\nJust because we are given 14days MC doesn't mean we have the right to use them all. Want to take make sure it's legit aka you're sick AF. If you chaokeng your boss and korlicks sure know",
          "score": 2
        },
        {
          "text": "Report",
          "score": 1
        },
        {
          "text": "Medical leave is an [entitlement, if you are covered under employment act.](https://www.mom.gov.sg/employment-practices/leave/sick-leave/eligibility-and-entitlement)\n\nHowever, those who aren’t covered are:\n[seafarers, domestic workers, stat board employees/civil servants.](https://www.mom.gov.sg/employment-practices/employment-act/who-is-covered)\n\nIn which case, it’s based on the contract. Did you fall into any of the above categories?",
          "score": 1
        },
        {
          "text": "Mc is your entitlement.  Don't let the bosses dictate otherwise",
          "score": 1
        },
        {
          "text": "Your boss stuck at NS is it?",
          "score": 1
        },
        {
          "text": "MC is protection for workers when they are sick. \n\nSome workers treat it like it's additional annual leave and somehow get sick for the exact number of MC days they're allowed.  \n\nSpoil market, get treated with suspicion.",
          "score": 1
        },
        {
          "text": "Lol ask yourself what you use mc for. If you truly sick than take mc is right. However taking mc so you can go shopping or go gym than is mis use of mc. There to say it is not an entilement for you to use to do all these. You can utilised leave for such thing.\n\nSo op first of all what you use mc for? Did you really use it when you sick or u max out your mc yearly. If the 2nd one any boss or hr will be suspicious cause it is telling them you are sick chicken. The next thing they will think can you handle stress or u need some check up to confirm you are healthy and good enough for the job.\n\nI not sure op fall in where but definitely mc is use when sick not for you to abuse or max out together with annual leave",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1rd8e4l",
      "subreddit": "singaporefi",
      "title": "28 y/o hitting a financial reset",
      "url": "https://old.reddit.com/r/singaporefi/comments/1rd8e4l/28_yo_hitting_a_financial_reset/",
      "score": 85,
      "num_comments": 41,
      "created_at": "2026-02-24T14:09:39",
      "selftext": "Hi all, as the title suggest, i am unfortunately broke in my late twenties. Had a really rough 2025, with being jobless and series of medical costs and a failed business, it drained my entire networth of $100k with medical being the main cost. So here I am, at 28 hitting a financial reset. I'm not financially savvy at all so i'd like to seek advice.\n\nI am only a diploma holder in hospitality and make roughly $3.6k before cpf. No debts, no dependants, living with parents and parents very fortunately doesnt expect me to give them any money. I've always been a good saver and have a pretty healthy relationship with money overall.\n\nIn 2024, I signed an endowment plan at $300/mth and an ILP at $700/mth (huge mistake, i know😭). I plan to surrender my endowment with $0 surrender value as it's honestly not that huge a sum and i value opportunity cost more going forward. I also plan to reduce my ILP premium to just $300/mth, current valuation sitting at ~$16k. \n\nWith that, i should be able to aggressively invest about $1.2k comfortably every month. I have a time horizon of 20-25 years and can stomach drawdowns from -40% to -50%. \n\nAfter doing my research, i've built my own portfolio and it looks like this:\n\n40% VTI\n30% QQQM\n15% VHT\n15% VXUS\n\nLogic is that the trend seems to be moving towards heavily on tech and healthcare. And i want maximum growth since i can stomach the big drawdowns. I also plan to divert my ILP to a more moderate risk portfolio to cushion my risk. I'm a citizen so i naturally have CPF as a guaranteed risk-free basket. \n\nAm i missing anything? Or does my ETFs pick not make sense? \n\nAny advice is greatly appreciated, thanks in advance!!!",
      "comments": [
        {
          "text": "VWRA is 80% of your planned portfolio while not having the headache of rebalancing and having the benefit of automatically reinvesting dividends. You also just need to buy one ticker instead of 4 which saves a bit on transaction costs.\n\nThe issue with chasing maximum growth or trends is that trends are just that, and it may change randomly over time. How do you know if tech &amp; healthcare will continue growing at its current pace, or if it will even grow? It could drop like a rock tomorrow. ",
          "score": 49
        },
        {
          "text": "The ETFs you have chosen are US ETFs having estate tax and higher dividend withholding tax. A better way would be to invest in LSE ETFs. Please read the group wiki for more info.\n\nhttps://reddit.com/r/singaporefi/wiki/index",
          "score": 38
        },
        {
          "text": "Wow u actually had 100k to lose at 28?!\nI only had 2k in my bank at 30.",
          "score": 27
        },
        {
          "text": "I'd recommend you to look towards UCITS based ETFs. They only have a 15% dividend withholding tax as opposed to US ETFs having a 30% withholding tax. UCITS ETFs also do not have a 40% Estate tax.",
          "score": 10
        },
        {
          "text": "Hi, My advice is for you to save an emergency fund of at least 3-6 mths expenses as a start and then set aside at least 10% invest in ETFs like VOO and STI. DCA It. But if you aiming to invest $1200, I think maybe start doing it after your EF is fully funded. Also if you can upgrade to a degree that could help in your career prospects. Anyway you’re only 28. Don’t worry too much… I probably had $600 in my bank account then and I’m doing pretty okay at 43. Main point is prioritize savings and investments and not let lifestyle inflation eat up your salary.",
          "score": 8
        },
        {
          "text": "Hmmmm is your current industry, do you think getting a degree would open more doors for you and possibly going into management? So that your salary won't be capped at 3.6k to 4k. \n \nLike getting a business degree or something for 1.5 years then after that you can find another role in same industry that pays more. After all, your job experience and business experience seems valuable",
          "score": 6
        },
        {
          "text": "Maybe can start with 6 to 12 months emergency funds first ?\n\nBoth of your endowment plan and ILP, can regard them as Endowment plans (so to convince yourself the money saved won’t grow that much, can be part of emergency funds next time).\n\nI did the same mistake of getting 2 ILPs on hand ($300 each, was a plan for my ex-fiancée, as she don’t save up proper I feel, hence the plans for myself and her)\n\nILP premiums at $300 / mth will be a good idea, with the extra cashflow to hold first from any further plannings\n\nAs for portfolio management, I believe that your own portfolio mix should be good\n\nIf got spare cash, can take a look at investment tool that allows you to invest surplus CPF-OAs (beyond the minimum $20k sum), and cash as you are not buying a house yet.\n\n1 example can be Endowus, with their transparent pricing upfront.\n\nHope this helps !",
          "score": 3
        },
        {
          "text": "I’d focus less on a perfect ETF mix and more on stopping the ILP from bleeding you. Also your portfolio is pretty much a US/tech bet (VTI + QQQM + VHT overlap a lot), so just be aware of that.",
          "score": 3
        },
        {
          "text": "There are endowment broker out there who you can sell your endowment plan to. At least you can get back some amount rather than total loss.",
          "score": 2
        },
        {
          "text": "Just curious didn't you have insurance and medishield to buffer the bulk of the medical cost?",
          "score": 2
        },
        {
          "text": "Can stomach risk but most people sell at 20% loss",
          "score": 2
        },
        {
          "text": "Everyone talking about investing and where to put your money for growth, but have you thought about protecting your money? Do you have health insurance in place? If illness strike and you’re unable to work, do you have income replacement? You should set aside 10-20% of your income for protection.",
          "score": 2
        },
        {
          "text": "I rsther you keep the endowment and look into surrendering the ILP or try to sell it. Another way is just max redraw if surrendering is too pain as it eats into your saving rate treat both like bonds lor worse case if you can't get rid of the ILP. \n\nYou still young enough to have  a significant pay upside by 40.\n\nOn top or what others said about insurance, emergency funds. Consider if you wanna go back to sch / switch careers if you think your current sector has not much opportunities. At this age the effort to develop or invest in yourself might have higher upside than investing. Find ways to increase your savings rate so your investing can roll faster",
          "score": 2
        },
        {
          "text": "What business did you venture into?",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rd5vqc",
      "subreddit": "singaporefi",
      "title": "Condo at 31 or wait till 35 for resale?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1rd5vqc/condo_at_31_or_wait_till_35_for_resale/",
      "score": 78,
      "num_comments": 94,
      "created_at": "2026-02-24T12:35:57",
      "selftext": "30F, thinking of getting a resale condo next year with 350k cash and 120k CPF OA. Mortgage is 20-30% of monthly salary. Got a huge raise at the expense of a 1h commute to work, or $20 by grab.\n\nAlso, I essentially have a fiancée. Can't get legally married since we're both women. And my family is very homophobic.\n\nWhich do yall find a better idea?\n\nPros of condo: move in asap, start life with fiancée and apart from unsupportive parents, nearer to work and save time and money on commuting. If only using my name for the bank loan, fiancée can get resale and we rent out the condo eventually for passive income \n\ncons of condo: wiping out my savings. my salary is partial commissions. while it has always gone up year on year, it's still unstable and very stressful \n\npros of resale HDB: Much more affordable. hearsay the min age for singles might be lowered soon\n\ncons of resale HDB: min age might not be lowered far enough in the next 5 years for me to benefit. stuck with an uncomfortable home life till then, unless I rent. Even if my fiancée and I own resales, the MOP will overlap as we're close in age, and we can't legally rent out one flat",
      "comments": [
        {
          "text": "suggestion that is more holistic than financial: move out and start life with your partner. Living life now is important and moving out will significantly improve your QOL. Better QOL, better lifestyle, more motivation to maintain income and creating memories with your partner.",
          "score": 123
        },
        {
          "text": "like that buy condo at 31, then downgrade to Resale at 36 loh.  \nGet in the game first. Time and Tide waits for no one. \n\nThose who waited since 2009 can tell you what happen.\n\nThen they waited in 2012 again..\n\nthen they waited in 2015 again..\n\nevery 3 years ... wait for something to happen..\n\nthen finally 2020 Covid came..\n\nand they waited for another 3 years .....\n\nnow they are still waiting..\n\n  \nBut the prices never wait for them. :D",
          "score": 108
        },
        {
          "text": "Hello I’m from the community. Go talk to someone from Prident. Or HausofPride. Or Hauslife. I don’t know why gay people cannot spell house properly lol ok kidding. I’m not getting commission from them but I’ve spoken to them before and feel they are trustable and work with the community’s needs in mind. Get them to crunch the numbers for you and recommend accordingly. Personally I bought condo when I was around your age, then sold recently and moved into my partner’s resale HDB. Good luck OP.",
          "score": 18
        },
        {
          "text": "Might as well rent in the interim honestly and get a HDB at 35. There’s no guarantee that housing prices will keep going up.",
          "score": 15
        },
        {
          "text": "just wait, condo is probably going to experience some sort of price correction",
          "score": 11
        },
        {
          "text": "Go for condo. No amount of money can be compared to the freedom you get from living by yourself or with your partner.",
          "score": 9
        },
        {
          "text": "Go for condo n get resale for ur partner (eventually). \n1 house each. \n\nFaster start ur life together",
          "score": 7
        },
        {
          "text": "Renting is like paying a mortgage on a resale hdb. \n\nA big hdb is nicer to live in than a small condo, which is what you will get for the same price. Its also less financially stressful.",
          "score": 7
        },
        {
          "text": "If you have the means, go for condo\n\nResale HDB should be most likely still 35 for time to come, and given the current housing market, it would only get more expensive.\n\nRent is another option but it will eat into your housing funds so probably not.",
          "score": 5
        },
        {
          "text": "Why not just rent a place and then buy resale HDB later? Since you just want to move out. Less complicated and less stressful. You can rent a bigger place for the money and then later when you buy a HDB you get bigger place for less money. You can jointly buy a resale HDB as 2 singles.",
          "score": 5
        },
        {
          "text": "Bought a condo at 31 recently because who wants to wait for 4 years. Rates are so low atm",
          "score": 3
        },
        {
          "text": "Move and start your life",
          "score": 3
        },
        {
          "text": "Condo. You can rent out straight away, and still rent a hdb if you want a bigger space.\n\nBut it’s never ideal to throw all the cash in. Illiquidity is unforgiving.",
          "score": 3
        },
        {
          "text": "Default always is HDB first before condo, but looks like your situation can just go for condo.",
          "score": 2
        },
        {
          "text": "I went through this conundrum as well, ultimately decided to swing for the condo. Zero regrets! As others have stated, time waits for no one. \n\nIf your partner is able to help contribute partially to the mortgage as well that would be ideal in helping manage your financial stress. Just make sure you keep 6m mortgage in your OA for emergency purposes. You got this!",
          "score": 2
        },
        {
          "text": "Go with the condo route.",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1re08y5",
      "subreddit": "singaporefi",
      "title": "YouTrip card charging for failed payments?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1re08y5/youtrip_card_charging_for_failed_payments/",
      "score": 21,
      "num_comments": 7,
      "created_at": "2026-02-25T10:05:18",
      "selftext": "Currently on a Holiday in Japan. Around yesterday evening, YouTrip had an error where their cards could not be used. We were not aware of this issue at first so we tried paying with our cards. Our cards were declined so we paid for our items in cash instead. Today morning, my friend woke up and found out he had 2 transactions for the same amount on his card. I didn’t have though. The difference was that I used my physical card while he used Apple Wallet. Each transaction costed the same 6000 yen. When we went back to the store this morning to attempt to get a refund it wasn’t possible. When trying to use the app to report, the app stated the payment was “authorised and secure” as he used Apple Pay, leading to only a “I understood” button or “suspend card” button. This is making him very frustrated, especially since we can’t call the hotline. \n\nWhat is the likelihood of a refund? We have the receipt for the 6000 yen item paid in cash. There was another smaller payment at another store but we lost the receipt. Checking his Apple wallet transaction l, the 2 transactions stated as declined but looks like the app still charged him. Has anyone else faced the same issue? Thank you!",
      "comments": [
        {
          "text": "Same here. Tried paying thrice with physical card that got rejected upfront at the POS. woke up to 3 charges to my card. Initiated transaction dispute and pending an update.",
          "score": 13
        },
        {
          "text": "Omg same here we got charged $200 sgd, if OP didn’t post here I would have noticed later!",
          "score": 6
        },
        {
          "text": "facing the same issue. please let me know if you have more info on this",
          "score": 4
        },
        {
          "text": "Facing the same issue :/",
          "score": 3
        },
        {
          "text": "Had similar issues before. It took 1 whole day for Youtrip to reverse the payment (received an email later at night 4am stating it was reversed)",
          "score": 2
        },
        {
          "text": "You need to go to the store and to a manual POS refund. It’s possible as I’ve run my own business before. \n\nAll the need to do is find the transaction on their POS or terminal machine and select it, and do a refund or reversal. It will take 5-10 business days depending on card, bank and country.",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1rda2vk",
      "subreddit": "singaporefi",
      "title": "[Seek advice] To wait out till 35 yo or Buy resale now",
      "url": "https://old.reddit.com/r/singaporefi/comments/1rda2vk/seek_advice_to_wait_out_till_35_yo_or_buy_resale/",
      "score": 7,
      "num_comments": 39,
      "created_at": "2026-02-24T15:46:14",
      "selftext": "Hi all, I am 34M going to be 35M this year. whereby i can purchase my own resale flat.\n\nNot going for BTO as i could only purchase 2 room Flexi by myself and i have barely exceed the income as a single.  I have a partner who is a S Pass holder. Foreign spouse scheme is not under my consideration as well since could only get 2 room flexi. Plus she would not be able to contribute her income to be considered for bank/hdb loan even for a resale HDB. I have 2 choices below left.\n\nChoice 1 :\n\nTo wait out till 35, get a HFE and purchase my own 3/4 room resale. Me as the main owner.\n\nChoice 2:\n\nTo get a HFE with her now and purchase my 3 room resale. Me as the main owner, and her as an occupier.\n\nWhich choices make more sense (assuming i wanted to apply for gov grant, CPF, EHG and PHG whichever applicable )? in term of a rs issue in the future, which had the least impact?",
      "comments": [
        {
          "text": "Wait till 35 and Buy on your own. Next time easier to get her to leave if things don’t work out",
          "score": 34
        },
        {
          "text": "The recent bto exercise shows supply oversubscribed by 4 times\n\nSo your chances at actually getting a queue number, let alone choosing a unit, is pretty slim. \n\nCan participate again and again and hope against the odds though as it is still the most value option. But you could spend 2,3 years and still not get a chance",
          "score": 7
        },
        {
          "text": "I do not think foreigners plays a role in any of the grant schemes as you are sole owner (occupier doesn’t count, and not even legally married). I don’t see a difference between both choices, but I stand corrected.\n\nIf you are worried if anything happens to you and she gets anything as an occupier, I don’t think so. Will be part of your assets to be distributed under your will or the interstate succession act. Best if you pay for it yourself so there will be zero arguments there. But not married I seriously doubt there will be a case.\n\nP.s. I didn’t know foreigner can be part of HFE so I may be out of the loop. I assume you checked that it’s possible.",
          "score": 5
        },
        {
          "text": "Option 3: Get married, make a Singaporean baby then apply HFE with wife and baby as occupiers. Now your income ceiling becomes $14k, you suka buy expensive resale flat with the family grant or you suka buy cheaper  BTO flat you decide after you get HFE letter.",
          "score": 3
        },
        {
          "text": "How sure are you in the relationship with her? \n\nOne problem is she's on S pass, it maybe hard to retain her pass status because the conditions for S/E pass are always changing so she may not be able to stay in SG in the future. At least for E pass its more stable and likely to retain the employment status. \n\nIf you want to get a flat with her, you must be 100% sure that your relationship will last or she's at least a PR, else I think better to wait until you are 35, even if you buy as a single, and get married in the future, likely she will be included in as occupier/essential occupier by the system automatically.",
          "score": 2
        },
        {
          "text": "Do it on your birthday",
          "score": 2
        },
        {
          "text": "Option 1 will be the safest. Just wait a while more.",
          "score": 1
        },
        {
          "text": "Option 1 first if can, 2-room flexi will be limiting in near future in terms of space, but it will be more affordable though.\n\nDo factor in the waiting time and MOP in totality, which can be 8 to 9 years in general, as opposed to 5 years for resale flats.\n\nAlso, please get HDB loan if you can, albeit with more “fixed” 2.6% pa, lesser worries down the road.\n\nDo weigh out the pros and cons between resale pricing and 2-room flexi pricing, especially for more premium areas (if you are keen).\n\nTip : HFE lasts for 9 months, and you can apply as soon as you hit 35, application results should be within a week (unless close to BTO / SBF launches, which will be within 6 weeks roughly).",
          "score": 1
        },
        {
          "text": "How far away is your birthday? By the time you've found your dream home, would it be almost your birthday already? You can apply for IPA for bank loan to get an estimate of your quantum (this is to help with your viewing appointment).",
          "score": 1
        },
        {
          "text": "What do u work as?",
          "score": 1
        },
        {
          "text": "Won't you need to married her to form a family nucleus?",
          "score": 1
        },
        {
          "text": "By the time choice 2 paperwork settle you 35 alr. That is not much sooner than choice 1 in terms of keycollection date max 6mths difference?\n\nR/s stability wise choice one is better. \nIf before marrage choice one is cleaner cut. Post marrage it's still yours unless she can prove she contributed financially to the morgage tho she is not owner if no child. Post rom you have to list her as essential/ occupier I beileve . You retain sole ownership. \n\nChoice 2, would this be under the fiancee scheme? Means have to rom before keys? Been sometime but to include her income means must be married right? \n\nIf I recall correctly, even if she is essential occupier only, you need her endorsement for a sale. Had a friend with foreign wife (LTVP don't pay morgage) demand he sell the flat for her to divorce and return to her home country with their kids. Foreign wife initiated proceedings out of the blue. \n\nshe will have a stake if things go wrong post marriage because this is your matrimonial home. if you have a kid even if she didn't contribute a cent to the morgage.  if you read women charter carefully she can fight for it post marrage even if pick choice 1",
          "score": 1
        },
        {
          "text": "Hi OP. what are your considerations for not getting 2 room flexi. Am similar to your case, and just like to hear whatever perspective out there",
          "score": 1
        },
        {
          "text": "For resale, there is no limit to the flat type.  You can even buy an executive maisonette.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rd4j7r",
      "subreddit": "singaporefi",
      "title": "Where to park emergency funds?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1rd4j7r/where_to_park_emergency_funds/",
      "score": 7,
      "num_comments": 21,
      "created_at": "2026-02-24T11:58:27",
      "selftext": "Currently have 10k parked at Mari invest SavePlus earning around 1.83% p.a. Just wondering if there is a better place for me to park my emergency funds with a higher interest rate. Thanks!",
      "comments": [
        {
          "text": "Emergency funds needs to be safe and liquid.\n\nUnfortunately this means low return.\n\nTheres nothing better.\n\nSome people might advise against your current choice even and recommend some savings accounts with banks that offer good interest.\n\nocbc360, uob one, gxs, maribank savings (not invest ah, this is different)....",
          "score": 14
        },
        {
          "text": "Dbs multipler",
          "score": 7
        },
        {
          "text": "You could try moving some of that to Mari Invest Income. Minor risk of temporary drawdown though, but it seems that Mari smooths it out so you won't see those daily fluctuations. \n\nMoney market funds (like Mari Invest Saveplus) are around the same, and I think 1.83% is a serious over-estimate maybe averaging over the entire past year (with the earlier months having higher rates).\n\nEven the Maribank website says that Saveplus return over 4 weeks ending in 27 Jan is only 1.46%. ",
          "score": 4
        },
        {
          "text": "You could try tactical investment strategy such as ALLW from bridgewater (USD) or ADPT from Pantarai (EUR). They will adapt to current market conditions and might provide you extra return.  \nHowever, your investment is not guaranteed.  \nSo you can get a higher return with a little more risk. Up to you",
          "score": 3
        },
        {
          "text": "I put it in Chocolate Finance, 2% pa for the first $20k. Nothing much higher already unfortunately. So far, my withdrawals seem to come back fast enough - about 1-2 working days.",
          "score": 2
        },
        {
          "text": "to each his own tbh. i park it in chocolate for a 2% boost. but risk wise definitely not the safest compared to bank fixed deposit or ssb i believe.",
          "score": 1
        },
        {
          "text": "If you can't afford to lose it, park it in traditional banks and maybe maybe 1 month FD rolling basis or some higher yield ones. \n\nThere have been MAS approved products that folded fyi.\n\nAlso, 10k... Even at 5% interest it's rather insignificant. Don't bother.",
          "score": 1
        },
        {
          "text": "I do a housing loan refund to my OA. I could do this as I had a huge housing loan and now my house is fully paid.",
          "score": 1
        },
        {
          "text": "You can consider Chocolate Finance (2% on the first 20k). If you’re more daring, you can consider IG Market, where they will give you 3% if you invest the amount with them. Just buy the STI ETF, since the price moves very slowly. Can sell it anytime when you need the money.",
          "score": 1
        },
        {
          "text": "Moved mine out of Mari for the same reason. Worth looking at GXS, CIMB FastSaver, and Chocolate Finance — the last's rates are competitive and liquidity is solid for an emergency fund. ",
          "score": 1
        },
        {
          "text": "Emergency funds is to chase reliability, easy redemption and speed. Not just for yield.\n\nTry a few reputable ones mentioned here and diversify a few you like in terms of user experience.\n\nRates change all the time so don't spend too much time and worry about missing out. It's not a lot to lose between them to begin with. 😉",
          "score": 1
        },
        {
          "text": "Currently I park mine in lion global SGD money market funds. Returns not fantastic but is relatively safe.",
          "score": 1
        },
        {
          "text": "It's your emergency fund, just put in any bank account gees. At 10k, it's not going to make much difference",
          "score": 1
        },
        {
          "text": "I keep in my house safe",
          "score": 0
        },
        {
          "text": "[deleted]",
          "score": -1
        },
        {
          "text": "Milo can",
          "score": -4
        }
      ]
    },
    {
      "id": "t3_1rd5ti9",
      "subreddit": "singaporefi",
      "title": "Manulife S'pore sells record S$380 million life insurance policy to single client!!",
      "url": "https://old.reddit.com/r/singaporefi/comments/1rd5ti9/manulife_spore_sells_record_s380_million_life/",
      "score": 4,
      "num_comments": 24,
      "created_at": "2026-02-24T12:34:24",
      "selftext": "[https://mothership.sg/2026/02/manulife-singapore-sells-380-million-life-insurance-policy/](https://mothership.sg/2026/02/manulife-singapore-sells-380-million-life-insurance-policy/)",
      "comments": [
        {
          "text": "99% chance the customer is from China. In recent years many of them have been using life insurance to get money out of China and to shield it from seizure.",
          "score": 40
        },
        {
          "text": "The insurance vermin can pangkang loh..\n\nHeng ong huat ah!!",
          "score": 10
        },
        {
          "text": "Wow, even Christiano Ronaldo's leg was insured for only US$144m. Pales in comparison to this S$380m",
          "score": 8
        },
        {
          "text": "agent bi tang until siao, 1% also shiok\n\nDk how extreme he/her went through with this deal...",
          "score": 8
        },
        {
          "text": "Wash money?",
          "score": 3
        },
        {
          "text": "500k commission?",
          "score": 2
        },
        {
          "text": "Is that sum assured or premium?!",
          "score": 1
        },
        {
          "text": "He should be careful hanging out with his beneficiaries 😆",
          "score": 1
        },
        {
          "text": "Agent huat",
          "score": 1
        },
        {
          "text": "agent jin song leh",
          "score": 1
        },
        {
          "text": "The agent chio?",
          "score": 0
        },
        {
          "text": "They insuring Yamal’s legs?",
          "score": 0
        },
        {
          "text": "Wtf….why buy??? If you can afford this, you don’t need insurance",
          "score": 0
        },
        {
          "text": "Which sinkie redditor is this, own up",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1rdife0",
      "subreddit": "singaporefi",
      "title": "FSM or Poems - PIMCO Income Fund in SGD Hedged",
      "url": "https://old.reddit.com/r/singaporefi/comments/1rdife0/fsm_or_poems_pimco_income_fund_in_sgd_hedged/",
      "score": 3,
      "num_comments": 9,
      "created_at": "2026-02-24T22:58:01",
      "selftext": "Would appreciate some help selecting the right fund to buy on FSM or POEMS. I only using these two platforms, and not keen to open elsewhere to keep things simple. \n\nWhich are the popular ones... I'll DYODD, but need some directions! Thank you",
      "comments": [
        {
          "text": "You can only get the retail and admin share classes of Pimco GIS Income Fund on those two platforms. FSM is bad because they charge 0.2% p.a. platform fee for unit trust on top of the fund level fees. \n\nSo, Poem (no platform fee):, admin share class (1.05% fund management fee):\n\nhttps://www.poems.com.sg/fund-finder/pimco-gis-inc-admin-sgd-hedged-income-ie00b91rq825-556842/\n\nIt would be cheapest to get the institutional class (0.55% fund management fee) from IBKR (no platform fee but 5 Euro commission?) or Endowus (0.3% platform fee).",
          "score": 4
        },
        {
          "text": "What are your investment objectives?",
          "score": 1
        },
        {
          "text": "OP is specifically looking at PIMCO Income?",
          "score": 1
        },
        {
          "text": "I put my mum spare cash in Fullerton SGD",
          "score": -1
        }
      ]
    },
    {
      "id": "t3_1rdhcpq",
      "subreddit": "singaporefi",
      "title": "Legacy property planning",
      "url": "https://old.reddit.com/r/singaporefi/comments/1rdhcpq/legacy_property_planning/",
      "score": 2,
      "num_comments": 12,
      "created_at": "2026-02-24T22:14:39",
      "selftext": "Living in a 99 year leasehold now. Is switching out for a freehold for the purpose of passing down to kids generally a wise move? \n\nAssuming we still need a property for own stay, and the price difference between the 99 and freehold is maybe $200,000 or so.\n\nWhat are some other considerations?\n\nCurrent leasehold is also in an ageing estate, undergoing en bloc but likely to fail. ",
      "comments": [
        {
          "text": "got pros and cons.\n\nu mean landed or condo?\n\nu got 1 or many kids?\n\nyour kids also future partner will do bto etc so then how?",
          "score": 4
        },
        {
          "text": "I’m not doing any calculations but given how much property prices has gone up, $200k difference between FH and LH shows that most people don’t care and just wanna move within 10-20 years. \n\nPray hard for enbloc. \n\nAlso, I guess developers don’t often enbloc FH because got a disparity in how much developer and homeowners feel about their FH premium costs.",
          "score": 4
        },
        {
          "text": "I would like the idea of a legacy property to be a freehold landed one rather than a condo.\n\nAn aging condo has more negative factors that comes with age than positive ones, not to mention the risk of an en bloc even though you have absolutely no intention of selling.\n\nWith a freehold landed i can renovate or tear down and rebuild the home as many times as i want, to maintain its modernity and all.",
          "score": 4
        },
        {
          "text": "The reality is the FH condo will be enbloced before u or your kid reaches the stage of passing anything down.",
          "score": 2
        },
        {
          "text": "Since you have kids, how you determine which kid gets the property?\n\n\nYou should prepare equal parts legacy or at least proportional in other assets so your kids can \"negotiate\" with each other.\n\n\nOne can ask for the property because of sentimental value and the other can get more in cash or other inheritance. \n\n\nIf you ask anyone about getting a fully paid $1mil property and $1mil cash, most people would take the property. \n\n\nSo you could prepare a 10-20% additional inheritance for the kid giving up their childhood home.",
          "score": 2
        },
        {
          "text": "Yes.\n\nIf legacy is a consideration, only FH.",
          "score": 1
        },
        {
          "text": "I prefer not to have a legacy property. It sounds great when the property is young and you don’t need to pay for a home but when it is aging the cost of maintenance to ensure it looks fresh and available for rental is not just costly but there is effort to maintain. \n\nBut if the intention is for home stay and you don’t mind the decline in value ie it is a residence primarily and generations  won’t ever move away then yes that would be a good idea. Or you want to force the family to stay near each other so you buy one row of flats, one  for each child on the same floor or same block",
          "score": 1
        },
        {
          "text": "How about you take that 200k difference and put it into VWRA for 99 years. After your current 99 year lease runs out, you may be able to buy multiple houses with that amount instead.",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1rdxo6m",
      "subreddit": "singaporefi",
      "title": "Hedging SGD against USD",
      "url": "https://old.reddit.com/r/singaporefi/comments/1rdxo6m/hedging_sgd_against_usd/",
      "score": 1,
      "num_comments": 40,
      "created_at": "2026-02-25T08:14:51",
      "selftext": "I'm using IBKR as brokerage. All of my shares are traded in USD.\n\nIs there a way to hedge against USD via IBKR?\n\nDon't aim to hedge against all shares but just my one-year withdrawal.\n\nAsking as I'm looking to RE end of the year and want to make sure that I'm covered.\n\n\nThanks!\n\n\nEdit: I am thinking of something *purchase* options, where the premium is the insurance paid, and maximum loss is cap at the premium paid.",
      "comments": [
        {
          "text": "Why do you even want to hedge for your shares?\n\nIf the share is denominated in USD, and the USD weakens, the nominal value of the share will go up. \n\nIf you want to reduce your exposure to currency risk, then you might need to rebalance your portfolio to hold more SGD-based equities.",
          "score": 12
        },
        {
          "text": "interested in this as well so far this is what I understand in the 3 levels of risk.\n\n1. buy a SGD hedged ETF.\n2. Borrow USD on margin. (short USD)\n3. option swap contract for USD:SGD.\n\nI only do number 2 right now. as for number 1,\n\n[https://youtu.be/K3flJjh00gA?si=i9P1BJatAj0R0NDn](https://youtu.be/K3flJjh00gA?si=i9P1BJatAj0R0NDn)\n\nNumber 3 is too risky for my appetite.\n\n  \nedit: typed but instead of buy",
          "score": 3
        },
        {
          "text": "Hi OP, I'm in a similar position, as in I have a lot of US currency exposure due to buying/holding VWRA via IBKR. \n\nFirst quick qn - are you earning in SGD? And second qn - are you investing for the long run? I'm not sure what RE meant in your OP even after googling it. Retire early? If that's the case, then I wonder if it'll be best to pull your USD positions out in tranches and thereby reduce exposure?  Currency exposure is intertwined with market exposure, sadly, in the case of USD given it's still the \"world's\" reserve currency.\n\nIf it's the former, meaning you earn in SGD AND is a long time investor, I wonder if it means that we get to buy more shares due to strong SGD conversion to USD? \n\nSlight Comment on options: Until the USD is no longer the world's central currency and we can buy SGD denominated ETFs emulating the likes of VWRAs, buying options is akin to betting that the USD will drop further. Then one has to factor in the purchasing cost of buying options etc.\n\nTLDR: if the goal is long term/you earn SGD/long market, then convert SGD to USD and buy more, taking advantage of DCA.",
          "score": 2
        },
        {
          "text": "You want world or US?\n\nhttps://endowus.com/investment-funds-list/ishares-developed-world-index-fund-ie-sgd-hedged-IE000XUK0R09",
          "score": 2
        },
        {
          "text": "You own shares and not USD. Just because the shares are traded in USD doesn't mean the price change is correlated to USD. There is still actual currency risk in the underlying business but it may not necessarily be USD/SGD. Just like you buy SGD denominated shares doesn't mean you have no currency risk exposure. DBS only deal with SGD assets meh?",
          "score": 2
        },
        {
          "text": "You can use forward Fx.  \n\nBut given that USD interest rate is now significantly higher than SGD, the forward rate will likely be below spot.\n\nUnless you expect USD to deteriorate a lot against SGD, it might not be worth it as you will be taking losses upfront.",
          "score": 1
        },
        {
          "text": "Find a forex broker that offers trading in SGD. Short USD/SGD. Close out the position after one year.",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1rdv1nr",
      "subreddit": "singaporefi",
      "title": "Is there a Singapore tele channel to discuss?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1rdv1nr/is_there_a_singapore_tele_channel_to_discuss/",
      "score": 0,
      "num_comments": 7,
      "created_at": "2026-02-25T06:31:11",
      "selftext": "Thought it’ll be useful if there’s a channel for us to warn / advise users incase of any news that might affect our picks.",
      "comments": [
        {
          "text": "don’t trust anyone. why would i listen to someone random on tele ?",
          "score": 9
        },
        {
          "text": "So many finance chats lol. \n\n- Dividend Investing\n- Finance Cafe SG\n- CryptoSG\n- Kelvin Learns Investing (obviously he plugs his content there too)",
          "score": -10
        }
      ]
    }
  ]
}