{
  "schema_version": "raw_scrape_v1",
  "report_id": "2026-02-24",
  "scraped_at": "2026-02-24T16:55:36.089250",
  "subreddits": [
    "singapore",
    "askSingapore",
    "SingaporeRaw",
    "singaporefi"
  ],
  "total_posts": 40,
  "total_comments": 498,
  "posts": [
    {
      "id": "t3_1rcgnnk",
      "subreddit": "singapore",
      "title": "Man, 48, raped &amp; impregnated intellectually disabled stepdaughter, then 14, gets 19 years 4 months' jail &amp; 16 cane strokes - Mothership.SG",
      "url": "https://old.reddit.com/r/singapore/comments/1rcgnnk/man_48_raped_impregnated_intellectually_disabled/",
      "score": 559,
      "num_comments": 112,
      "created_at": "2026-02-23T20:54:46",
      "selftext": "The man was the sole breadwinner, working as a bouncer at a club.\n\nThe court heard that he knew the victim was \"heavily reliant\" on him and her mother to fulfil simple, daily tasks, CNA reported.\n\nThe three lived together in a one-room flat with two other children the couple shared, and the three children slept together in the living room.\n\nIn May or June 2024, the man returned home drunk at about 7am after completing a shift.\n\nHe saw the victim sleeping in front of the main door with her half-siblings nearby,\n\nHe then started touching her and eventually raped her.\n\nLater in September, the victim complained of abdominal pains and was brought to the hospital, where her pregnancy was discovered.\n\nThe hospital made a police report as she was a minor, according to CNA.",
      "comments": [
        {
          "text": "what the absolute fuckshit of a human \n\n“The prosecutor said that while the girl was 14 years old, her rapist observed that she \"behaved like a child who was about eight years old\".”",
          "score": 526
        },
        {
          "text": "What the fuck.\n\nSo he a)raped b)a minor that c)is mentally disabled and d)is a dependant on him. \n\nGive him 4×16 strokes thanks.",
          "score": 327
        },
        {
          "text": "Absolutely vile. News like this make me lose faith in humanity. Also:\n\n&gt;&gt; The court heard that the couple’s other daughter had told the mother about witnessing him performing sexual acts.\n\n&gt;&gt; However, as she did not witness these acts herself, she trusted that he would not harm her daughter\n\nShame on the mother for brushing this off and trusting the man more than her own daughter. The fact that the victim is intellectually disabled makes it even worse. She has only her mother to watch out for her, and yet…",
          "score": 279
        },
        {
          "text": "I'm so glad he isn't 50 yet, or he will miss out on the most fun part of the sentence, which is the caning.",
          "score": 176
        },
        {
          "text": "Mandatory caning on his crotch",
          "score": 62
        },
        {
          "text": "“She (the lawyer) added that he hopes to rebuild his family and fix their relationship.”\n\nI can’t even imagine how he thinks he can ‘fix’ this.",
          "score": 61
        },
        {
          "text": "Eh why this fella also stateless? ",
          "score": 41
        },
        {
          "text": "✂️",
          "score": 37
        },
        {
          "text": "no.\n\ni am sorry, this sentencing is not severe enough. he needs to be locked away for life.",
          "score": 35
        },
        {
          "text": "This is f-ing sick. What did i just read?",
          "score": 28
        },
        {
          "text": "Sentence is too light. Should be caning from the front",
          "score": 21
        }
      ]
    },
    {
      "id": "t3_1rcefxe",
      "subreddit": "singapore",
      "title": "Raybe Oh, 32, who sustained 80% burns on body saving fiance from burning car in 2021 Tanjong Pagar car crash, returns to getai stage",
      "url": "https://old.reddit.com/r/singapore/comments/1rcefxe/raybe_oh_32_who_sustained_80_burns_on_body_saving/",
      "score": 437,
      "num_comments": 150,
      "created_at": "2026-02-23T18:58:18",
      "selftext": "She is slated to return to the stage on Feb. 27.\n\nHer guest performance, organised by Zhenghua Community Club next to Bukit Panjang's Greenridge Shopping Centre, is scheduled for 6:30pm on Friday.\n\nOh, a former Singapore Airlines stewardess, told *Shin Min* that upon recovery, the skin at her chin and neck became hard, making it very difficult to sing.",
      "comments": [
        {
          "text": "One thing I never liked about the whole incident is how the media framed her as some sad victim or heroine who tried to save her bf.\n\nShe was filming them racing lol.",
          "score": 728
        },
        {
          "text": "Imagine if that period not Covid, they would probably have killed some innocent people.",
          "score": 348
        },
        {
          "text": "lol let’s not forget:\n\n‘3 families of passengers in 2021 Tanjong Pagar crash seeking S$1.7 million from estate of driver’\n\nhttps://www.reddit.com/r/singapore/s/7AxMrg0Gg6",
          "score": 313
        },
        {
          "text": "This is news? She isn't a victim; she's a willing accomplice who recorded their actions in support, knowing full well those actions could have easily killed innocent bystanders.",
          "score": 204
        },
        {
          "text": "My faith in this subreddit is restored. The majority of you guys are not entertaining nor are you all supporting her.\n\nHer boyfriend and his cronies were being absolute shit heads. \n\nCan you IMAGINE if those bozos did it if covid wasn't there. Innocents could've been collateral to their tiny dick measuring contest.",
          "score": 202
        },
        {
          "text": "&gt;She also did not feel confident enough to return to the stage, but continued to practice for about a year until November 2025, when she finally expressed her desire to sing to a childhood friend, who had been consistently encouraging her over the years.\n\n&gt;The friend is also the upcoming show's planner, and happens to be the son of its emcee. \n\nFeel good nepotism.",
          "score": 152
        },
        {
          "text": "If only she told her boyfriend to drive safely instead of filming it.",
          "score": 147
        },
        {
          "text": "Ah the enabler\n\nSurprise shes still keeping contact with her dead bf's family. If I were her, I’d be consumed with guilt, not only for failing to stop the boyfriend at the time (who was also drunk), but for squatting there filming the whole thing with a smile",
          "score": 135
        },
        {
          "text": "Hmm good for her but I never really understood why the media angled her as some victim when she basically participated in the illegal drag race/rounding",
          "score": 129
        },
        {
          "text": "Honestly find her a lil shameless to be using the media to boost her business etc. As others have mentioned, she’s only gained pity points cause there have been no real victims from that accident that day. I remember how she said that if she were to turn back time, she would run into the fire to save her fiancé again like girl… if you could turn back time you should stop him from speeding so recklessly for fun. It really showed her mentality and how she also poised herself as some type of heroine. Good for her that she can move on with life but some people should really live quietly.",
          "score": 102
        },
        {
          "text": "Let this be a good reminder not to drive like maniacs on the road. Another one is the Porsche on Nicoll Highway.",
          "score": 14
        }
      ]
    },
    {
      "id": "t3_1rd92qf",
      "subreddit": "singapore",
      "title": "Pritam Singh calls for full disclosure of billions in public spending amid record surpluses",
      "url": "https://old.reddit.com/r/singapore/comments/1rd92qf/pritam_singh_calls_for_full_disclosure_of/",
      "score": 316,
      "num_comments": 76,
      "created_at": "2026-02-24T14:45:39",
      "selftext": "",
      "comments": [
        {
          "text": "&gt;Mr Singh also questioned whether the formula used to determine ministers’ bonuses remains appropriate, in light of Deputy Prime Minister Gan Kim Yong’s earlier remarks that [GDP growth may no longer translate into jobs for Singaporeans](https://www.channelnewsasia.com/singapore/economic-strategy-review-jobs-gdp-growth-ai-5895496).\n\nSounds like it's time for PAP to move the goalposts",
          "score": 189
        },
        {
          "text": "Gone for the bloody nose there👍The number 1 question on everyone’s mind. What do you plan to do with a 15 billion surplus?",
          "score": 167
        },
        {
          "text": "Yes, the government has over tax our property  and increased gst without good reasons.\n\n\nThey said they would be a deficient if no increase. End up they received so much that they can even afford to distribute  back.\n\n\nIt's a joke, if I am to believe them in the next increase in all sorts of tax.",
          "score": 47
        },
        {
          "text": "Actually, this Pritiam comments are all on point hahahahaha. Just look at the state of Skillsfuture Singapore funding - how to guage efficiency?",
          "score": 37
        },
        {
          "text": "This has been on my mind after Covid, there was a draw out from the reserves of 100B. Has it been accounted for who gets what? A big chunk of it went to the GLCs.  I heard small businesses that got the bail out has to return the money.",
          "score": 33
        },
        {
          "text": "I wont be surprise if a few years down the road, the concept of dynamic cdc voucher payouts(more vouchers if you have more member of household) get introduced albeit refined under different parameters. ",
          "score": 33
        },
        {
          "text": "My man came back with a vengeance.\n\nDude be like \"Fuck it, We ball\"",
          "score": 17
        },
        {
          "text": "Surplus for me but not for thee",
          "score": 11
        },
        {
          "text": "Me think this man should be considered as leader of opposition, should such an appointment exits",
          "score": 10
        }
      ]
    },
    {
      "id": "t3_1rcck48",
      "subreddit": "singapore",
      "title": "Crow shooting to resume in Singapore as attacks swell",
      "url": "https://old.reddit.com/r/singapore/comments/1rcck48/crow_shooting_to_resume_in_singapore_as_attacks/",
      "score": 233,
      "num_comments": 125,
      "created_at": "2026-02-23T17:04:24",
      "selftext": "",
      "comments": [
        {
          "text": "&gt;“In 2025 alone, the Municipal Services Office received about 15,000 crow-related feedback, three times more than in 2020,” he said, adding that reports of crow attacks have also increased by fourfold to more than 2,000 cases over the same period.\n\nThat’s a lot of complaints and attacks. \n\nCrows are an invasive species and really intelligent, so I think we are doing the right thing here.",
          "score": 247
        },
        {
          "text": "The turnover of shooters is high cos the crows remember their faces",
          "score": 137
        },
        {
          "text": "I kenna attacked before as a former child. Was waiting for my school bus in the afternoon, and then it suddenly swooped down on me and attacked me (with its claws, wasn’t sharp but its like someone took a hairbrush and scrapped your scalp) \n\nFirst time I was like what, second and third time it tried to swoop down and missed. I was 10 years old and alone waiting, it was fucking scary (adults were watching but didn’t help, then again I guess they were dumbstruck)",
          "score": 93
        },
        {
          "text": "Crows are too smart. Shooting is the best option",
          "score": 73
        },
        {
          "text": "Took them long enough. Finally doing something right for once.",
          "score": 63
        },
        {
          "text": "Sentiments here so far seem to be the exact opposite on some social media posts hmm..",
          "score": 43
        },
        {
          "text": "I like crows, BUT they're smart enough to come up with evasive strategies so it's fair game I feel.",
          "score": 17
        }
      ]
    },
    {
      "id": "t3_1rcchc0",
      "subreddit": "singapore",
      "title": "'I want burger': Man on trial for allegedly snatching McDonald's food from siblings at Sun Plaza",
      "url": "https://old.reddit.com/r/singapore/comments/1rcchc0/i_want_burger_man_on_trial_for_allegedly/",
      "score": 218,
      "num_comments": 76,
      "created_at": "2026-02-23T16:59:53",
      "selftext": "",
      "comments": [
        {
          "text": "IRL hamburglar",
          "score": 313
        },
        {
          "text": "I read the title and thought he snatched from his own sibling then got reported to police, was alot funnier in my head",
          "score": 268
        },
        {
          "text": "&gt; He estimated that the cheeseburgers cost about S$7, while the nuggets were S$10 or S$14, but said that he could not remember if they were on offer.\n\nReal crime is the price of McD!!",
          "score": 113
        },
        {
          "text": "Artist sketch of the suspect\n\n![gif](giphy|LEDow0BfZVlOE)",
          "score": 67
        },
        {
          "text": "Bro thought he was cheesing down the street till the law ketchup with him.",
          "score": 43
        },
        {
          "text": "He won't be lovin it in Changi Prison",
          "score": 42
        },
        {
          "text": "I don’t understand, how come this case $20 burger snatched gets actual police work and court cases, while $20 shoes stolen from shoe rack at common corridor is just “mischief”?\n\nI would be very pissed if this ever happens to me.",
          "score": 34
        },
        {
          "text": "\"The case opened with the interpreter stating that Hisyam wanted to change his spoken language to Arabic. This was even though he had used English and Malay in court sessions previously.\"\n\n\nTrying to play with the court? Act blur live longer. \n\n\nWhat's next, weebs asking to be spoken to in Japanese? When they are JLPT N4 level in daily conversation? \n\n\nPlease refer to me only by my Hiragana/Katakana/Kanji written name. I shall not respond to any other name. ",
          "score": 33
        },
        {
          "text": "Keep him away from fast food restaurants lmao",
          "score": 32
        },
        {
          "text": "seems mentally disturbed/disabled",
          "score": 28
        },
        {
          "text": "I WANT BURGER",
          "score": 14
        }
      ]
    },
    {
      "id": "t3_1rd9uzt",
      "subreddit": "singapore",
      "title": "Ordered butter kaya baguette at Killiney . They gave me the whole baguette lol. Uncle my mouth isn’t that big 😮",
      "url": "https://old.reddit.com/r/singapore/comments/1rd9uzt/ordered_butter_kaya_baguette_at_killiney_they/",
      "score": 206,
      "num_comments": 50,
      "created_at": "2026-02-24T15:32:48",
      "selftext": "",
      "comments": [
        {
          "text": "With the current trend of serving 1 slice of bread cut into 4 or more with paper thin butter in between.. what you got is considered a steal already lo.\n\nDabao eat for dinner and tmr morning breakfast. 😬",
          "score": 130
        },
        {
          "text": "I hope it was worth the price lol",
          "score": 42
        },
        {
          "text": "This is hilarious. At least cut the baguette slice in half, and put the kaya inside..",
          "score": 31
        },
        {
          "text": "I actually prefer my baguettes whole.",
          "score": 11
        },
        {
          "text": "TIL they sell a footlong kaya toast.",
          "score": 6
        },
        {
          "text": "This is the classic case of how impt presentation is",
          "score": 4
        },
        {
          "text": "Damn gd le",
          "score": 3
        },
        {
          "text": "You need more training from BBC",
          "score": 3
        },
        {
          "text": "uncle saw something we didn’t 🤣",
          "score": 2
        },
        {
          "text": "steak is too juicy, lobster is too buttery",
          "score": 1
        },
        {
          "text": "give you big bread also complain.. Not happy then don't eat mah",
          "score": 1
        },
        {
          "text": "Bread too small complain. Bread too big also complain.",
          "score": 1
        },
        {
          "text": "Give more also kenna. Give less also kenna. Wah lao eh",
          "score": 1
        },
        {
          "text": "Looks like half. Go back and ask where's the rest of it.",
          "score": 1
        },
        {
          "text": "The 2 piece can share with your friend",
          "score": 1
        },
        {
          "text": "“Lets see what that mouth do” 🤣",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rd5qbe",
      "subreddit": "singapore",
      "title": "Manulife S'pore sells record S$380 million life insurance policy to single client",
      "url": "https://old.reddit.com/r/singapore/comments/1rd5qbe/manulife_spore_sells_record_s380_million_life/",
      "score": 154,
      "num_comments": 86,
      "created_at": "2026-02-24T12:32:06",
      "selftext": "",
      "comments": [
        {
          "text": "Wow the agent sure enjoying his CNY to the max",
          "score": 172
        },
        {
          "text": "Beyond a certain level of wealth, this kind of insurance is just not really sensible. You are already a billionaire. If you die or become disabled, your heirs get paid another $380m. What's the point?",
          "score": 45
        },
        {
          "text": "I assume the client is a multi-billionaire?",
          "score": 41
        },
        {
          "text": "Waits  for the headline ‘Manulife single client dies in suspected fall, wife claims insurance’",
          "score": 34
        },
        {
          "text": "&gt; Nearly seven in 10 of these fortunes are self-made.\n\nsure bo?",
          "score": 14
        },
        {
          "text": "sounds like a policy they never intend to pay out. when shit happens and the claim comes, why would they pay when the legal fees to fight it out in court is so much less.",
          "score": 9
        },
        {
          "text": "People are assuming that the client is a Singapore resident. Just because the policy was booked under Manulife Singapore, does not mean that the client is a Singapore resident. I am also not saying it is not but I do know of many HNWI from countries in the region who buys insurance in Singapore.\n\nFor certain insurance policies, the premiums are cheaper in Singapore due to higher life expectancy here. \n\nThere might also be tax benefits, especially if you are from a country with estate taxes. You can structure a Variable Universal Life to defer or avoid certain taxes as well, which is especially useful for succession planning. It could also be for liquidity management if their assets are tied up in property or business interests.",
          "score": 7
        },
        {
          "text": "Definitely come with kickback for the deal. Just not in the usual proper channels.",
          "score": 7
        },
        {
          "text": "Yes, that reminds me. Let us all work hard so that we can be successful enough to pay $380 *million* for an insurance policy.",
          "score": 4
        }
      ]
    },
    {
      "id": "t3_1rcynyn",
      "subreddit": "singapore",
      "title": "Home broken into on Feb 21 is second landed property in Upper Thomson to be hit in days",
      "url": "https://old.reddit.com/r/singapore/comments/1rcynyn/home_broken_into_on_feb_21_is_second_landed/",
      "score": 138,
      "num_comments": 65,
      "created_at": "2026-02-24T08:07:53",
      "selftext": "",
      "comments": [
        {
          "text": "Using tourist visa like a thief visa",
          "score": 115
        },
        {
          "text": "Visa-free and open leg policy somemore lor. Iirc, the previous ones only got arrested because they went back to the same place.\n\nSG is a perfect place for foreigners to come in and commit crimes. Most of the population has never experienced crime in their lives, huge complacent mentality and easy to escape from Changi Airport within hours.\n\nPolice is one of the most understaffed for developed countries. Not aware of any mass CCTVs/security cameras being placed along these sites.\n\nPolice cannot protect people, least they should do is change self defence laws to remove existing limitations within one’s own home.",
          "score": 106
        },
        {
          "text": "&gt; They are getting so daring. You typically hear of burglars trying to pick houses that are empty to avoid home owners. But the lights in my house were turned on and he still decided to target us,” she added.",
          "score": 97
        },
        {
          "text": "If an intruder breaks into a home in Sg and a person stabs them with an OCS ceremonial sword, will that person get into trouble? Asking for a friend.",
          "score": 73
        },
        {
          "text": "How many are on the run now?\n\n- [Car chase guy](https://www.straitstimes.com/singapore/cops-looking-for-driver-who-ditched-car-after-police-chase-from-paya-lebar-to-punggol)\n- 17 Feb home intruder \n- 21 Feb home intruder (though this could very well be the same person)",
          "score": 73
        },
        {
          "text": "It is getting unsafe nowadays. What happens from being 'safest' place to be to the current problem?\n\nOpen leg policy?",
          "score": 35
        },
        {
          "text": "These people come from 1st tier cities to a provincial town to rob the residents….. /s",
          "score": 23
        },
        {
          "text": "They have more restrictions at home with the hukou system while visa free doesn’t discriminate them here",
          "score": 19
        },
        {
          "text": "Flood people in to raise GDP for it to be offset by bulgary, theft and scams. Lol",
          "score": 14
        },
        {
          "text": "Triple the punishment for foreigners who commit crimes here while on social visit passes ",
          "score": 9
        },
        {
          "text": "That's why I never understood the appeal of landed.\n\nBasic thing like security (not talking about security guard btw) not even there, how to sleep with a piece of mind?",
          "score": 6
        }
      ]
    },
    {
      "id": "t3_1rclwub",
      "subreddit": "singapore",
      "title": "Foreign visitor refusals at Singapore’s checkpoints rise 38.3% in 2025: ICA",
      "url": "https://old.reddit.com/r/singapore/comments/1rclwub/foreign_visitor_refusals_at_singapores/",
      "score": 84,
      "num_comments": 7,
      "created_at": "2026-02-24T00:22:18",
      "selftext": "",
      "comments": [
        {
          "text": "No mention of a certain visa-free country coming in to rob houses.",
          "score": 34
        },
        {
          "text": "Almost 40% of visitors trying to enter Singapore get turned away? That’s *huge* - amazing work by ICA that almost half of visitors coming for incorrect reasons and this is actually prevented",
          "score": -19
        }
      ]
    },
    {
      "id": "t3_1rcg1df",
      "subreddit": "singapore",
      "title": "Jesus Casas former Iraqi national team coach appointed as Lion City Sailors new head coach",
      "url": "https://old.reddit.com/r/singapore/comments/1rcg1df/jesus_casas_former_iraqi_national_team_coach/",
      "score": 63,
      "num_comments": 24,
      "created_at": "2026-02-23T20:23:56",
      "selftext": "",
      "comments": [
        {
          "text": "Looks like glasner",
          "score": 45
        },
        {
          "text": "that’s it we’re qualifying for champions league next season",
          "score": 22
        },
        {
          "text": "Was at one point in the running to be national team coach before Gavin was appointed\n\n\nProbably was interviewed by Forrest Li earlier on and found to be a convenient and competent replacement when the need for a new coach at LCS arose",
          "score": 11
        },
        {
          "text": "Interesting appointment, hope this means LCS plays more entertaining football now, wonder who Tampines is gonna appoint now",
          "score": 8
        },
        {
          "text": "Hopefully the football will be better. I have found Ranko's team to be way too defensive, cautious and overly dependent on Liestiene. I don't think the team under him believes that they are the third or fourth best team in ASEAN.",
          "score": 6
        },
        {
          "text": "LSC winning the champions league and World Cup then",
          "score": 6
        },
        {
          "text": "Since he’d did not get the Singapore job Forrest say fine we have a empty slot you go coach my team",
          "score": 2
        },
        {
          "text": "Wait till he finds out about our pro football players having to work another job. The stadiums without protection from rain and sun. The lack of supporters in the stadiums. Supporters wanting free this, free that. ",
          "score": 1
        },
        {
          "text": "Jesus take the wheel",
          "score": 1
        },
        {
          "text": "anyone knows what are his football philosophies? better than ranko's back pass and pray for lestienne to score?",
          "score": 1
        },
        {
          "text": "Jesus is coming to singapore 🫣",
          "score": 0
        },
        {
          "text": "What's that accent over the \"u\" supposed to mean?    \n\nAnd, are you suppose to pronounce the \"j\" as \"h\"?   \n\nDisclaimer: hardly keeping up with any football news, no idea what is the big deal.",
          "score": -10
        }
      ]
    },
    {
      "id": "t3_1rczo8z",
      "subreddit": "askSingapore",
      "title": "does singles mixer work? what are your thoughts",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rczo8z/does_singles_mixer_work_what_are_your_thoughts/",
      "score": 115,
      "num_comments": 77,
      "created_at": "2026-02-24T08:44:33",
      "selftext": "ive seen the rise of many singles mixer events and the price of the tickets are around $30-$40\n\ni havent been to one however i think its overhyped &amp; doubt the reliability of those events because of my friends past experiences, such as:\n\n1. does not lead to anywhere\n\n2. end up making more friends than potential matches\n\n3. alot of weirdos\n\njust curious, are there any couples that have successfully dated from meeting at a singles mixer? if not, how was ur experience?  ",
      "comments": [
        {
          "text": "Shared my experience previously in another thread so thought I’d share again in the hope that a better model of singles mixers can be adopted by event organisers\n\nHave gone for a few such events before but after the second or third time, I felt it was a bit scammy because:\n\n1. Gender ratios always skewed. Always more guys than gals (estimate 80-20 ratio), which made it uncomfortable for everyone as there'd be minimum 4 guys swarming around 1 gal. What made it even worse was the more attractive ones would often be swamped which made them feel overwhelmed and those who weren't getting any attention were rightfully miffed\n\n2. No facilitation by host/organiser. Using the swarming example, a good host/organiser would step in and redistribute the pax but nothing was done. No facilitation either or if any facilitation done, not much thought was put into how to actually get participants to interact in a meaningful manner\n\n3. Poor venue setup. Most of the events comprised sitdown tables and chairs, which are only helpful for e.g. speed dating or if the organiser/host is facilitating by moving people around. So you would have people hogging the chairs and tables and refusing to move while others stood around hovering behind others - very uncomfortable\n\n4. Most crucially, host/organiser seemed to just want to earn money from the event while preying on the optimism or hope of participants but not doing anything productive. Why I say so is that the event format was still the same each time, despite feedback given to the organiser, which meant the issues mentioned above were recurring. Yet because the participants were hopeful to meet someone, they just kept coming for the events, which means the previous events weren't effective at connecting people romantically and which also means the organiser/host has a captive audience to exploit and profit from",
          "score": 161
        },
        {
          "text": "Went for one a month ago and was surprised that there were more ladies than guys.\n\nAlso, the quality of the girls are sooo high, I'm really surprised that they are single. I'm not talking high maintenance kind, but genuinely nice girls, average to above average looking, no obvious red flags kind.\n\nWhereas the guys were.. underwhelming. Awkward in conversations etc.\n\nAgree that it didn't lead to any potential matches, but I would have attributed it to the lower quality of guys actually.\n\nI was there to accompany a friend and they allowed 'attached' people to join too. Was one of only 2 attached people there and could watch the action up close, like my own personal single's inferno episode!",
          "score": 75
        },
        {
          "text": "Whole point of a singles mixer is to allow people to meet others in a personal setting, talk, and potentially find someone for themselves. However, to me, it’s similar to dating apps, just live. \n\nThe people coming are single, yeah (almost) the same. People are looking at your outward appearance first (same as app profiles). People ask you questions/check the vibe (chatting). End of the day it’s still performative. \n\nSo personally it’s a waste of time and money for me. I’d rather be spending money on classes/hobby groups that have a higher chance of meeting someone I might actually have a connection with and THEN going forward, doing something I actually like. \n\nBut yea different people different mileage. Just my opinion!",
          "score": 67
        },
        {
          "text": "I've gone for one in 2020, right before the first lockdown.\n\nI was a dude on the lower end of the age spectrum, so naturally disadvantaged. The moment you sit down and talk to a lady and they realize you're younger (even if just by a year or two) they just immediately switch off, you could see it in their eyes.\n\nFrom the event I discovered that I am a pretty sociable and extroverted person, to be able to hold a conversation with all those uninterested ladies for an evening.\n\nUltimately had 2 pretty nice conversations. \n\nFirst was with a vietnamese girl at the tail end of the night where half the people had left and the others had either locked in on someone (so you couldnt get them to rotate) or given up. We had a nice chat about the \"meta\" of the mixer event, and she said she enjoyed that chat since I didnt ask her about her name, job, age, hobbies or the usual stuff. Ended up just clinking my drink with her and walking away at the end though, I was also fatigued by that point to try anything.\n\nThe other was another dude my age, definitely best convo of the night. Just discussed with him his experience at the mixer and had some good laughs. Again, clinked drinks with him and I left the venue.\n\nPretty fun and I discovered more about myself but did not move an inch closer to dating someone.",
          "score": 61
        },
        {
          "text": "I am one of those people who attended singles mixer with no intention to look for potential dates 😂 before covid, there was this scheme similar to skillsfuture where the gahmen gave single adults $ credits to attend such events. So I attended solely because the activity was interesting (eg yacht ride to Lazarus Island, 2d1n trip to Kukup) and very affordable after the subsidy. \n\nI observed that during the events, the girls and guys generally hung out separately. It didn’t help that many guy attendees seemed to have “desperate” vibes that made people uncomfortable. It seems like most girls who attended the event ended up making more female friends than potential male matches.",
          "score": 29
        },
        {
          "text": "There is potential, but it usually ends up in awkward situations.\n\nWorked with them (as a vendor) and joined a few events to see how it would work out.\n\nScummy event companies would milk money from desperate people.\n\nBad actors on both genders make it an absolute shitshow.\n\nDon't expect much but it is a very good place to pay some money to practice how to communicate with a couple of random strangers.",
          "score": 27
        },
        {
          "text": "I used to go for those socials organised through meetup. This was back in 2016/2017 (oh man I’m realising it’s about 10 years ago now). The demographic was mostly expats, usually white or Indian, largely male, mostly single although a handful are people who just moved to Singapore and just wanted to make friends. \n\nI was a young female Singaporean with pan Asian background so the odds were in my favour but most people there weren’t really in the “serious relationship” category- a lot were there just to have fun. So really, an IRL version of today’s dating app (I’m assuming?)\n\nThe socials were super fun and I made a whole bunch of friends that were regulars to these things and so we’d hang out even after the event. I think my takeaways from it are that it IS possible to make friends and have the potential for it to organically become something more. One of my good friends today is someone I met there all those years ago. But I think the key is not to expect your prince or princess to appear in the doorway like a movie.\n\nIn the end I met my now husband on a dating app even though ironically I started going for those events because I was super sick of the apps at the time.",
          "score": 16
        },
        {
          "text": "Back in the days, when we had to actually meet real people, we ran into weirdos, made friends. Most people you meet in life will never lead anywhere. The cons you listed exist as a part of all real-life interactions. Part of adulting is learning how to deal with it.\n\nSingles mixers, like any real interaction, cannot guarantee any connection. It's a numbers game. Your match with someone is not really based entirely off stats/requirements. You meet people so you know if there's any real attraction and connection. You cannot get this from online.\n\nOnline is skewed to work primarily for women, and for more attractive people who are really only into it for situationships.\n\nYour best bet is just meeting a ton of people and seeing if you can make a connection. It might not happen, and that's fine. The point is to deal with the numbers portion of it. If you don't do that, you're climbing a near-insurmountable hill.\n\nIf I were still single, I'd definitely do singles mixers. Back then, I did the hardest thing possible, which was cold pickups. Singles mixers gives you all the benefits of cold pickup without the awkwardness and massive personal rejections.\n\nI've been married 20 years and I met my wife through friends. This is actually how many people meet their life partners, through friends of friends. The only way to do that is get out there, to make friends, and actually meet people.",
          "score": 15
        },
        {
          "text": "Many years ago, I went with a friend (both guys). We only thought about making new friends. There, at the event, we met another group of girls. Soon, we became friends and go out together - karaoke, hiking and etc. This group expanded and included other friends. At the end of the day, it was friends who didn't go to the event got hitched. Hahaha...",
          "score": 13
        },
        {
          "text": "Went for gai gai event, never going again. I’m a girl in my 20s and the guys were all late 30s to 40s. They looked bad and old. Also, all the convos just revolved around work cos they were all q old and I was just there like.. awkwardly sitting. \n\nEnded up going out with one guy in his 40s out of pity but it was so bad cos he looked like my sugar daddy except he’s not even generous. How are you more than 10 years older and not even willing to provide for the girl. Anyways, JUST DONT GO",
          "score": 12
        },
        {
          "text": "I got dragged to a dating event by a friend. I had zero interest in going, but I’m close to him and I’m generally fine with social settings, so I thought, why not. At the very least, I’d get to see how these things work.\n\nIMO, it was badly organised and a complete waste of money.\n\nIt was at a two-storey shophouse turned into a clubhouse, KTV on the first floor, pool table upstairs. Turnout was over 100 people, and from what I saw, there were more women than men.\n\nThe format was simple. You fill in a survey, answer a like or dislike personality question, take a Polaroid, and they print a kind of resume profile. Everything gets pasted on a wall for everyone to browse.\n\nThe only complimentary drinks were Oatside milk and bottled green tea. Wine was $6 or $8 a glass. That was it.\n\nThe founder attempted an icebreaker. We were split into groups and made to answer trivia questions like “What’s the capital of Brazil?” Then the organiser announced which team won and… that was the end of it. No follow-up, no actual interaction. Ice thoroughly unbroken. Like HUH? What ICE? \n\nSo I did what I usually do in social situations. I went around and spoke to anyone and everyone. I wasn’t there with a specific agenda or type in mind. The resumes were actually useful conversation starters, but you cannot just rely on 1 sentence to continue a conversation. I remembered one of the girls had a ‘I made this outfit I’m currently wearing from a workshop!’ \n\nBut it felt like most people were there with a clear end goal. Fair enough, it’s a dating event. Still, many conversations ended abruptly, or people drifted off mid-chat to find someone else.\n\nI spoke to a police officer, two tech bros, an early childhood educator, two guys of questionable background, and a medical researcher who also does part-time modelling. Ironically, he was the only person I ended up exchanging contacts with. Everyone else didn’t seem keen to continue the conversation.\n\nThe saddest part was observing a few guys who clearly weren’t socially comfortable. Some looked fresh out of NS. They stood around alone, drink in hand, scanning the room and waiting for someone to approach them. It was hard to watch.\n\nAt one point I suggested to the organiser that maybe she could host more actively. She said the idea was to let people mingle organically. Personally, if I’m charging $48 a head, I’d structure the experience a lot more intentionally. If I’m paying that amount to do essentially nothing, I can think of better ways to spend it. It reeks of poor organising IMO, if I had wanted to just do an event like this it’s really not that hard. \n\nWhat surprised me, though, was overhearing a woman sincerely thanking the organiser and saying she really enjoyed the event. So clearly, it works for some people.\n\nThe medical researcher-model guy, who was probably the most conventionally attractive person there, ended up leaving alone too. I found that oddly amusing.\n\nMy friend, who dragged me there, eventually said it was too overwhelming for him as an introvert and disappeared. I was like, bro, you invited me.\n\nI left feeling bored overall. But if you’re into social anthropology, it would have been a fascinating case study. Watching who approaches, who waits, who performs confidence, who actually connects, and who doesn’t. That part was interesting? \n\nWould I go again? Probably not. I get better social experiences from events I intentionally want to go for and my own events that I host for communities.",
          "score": 12
        },
        {
          "text": "Have been to a couple, but I think they're kind of poorly managed somewhat. Most of them have just been a bit of a \"pay money, drop in with other people who did the same thing and get to mingle\"\n\nAbout the events themselves, I'd maybe start talking to some woman and maybe have some good conversation going before some other dudes would jump in, start speaking over each other anddddd I'd just exit at that point, I don't have the energy for that shit\n\nFunnily, the best shot I had was with the host, but based on how her work/lifestyle was basically work all day/week, idk how that would have worked out\n\nIf you're thinking of going to one, I'd say to just enjoy yourself regardless. As others have said/experienced, sometimes the best conversations are with the bros we've made along the way.",
          "score": 6
        },
        {
          "text": "All social events, including work and school, depend on the crowd. Events that are more heavily vetted tend to have crowds curated according to the curator’s criteria. Your best matchmaker is someone who knows you well and can introduce you to someone whom they think you’ll like. Otherwise just go and have fun, and avoid the ones with zero curation",
          "score": 5
        },
        {
          "text": "Great place to see people swipe left on you in your physical presence instead of a Tinder profile pic.",
          "score": 5
        },
        {
          "text": "Nothing there it's just get a drink and come back. Waste of time",
          "score": 4
        },
        {
          "text": "&gt; alot of weirdos\n\ni can almost guarantee that the people who turn up to these events are the same people already on dating apps. the issue with irl events is that you can't swipe left on weirdos, which is supremely uncomfortable.\n\ndating apps do work. having said that, you have to be a certain type for it to work, along with a generous serving of fate and luck.",
          "score": 4
        },
        {
          "text": "Female here. Been to a few and I think it's a waste of time and money. Sharing some examples of my experience:\n\n1. Gender ratio was quite balanced, facilitators ensured everyone gets to talk to everyone. But the guys who attended can't hold proper conversations and have very desperate vibes.\n\n2. Event did not state any age range/restriction. Some may think it's discrimination but I rather they do this so we don't waste our time. The guys there were mostly at least 10-15 years younger than me.\n\n3. The scammiest one was, most of the participants seemed to already know one another. They huddled together in their respective sub-groups and did not socialise with others. So we could only interact with that small handful of people.",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1rcjii6",
      "subreddit": "askSingapore",
      "title": "People who decided to take a career break, how did it turn out for you?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rcjii6/people_who_decided_to_take_a_career_break_how_did/",
      "score": 98,
      "num_comments": 80,
      "created_at": "2026-02-23T22:52:45",
      "selftext": "I’ve been considering a career break for a while now because of burnout, but the fear of not being able to find a job after I’m done with the break still holds me back from throwing my letter. After years of climbing the corporate ladder and striving for promotion after promotion, it is honestly terrifying to walk away, yet I can’t fathom another year of stress and overtime work. I have enough savings to tide through 2+ years, but who knows how long my unemployment stint may be in this economy…\n\nAs you can see, I’m very conflicted. I just want to be happier but I don’t want to make an impulsive decision or regret this further down the line.\n\nFor those who decided to take the leap of faith, how did it turn out for you? Did the risk pay off? If you could rewind the clock, would you make the same decision again?",
      "comments": [
        {
          "text": "If you are really burnt out and have enough savings for atleast a year then take a break. People may say this is not the right time because of the job market. Yes it might be hard to find a job after a break. But if you keep waiting the time will never come. Then one day when you pause and look back at your life, you might regret it. You won't have any memories other than sleep, wake up, eat, work, gym, commute, eat, sleep repeat. During that time you might be in a situation where it is not possible. So I encourage those who have enough savings, go on and take a long or short  break. Do things that you couldn't do while working. Take care of your health. Spend time with family and friends. Explore the world. Make memories.",
          "score": 155
        },
        {
          "text": "Resigned without a job because of the management. Unemployed for 9 months. While I felt a sense of relief after I left a miserable place, some days were longer than others when I have too much free time.\n\nNonetheless, I have learned to take things easy and one step at a time. I am also better mentally prepared for challenges which may come my way.",
          "score": 67
        },
        {
          "text": "My younger brother took a career break, convinced by his wife. Felt burnt out from his investment banking job. Wanted to explore the world, possibly move abroad. Ended up exploring SEA on a budget cuz he feared burning through his funds and he was too used to spending too much money. Old company wouldn’t take him back, had to join a lower tier investment bank. Back to being burnt out again. YMMV",
          "score": 55
        },
        {
          "text": "I’m a single female in my mid-30s living with my parents, so I don’t have major financial commitments. I used to work in tech sales earning &gt;SGD 200K, but it was extremely stressful (13–15 hour/day, 5-day weeks, with lots of internal politics). I had about 3–4 years of savings and took a career break in May 2024 to rest.\n\nI kept myself busy with gym, yoga, family time, reading, and some travel, but after a few months I got bored and started feeling a bit useless, so I began job hunting. The market was rough and it took much longer than expected — I only secured a role in Jan 2025 (not my ideal company, and the location was far from home, but it was my only offer so I accepted it). I left in under a year and moved to my current company with about a 15% pay cut, and I’m still working 10–12 hour days. Thinking back now, given the previous pay scale, I probably should have stayed since I’m still working long hours but earning less in my current role. \n\n\n\nThings I didn’t anticipate - job search taking much longer than expected, paying income tax (I didn’t factor this in, getting lowballed because I was unemployed, employers assuming I’ve been laid off\n\nIf I could redo it, I wouldn’t quit without something lined up. I’d job hunt while employed and be more chill in how I manage work stress and take short breaks of annual leaves for holidays instead.\n\nNot saying don’t do it — just sharing my experience here. And job market seems to be worst now so expect longer time to land a job or take a pay cut for your new role..",
          "score": 43
        },
        {
          "text": "On a career break since beginning of 2025. My first career break after working for a decade. Was planning to just take one year but decided to extend six more months. Currently overseas and will be back mid-2026.\n\nHonestly, it's been so liberating. Been discovering myself a lot the past year and my mental health has been so much better. I travelled throughout most of my career break. I initially planned to do it a few years ago but COVID-19 was still around so I waited for a bit more. I lost 10kg over the last one year (I tend to eat more when stressed). This is the best thing about my break thus far.\n\nDo I fear about not getting a job later on? Yes, but I am okay with pivoting and trying something else if I'm not able to return to my field. I intend to take another career break 10 years from now (around 2035) if all is well.\n\nBut one thing I'd say is - make sure you have heaps of money to do it. Cos the expenses can be high, depending on what you want to do during the career break. Perhaps you can start with six months, then if you have the finances thereafter, you can extend for another six months.\n\nGood luck. Please take care of yourself.",
          "score": 34
        },
        {
          "text": "I am on a professional break after nearly 30 years of working. \n\nTo me the key is not to lament about lost opportunities as I have seen my previous peers getting higher and higher titles and also money. \n\nThe key is to make your days fulfilling like volunteering, working on strengthening your body, improving your mobility, learning new things like taking up AI and building AI agents etc. \n\nThe returning you should choose to will be hard. But you have only 1 life, dying in the office is not the preferred path so do not focus on what you have lost but appreciate what you still have. \n\nFrankly the relentless pursuit of corporate titles and money is never ending and all it brings is the day when your value Vs income will be tilted against you and you be asked to go anyway. \n\nFocus on yourself and your own self improvement. It is your choice and don't get too worried about what others think of you. Remember that an opinion is like an asshole, everyone has one. \n\nEnjoy your break and may your days be fulfilling.",
          "score": 29
        },
        {
          "text": "It worked out well for some friends, others not so. \n\nSome friends of mine were burnt out by their industry. They quit, took a year or two off but didn't really put effort into finding something else so they just went back to the same industry but to a different company. For others, the pay was so high that they couldn't/or wouldn't find anything else. \n\nOthers took the time to do higher studies or do a different course, and made an effort to find something different. I think the ones who made the change seemed happier. ",
          "score": 19
        },
        {
          "text": "i am approaching late 30s now.  Financially i think i would be able to call it a day and walk away from work for good, maybe do simple non stress job and pursue more hobbies and travel. However, the anxiety of thinking this is a bad and irreversible mistake is stopping me. Also the more i research about whether financially i can make it or not introduces new risk to the planning e.g. risk of sequence of returns. Mentally I am quite checked out and does not have any much more motivation to pivot careers or look for another job. Sometimes I wish I get laid off so I can be put out of this misery, this is then accompanied by thoughts that I should be more grateful that there are other people worst off and really need the job.",
          "score": 17
        },
        {
          "text": "You should give some thought to what you want out of your career break and have a plan before you quit. You have to take into account your financial situation, your network/skills/hire-ability, and job market. My career break was pretty straightforward, I was burnout and wanted to switch industries. I had enough savings for 3 years, a good network, and the job market was pretty robust, so it was an easy decision. Ended up doing a bunch of traveling and got an offer after 3+ months through a friend of a friend. I'd do it again because it was stress free and I got to refocus myself. But I was definitely in a fortunate set of circumstances.",
          "score": 11
        },
        {
          "text": "I took 2 breaks in between those years -- no regrets. The pause gave me breathing space and a break -- enabling me to think through clearly without all the noise. Best decision ever.  No regrets. Would I do anything differently? No..  The pause and break + actions taken after shaped who and what I am today. \n\nCurrent market not ideal?  Well, if not now, when? You either Live Life or allow Life to live you. Then you gotta spend years undoing what Life did to you.  By then, what's left? ",
          "score": 11
        },
        {
          "text": "I did it for a year and moved to Korea. It's been good to reset. Am on my way back now. ",
          "score": 10
        },
        {
          "text": "Honestly i don’t regret taking a career break because during this period i really experienced a-lot. I am on my close to a year career break but honestly going back into the career scene has been tough no joke. Finding job was not as tough last time. I am not sure if it’s really due to my career break or just a lack of opportunities so do it only if you have enough savings to tide you at least 1-1.5 years of unemployment.\n\nLooking back if i had the chance i might not throw letter so fast and be more calm. But then again i would say this period made me grow a-lot as a person.",
          "score": 8
        },
        {
          "text": "The job market will always sound and feel bad, so there’s no “right” time for a career break. Well, maybe when you are younger.\n\nI was unemployed for 1 year, not by choice. Do it when you are younger as you have a longer runway.\n\nWhen you get back into the workforce, you will look back at that period with fondness as it might be the only break you get, without being hounded by your boss",
          "score": 6
        },
        {
          "text": "If you go on a break without enough money to last, you gonna end up more stressed out. \n\nMy advice is stack cash first, so you can truly take a break that feels like a break, rather than having to fret about finding a job to make ends meet after your break ends.",
          "score": 5
        },
        {
          "text": "Best thing ever. But you have to clear in why you are taking a career break. Is it for family? To learn a new skill. To take care of your body? If you are taking a break just to nua at home and do nothing, I promise the novelty will wear off very quickly and soon you will be feeling stressed.",
          "score": 5
        },
        {
          "text": "If you can stay in your current role and have some social capital given your time in company, discuss a sabbatical? \n\nEspecially if you know of colleagues who has done the same, tides you over w/o fear of being unemployed. Then discuss a more sustainable work arrangement when back.",
          "score": 4
        }
      ]
    },
    {
      "id": "t3_1rck7sz",
      "subreddit": "askSingapore",
      "title": "Striking 4D/TOTO and how life transform",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rck7sz/striking_4dtoto_and_how_life_transform/",
      "score": 65,
      "num_comments": 65,
      "created_at": "2026-02-23T23:19:34",
      "selftext": "With 12m toto draw this friday, I was wondering if anyone strike big by buying toto/4D and how their life transform? I only strike a $60 toto system 7 bet before.",
      "comments": [
        {
          "text": "First thing I'll do after striking toto on the 27th is to wake up",
          "score": 223
        },
        {
          "text": "My colleagues and I were discussing how we have 0 friends, friends' friend or even 3rd 4th 5th degree friends, who won TOTO grand prize. Among everybody we know, the highest winning was less than $50k. Hmmm... or maybe a friend won grand prize already but quietly continue working and continue living normal frugal life so we will never suspect it?\n\nOkay let's brainstorm for ideas. How do we confirm that there is a real human winner for the grand prize and then confirm this human isn't affiliated with Singapore Pools in any way?",
          "score": 83
        },
        {
          "text": "Will let you know after winning this Friday toto 😂",
          "score": 64
        },
        {
          "text": "u are 14 times more likely to be struck by lightning than winning group 1. Dream on buddy.",
          "score": 56
        },
        {
          "text": "If it’s yours it’s yours. No need buy so big. The fun is reading the signs and numbers.",
          "score": 54
        },
        {
          "text": "I strike $30 before. Could order stingray for caifan",
          "score": 40
        },
        {
          "text": "A friend of mine struck one of the $1 million draws in 2015\n\nThis was just after they changed it to the current 6-out-of-49 format in end-2014 and he won about $1.2 million. Brought everyone in his friend group to the 2-starred Andre (now no longer around). Purchased a 4-bedder in Sengkang (I believe the condo name is Hyde Park or smth) with the remainder of his cash. He mentioned something about making sure he spends his all the winnings so that when someone asks him for money, he can just tell them that he can't be selling away his home to give them a loan.",
          "score": 32
        },
        {
          "text": "I know two people who each won a first prize with seven-figure winnings. Ten years later, he’s still working as an engineer and she’s still a cashier. Every big Toto draw, they buy stacks of tickets, hoping to win again. They couldn’t manage their winnings well enough to change their lives and now keep spending a lot, chasing another lucky break again.",
          "score": 30
        },
        {
          "text": "I know a guy who won MYR33 million around Nov 2019. Bought a few luxury cars for his immediate family members. Bought a MYR 1 million condo somewhere in Damansara. Setup a dental clinic for his gf (she was caught cheating on him few months later but kept the dental clinic). Crashed a brand new nissan GTR and bought another one right after. Sleeps with call girls few times a month, smokes, drinks all the time. Pretty sad way to live despite having millions.",
          "score": 25
        },
        {
          "text": "If I win my first purchase is a toto washlet",
          "score": 20
        },
        {
          "text": "this few nights pillow stack higher, tia gong got higher chance.",
          "score": 17
        },
        {
          "text": "I don’t think I’ll be on Reddit this Friday when I win",
          "score": 9
        }
      ]
    },
    {
      "id": "t3_1rcg4sq",
      "subreddit": "askSingapore",
      "title": "What are some words non-Malay thought its Melayu?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rcg4sq/what_are_some_words_nonmalay_thought_its_melayu/",
      "score": 48,
      "num_comments": 56,
      "created_at": "2026-02-23T20:28:52",
      "selftext": "What are some words that the public use without knowing it’s the correct language? Eg. Gostan, for the longest time I thought it’s a Malay word. ",
      "comments": [
        {
          "text": "\"Chapalang\" (like, random or anyhow) I always thought was malay lol. Until a malay friend ask me what it means then I tio stun.",
          "score": 67
        },
        {
          "text": "*gostan* is a Malay word though https://prpm.dbp.gov.my/cari1?keyword=gostan\n\nYes it’s borrowed from English “go astern”, but it’s the Malay word which then became re-borrowed into Singlish https://en.wiktionary.org/wiki/gostan\n\ncc: u/TrashDesperate930\n\nEdit: Seems like quite a number of comments in this post are for actual recognised Malay words, even if they did descend from identical/similar words in other languages",
          "score": 52
        },
        {
          "text": "I don’t have evidence for this, but I believe aiseh came from “I say!” - as in, the old British expression.",
          "score": 43
        },
        {
          "text": "Sharing the most used one since pri sch: TOMBALIK means upside down when the Malay word is TERBALIK",
          "score": 36
        },
        {
          "text": "What's gostan",
          "score": 18
        },
        {
          "text": "Halal &amp; haram",
          "score": 16
        },
        {
          "text": "Gudang....is the Malay version for Storehouse. \n\nThe word originates from Telugu or one of the south Asian language..gidanga. I only found out when i saw the English version of Gudang is Godown. Which led me to a rabbit hole of the word origin..\n\nThen there's lots of other Malay words l realise have origins in Sanskrit. Mainly cultural words..\n\nFor an incomplete list of loan words and their origins\n\nhttps://en.wikipedia.org/wiki/List_of_loanwords_in_Malay_language",
          "score": 8
        },
        {
          "text": "Sabun actually is soap in Portuguese\nSatay, three stack/pieces in Hokkien \nBomba = pump in Portuguese. Portuguese fire men is called bombeiros\nNanas. Portuguese for pineapple Ananás\n\n",
          "score": 7
        },
        {
          "text": "The opposite, I grew up thinking ikan bilis was Tamil because that's how my parents said it too when speaking Tamil. Turns out its nettili! Ikan bilis comes more naturally though.",
          "score": 4
        },
        {
          "text": "Pangsai",
          "score": 2
        },
        {
          "text": "I was pretty positive that sabun was soap in Malay. Was shocked when my taiwanese colleague told me it was applicable in mi nan yu.",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1rd1prn",
      "subreddit": "askSingapore",
      "title": "Does your office still have a souvenir culture?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rd1prn/does_your_office_still_have_a_souvenir_culture/",
      "score": 46,
      "num_comments": 43,
      "created_at": "2026-02-24T10:01:04",
      "selftext": "Just curious about different workplace cultures in Singapore!\n\nBack in my first job, it was almost an unspoken rule to get souvenirs for the entire department - think small KitKat bars (or anything individually packed) for 50 people.\n\nThe company also placed a lot of emphasis on team building etc so naturally the department interacted quite a bit across teams and everybody were on good speaking terms.\n\nIs anyone else’s office like this as well?\n\nI don’t get souvenirs for my current colleagues because we are not even on small talk terms haha, if they don’t know where I’m going for my holidays I don’t see a reason to get stuff, I just get some snacks for my lunch buddies.",
      "comments": [
        {
          "text": "Quite common in SG\n\n  \nYou may not have to give everyone individually if you dont want to make it too persona, just buy some snacks and put in common area and let them know about it also can.",
          "score": 68
        },
        {
          "text": "Unspoken rule to get something for the cluster to share after overseas trips/festive periods like Christmas. \n\nNever did it once. I get individual items for closer colleagues if I go to places known for snacks (e.g. Japan). To be honest I don't keep track of who does and does not do it, and it always felt a little performative to me.",
          "score": 28
        },
        {
          "text": "Yes, i guess it’s also a thank you for people covering my work \n\nThankfully our team isn’t big I can’t imagine buying for 50 pax",
          "score": 19
        },
        {
          "text": "I buy something I want to eat but don't want to finish the whole pack. I put on the shared pantry area and just take what I need, the rest i let people eat.",
          "score": 19
        },
        {
          "text": "Luckily no and thank god for that",
          "score": 16
        },
        {
          "text": "Usually I get for my team members if I take leave over a longer period and if I go further aboard. If I take leave go JB and Batam, I don't care. Thats because its such a common place. I got colleagues from JB also. If I go JB and then I buy them some token of appreciation for them from JB abit silly also.",
          "score": 16
        },
        {
          "text": "Yes. Not because we have to, but because we want to. My team has around 20 pax, and we love to bring back snacks whenever we go traveling to share with everyone. We even buy everyone small gifts, and some of the older colleagues also gave us Ang pao + small CNY deco to bring home or put at our work desk.",
          "score": 11
        },
        {
          "text": "Yeah quite common, especially if you are a close-knit workplace. I will usually buy a pack of something and put at the pantry for all to enjoy but I also partake too with the snacks I brought.",
          "score": 9
        },
        {
          "text": "Small SME with 10 staff here. We don't expect individual souvenirs. A contribution to the snack pantry is fine enough",
          "score": 8
        },
        {
          "text": "I previously gotten small candies to put at office pantry but recently not anymore HAHA",
          "score": 8
        },
        {
          "text": "yes….im new to the team but I’ve witness how they will bring back abit of snacks whenever they go on leave to travel. \n\nAnd bc im new to the team, I have to shadow them almost everyday, so obv I overheard them talking abt how one of our colleagues prev didn’t buy them any snacks when she went overseas. \n\nShows alot abt their practices I guess.",
          "score": 6
        },
        {
          "text": "When I was working in a smaller company, then yup, I would get small souvenirs for the people I'm close to. And snacks, coffee or tea for the pantry for everyone else.\n\nNow I'm in a larger company, I just get snacks for the pantry, or sometimes nothing at all.",
          "score": 5
        },
        {
          "text": "I'll get a few snacks for our \"office pantry\" but lately there's been excess and our finance manager made noise lol. So I stopped since my recent trips and just get for my immediate team members.",
          "score": 5
        },
        {
          "text": "We don't have a rule but it's fun to share unique/tasty tidbits from wherever you have been to.\n\nYou know you brought a hit when it's sold out before lunch on the same day.",
          "score": 5
        },
        {
          "text": "Yes! Usually I’ll get snacks like bars or individually packaged items so my team members can grab and go! Best is Japan - a lot of options! Hahaha usually I’ll also like to “woman-plain”the flavours etc.",
          "score": 5
        },
        {
          "text": "50 people??!! Wah broke already. Most people in my office travel 4 or more times a year, usually will get but just for the team, ie less than 10 people.",
          "score": 4
        },
        {
          "text": "Frankly, I don't see a need to get stuff to individuals or for sharing...",
          "score": 4
        },
        {
          "text": "I’m lucky that my team size is small and hence I can buy some nice local snacks to share.\n\nI don’t expect a gift from others as I understand that there may be time constraints, but I have received quite a few souvenirs such as magnets from my travelling colleagues.",
          "score": 4
        },
        {
          "text": "I have nv gotten my colleagues/ex colleagues anything when i came back from my vacation. But they do get some souvenirs (snacks) when they return from vacation. \n\nJust not me to do so. I like to travel light so i travel w my backpack only.",
          "score": 3
        },
        {
          "text": "Especially after you gone for a holiday overseas",
          "score": 3
        },
        {
          "text": "I know a certain fintech where single malts happen to be souvenir.",
          "score": 3
        },
        {
          "text": "I might bit traditional, even we ain’t in small talk whatsoever, I still buy some snacks back and put in the pantry. \n\nSort of like, “hey I bought these for y’all to share, enjoy”",
          "score": 3
        },
        {
          "text": "Souvenirs to the one you close with, the rest just snacks.",
          "score": 2
        },
        {
          "text": "Yes!!! My table always has something for me to snack on bc someone is always coming back from holiday hahaha. I love it.",
          "score": 2
        },
        {
          "text": "Nope. Just snacks, cause who doesn't like to munch on new snacks.",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1rccemx",
      "subreddit": "askSingapore",
      "title": "If your Dr gave you 3 days MC and you feel better by the second day, will you take the third day of MC? What are your considerations?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rccemx/if_your_dr_gave_you_3_days_mc_and_you_feel_better/",
      "score": 45,
      "num_comments": 50,
      "created_at": "2026-02-23T16:55:09",
      "selftext": "Im thinking:\n\n\\- urgent projects\n\n\\- work that relates to team members (as opposed to work that doesn't affect team members)\n\n\\- contagious vs non-contagious illness\n\nIs it unethical to take the third day of MC if you're feeling okay and the illness is not contagious?",
      "comments": [
        {
          "text": "The doctor gave you three days' medical leave. Take it. If anything happens to you in the office on the third day, the company can deny any responsibility. If you really need to work, work from home.",
          "score": 251
        },
        {
          "text": "WFH, but don't tell anybody that you are working. That way you don't need to reply to emails/Slack. ",
          "score": 132
        },
        {
          "text": "take it of course.. unless the work is actually your own business. \n\ndon't put your life on the line for someone else's business... at the end of the day you are just a salaried worker.",
          "score": 52
        },
        {
          "text": "u are not the doctor, if the doctor deem that 3 days is needed than u follow 3 days. ",
          "score": 36
        },
        {
          "text": "Do what makes you feel better. I doubt you will remember this in 10 years",
          "score": 25
        },
        {
          "text": "Take the full day MC. If I feel better on the second day, I will use the 3rd day to catch up on my work at home.",
          "score": 21
        },
        {
          "text": "Is it ethical to work 70-80+ hours a week usually 🤣...\n\nIt's up to yourself and your work to me. If I had three days mc but I was more or less recovered by day three I personally would still rest for the most part. The demands of my everyday work are tiring and taking a breather to reset your mental headspace is sometimes just as important as the work itself.\n\nThough of course if I had a drop dead do or die project maybe I'll work, particularly if I felt like my absence would impact the overall wins for the team. But rarely can corporate deadlines truly be so drastic...\n\nIf it's contagious - definitely stay home. Getting other people sick is highly irresponsible.",
          "score": 20
        },
        {
          "text": "Doctor give, you just take. What's ethical is how you treat your health. If you go back to work on the 3rd day and your illness relapse the day after that, you cause even more time and trouble for your teammates. And also, if your projects has onsite monitoring/manual tasks, no one can guarantee you won't faint/die due to underlying conditions. Plus in the case that you do suffer injuries or death at work, your insurance might refuse to pay out on grounds that you defied your doctor's MC.\n\nPlus if your illness is contagious, there is no guarantee that just because you feel better, the illness cannot transmit. Some illness can be transmitted through touch and close contact. Doctors usually only give 2 days for fever, flu, etc. but if they gave you three days, maybe they received new guidelines that the seasonal flu is highly contagious and they give one additional day to be sure that it will have lesser chances of transmission. You don't understand human biology/anatomy and contagious diseases like doctors do so I wouldn't challenge on what they ordered. ",
          "score": 15
        },
        {
          "text": "I won't take the MC because typically, the longer I am on MC, the more crap I have to catch up on when I go back. \n\nBut if it's Covid or something else where other people may be offended I come back infectious, then I will WFH. \n\nThe doctor is also guessing when they issue 3 days MC. Actually it's more common for them to issue shorter MC (e.g. 2 days), then you call back if you are still not well after that, and they issue you another MC without charging consultation fee again. ",
          "score": 10
        },
        {
          "text": "you are given third days for a reason. should something happen to you on that day you go back to work when you are still on a mc, insurance can't cover for it, you know? (i think)\n\ninsurance company have the right to dispute—you are not certified fit to work by a doctor already.",
          "score": 7
        },
        {
          "text": "See you want be hero anot lor.\n\nSome jobs/dynamic with bosses, sure. Some, nahhh",
          "score": 6
        },
        {
          "text": "Dunno about your company. My company doesn't want the responsibilities of having a staff who has been certified by a doctor to be unfit to work for 3 days to step into office.\n\nIf you died/fainted/whatever on your certified-unfit-to-work-but-still-come-to-work day then legally messy already.",
          "score": 6
        },
        {
          "text": "Well, if your doctor gave you 5 days MC and you died on the second day, your company probably have a job opening post the next day.\n\nJust rest, you got 3 days MC so why is it unethical to take 3 days rest?",
          "score": 6
        },
        {
          "text": "You doctor or you go and see the doctor? The doctor gave you 3 days MC for a reason. Why you care you about work? Die today, you are replaced tomorrow. F work.",
          "score": 5
        },
        {
          "text": "I take the full days I am given. Just because you feel better doesn't mean you are better. You could still be sick or your body could still very much require the rest and if you keep pushing, you end up getting sick not long afterwards.\n\nJust take the days. There's a reason they give those days. Even if you're feeling OK, the doctor may still tell you to take an additional day to rest.\n\nThe last time I tweaked my shoulder while working out, I was told to stop lifting for at last a week to allow it (the swelling) to heal properly. By day 5, my shoulder felt fine, so I went to the gym, did a warm-up, and tweaked it even worse, then ended up with pain that lasted over a month. It's been over a year and it's still threatening to derail my progress. I regret that one decision.\n\nIf the doctor tells you something, just follow it, regardless how you feel.",
          "score": 5
        },
        {
          "text": "Mc is mc. Fk work. Lol",
          "score": 5
        },
        {
          "text": "depends on a lot of factors\n\nwhat is your position, do you manage staff, importance of your workload etc.\n\ntypically the higher position/pay grade you are, take mc still have to work unless you are bedridden",
          "score": 3
        },
        {
          "text": "Depend on the company also. My current one seems to be adminly troublesome to cut short your mc so I never see anyone do that before. My older job still have some leeway. Anyways just take the extra day to rest or do other things.",
          "score": 3
        },
        {
          "text": "I would say depends on the urgency of your workload. \n\nIf the day after the third day MC is the due date then just work from home if possible lor. \n\nI wouldnt want a colleague who is sick/just recover to come back. Later I kena, who to blame oh?",
          "score": 2
        },
        {
          "text": "My work would still push me to wfh anyways , 3 days or 5 days or whatever",
          "score": 2
        },
        {
          "text": "I'll choose to work from home on the third day - especially if I've good relationship with my colleagues who are tanking in my absence",
          "score": 2
        },
        {
          "text": "depends on the nature of work? my work is task based and cant be covered. its either I take the rest day and have to chiong back later, or I start work earlier and clear them so the rest of the week can breathe easier",
          "score": 2
        },
        {
          "text": "This question reminded me of an analogy my friend told me:\n\nIf you kek sai then half way you decided to stop, will you stop and withhold the rest of the sai in your butt? Or kek all the way. \n\nI snorted my coke and made a mess.",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1rd8yt8",
      "subreddit": "askSingapore",
      "title": "What is one residential area in Singapore that you will not recommend staying in?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rd8yt8/what_is_one_residential_area_in_singapore_that/",
      "score": 31,
      "num_comments": 119,
      "created_at": "2026-02-24T14:39:21",
      "selftext": "Is there any area that you will actively avoid when you are house hunting? Need your honest opinions pls",
      "comments": [
        {
          "text": "Anywhere too far from your office",
          "score": 87
        },
        {
          "text": "A specific part of Bt Gombak. Unless u really enjoy lots of young punks blasting music and lots of neighbours that have no civil mindedness.\n\nHighly recommend during house hunting not to just depends on your agent viewing. After shortlisting preferred option, take some weekend morning and evening time go spotcheck to see if dysfunctional neighbors being noisy in morning and evening. Some are unbearable. Such spotcheck helps alot. If WFH then also go on weekdays day time.\nJust my serious personal recommended actions coz am suffering due to failure to do this previously. And police can't help much for such scenarios tbh",
          "score": 53
        },
        {
          "text": "Areas near the expressways/highways",
          "score": 39
        },
        {
          "text": "Tengah. Went there during cny and the network is horrible",
          "score": 28
        },
        {
          "text": "I feel that commuting time is a huge aspect of QOL, and when your workplace/school requires 1 hour of daily commute, it can really take a toll on your mental health. For that reason, places in the far-flung north-west like CCK, Yew Tee are very undesirable to me since offices tend to be located in city or central SG. These areas, unlike Punggol, Woodlands, or Bukit Panjang, do not have a straight line down to city/CBD (technically they do but tolerating the whole redline detour from kranji onwards is crazy), so you typically need to change to other lines to reach town.\n\nI stay in Keat Hong but there was a straight bus to NUS back when I was still studying and a straight bus to my first workplace in the west so it wasnt that bad. Currently, my office is located near city and having to change multiple lines PLUS needing to take feeder bus is exhausting. Not too many pros here except for the Mcdonalds downstairs my block.",
          "score": 25
        },
        {
          "text": "Serious answer, Yishun. More specifically the older resale flats. Overcrowding, too many pmds, multiple cases of high rise literring.",
          "score": 24
        },
        {
          "text": "Jurong West. Looks pretty depressing. \n\n  \nWas gonna say also the whole stretch of red line between bukit batok to sembawang there but I think if you stay near mrt stations like woodlands it's actually not so bad?",
          "score": 23
        },
        {
          "text": "If you can't handle kids, don't move to Sengkang/Punggol/ESPECIALLY Bidadari",
          "score": 22
        },
        {
          "text": "Punggol. Especially the shore area that overlook Pasir Gudang. Good luck with the air quality there. ",
          "score": 22
        },
        {
          "text": "This question can be pretty biased as where you stayed when you were a kid highly influences which area you think is “bad”. I stayed in the Central Area for most of my life even though I work nowhere near which is in the far east, but I loved where I stay for its conveniences. I told myself I’ll never move to places like Seng Kang , but guess where I’m staying now.",
          "score": 20
        },
        {
          "text": "Tampines Central.\n\nI find that place to be one giant mosh pit with too many people.\n\nAt least Simei is calmer.",
          "score": 16
        },
        {
          "text": "Most depressing is corridor around Novena, Ang Mo Kio, Brighthill, upper Thomson, Sin Ming, Bishan area. The entire area has been a giant construction site for tens of years and there is no light at the end of the tunnel. Most depressing and dusty corridor. I cannot imagine spending 20 years in such an environment and there is no light at the end of the tunnel.",
          "score": 10
        }
      ]
    },
    {
      "id": "t3_1rd4f41",
      "subreddit": "askSingapore",
      "title": "What is SQ Cabincrew salary for the 4 ranks?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rd4f41/what_is_sq_cabincrew_salary_for_the_4_ranks/",
      "score": 23,
      "num_comments": 5,
      "created_at": "2026-02-24T11:55:13",
      "selftext": "Does anyone know how much the cabin crew for the different ranks earn?\n\nBlue: Most junior\n\nGreen: Leading\n\nRed: Chief\n\nPurple: In flight manager",
      "comments": [
        {
          "text": "Blue : 4-5k\n\nGreen :5-6k \n\nRed: 6-7k \n\nPurple: 7-9k \n\nAfter CPF. But all depending on roster. Some months maybe more some maybe less",
          "score": 1
        },
        {
          "text": "You can try ask this in ChatGPT",
          "score": -66
        }
      ]
    },
    {
      "id": "t3_1rcjw4t",
      "subreddit": "askSingapore",
      "title": "For those who resigned/retired - parting gifts for bosses?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rcjw4t/for_those_who_resignedretired_parting_gifts_for/",
      "score": 23,
      "num_comments": 36,
      "created_at": "2026-02-23T23:07:15",
      "selftext": "Title says it all. What parting gifts did you give to bosses before you retired/resigned? \n\nBudget: max $300 \n\nLooking for something thoughtful/personal. Any category ok ",
      "comments": [
        {
          "text": "I had a husband wife power couple for a boss, and I gave the husband a moleskin notebook with a handwritten note, and the wife a bottle of wine. The husband, whom I worked more closely with was very delighted at the handwritten note because he said he hasn’t receive something like this in a while. Their parting gift for me was me working till 9pm on my last day which was my birthday lol",
          "score": 102
        },
        {
          "text": "A bunch of password protected files that noone will ever be able to read.",
          "score": 27
        },
        {
          "text": "Why do you need to give boss a gift? Should it not be the other way round?",
          "score": 26
        },
        {
          "text": "I gave my previous boss a handshake lmao. Be aware of gifting policies in your workplace, if any. \n\nWhat about gifting a bottle of perfume or an Ember Smart Mug? These are QOL upgrades for many working men. ",
          "score": 22
        },
        {
          "text": "Bro not the other way around meh. You retire also not the boss retire, they buy for you.",
          "score": 17
        },
        {
          "text": "You said personal, well we don’t know your boss at all, how would we know what they would like?\n\nPreviously when I left, I gave one boss fishing tackles cos he liked to fish, another boss I gave him a Dilbert collection cos he always like to quote Dilbert. Another boss had pierced ears so I gave him earrings. None of the gifts were expensive but they were all personal and tailored to them. AFAIK they all liked their gifts. So you need to think about your bosses and what they like.",
          "score": 16
        },
        {
          "text": "I don't think the price matters as much as the thoughfulness of the gift. I don't mean the gesture, but rather the effort that went into choosing the gift. Just some examples:\n\n1) Team does alot of overseas trips: travel GaN chargers to charge their laptops and devices.\n\n2) Team did alot of note-taking: Rocket Books or Rewritables.\n\n3) Team loves golt: golf kits, club sleeves, etc.\n\n4) Know someone for decades: think about your mutual first memories and commemorate that. ",
          "score": 6
        },
        {
          "text": "None for my boss other than very well organised files as no replacement for me till hiring freeze stopped.\n\nBut ordered in McDonald’s lunch for my team mates and a work series blind box  (everyone into this). Also bought bbt for everyone else I interacted with and made my life better working there.",
          "score": 6
        },
        {
          "text": "Wine is probably the best and most agnostic gift",
          "score": 4
        },
        {
          "text": "I left so many companies but didn't give any to my bosses.. you guys are so kind",
          "score": 3
        },
        {
          "text": "For my ref: for now I’ll look into stationery, desk accessories, mugs, bookmarks",
          "score": 3
        },
        {
          "text": "My French boss had celiac so I bought a couple bottles of gluten free beer for the team to drink and had some thank you notes tied to it.",
          "score": 1
        },
        {
          "text": "Customised Mont Blanc pen? If your budget is lower, perhaps a Montigo water bottle with their names or smth meaningful engraved on it? Regardless of age, a water bottle would be useful to anyone",
          "score": 1
        },
        {
          "text": "An oversized enter keyboard button so he can smash it every time he types a new line of code and destress at the same time",
          "score": 1
        },
        {
          "text": "Handwritten and decorated card is always most appreciated",
          "score": 1
        },
        {
          "text": "I just buy food for my colleagues to have energy to continue be abused",
          "score": 1
        },
        {
          "text": "I never gave any, but one of colleague gave my retired big boss a a bundle of printed t shirts with various photos of us. Another gave a watch with his name engraved at the back",
          "score": 1
        },
        {
          "text": "$300 NTUC vouchers",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rd83wl",
      "subreddit": "askSingapore",
      "title": "Where in SG can I learn some conversational Hokkien",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rd83wl/where_in_sg_can_i_learn_some_conversational/",
      "score": 20,
      "num_comments": 27,
      "created_at": "2026-02-24T13:54:29",
      "selftext": "SG millennial hopeless Chinese here, I realised I can’t connect with my ageing parents as much as I’d prefer. Sometimes they speak to each other in Hokkien and pivot to me to continue the conversation and I have zero context. Sometimes it’s just nice to understand their comments on random things outside or on the TV. Or maybe try to get in on their humour.\n\nIf possible I want the coffeeshop/SG/M’sian style, I’m not even sure if that’s the right way to put it. I mean as opposed to ‘original’ mainland china style.\n\nAny ideas where to begin?\n\nAlso, what about Hainanese? Our PM is Hainanese, I’m mildly curious\n\nEDIT to add: thanks everyone for the suggestions. I'm gonna just whack it. Just memorise a few everyday phrases and get started talking. Wish me luck!",
      "comments": [
        {
          "text": "the hokkien huay kuan runs courses from time to time",
          "score": 15
        },
        {
          "text": "From your parents",
          "score": 9
        },
        {
          "text": "sorry to say this but if you didn't pick up from your parents conversing with each other, then it's almost impossible to learn through classes. Min-nan is known in China as one of the most complicated dialect to learn. My daughters attended the hokkien clan classes. not much use as expected.\n\n  \ni foresee hokkien and most dialects will die off within 2-3 generations",
          "score": 8
        },
        {
          "text": "There's a learndialect.sg I keep seeing their ads but have never tried it. They have online classes Maybe it'll be convenient for you. \n\nMaybe can also learn from friends or volunteers? \n\nHokkien is pretty similar to what they use in the Taiwanese soap drama (that lasts for years). My aging parents always follow the shows on ch8.",
          "score": 7
        },
        {
          "text": "Learning is one thing. Using is another. My grandmother spoke only in Hokkien. I think she passed away when I was aged 3 or 5. Can't remember. By then, I was semi fluent in Hokkien. Spoken only. Ask me to read lyrics from Taiwan songs that are in the Min language, I don't know how to translate to Hokkien. \n\nMy dad spoke only Cantonese. I became fluent in Cantonese without taking classes. Again, ask me to read, maybe I CMI.\n\nIMO, languages is not about taking classes. You need to also use it so that you can get to master it. The structured way of how sentences are taught might not be what you use in street conversation too.",
          "score": 3
        },
        {
          "text": "From Wang Lei",
          "score": 2
        },
        {
          "text": "SAF, free lessons some more lmfaooo",
          "score": 2
        },
        {
          "text": "Hougang",
          "score": 1
        },
        {
          "text": "Maybe refer to Taiwanese dramas and listen to Taiwanese music eg Wu Yue Tian? Haha but others have already mentioned the classes at the huay kuan. I think there are old Singaporean movies that also use Hokkien eg Jack Neo movies, though I can’t say I really enjoy the humour.",
          "score": 1
        },
        {
          "text": "Go Chinatown talk to the old folks hanging out in public spaces",
          "score": 1
        },
        {
          "text": "honestly i picked up my hokkien from home and im the only one in my generation to be able to understand and speak hokkien, my cousins are not able to speak and barely understand. honestly my uncles’ wives cant speak too but understand hokkien. its important to be able to practice, otherwise you may end up understanding but not able to speak. (i think there are radio channels in hokkien and some  ch8 dramas in hokkien too, not too sure but ive briefly seen and heard it before)\n\ni get to practice because at home i get to speak hokkien with my grandparents and previously when i volunteered and worked with elderly i get to speak in hokkien (and cantonese). \n\nnot related to hokkien but i picked up my cantonese from watching TVB dramas and practiced with my friend who is super fluent in canto, get to speak with old folks and sometimes practice with my mum since she speaks a little canto. so i’ll say watch dramas in hokkien accompanied by chinese subs (easier for me but english sub works too) to understand. \n\ni learn dialects and languages pretty quickly so i dont take up classes for it and i always learn via watching shows.",
          "score": 1
        },
        {
          "text": "There are different associations or clans for the various dialect groups in Singapore. Unfortunately language is mostly learned through practice and socialisation - the only reason I am able to speak 3 different dialects is because I had no choice but to learn if I want to communicate with my grandparents.\n\nChinese serves as a very good starting point - my advice is to try and get fluent in mandarin first, that will form the baseline and serve as a reference for the other dialects. The moment you are able to translate chinese to dialect and vice-versa, you will pick things up much faster.\n\nFYI my chinese sucks too, but after having to converse with clients from mainland China, it just starts improving over time. Dialects in Singapore are unique in the sense that they evolved more for easy communication among fellow countrymen - so that's exactly what you have to do, try to converse (even if very poorly at first).\n\nMusic also helped a lot for me - for hokkien specifically you may look at Taiwanese artists (although there may be slight differences) like EggPlantEgg, the singer has very good enunciation which helps for clarity, the MVs are subtitled with the hokkien pronunciation with mandarin characters so you get to learn the meaning and how to pronounce at the same time",
          "score": 1
        },
        {
          "text": "There are some Hokkien shows on Mewatch! One that I recall is 没马跑. You just need to select the original one as it was recently dubbed to Chinese.",
          "score": 1
        },
        {
          "text": "If you live with them, then can try to converse with them in Hokkien more? Listen and dont be afraid to speak. My parents use to tease me when I speak hokkien but then I continue and now I can chitchat with my parents in Hokkien, no doubt some pronounce is very funny. lol.    \nMy hub can also speak hokkien, so its our secret language when we talk in front of my kids.   \nMy kids sadly, although see their grand parents almost everyday did not really pick up Hokkien. My mum will speak chinese to them and sometimes simple hokkien, like have they eaten, or tell them the food is hot. ",
          "score": 1
        },
        {
          "text": "Tekong.\n\nJust kidding, you should try to approach the Hokkien Huay Kuans",
          "score": 1
        },
        {
          "text": "Speak Mandarin campaigns were rampant in the 70s and 80s until all TV programs were dubbed in Mandarin.\n\nGrowing up in a Cantonese family, I learnt the dialect from young speaking to parents and relatives. As for Hokkien, most of my childhood and teenage friends are from that dialect group so naturally picked it up along the way. \n\nDuring NS, picked up the Malay language as well. \n\nDue to work as I was stationed in Bangkok for a couple of years, I managed to pick up the Thai language.\n\nMy elder child is fluent in Cantonese but my younger child's command of the Cantonese language is half past six. \n\nI also noticed that those Gen X onwards, majority don't speak their dialects as their parents either converse with them in Mandarin or English. Same goes for their friends. All these lead to the \"extinction\" of various dialects. \n\nAs for OP, try to befriend an elder person, listen and then speak with them. Over a period of time, you should be able to pick up the dialect but it will take time and practices.",
          "score": 1
        },
        {
          "text": "There’s a Singapore Hokkien Meetup where people meet to chat.\n\nOr you could just befriend your neighbourhood kopitiam uncles.",
          "score": 1
        },
        {
          "text": "Can try watching content from yitinggoyt on Tiktok, she's the hokkien girl on Tiktok. She banters with her parents sometimes and you can get an insight on understanding what kind of conversations can happen in Hokkien and what kind of jokes you might be able to learn from her.   \n\n\nIt would be abit more slice of life vibes that would allow you to get more insights on how such conversations happen and what kind of humour you can consider trying with your parents.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rcjwjl",
      "subreddit": "SingaporeRaw",
      "title": "They walked so Melvin and Grayce could run",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rcjwjl/they_walked_so_melvin_and_grayce_could_run/",
      "score": 339,
      "num_comments": 69,
      "created_at": "2026-02-23T23:07:42",
      "selftext": "",
      "comments": [
        {
          "text": "\"I wan to lick your vaginal\" this kinda english coming from a VP is legit insane. ",
          "score": 293
        },
        {
          "text": "The fucking checklist lmao I wanna throw up",
          "score": 178
        },
        {
          "text": "Yes I wan u to suck me.\nThen I will do it loh. \n\n🤣🤣🤣🤣",
          "score": 158
        },
        {
          "text": "https://preview.redd.it/5sgse85hl9lg1.jpeg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=057d607131e04736f0772132fbcf4a07bccd1c1a",
          "score": 92
        },
        {
          "text": "For those who are not aware of this lore that happened in 2024.   \nHere it is 😁\n\n[https://mothership.sg/2024/10/vice-principal-affair-wife-claims/](https://mothership.sg/2024/10/vice-principal-affair-wife-claims/)",
          "score": 39
        },
        {
          "text": "They whispered so that she could scream",
          "score": 31
        },
        {
          "text": "Knn this is so classic",
          "score": 29
        },
        {
          "text": "He held a LTC rank in the SAF before that VP post. \n\n![gif](giphy|cqAR5v5qwjQghPdqrp)\n\n",
          "score": 28
        },
        {
          "text": "Someone enlighten me pls",
          "score": 16
        },
        {
          "text": "Should reply with \"I wanna wet your urinal\" ",
          "score": 16
        },
        {
          "text": "Is this the [Vice Principal extra-marital affair case in Singapore](https://mustsharenews.com/affair-vice-principal/)?",
          "score": 10
        },
        {
          "text": "Wait what’s the lore behind this?",
          "score": 10
        },
        {
          "text": "Maybe im dumb but how come the conversation POV is from Michael but also addressed to Michael? Shouldn't it be the lady's name at the top?",
          "score": 8
        },
        {
          "text": "That laundry list of demands still cracks me up.",
          "score": 7
        },
        {
          "text": "How come got checklist? You can take away the man from SAF but you cannot take away the SAF from a man.",
          "score": 6
        },
        {
          "text": "Standard VP legit boo🤣😆",
          "score": 5
        }
      ]
    },
    {
      "id": "t3_1rcgx1o",
      "subreddit": "SingaporeRaw",
      "title": "40-year-old man who immigrated to Australia as a child and evaded NS for more than 16 years was sentenced to 16 months in prison",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rcgx1o/40yearold_man_who_immigrated_to_australia_as_a/",
      "score": 239,
      "num_comments": 90,
      "created_at": "2026-02-23T21:06:12",
      "selftext": "The 40-year-old man immigrated to Australia with his family as a young man, evaded military service for more than 16 years, and was sentenced to 16 months in prison for using his Australian passport at least 21 times.\n\nThe defendant, Chow Chun Kit (40), who faces a total of 28 counts of contravention of the Enlistment Act, pleaded guilty in the State Courts earlier and the verdict was handed down on Monday (February 23).\n\n[少时移民澳洲逃兵役逾16年 40岁男子判监16个月 | 联合早报](https://www.zaobao.com.sg/news/singapore/story20260223-8626107)",
      "comments": [
        {
          "text": "Why the fuck would you come back?",
          "score": 157
        },
        {
          "text": "So much white hair at 40",
          "score": 121
        },
        {
          "text": "That's why I always said, the minute a boy is born in SG, a mindef officer already standing by at the door with a stamp that says \"Property of Mindef\" 🤣🤣🤣",
          "score": 113
        },
        {
          "text": "At the end he also already gave up his citizenship and not like he took any perks from serving NS or whatsoever. \n\nShould have an option to pay for release for such cases at least rather than jailing him.",
          "score": 95
        },
        {
          "text": "Seriously ... people already dont want sinkie citizenship, so as long as he renounced liao, you let him. then done loh.  \nis it govt never let him renounced.. or is it must serve jail before you can renounced??   \nhaiz... What about foreigners who come here at age 20yrs old or 30yrs old and become new citizens.  Need to serve NS or not? Why born here is a penalty?",
          "score": 75
        },
        {
          "text": "This idiot already left long ago and didn’t surrender citizenship. He kana sabo by parents.\n\nHe siam NS but he also didn’t benefit much/contribute the Singapore system.",
          "score": 54
        },
        {
          "text": "So after serving  16 months in prison and given his age.. Still need to serve 2 full years of NS and 10 cycle of reservist?",
          "score": 26
        },
        {
          "text": "Madness. He is an Australian citizen now. He isn't Singaporean though born here. Instead of splitting hair over such. How about spending more time and effort to go enforce rules to all those newbies you let in, creating social issues and banning them instead?",
          "score": 8
        },
        {
          "text": "Insane. Him migrating was no fault of his own. Just cos he missed some arbitrary age level (at age 12, how tf does any migrant child at that age already have decided their future life??) by 2 years his life got thrown upside down.",
          "score": 5
        }
      ]
    },
    {
      "id": "t3_1rcgf48",
      "subreddit": "SingaporeRaw",
      "title": "Something that amazed me today",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rcgf48/something_that_amazed_me_today/",
      "score": 199,
      "num_comments": 58,
      "created_at": "2026-02-23T20:43:26",
      "selftext": "cool couple walking relaxed for almost 200+  meters , even crossed a signal and until they were  bothered by 65 stopping behind them and honking . ",
      "comments": [
        {
          "text": "Visit again on Sundays. U will amazed and baffled 😁",
          "score": 120
        },
        {
          "text": "They probably thought it was the elderly people lane 🤣\n\nhttps://preview.redd.it/vthxjavxr8lg1.jpeg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=0d453a08f2e6e07f12d83195e19473664081b3d4",
          "score": 86
        },
        {
          "text": "When in Rome, do as the Romans do but for the couple, it’s ’When in Rome, do it the same way you do back home.’",
          "score": 79
        },
        {
          "text": "I've seen them cycling through red lights or cycling on the wrong side of the road.\n\nWhere is that Maxwell BYD driver? Should be over here and not running over little girls.",
          "score": 36
        },
        {
          "text": "Yao Siew CECAs.. I was out jogging today &amp; a family of 4 CECAs was hogging the whole pedestrian lane, walking very slowly.\n\nEven seeing that I was running towards them, they dk how to siam one. I had to run into them before they know how to make space.\n\nI lapped them 4-5 times during my night run &amp; it was always the same instances. Don’t know what kind of poor upbringing their whole country has to lack such simple social awareness (of making way when people are running towards you) &amp; graciousness.\n\nPeople like to hate on tiongs, JHK, peenoise &amp; whatever but CECAs take the cake for me.",
          "score": 31
        },
        {
          "text": "In india, they do that",
          "score": 23
        },
        {
          "text": "First time?",
          "score": 15
        },
        {
          "text": "Lol at elderly crossing sign, OP truly knows how to capture a magical moment",
          "score": 15
        },
        {
          "text": "Cultural",
          "score": 15
        },
        {
          "text": "“We first society”",
          "score": 9
        },
        {
          "text": "No enforcement at all",
          "score": 8
        },
        {
          "text": "i need some russian drivers driving around there with a vodka in their hand",
          "score": 8
        },
        {
          "text": "The way to deal with such people is to speed right past closely without touching so that they realize they are in danger and get out of the roads",
          "score": 8
        },
        {
          "text": "I saw such people walking 3 in a horizontal row along cyclist path at east coast beach. Just waiting to be knocked down",
          "score": 7
        },
        {
          "text": "This is why Im terrified of driving down serangoon rd",
          "score": 7
        },
        {
          "text": "That guy walking like a Bollywood hero whom later may jump up to the roof of the bus and fight the bad guys there..",
          "score": 6
        },
        {
          "text": "They identify as buses.",
          "score": 5
        },
        {
          "text": "CECA…",
          "score": 3
        },
        {
          "text": "Normal in india.",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1rcd7js",
      "subreddit": "SingaporeRaw",
      "title": "How wild are uni halls and dorms?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rcd7js/how_wild_are_uni_halls_and_dorms/",
      "score": 146,
      "num_comments": 40,
      "created_at": "2026-02-23T17:44:22",
      "selftext": "heard certain halls in nus like kent ridge and sheares have alot of action going on like group hook ups. and stories about mass nudity in orientation camps in the past. anyone has real stories to share? seems like a lot of gossip on this but not sure if it actually happens. ",
      "comments": [
        {
          "text": "Very wild. I participated in a 100 person orgy before. All guys.",
          "score": 163
        },
        {
          "text": "It depends which hall. Diff hall diff culture\n\nMy current hall I chose because it’s near most of my classes and I didn’t realise is a party hall 💀💀. The room beside mine the guy change gf like 3 times already luckily the walls between us got abit of sound proofing so can’t hear the sound at night but Thursday and Friday nights can hear a lot of loud music and drunk people then the next morning the toilet bowl got vomit. Also a lot of mahjong playing till 5 am on some nights",
          "score": 149
        },
        {
          "text": "A colleague's daughter was harassed and stalked by a horny boy in NUS halls that she has to make police report and get restraining order.\n\nIts not all fun and games.",
          "score": 137
        },
        {
          "text": "I did it in a real.estate office before",
          "score": 109
        },
        {
          "text": "Since decades ago have. But have doesn't mean everyone does it. Usually is a small % very wild and majority just normal bf gf stuff.",
          "score": 75
        },
        {
          "text": "NUS not sure but for NTU not so much. Cause most NTU students are from more modest background and poly. Plus most are engineering students so… \n\n\nSure there are flirtations here and there, also have couples having sex in the dorm (and moaning until the whole floor can here). But so far only these",
          "score": 39
        },
        {
          "text": "Quite wild. There is an unknown rule if you see like your female neighbour’s dorm outside got big guy  slippers or vice versa . You never knock and disturb",
          "score": 36
        },
        {
          "text": "I was in nus for an exchange and it was indeed quite wild. We have 2 people from france, 1 from germany, and me. It was quite an amazing experience I would say as a young adult back then. The girls in the exchange group however didn find it the same way, they have limited social circle basically just with us fellow exchanges.",
          "score": 29
        },
        {
          "text": "Yes. My friend panties got stolen like 5 times",
          "score": 27
        },
        {
          "text": "Pretty wild when I did my exchange there. Got plenty of group action every other week.",
          "score": 22
        },
        {
          "text": "Piak Piak in toliet, classroom during wee hours",
          "score": 21
        },
        {
          "text": "It was crazy we were having wild party with exchange students. Oh my they were wild.",
          "score": 11
        },
        {
          "text": "There is a CNA documentary about this.",
          "score": 7
        }
      ]
    },
    {
      "id": "t3_1rd22x8",
      "subreddit": "SingaporeRaw",
      "title": "Wyd bro. He did this for 20mins straight.",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rd22x8/wyd_bro_he_did_this_for_20mins_straight/",
      "score": 99,
      "num_comments": 53,
      "created_at": "2026-02-24T10:16:43",
      "selftext": "",
      "comments": [
        {
          "text": "Bro straight up violated that MRT seat 😂",
          "score": 112
        },
        {
          "text": "Stimulating the seat gives him sense of achievement",
          "score": 87
        },
        {
          "text": "let he who has not caressed the crack of an MRT seat for more than 15mins cast the first stone",
          "score": 47
        },
        {
          "text": "buddy was prolly on call with his wife or smth la 😭😭",
          "score": 41
        },
        {
          "text": "Walk away la. Still sit there for what",
          "score": 25
        },
        {
          "text": "Wife talking naughty to him from his village. Bro mimicking his fingering haha",
          "score": 15
        },
        {
          "text": "*Processing img 33xjm57utclg1...*\n\nBro can't tahan anymore..",
          "score": 11
        },
        {
          "text": "Keling chee bye.",
          "score": 11
        },
        {
          "text": "PAP favourite activities. 🤣",
          "score": 10
        },
        {
          "text": ".... Gross",
          "score": 10
        },
        {
          "text": "Usual suspect",
          "score": 10
        },
        {
          "text": "Maybe his snot just wouldn't leave his fingers lol.",
          "score": 9
        },
        {
          "text": "he horny ah",
          "score": 7
        },
        {
          "text": "some jokers dig their nose and the complete with this motion.. sick",
          "score": 6
        },
        {
          "text": "![gif](giphy|10FHR5A4cXqVrO)\n\nImagine you are the one taking the next sitting…nvm. 😌",
          "score": 5
        },
        {
          "text": "mrtussy got me acting unwise",
          "score": 5
        },
        {
          "text": "Train seat ASMR",
          "score": 4
        },
        {
          "text": "\"I do not fear the man that have touched a thousand slits.\n\nI fear the man that have touched a slit for a thousand times.\"\n\nBoobs Lee.....I think",
          "score": 4
        },
        {
          "text": "Always talking on the phone. Must be talking dirty with wife back home",
          "score": 4
        },
        {
          "text": "Relax people. Obviously he's scared. Never heard of train turbulence??\n\nhttps://preview.redd.it/gw9xhoxyrdlg1.png?width=882&amp;format=png&amp;auto=webp&amp;s=d8a9fa9487633b1e411889c6582f5dd766a5eba9",
          "score": 3
        },
        {
          "text": "I saw his bag  and thought he came",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1rccyls",
      "subreddit": "SingaporeRaw",
      "title": "Got the kaigong angbao today, $2 thank you ah",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rccyls/got_the_kaigong_angbao_today_2_thank_you_ah/",
      "score": 82,
      "num_comments": 31,
      "created_at": "2026-02-23T17:28:48",
      "selftext": "",
      "comments": [
        {
          "text": "Then you give $2 worth of kaigong effort lor",
          "score": 73
        },
        {
          "text": "No head no tail, never specify the industry or role you work in",
          "score": 46
        },
        {
          "text": "ang pao is not an entitlement.",
          "score": 37
        },
        {
          "text": "I used to get $28, I think my Boss is stingy. After I saw your $2 angbao, I will never complain again.",
          "score": 31
        },
        {
          "text": "People complains about angbao money nowadays?",
          "score": 29
        },
        {
          "text": "Sad that people forgot about the true meaning of angpau, the same people who mock their relative/friend for giving $2 because they're poor",
          "score": 27
        },
        {
          "text": "I got $0 so you win me hehe",
          "score": 24
        },
        {
          "text": "earn your own money la bro. Kai gong is just God grandpa right sooo?",
          "score": 22
        },
        {
          "text": "Can buy you a drink from coffeeshop.",
          "score": 9
        },
        {
          "text": "Better than those who got $0",
          "score": 9
        },
        {
          "text": "I got a toto ticket with $1 quick pick before, and the fella said good luck. Back then i didn’t knew why the fella would say good luck until i open the red packet when i got home.",
          "score": 8
        },
        {
          "text": "One free drink better than no free drink",
          "score": 8
        },
        {
          "text": "Better than nothing",
          "score": 6
        },
        {
          "text": "Mine was $88 huat huat",
          "score": 5
        },
        {
          "text": "It’s okay la just take free money",
          "score": 3
        },
        {
          "text": "Your boss not pai seh. Go buy toto.    Maybe can win 10 buy least to make up numbers",
          "score": 3
        },
        {
          "text": "At least put in some effort buy toto. Can $1",
          "score": 2
        },
        {
          "text": "Still got $2 Angbao",
          "score": 2
        },
        {
          "text": "$2 quick pick toto or $2 note better? \n\nyou choose!",
          "score": 1
        },
        {
          "text": "my boss asked me if can OT bro\n\nwe don't get OT pay",
          "score": 1
        },
        {
          "text": "You give your boss back 4 dollar, shou gong angbao",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rd4ntz",
      "subreddit": "SingaporeRaw",
      "title": "caishengye gone rogue?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rd4ntz/caishengye_gone_rogue/",
      "score": 67,
      "num_comments": 18,
      "created_at": "2026-02-24T12:02:18",
      "selftext": "",
      "comments": [
        {
          "text": "Confirm jhk",
          "score": 22
        },
        {
          "text": "Any how alter the tradition, this is what you get. Just like PLB throwing lohei. ",
          "score": 16
        },
        {
          "text": " I will not use that table",
          "score": 13
        },
        {
          "text": "This Caishenye ownself havent huat, NEA huat first - summon tickets on the way.",
          "score": 6
        },
        {
          "text": "I 🤣 😂 🤣 when caishengye fell",
          "score": 6
        },
        {
          "text": "To much money inside pocket till fall",
          "score": 6
        },
        {
          "text": "Tis one is caishendou",
          "score": 5
        },
        {
          "text": "This want confirm father mother never teach from young that why can dance on the table.",
          "score": 4
        },
        {
          "text": "Disgusting behaviour\n\nWhat difference compared to 👉 [https://packaged-media.redd.it/5q6wf88v9g0f1/pb/m2-res\\_854p.mp4?m=DASHPlaylist.mpd&amp;v=1&amp;e=1771290000&amp;s=6c25e587c04d1802fc88dd3a2ccee1baee0cd799](https://packaged-media.redd.it/5q6wf88v9g0f1/pb/m2-res_854p.mp4?m=DASHPlaylist.mpd&amp;v=1&amp;e=1771290000&amp;s=6c25e587c04d1802fc88dd3a2ccee1baee0cd799)",
          "score": 4
        },
        {
          "text": "财神倒",
          "score": 3
        },
        {
          "text": "Cai Shen Nahhhh",
          "score": 3
        },
        {
          "text": "Cai Sheeyannn",
          "score": 3
        },
        {
          "text": "must be doing tiktok",
          "score": 3
        },
        {
          "text": "Economy so bad that CSY need to dance on a table because no pole",
          "score": 3
        },
        {
          "text": "HUAT AH…. WindFALL indeed!!",
          "score": 2
        },
        {
          "text": "Needs more twerk",
          "score": 1
        },
        {
          "text": "gone wilddd",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rcea8l",
      "subreddit": "SingaporeRaw",
      "title": "Chinese national arrested after 14,550 cartons of duty-unpaid cigarettes worth more than $1.5m worth seized",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rcea8l/chinese_national_arrested_after_14550_cartons_of/",
      "score": 47,
      "num_comments": 19,
      "created_at": "2026-02-23T18:49:03",
      "selftext": "",
      "comments": [
        {
          "text": "Where is kongwee, maleficent\\_today\\_79,  cherishlogic, jypt98, consistent-jury-1664 and the gang? How come your comrades always in the news these days ah?",
          "score": 35
        },
        {
          "text": "u/kongweeneverdie, your thoughts?",
          "score": 22
        },
        {
          "text": "五千年历史，也不过如此。难道是五千年当盗劫匪的历史？\n\n也难怪，上梁不正，下梁歪。受到主席的影响和包庇，人民也自然而然跟着捞偏门咯。",
          "score": 8
        },
        {
          "text": "See lah. Import somemore ",
          "score": 6
        },
        {
          "text": "七百啊中",
          "score": 5
        },
        {
          "text": "Visa free business opportunity",
          "score": 2
        },
        {
          "text": "Probably try to bribe the officer with $10",
          "score": 1
        },
        {
          "text": "Eww tiong…",
          "score": 1
        },
        {
          "text": "No name",
          "score": 1
        },
        {
          "text": "Did this come by sea, since it’s from Tuas",
          "score": 0
        },
        {
          "text": "沒有共產黨就沒有新中國",
          "score": -3
        },
        {
          "text": "I'm pretty Reddit Singaporean are asking how they did that.",
          "score": -4
        }
      ]
    },
    {
      "id": "t3_1rd9eo1",
      "subreddit": "SingaporeRaw",
      "title": "Pritam Singh questions if GDP growth should determine ministerial bonuses amid job concerns",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rd9eo1/pritam_singh_questions_if_gdp_growth_should/",
      "score": 38,
      "num_comments": 15,
      "created_at": "2026-02-24T15:05:23",
      "selftext": "Credits to Source:\n\n  \n[https://forums.hardwarezone.com.sg/threads/pritam-singh-questions-if-gdp-growth-should-determine-ministerial-bonuses-amid-job-concerns.7190234/](https://forums.hardwarezone.com.sg/threads/pritam-singh-questions-if-gdp-growth-should-determine-ministerial-bonuses-amid-job-concerns.7190234/)",
      "comments": [
        {
          "text": "Citizen should ask why minsters so shameless dare to ask for pay raise when performing medicorely",
          "score": 32
        },
        {
          "text": "What is gdp growth if it only benefits wealthy asset owners and not majority of citizens. Then again we voted for this.",
          "score": 13
        },
        {
          "text": "Finally asking the tough questions. Get ready for \"fixing\" 3.0.",
          "score": 11
        },
        {
          "text": "For the longest time, we had our doubts whenever our leaders boosted how wonderful our economic growth is, how high our GDP and GDP per capita are. The simple reason is that our quality of life is NOT improving!\n\nSo far, the only person in parliament that is saying this fact out loud is Mr Singh. Sad that the ones in charge of running this country aren't even talking, discussing or debating on this matter.",
          "score": 5
        },
        {
          "text": "Cut the $300 million founders memorial which nobody asked for and there you have it , your pay raise. ",
          "score": 2
        },
        {
          "text": "https://preview.redd.it/4u7akvsqhelg1.jpeg?width=846&amp;format=pjpg&amp;auto=webp&amp;s=df38c56d868fee4e39782ef431713b536f65e8e6",
          "score": 1
        },
        {
          "text": "The CCP i sign up for say will help find job from last year Dec then delay to jan 2026 now delay again to July 2026. Blardy worthless.",
          "score": 0
        },
        {
          "text": "I would say that it is not what has been achieved but it should also factor in how…. And this would highlight whether general population has also realised the fruits of those achievements or just locked in for a few.",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1rd24jf",
      "subreddit": "SingaporeRaw",
      "title": "Singapore will take action against citizens who fight overseas in foreign causes: Shanmugam",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rd24jf/singapore_will_take_action_against_citizens_who/",
      "score": 37,
      "num_comments": 27,
      "created_at": "2026-02-24T10:18:45",
      "selftext": "",
      "comments": [
        {
          "text": "Let's hope if found to be true, these 2 will be punished. But, I wonder if the Israeli embassy will try and interfere. If they do then we will know where their allegiance lies.",
          "score": 18
        },
        {
          "text": "But Singaporeans are expected to fight for causes of foreigners already residing in SG. The absolute irony...",
          "score": 16
        },
        {
          "text": "Singaporeans can't fight for foreign countries. But Singaporeans who migrated (aka foreigners) are legally required to serve NS to fight for Singapore lol.",
          "score": 15
        },
        {
          "text": "Weird, so now they say Singaporeans cannot serve army for the sake of foreigners?",
          "score": 13
        },
        {
          "text": "What is the problem. If your citizen mati. Just import CECA can already",
          "score": 8
        },
        {
          "text": "People are allowed to keep dual citizenship until 21 when they have to decide\nWhat would happen to Someone with Singapore and Israeli double citizenship who gets called back to serve idf and gets mobilised to Gaza when he or she is serving there\n\n",
          "score": 7
        },
        {
          "text": "Same clause as moonlighting. You serve for 1 company, cannot serve in another too.",
          "score": 3
        },
        {
          "text": "got sinkie fight for ukraine , so they will kenna",
          "score": 3
        },
        {
          "text": "Voters will take action at ballot box to keep out lousy and useless ministers",
          "score": 2
        },
        {
          "text": "Does he mean that fighting against terrorists is a crime unless it is officially led by the SG government??????\n\nI’m not sure if this is a populist position motivated by the need to appease a segment of SGeans.",
          "score": 2
        },
        {
          "text": "But I fight in overseas tournaments leh…. \n\nI thought task force man supposed to fight on behalf of Singaporeans for the tariff situation also? Now go up to 15% liao",
          "score": 1
        },
        {
          "text": "How about ibs like kongwee? Are they gonna do anything about it?",
          "score": 1
        },
        {
          "text": "If it's Israeli PR how ah? They need to do NS and also Israeli NS? i beri confused",
          "score": 1
        },
        {
          "text": "Would you rather be a child killer or child killer ?",
          "score": -15
        }
      ]
    },
    {
      "id": "t3_1rcdnl3",
      "subreddit": "singaporefi",
      "title": "I built a free Singapore FIRE calculator — CPF, SRS, tax, Monte Carlo, 12 withdrawal strategies, and more",
      "url": "https://old.reddit.com/r/singaporefi/comments/1rcdnl3/i_built_a_free_singapore_fire_calculator_cpf_srs/",
      "score": 651,
      "num_comments": 119,
      "created_at": "2026-02-23T18:11:35",
      "selftext": "**TL;DR:** I made [sgfireplanner.com](https://sgfireplanner.com) — a free Singapore-specific FIRE retirement planner. It handles CPF, SRS, progressive tax, HDB/property, healthcare costs, 12 withdrawal strategies, Monte Carlo simulation, historical backtesting since 1928, and sequence risk stress testing. No login required. Everything runs in your browser — your financial data never leaves your device. It will always be free and it's [open source on GitHub](https://github.com/RemarkRemedy/fireplanner). Still actively fixing bugs and implementing new features — if you spot anything off, let me know!\n\nHey r/singaporefi,\n\nI've been working on a retirement planning tool built specifically for Singapore, and I wanted to share it with the community.\n\n**The problem:** Most FIRE calculators are US-centric. They don't understand CPF, SRS tax deductions, BSD/ABSD, Bala's Table leasehold decay, or SG progressive tax brackets. I wanted something that actually models how retirement planning works *here*.\n\n# What it does\n\n[sgfireplanner.com](https://sgfireplanner.com) is a comprehensive FIRE planner tailored to Singapore residents.\n\n**Singapore-specific modelling**\n\n* **CPF** — age-bracket contribution rates, OA/SA/MA tracking, extra interest on first $60K, BRS/FRS/ERS projections, CPF LIFE payouts\n* **SRS** — tax deduction impact, balance tracking, drawdown planning\n* **Income tax** — SG progressive brackets (0%–24%), personal reliefs (earned income, NSman, spouse, child, parent, CPF, SRS)\n* **Property** — BSD/ABSD calculations, Bala's Table leasehold decay, LTV, HDB monetisation strategies, downsizing analysis\n* **Healthcare** — MediShield Life, Integrated Shield Plans, CareShield LIFE, out-of-pocket cost projections by age\n\n**Income &amp; expense modelling**\n\n* 3 salary projection models (simple, career-phase, MOM data-driven benchmarks)\n* Multiple income streams (salary, rental, dividends, business, CPF LIFE)\n* Life events (promotions, career breaks, parent support obligations)\n* Year-by-year projection table showing exactly how your finances evolve\n\n**Simulation &amp; stress testing**\n\n* **Monte Carlo simulation** — 10,000 randomised market scenarios with 3 methods (parametric, historical bootstrap, fat-tail Student-t)\n* **Historical backtesting** — test your plan against every rolling window since 1928 (97 years of actual market data)\n* **Sequence risk stress testing** — see how your plan holds up under 8 historical crises (GFC, Asian Financial Crisis, COVID crash, etc.) with mitigation strategies (bond tent, cash buffer, flexible spending)\n\n**12 withdrawal strategies — way beyond the 4% rule**\n\n* Constant Dollar (4% Rule), Variable Percentage (VPW), Guardrails (Guyton-Klinger), Vanguard Dynamic, CAPE-Based, Floor &amp; Ceiling, Percent of Portfolio, 1/N Remaining Years, Sensible Withdrawals, 95% Rule, Endowment (Yale), and Hebeler Autopilot II\n* Side-by-side comparison so you can see how each performs\n\n**8 asset classes**\n\n* US Equities, SG Equities (STI), International (MSCI), Bonds, REITs, Gold, Cash, CPF\n* Pre-built allocation templates or build your own\n* Correlation matrix, Markowitz portfolio stats, glide path configuration\n\n**Dashboard &amp; other features**\n\n* FIRE number, progress tracking, years to FIRE\n* \"What if\" analysis, one-more-year impact\n* Risk assessment across 6 dimensions\n* Passive income breakdown for post-retirement\n* 3 onboarding pathways (goal-first, story-first, already FIRE)\n* Simple and Advanced modes — start simple, go deep when ready\n* JSON export/import, Excel export\n* Comprehensive reference guide with ELI5 explanations\n* Retirement preparation checklist\n\n# A note on accuracy\n\nFull transparency — this was vibe-coded with the help of [Claude Code](https://claude.ai/code). The formulas are based on official sources (CPF Board, IRAS, URA, MOM) and I've eyeballed the numbers to check that the math looks right, but I haven't formally audited every calculation path. If you spot anything that looks off — a CPF rate that's wrong, a tax bracket that doesn't match, a simulation result that seems fishy — please let me know. Bug reports and corrections are genuinely appreciated and will help make this more reliable for everyone.\n\n# Privacy\n\nThis is a fully client-side app. There is no backend server, no database, no user accounts, and no tracking. All computation runs in your browser using a Web Worker. Your financial data is stored in your browser's localStorage and never transmitted anywhere. You can verify this yourself — the network tab will show zero data being sent.\n\n# Always free. Open source.\n\nThis will always be **free**. No premium tier, no paywalls, no \"sign up for advanced features.\" I built this because I wanted a proper tool for my own planning, and I believe everyone in Singapore should have access to comprehensive retirement planning without paying for it.\n\n# Disclaimer\n\nI'm not a financial advisor and this tool is not financial advice. It's built for educational and planning purposes only — to help you explore scenarios and understand how different assumptions affect your retirement projections.\n\n# Feedback welcome\n\nI'd really appreciate any feedback that can make this more useful — whether it's a feature you wish it had, a UX improvement, or a bug. Drop a comment here or DM me. This is very much a community tool, and I want it to serve the community well.\n\n**Link:** [sgfireplanner.com](https://sgfireplanner.com)",
      "comments": [
        {
          "text": "Havent tried everything, but just wanna say thank you for your contribution and effort. 💪",
          "score": 61
        },
        {
          "text": "FAs hate this guy.",
          "score": 48
        },
        {
          "text": "how about an option for couples with combined finances?",
          "score": 18
        },
        {
          "text": "Had a go at it - thanks for making this v comprehensive and \"fit for SG\". I never projected the numbers (esp. NW)  as to what it would look like at age 90, and was presently surprised :D",
          "score": 17
        },
        {
          "text": "Amazing. This should be pinned.",
          "score": 15
        },
        {
          "text": "The expected returns for a few investment classes seem to be on the high side - i.e. dividends at 8% and cash at 2%.",
          "score": 14
        },
        {
          "text": "Looks really comprehensive but also a little intimidating because of all the tweakable settings. Perhaps you can make some starter videos showing how to use it?",
          "score": 8
        },
        {
          "text": "Omfg. \n\nEdit: ok I just saw it in the side bar. \nWow this thing is insane. \n\nI want to model having kids and having tiered reduction of expenses as the kids go independent. Or alternatively instead of a single FIRE event, maybe multiple tiers of reduction in expenses. Is that weird.",
          "score": 7
        },
        {
          "text": "Guys, this is insane and wonderful calculator I can only dream of making that is Singapore-centric and most relevant to us.\n\nJust want to add that for people who want to retire early before 65, only liquid networth should count to FIRE number to be realistic since CPF can't be touched until 65 onwards. Currently it is including CPF as well giving me an earlier than expected FIRE age :)\n\nThe other is that the returns for equities, reits, cash etc are all too high, also contributing to an earlier FIRE age. Must be a morale booster for many LOL. Some tweaking will do to make it more realistic, this app has everything! Fantastic Job OP.",
          "score": 7
        },
        {
          "text": "Awesome tool! Loving it. \n\nFor the property segment, as most property is co-owned, would be great if a setting can be added to the property segment to only take a % of all the values (e.g. property value, outstanding loan) into the calculation. This is for those calculating as a single person, and not as a family unit. I could just manually divide now and input the divided values, but i think having that setting is more intuitive. For consideration. :)",
          "score": 5
        },
        {
          "text": "First to star your repo! 👍🏼💪🏻",
          "score": 3
        },
        {
          "text": "Hi this is by far the most comprehensive Singapore fire calculator I’ve seen so far. Thankyou so much for your hard work to this and for making it free for all :) \n\nI’ve tried it and some feedback: \n1) would be good if u allow us to customise the returns % for our assets, i don’t think emergency funds most keep in banks hit 2%. I’d want to be more conservative on my global ETFs return as well, i feel 8% is a bit too optimistic (for me). \n\n2) I don’t quite understand how to interpret the number of years to full FIRE. If I key in retirement age as 58 and it tells me I can fire at 41, is it referring to coast fire? Even if I select my option as standard fire? I definitely don’t think my portfolio is sufficient for full fire at 41 assuming 3% swr so something seems off somewhere… not sure if you get what I mean.\n\nOk so I adjusted my retirement age to 41 then it tells me I receive financial independence at 41 but portfolio depletes at 85. I’ve set my lifespan to be till 90. This doesn’t seem to meet the definition of financial independence?",
          "score": 3
        },
        {
          "text": "This is seriously cool - thanks for sharing.",
          "score": 2
        },
        {
          "text": "This is amazing. Thank you for building this and making it available to all of us.",
          "score": 2
        },
        {
          "text": "Thanks boss. Will try it soon. Curious to see the different types of FIRE included in the list and how far am I on track",
          "score": 2
        },
        {
          "text": "Always free. Open source. HES THE GOAT",
          "score": 2
        },
        {
          "text": "Why does it say I can fire by 30 years old but in the salary section it models me working until 65?",
          "score": 2
        },
        {
          "text": "This looks very good \n\n\n\n",
          "score": 2
        },
        {
          "text": "Very good. Saw your previous post but this is a huge progress.",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1rd5vqc",
      "subreddit": "singaporefi",
      "title": "Condo at 31 or wait till 35 for resale?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1rd5vqc/condo_at_31_or_wait_till_35_for_resale/",
      "score": 26,
      "num_comments": 57,
      "created_at": "2026-02-24T12:35:57",
      "selftext": "30F, thinking of getting a resale condo next year with 350k cash and 120k CPF OA. Mortgage is 20-30% of monthly salary. Got a huge raise at the expense of a 1h commute to work, or $20 by grab.\n\nAlso, I essentially have a fiancée. Can't get legally married since we're both women. And my family is very homophobic.\n\nWhich do yall find a better idea?\n\nPros of condo: move in asap, start life with fiancée and apart from unsupportive parents, nearer to work and save time and money on commuting. If only using my name for the bank loan, fiancée can get resale and we rent out the condo eventually for passive income \n\ncons of condo: wiping out my savings. my salary is partial commissions. while it has always gone up year on year, it's still unstable and very stressful \n\npros of resale HDB: Much more affordable. hearsay the min age for singles might be lowered soon\n\ncons of resale HDB: min age might not be lowered far enough in the next 5 years for me to benefit. stuck with an uncomfortable home life till then, unless I rent. Even if my fiancée and I own resales, the MOP will overlap as we're close in age, and we can't legally rent out one flat",
      "comments": [
        {
          "text": "like that buy condo at 31, then downgrade to Resale at 36 loh.  \nGet in the game first. Time and Tide waits for no one. \n\nThose who waited since 2009 can tell you what happen.\n\nThen they waited in 2012 again..\n\nthen they waited in 2015 again..\n\nevery 3 years ... wait for something to happen..\n\nthen finally 2020 Covid came..\n\nand they waited for another 3 years .....\n\nnow they are still waiting..\n\n  \nBut the prices never wait for them. :D",
          "score": 62
        },
        {
          "text": "suggestion that is more holistic than financial: move out and start life with your partner. Living life now is important and moving out will significantly improve your QOL. Better QOL, better lifestyle, more motivation to maintain income and creating memories with your partner.",
          "score": 54
        },
        {
          "text": "just wait, condo is probably going to experience some sort of price correction",
          "score": 15
        },
        {
          "text": "Might as well rent in the interim honestly and get a HDB at 35. There’s no guarantee that housing prices will keep going up.",
          "score": 13
        },
        {
          "text": "Renting is like paying a mortgage on a resale hdb. \n\nA big hdb is nicer to live in than a small condo, which is what you will get for the same price. Its also less financially stressful.",
          "score": 6
        },
        {
          "text": "Hello I’m from the community. Go talk to someone from Prident. Or HausofPride. Or Hauslife. I don’t know why gay people cannot spell house properly lol ok kidding. I’m not getting commission from them but I’ve spoken to them before and feel they are trustable and work with the community’s needs in mind. Get them to crunch the numbers for you and recommend accordingly. Personally I bought condo when I was around your age, then sold recently and moved into my partner’s resale HDB. Good luck OP.",
          "score": 5
        },
        {
          "text": "If you have the means, go for condo\n\nResale HDB should be most likely still 35 for time to come, and given the current housing market, it would only get more expensive.\n\nRent is another option but it will eat into your housing funds so probably not.",
          "score": 3
        },
        {
          "text": "Go for condo n get resale for ur partner (eventually). \n1 house each. \n\nFaster start ur life together",
          "score": 3
        },
        {
          "text": "Move and start your life",
          "score": 2
        },
        {
          "text": "Go for condo. No amount of money can be compared to the freedom you get from living by yourself or with your partner.",
          "score": 2
        },
        {
          "text": "Default always is HDB first before condo, but looks like your situation can just go for condo.",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1rd8e4l",
      "subreddit": "singaporefi",
      "title": "28 y/o hitting a financial reset",
      "url": "https://old.reddit.com/r/singaporefi/comments/1rd8e4l/28_yo_hitting_a_financial_reset/",
      "score": 26,
      "num_comments": 23,
      "created_at": "2026-02-24T14:09:39",
      "selftext": "Hi all, as the title suggest, i am unfortunately broke in my late twenties. Had a really rough 2025, with being jobless and series of medical costs and a failed business, it drained my entire networth of $100k with medical being the main cost. So here I am, at 28 hitting a financial reset. I'm not financially savvy at all so i'd like to seek advice.\n\nI am only a diploma holder in hospitality and make roughly $3.6k before cpf. No debts, no dependants, living with parents and parents very fortunately doesnt expect me to give them any money. I've always been a good saver and have a pretty healthy relationship with money overall.\n\nIn 2024, I signed an endowment plan at $300/mth and an ILP at $700/mth (huge mistake, i know😭). I plan to surrender my endowment with $0 surrender value as it's honestly not that huge a sum and i value opportunity cost more going forward. I also plan to reduce my ILP premium to just $300/mth, current valuation sitting at ~$16k. \n\nWith that, i should be able to aggressively invest about $1.2k comfortably every month. I have a time horizon of 20-25 years and can stomach drawdowns from -40% to -50%. \n\nAfter doing my research, i've built my own portfolio and it looks like this:\n\n40% VTI\n30% QQQM\n15% VHT\n15% VXUS\n\nLogic is that the trend seems to be moving towards heavily on tech and healthcare. And i want maximum growth since i can stomach the big drawdowns. I also plan to divert my ILP to a more moderate risk portfolio to cushion my risk. I'm a citizen so i naturally have CPF as a guaranteed risk-free basket. \n\nAm i missing anything? Or does my ETFs pick not make sense? \n\nAny advice is greatly appreciated, thanks in advance!!!",
      "comments": [
        {
          "text": "VWRA is 80% of your planned portfolio while not having the headache of rebalancing and having the benefit of automatically reinvesting dividends. You also just need to buy one ticker instead of 4 which saves a bit on transaction costs.\n\nThe issue with chasing maximum growth or trends is that trends are just that, and it may change randomly over time. How do you know if tech &amp; healthcare will continue growing at its current pace, or if it will even grow? It could drop like a rock tomorrow. ",
          "score": 22
        },
        {
          "text": "The ETFs you have chosen are US ETFs having estate tax and higher dividend withholding tax. A better way would be to invest in LSE ETFs. Please read the group wiki for more info.\n\nhttps://reddit.com/r/singaporefi/wiki/index",
          "score": 15
        },
        {
          "text": "I'd recommend you to look towards UCITS based ETFs. They only have a 15% dividend withholding tax as opposed to US ETFs having a 30% withholding tax. UCITS ETFs also do not have a 40% Estate tax.",
          "score": 5
        },
        {
          "text": "Hmmmm is your current industry, do you think getting a degree would open more doors for you and possibly going into management? So that your salary won't be capped at 3.6k to 4k. \n \nLike getting a business degree or something for 1.5 years then after that you can find another role in same industry that pays more. After all, your job experience and business experience seems valuable",
          "score": 5
        },
        {
          "text": "Wow u actually had 100k to lose at 28?!\nI only had 2k in my bank at 30.",
          "score": 5
        },
        {
          "text": "Hi, My advice is for you to save an emergency fund of at least 3-6 mths expenses as a start and then set aside at least 10% invest in ETFs like VOO and STI. DCA It. But if you aiming to invest $1200, I think maybe start doing it after your EF is fully funded. Also if you can upgrade to a degree that could help in your career prospects. Anyway you’re only 28. Don’t worry too much… I probably had $600 in my bank account then and I’m doing pretty okay at 43. Main point is prioritize savings and investments and not let lifestyle inflation eat up your salary.",
          "score": 2
        },
        {
          "text": "Maybe can start with 6 to 12 months emergency funds first ?\n\nBoth of your endowment plan and ILP, can regard them as Endowment plans (so to convince yourself the money saved won’t grow that much, can be part of emergency funds next time).\n\nI did the same mistake of getting 2 ILPs on hand ($300 each, was a plan for my ex-fiancée, as she don’t save up proper I feel, hence the plans for myself and her)\n\nILP premiums at $300 / mth will be a good idea, with the extra cashflow to hold first from any further plannings\n\nAs for portfolio management, I believe that your own portfolio mix should be good\n\nIf got spare cash, can take a look at investment tool that allows you to invest surplus CPF-OAs (beyond the minimum $20k sum), and cash as you are not buying a house yet.\n\n1 example can be Endowus, with their transparent pricing upfront.\n\nHope this helps !",
          "score": 2
        },
        {
          "text": "I’d focus less on a perfect ETF mix and more on stopping the ILP from bleeding you. Also your portfolio is pretty much a US/tech bet (VTI + QQQM + VHT overlap a lot), so just be aware of that.",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1rcgb7l",
      "subreddit": "singaporefi",
      "title": "When Can You Actually Retire? Modelling CPF LIFE + SRS Scenarios",
      "url": "https://old.reddit.com/r/singaporefi/comments/1rcgb7l/when_can_you_actually_retire_modelling_cpf_life/",
      "score": 13,
      "num_comments": 20,
      "created_at": "2026-02-23T20:37:55",
      "selftext": "I’ve been learning more about retirement planning recently. I used to assume that if you live moderately, save, and invest, you should eventually be able to retire but I never really knew when, or whether retiring earlier was realistically possible.\n\nAs I dug deeper into CPF LIFE and SRS, I realised there are quite a lot of policy details that aren’t always intuitive (for example, nuances around the SRS 10-year withdrawal window). When you start layering CPF, SRS, savings and investment timing together, the outcomes aren’t obvious.\n\n[After modeling CPF, I modeled SRS withdrawal and here are some of my learnings : r/singaporefi](https://www.reddit.com/r/singaporefi/comments/1rbl80l/comment/o6rqj0c/)  \n[I have been learning more about CPF Life and here are some thoughts : r/singaporefi](https://www.reddit.com/r/singaporefi/comments/1r8yujj/comment/o6k218l/)\n\nSince I’m interested in tech, I tried modelling what I learned in a simple browser-based tool to visualise different retirement scenarios. It started as a hobby project, but I’m sharing it in case it’s useful for others thinking through similar questions.\n\nIt runs locally in your browser, stores no data on any server, is free to use, and doesn’t require an account or personal information.\n\nIf you’re curious: [finora.fly.dev](http://finora.fly.dev)\n\nI’m sharing it mainly to invite feedback. Retirement policy is complex, and I’m sure there are blind spots in how I’ve modelled things. If there are gaps or incorrect assumptions, I’d genuinely appreciate corrections.\n\nIt’s been a learning exercise, and I’d like to refine it into something clearer and more useful for anyone trying to get started on financial planning.\n\nThanks!\n\n**Some features I have built as part of my learning or what I thought would be useful in the tool**\n\n[Simple guided steps to quickly setup a plan](https://preview.redd.it/br1o1oyzl8lg1.png?width=871&amp;format=png&amp;auto=webp&amp;s=3dd77c94201924ef70f8d2886c61e98cb98c0fd8)\n\n\n\n[View of how your assets grow over time](https://preview.redd.it/bobx3sf4m8lg1.png?width=1199&amp;format=png&amp;auto=webp&amp;s=4f0adfa9975c9cc0aac464e6c389c2f91fc49dbd)\n\n\n\n[AI attempt to explain what it observe](https://preview.redd.it/li5iz8p7m8lg1.png?width=1133&amp;format=png&amp;auto=webp&amp;s=fc5915bd5cadbbffaa993e0373742d863fc2646b)\n\n[Timeline view of some important events](https://preview.redd.it/69jse2kam8lg1.png?width=1185&amp;format=png&amp;auto=webp&amp;s=e273e2c2b99753717f8d3c0d97fdad5bcf2a51f4)\n\n[Breakdown view of CPF balances](https://preview.redd.it/n4wrac8em8lg1.png?width=1199&amp;format=png&amp;auto=webp&amp;s=119dfd27f3da028c470f8a679e2c4a5ab3ed58a5)\n\n[SRS Withdrawl Approach](https://preview.redd.it/h6smzbcjm8lg1.png?width=1230&amp;format=png&amp;auto=webp&amp;s=073f6bba17639fec5c72eb4a3ed3e12e78876a1e)\n\n[You can create different plans just to explore and compare](https://preview.redd.it/s81qsyjom8lg1.png?width=1259&amp;format=png&amp;auto=webp&amp;s=09893bf74d8b81b7b68f250b9efe26117e2ad41e)\n\n[You can adjust different settings to see the projections.](https://preview.redd.it/zgoq6k5zm8lg1.png?width=1875&amp;format=png&amp;auto=webp&amp;s=94b3ec64089dd956406df2974a41bf4dc3ba5e31)\n\n  \n",
      "comments": [
        {
          "text": "I don't get the point of this. Like I responded in your earlier post, it's kind of pointless to model investments (including SRS) as deterministic. Without sequence of returns risk, you would be able to withdraw a lot more than the usual 4% Safe Withdrawal Rate. The expected outcome is dying with more money than you started off with.\n\nI don't even know what you modeling in the investments part. It seems like you are modeling expenses growing with inflation, then whatever isn't covered by CPF Life (and SRS?) comes from investment?",
          "score": 12
        },
        {
          "text": "I haven't check your tool.\nBut I suggest just use excel to model for each remaining years.\nYou can put in your estimated income which can include active, rental, cpf life, etc. \nYou can model in your cpf accounts. \nAnd also expected expenses for remaining years. \nJust lump in your SRS assets into your total assets. Don't need to bother with details that it can only be withdrawn within 10yrs. \n\nIf you want, you can even give your assets a random growth rate each year based on average and std deviation. \nIf you want more, you can even let the computer do 500runs automatically and get average, median, minimum, maximum value of total assets at various ages.",
          "score": 1
        },
        {
          "text": "Your tool is actually not simple. Quite a lot of things you are trying to capture. \n\nOne comment is that maybe it's too complex and people may not know what each bells and whistle supposed to do. \n\nAlso, expenses may not be same throughout whole life. \nUsually retirees plan to spend more in the initial phase, then lesser in phase 2, and least in phase 3.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rcqnc2",
      "subreddit": "singaporefi",
      "title": "Seeking opinon in regards to gold",
      "url": "https://old.reddit.com/r/singaporefi/comments/1rcqnc2/seeking_opinon_in_regards_to_gold/",
      "score": 6,
      "num_comments": 19,
      "created_at": "2026-02-24T03:08:00",
      "selftext": "Given the gold price, would you prefer to buy used gold or new gold? Given the below option.\n\nOld gold: 212/gram\n\nNew gold: 240/gram\n\nIf you were to choose old gold, would you buy from pte dealer who is dealing in gold shop or from other gold shop?\n\nPte dealer price: 199/gram  \nGold shop pricing: 205/gram\n\nI am doing a research as i am intending to operate as a pte dealer.",
      "comments": [
        {
          "text": "Buy whatever is closer to spot. Gold can lao hong isit? Personally I would avoid whoever giving you this deal.",
          "score": 21
        },
        {
          "text": "For long-term investors, I would just buy it from UOB banks; there's no hassle, and I don’t need to worry about the authenticity of the gold bar. It might cost more, all this for a peace of mind. \n\nThe banks will buy it back when you want to sell it.",
          "score": 14
        },
        {
          "text": "Main thing is how would you know you're not getting scammed with fake gold?",
          "score": 8
        },
        {
          "text": "Op I’m curious \nWhy would the pawn shop do authentication for u ?",
          "score": 4
        },
        {
          "text": "Are you taking about gold in jewellery form or in PM form? Best to ensure it’s 24k and not 22k of its the former. Your quoted prices seem quite high I wouldn’t go that route. \n\nIf you’re buying for investment, best bet is to ope UOB physical gold account and buy/sell through them. \n\nOr you can buy from bullionstar or any other similar PM dealer.",
          "score": 2
        },
        {
          "text": "i would buy closer to spot, as long as the purity of the gold can be reasonably proved on the spot. I would not get it from a dealer who does not have the appropriate spectroscopic equipment to do this.",
          "score": 2
        },
        {
          "text": "Bullionstar, silver bullion and UOB raffles. Some if these retailer has zero spread on certain products, I prefer Gold with zero spread on bullionstar , silver bars with silver bullion . Sell back where you bought from for better pricing.",
          "score": 1
        },
        {
          "text": "If buy for investment, retail channels might be costly due to admin fees\n\nCan consider the following options if purely for investments\n1. OCBC Precious Metals Account (min 0.01oz)\n2. UOB Gold Savings Account (GSA)\n3. Gold or Precious Metals ETFs\n\nOtherwise, safer to go with UOB for retail purchases.",
          "score": 1
        },
        {
          "text": "I will buy IPM gold that doesn't attract GST. \n\nI will not buy non IPM gold because I have to pay 9% GST. Simple as that.",
          "score": 1
        },
        {
          "text": "Bought from UOB.",
          "score": 1
        },
        {
          "text": "GLDM 0.1% expense ratio. Anything else is wasting time/money.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rd5ti9",
      "subreddit": "singaporefi",
      "title": "Manulife S'pore sells record S$380 million life insurance policy to single client!!",
      "url": "https://old.reddit.com/r/singaporefi/comments/1rd5ti9/manulife_spore_sells_record_s380_million_life/",
      "score": 3,
      "num_comments": 17,
      "created_at": "2026-02-24T12:34:24",
      "selftext": "[https://mothership.sg/2026/02/manulife-singapore-sells-380-million-life-insurance-policy/](https://mothership.sg/2026/02/manulife-singapore-sells-380-million-life-insurance-policy/)",
      "comments": [
        {
          "text": "The insurance vermin can pangkang loh..\n\nHeng ong huat ah!!",
          "score": 5
        },
        {
          "text": "agent bi tang until siao, 1% also shiok\n\nDk how extreme he/her went through with this deal...",
          "score": 2
        },
        {
          "text": "The agent chio?",
          "score": 2
        },
        {
          "text": "They insuring Yamal’s legs?",
          "score": 1
        },
        {
          "text": "500k commission?",
          "score": 1
        },
        {
          "text": "Agent huat",
          "score": 1
        },
        {
          "text": "Wow, even Christiano Ronaldo's leg was insured for only US$144m. Pales in comparison to this S$380m",
          "score": 1
        },
        {
          "text": "Wtf….why buy??? If you can afford this, you don’t need insurance",
          "score": 1
        },
        {
          "text": "99% chance the customer is from China. In recent years many of them have been using life insurance to get money out of China and to shield it from seizure.",
          "score": 1
        },
        {
          "text": "agent jin song leh",
          "score": 1
        },
        {
          "text": "Which sinkie redditor is this, own up",
          "score": 1
        },
        {
          "text": "Is that sum assured or premium?!",
          "score": 1
        },
        {
          "text": "Wash money?",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1rd4j7r",
      "subreddit": "singaporefi",
      "title": "Where to park emergency funds?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1rd4j7r/where_to_park_emergency_funds/",
      "score": 3,
      "num_comments": 10,
      "created_at": "2026-02-24T11:58:27",
      "selftext": "Currently have 10k parked at Mari invest SavePlus earning around 1.83% p.a. Just wondering if there is a better place for me to park my emergency funds with a higher interest rate. Thanks!",
      "comments": [
        {
          "text": "Emergency funds needs to be safe and liquid.\n\nUnfortunately this means low return.\n\nTheres nothing better.\n\nSome people might advise against your current choice even and recommend some savings accounts with banks that offer good interest.\n\nocbc360, uob one, gxs, maribank savings (not invest ah, this is different)....",
          "score": 3
        },
        {
          "text": "I know a guy who will give 10% interest and you can withdraw any time. Certified safe and trustable\n\nEdit: the guy is me",
          "score": 3
        },
        {
          "text": "to each his own tbh. i park it in chocolate for a 2% boost. but risk wise definitely not the safest compared to bank fixed deposit or ssb i believe.",
          "score": 1
        },
        {
          "text": "Dbs multipler",
          "score": 1
        },
        {
          "text": "I keep in my house safe",
          "score": 1
        },
        {
          "text": "You could try moving some of that to Mari Invest Income. Minor risk of temporary drawdown though, but it seems that Mari smooths it out so you won't see those daily fluctuations. \n\nMoney market funds (like Mari Invest Saveplus) are around the same, and I think 1.83% is a serious over-estimate maybe averaging over the entire past year (with the earlier months having higher rates).\n\nEven the Maribank website says that Saveplus return over 4 weeks ending in 27 Jan is only 1.46%. ",
          "score": 1
        },
        {
          "text": "Milo can",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1rcdc33",
      "subreddit": "singaporefi",
      "title": "Selling your home with a mortgage - are you always subject to bank penalty?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1rcdc33/selling_your_home_with_a_mortgage_are_you_always/",
      "score": 3,
      "num_comments": 15,
      "created_at": "2026-02-23T17:52:13",
      "selftext": "I’m currently on a **2.25% fixed mortgage rate**. My contract allows a **free conversion after 12 months**, but there’s a **1.5% penalty** if I break the loan before 24 months (e.g. refinance or sell during lock-in).\n\nI’m hearing some banks are offering **&lt;2% rates (around \\~1.5%?)** now.\n\nHere’s my dilemma:\n\n* I’m planning to sell, but the offers so far are lower than my expectations.\n* If I sell during lock-in, I’ll incur the 1.5% penalty.\n* If I don’t sell, I could wait for the free conversion window and possibly reprice/refinance later.\n\nTrying to think through a few things:\n\n1. Is it ever worth continuing to reprice with the bank assuming interest rates drop to \\~1.5% or should I just stick to 2.25% and wait till the end of 24 months? \n2. For those who have sold while on a mortgage, is there any way to escape the 1.5% penalty? if you aren't able to time the sale to your refinancing timeline, do you just have hang onto the SIBOR + 1% in the interim? \n\nWould appreciate hearing from anyone who has navigated selling while still on a mortgage - especially how you thought about the penalty vs market timing.",
      "comments": [
        {
          "text": "Check if your mortgage has a waiver on sale clause. Although usually if you didn't request when you got your current mortgage, they won't include it",
          "score": 2
        },
        {
          "text": "So do you want to sell or you want to hold on? If you want to sell just tank the 1.5% else if you want to hold just reprice when able to with a waiver on sale clause (just in case).",
          "score": 2
        },
        {
          "text": "What I do is I re-price once to get out of the lock in duration, then time to sell at the end of the re-price. Reprice may incur cost also though.\n\nElse, when your unit is desirable for sale in the future, get the buyer to offer your selling price + the penalty amount.\n\n  \nIt's possible not to pay the penalty, when you are buying another unit and taking the loan with the same bank.",
          "score": 1
        },
        {
          "text": "So I’m looking to sell, but trying to find a way to do that without paying the penalty. Does everyone with a mortgage have to pay the penalty when they sell their house? 😅",
          "score": 1
        },
        {
          "text": "You can ask for “selling”penalty waiver if you take a new loan from the same bank. Negotiate hard. Or you can reprice and include the waiver clause then u can take ur time.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rd6xzs",
      "subreddit": "singaporefi",
      "title": "[Serious] How would you short the commercial and high end retail property sector in Singapore?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1rd6xzs/serious_how_would_you_short_the_commercial_and/",
      "score": 0,
      "num_comments": 19,
      "created_at": "2026-02-24T13:03:45",
      "selftext": "Serious question, and I hope I don't get flamed for this (you may disagree with the directional view but I just want to get help on the instrument to express this view).\n\nIf one takes the view that AI and agentic workflows will remove a substantial component of white collar work over the next 2 to 5 years -&gt; reduced headcount in Singapore companies-&gt; increased unemployment and reduced wealth effect which means the red hot high end residential property market and retail spaces gets hit first. Corporate offices downsizing / removing entirely \"regional HQs\" which Singapore has been wooing in the past decade reduces the demand for office space and rental revenue from these places, which have been at all-time highs.\n\n[https://www.citriniresearch.com/p/2028gic](https://www.citriniresearch.com/p/2028gic)  \nMany of you would have read this (somewhat cliched) article by now, but it gets the gist of what I'm trying to say.\n\nIn such a scenario, what would be the best instrument to take a short position on Singapore companies like Propnex and Singapore office/retail/high end residential REITs and developers?\n\nCFDs on IBKR have no stock available for shorting, and naked shorting isn't available either. (I have sufficient assets to get accredited as an accredited investor if that helps).\n\nAppreciate any tips/discussion",
      "comments": [
        {
          "text": "In theory there are a bunch of REITs exposed to this sector. \n\nIn practice I don’t know if you can short these things at reasonable cost. Depends on your broker. \n\nYou also have to consider that real estate in Singapore works pretty different to the rest of the world as the government carefully manages land supply, and that Singapore is seen as a global safe haven. So REIT valuations may not be crushed even if occupational fundamentals were weak.",
          "score": 11
        },
        {
          "text": "Get an investment banking account. These are bets available to clients with 8-figure assets. \n\nAs for downturn, the Singapore government controls a key number: the number of immigrants. That ensures a soft landing is possible under most circumstances. The ai transition won't happen overnight simply because models aren't good enough and compute out of reach beyond the biggest boys.",
          "score": 7
        },
        {
          "text": "If you are an accredited investor, just get your RM to price for an inverse delta REIT note.",
          "score": 6
        },
        {
          "text": "Short CFDs on PropNex is available on POEMS (8%),\n\nYou can also short the stock directly.\n\nThese instruments are available for all the property developers like CDL, GuocoLand and CapitaLand.",
          "score": 3
        },
        {
          "text": "why not short america property/US info tech/India infotech if u believe thats to be the case. America share of white collar is 60%, singapore PMETs is about 60% too. Singapore is also a lot more aggressive and active in state actions to stabilize economy vs America \n\nSingapore has an additional layer going for it, the chinese are more than willing to come to singapore to use our neutrality to America. In a tech race btw US China and US AI banning China IPs, Singapore will be the neutral ground not to mention wealth running away from China to Singapore as a secondary residence (the ones that are accepted into singapore are increasingly wealthy entrepreneurs with global ambitions, they swoop up industrials/residences/offices). \n\nSingapore REITS are div yield machine also, ur paying the equivalent of commercial reits like Suntec REIT yield + wtv stock borrowing costs from broker just to short it, this essentially becomes a \"trade\" and needs to be timed, else ur burning yield waiting for it to fall. \n\nAnd if u have size, u can ask a PB to structure some weirdass product for you but it's confirm costly. Anyway if that scenario u described happens, Singapore banks will be a big casualty from loan book impact 1/3 property sectors and overall singapore confidence, it then u can just short STI",
          "score": 3
        },
        {
          "text": "Maybe you can't short the stocks but can you buy puts? But for the kind of time horizon you are looking at in the real estate sector, you might have to pay high premiums and constantly roll over your contracts. Might not be that feasible of a thesis to execute.",
          "score": 2
        },
        {
          "text": "It’s Okie most white collar are not skilled enough to use Ai . It’s a tool to max human intellect I dun think that Ai will be a threat. Stupid people using Ai get lazier. Smart people get smarter some use Ai to Chao Keng some people use Ai to do more",
          "score": 1
        },
        {
          "text": "You could try single stock futures, they are usually easier to short.",
          "score": 1
        },
        {
          "text": "I believe you can use any CDP broker for naked shorting. But you have limited time to cover it. It's very risky though.",
          "score": 1
        },
        {
          "text": "I have read this essay. It gets many things right and shows you how it can go very wrong. In some ways it is making similar arguments that Marxism makes against capitalism. Machines increase productivity, corporations reduce human labour, middle class gets squeezed and aggregate demand falls, revenue of corporations fall, buy more machines to increase margin, even more lay offs, even more destruction of demand and on and on. And the essay says that there is no brake. But there is brake. If capital markets get destroyed who will fund the CapEx for AI. Price will be the brake. What the essay also does not discuss is how AI is democratising intelligence. Everyone can get intelligence on the cheap. There is no longer high barrier to entry if you want to start a small scale business on your own. As a society, we may lose corporate jobs and valuations of corporations may come down (as we are already witnessing now) but individuals will find ways to utilise AI to create value for other humans. There is also a new economy where AI is actually hiring humans to do physical work. Capital is just being re-allocated elsewhere but the transition will be rough. \n\nThis could be a world where there is an abundance of information and intelligence. And capital will seek what is scarce and limited.",
          "score": 1
        },
        {
          "text": "unfortunately there’s no real mechanism to short sg assets, and if any counterparty were to were to make a market for you, you’d be paying an exorbitant spread \n\nalso, not sure why you’d be looking at SG assets since the trend is global - just short real estate in other mature markets?",
          "score": 1
        },
        {
          "text": "If that’s the case most stocks would be dead, why only REITs?",
          "score": 1
        },
        {
          "text": "AI would not fully replace labour firstly because the economy doesn’t support that -\n  \nLook at your Y = C + I + G \n  \nIf C goes down due to unemployment - government might have to step in with a UBI scheme to provide monetary support so people could live and buy goods that firms produce. To do that, they would need to increase taxes.\n  \nA firm would only choose an AI if the implementation cost of AI is cheaper than the cost of labour units + additional taxation levied. \n  \nWe’re only at the beginning - likely in the short term, AI is going to augment labour - increasing productivity - solow growth model should see another cycle of growth.\n  \nWhat we will see is a widening divide between the income classes - rich get richer because only highly skilled individuals retain their jobs - lower and middle income jobs will be gone and forced to compete with each other -",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1rce0yy",
      "subreddit": "singaporefi",
      "title": "Is Citibank good for Fixed Deposits in Singapore?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1rce0yy/is_citibank_good_for_fixed_deposits_in_singapore/",
      "score": 0,
      "num_comments": 6,
      "created_at": "2026-02-23T18:34:09",
      "selftext": "I’m considering placing a fixed deposit with [Citibank ](https://www.citibank.com.sg/)in Singapore and wanted to hear some real experiences.\n\nAre their FD rates competitive compared to local banks like DBS/OCBC/UOB? How’s the overall experience (rates, promos, ease of placement, customer service)?\n\nLooking for something safe and straightforward to park funds.",
      "comments": [
        {
          "text": "Can't comment on the service side nor do I think FDs are the best product for some use case...\n\nBUT....\n\nIf you wanna screen FD rates. Theres a free tool for this!\n\nhttps://sgfd.neocities.org/",
          "score": 2
        },
        {
          "text": "Why citi ? Why not any other bank ? Are you looking for Citigold  services",
          "score": 1
        },
        {
          "text": "Citi does not offer favourable rates for fd. Unless say , promotion for new-to-bank, citigold ( larger sum)\n\nIn today's context, better fd rates are offer by Malaysia banks HL , RHB, CIMB. Rates at local banks isnt that favorable as well.",
          "score": 1
        },
        {
          "text": "Maribank FD\n\n1.0% p.a. for 1 month\n\n1.1% p.a. for 3 months\n\n1.2% p.a. for 6 months\n\n1.3% p.a. for 12 months",
          "score": 0
        },
        {
          "text": "citibank fd is 0.6% p.a for 1-6 months, 0.7%p.a for 1 yr, and 0.1% for anything after that\n\nwhy want to do that? other normal savings accounts already average 2-3x that, with no need of lock up etc, if you do short term investing also more, if you put vwra/cspx/long term index of your choosing its already 15-20x that.",
          "score": -1
        }
      ]
    }
  ]
}