{
  "schema_version": "raw_scrape_v1",
  "report_id": "2026-02-23",
  "scraped_at": "2026-02-23T12:44:16.963495",
  "subreddits": [
    "singapore",
    "askSingapore",
    "SingaporeRaw",
    "singaporefi"
  ],
  "total_posts": 37,
  "total_comments": 429,
  "posts": [
    {
      "id": "t3_1rbib7p",
      "subreddit": "singapore",
      "title": "New 15% US tariff likely to apply to Singapore, says DPM Gan Kim Yong",
      "url": "https://old.reddit.com/r/singapore/comments/1rbib7p/new_15_us_tariff_likely_to_apply_to_singapore/",
      "score": 321,
      "num_comments": 203,
      "created_at": "2026-02-22T18:16:18",
      "selftext": "",
      "comments": [
        {
          "text": "Apparently the Chinese are thankful for Trump and labelling him “China nation builder”",
          "score": 340
        },
        {
          "text": "thanks america for being so divided that you manage to vote in a pedophile who has been able to consolidate power and can ignore the supreme court. sounds kind of familiar, wonder what will happen next. 🤔",
          "score": 258
        },
        {
          "text": "It was a big waste of time for so many countries to negotiate with Trump to get a reduction on tariffs and in the end everyone gets hit with the same 15%. Or rather, Americans get hit with the same tariffs for goods from every country.",
          "score": 102
        },
        {
          "text": "Trump is just like the school bully with $ and power. no use negotiating with him. the bad kids and bullies will join forces aka \"Board of Peace\" .. and then fund himself billions of dollars. 7billion announced yesterday",
          "score": 78
        },
        {
          "text": "Yawn, at this point I am not sure I care what that guy says anymore, its just lies anyway.",
          "score": 17
        },
        {
          "text": "I'm going out on a leg here and thinking that even the old elites like Gan here are quivering with rage at Orange Man fucking around with the establishment.",
          "score": 12
        }
      ]
    },
    {
      "id": "t3_1rbr7rt",
      "subreddit": "singapore",
      "title": "Did anyone feel tremors in Singapore?",
      "url": "https://old.reddit.com/r/singapore/comments/1rbr7rt/did_anyone_feel_tremors_in_singapore/",
      "score": 317,
      "num_comments": 86,
      "created_at": "2026-02-23T01:06:48",
      "selftext": "Living in the East Coast area and just felt swaying. It was more severe than previous times. Seems like a strong earthquake in the nearby region. \n\nDid anyone else feel it? It’s was kinda scary. It woke me up. ",
      "comments": [
        {
          "text": "Advisory:\n\n[Updated at 1.13 am 23 Feb 2026] A 6.8 magnitude earthquake was detected in Borneo, approximately 1509 km ENE of Singapore or 100 km N of Kota Kinabalu at 12.57 am (Singapore Time) on 23 Feb 2026. No reports of tremors. Nil tsunami advisory.\n\nhttps://www.weather.gov.sg/warning-regional-seismic-information/#:~:text=Earthquake%20Info&amp;text=No%20reports%20of%20tremors.,Nil%20tsunami%20advisory.",
          "score": 205
        },
        {
          "text": "Im in Sengkang. I felt it while taking a shit. Scared the shit out of me.",
          "score": 179
        },
        {
          "text": "I did. Was one of the strongest tremor I’ve ever felt in sg. Am along east coast too.",
          "score": 90
        },
        {
          "text": "I live in the west but I didn’t feel anything\n\nBut I saw a few of my acquaintances posting on ig story that they felt tremors",
          "score": 47
        },
        {
          "text": "At 106/107am? My cat woke up from sleep and suddenly started meowing. I’m staying near Marine Parade, didn’t feel anything but maybe because I’m lying down.",
          "score": 45
        },
        {
          "text": "Shit. I thought it was just me. For a moment I felt my bed started to sway, I thought my fat ass broke the bed",
          "score": 38
        },
        {
          "text": "didn't feel anything at bedok",
          "score": 25
        },
        {
          "text": "7.0 near Kota Kinabalu. Certain areas with softer ground may feel slight tremors, but the epicenter is over a 1000 km away, so the intensity is significantly dampened here compared to the epicenter.",
          "score": 22
        },
        {
          "text": "Was in bed and suddenly woke at 1+ am, no tremors felt but the wind chime hung in my bedroom started to sway.\n\nI thought it’s paranormal activity because the doors and windows are closed tightly in an aircon room 😂\n\nGlad the mystery is solved.",
          "score": 21
        },
        {
          "text": "no way, i felt it too. I thought i was imagining things",
          "score": 16
        },
        {
          "text": "Felt it in Stevens area. Must've been a strong quake if I feel it in Central region. And I just experienced one in Tokyo of about the same intensity. Like a 2.0.",
          "score": 15
        },
        {
          "text": "Oh! That was an earthquake? I thought I was dizzy",
          "score": 15
        },
        {
          "text": "None in west !!",
          "score": 13
        },
        {
          "text": "No tremors here in Yishun",
          "score": 10
        },
        {
          "text": "Yall should download the myENV app by NEA. They have notifications not just when it’s about to rain, but also notifies when there are quakes detected off coast.",
          "score": 6
        },
        {
          "text": "Didn’t feel anything in the north",
          "score": 5
        }
      ]
    },
    {
      "id": "t3_1rc3pwn",
      "subreddit": "singapore",
      "title": "‘The emotional abuse is relentless’: Dad gets personal protection order for daughter against mum",
      "url": "https://old.reddit.com/r/singapore/comments/1rc3pwn/the_emotional_abuse_is_relentless_dad_gets/",
      "score": 117,
      "num_comments": 45,
      "created_at": "2026-02-23T09:16:20",
      "selftext": "",
      "comments": [
        {
          "text": "People regularly think the only kinds of abuse which warrants action are physical related abuse. \n\nHowever, emotional abuse can be as horrible or even worse than physical abuse. \n\nThis case is clearly an extreme, but many children grew up (or are growing up) with emotional abuse by parents, and will be dealing with the trauma for years to come. If a child’s emotional needs aren’t met, it will hinder their growth as a person. Many people will say “oh they’re still your parents. They’re doing this because they care…” Bullshit. There are proper ways so show care and concern to your child without resorting to means that diminishes their self-worth. \n\nIt can be as simple as parents calling their children stupid when they don’t do well in school, constantly comparing them to others, or taking out their anger and frustration at work on their children. Raising a child is more than just providing a roof, some food and education. \n\nEdit: Goodness, there’re actually people downvoting this to show disagreement? \n\nI wonder if they’re the bunch of parents with a guilty conscience, or the kids who were so brainwashed by emotional abuse that they cannot go against what their parents did to them.",
          "score": 115
        },
        {
          "text": "Some people truly don’t deserve to be parents.\n\nWonder how the father put up with her before the child was born..",
          "score": 73
        },
        {
          "text": "Only 7 years old and already the mother is this crazy, cant imagine what will happen on PSLE year",
          "score": 63
        },
        {
          "text": "I’ve been thinking to call the authorities on my neighbour. She has been verbally abusing to her son. Which results in everyone in the family will just scold him for even the smallest things. It feels like no matter what he does, even if he’s trying to help, is also a burden.",
          "score": 25
        },
        {
          "text": "I wish this law was there when I was a kid.",
          "score": 20
        },
        {
          "text": "That bitch is not fit to be a mother",
          "score": 16
        },
        {
          "text": "Boils down to why. Why have children? Society, religion, FOMO, sense of security from posting a family photo online? Feel sorry for these chidren. Emotional abuse is also abuse. I understand parents have good intentions. Like one careless mistake in spelling or calculation may consequences. But the children will grow up with PTSD!! Omg.",
          "score": 14
        },
        {
          "text": "How should one enforce PPO if the mother is still the primary caretaker",
          "score": 11
        },
        {
          "text": "And this is why not everyone deserves to be parents, neither should people force their kids to have children in the future for the sake of being able to show off and having \"trophy kids\"\n\nHaving kids is not a fucking game, nor is it a competition\n\nthis is life and death, not a trophy to be used for showing off or for making you look successful",
          "score": 4
        },
        {
          "text": "Poor girl",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1rbhc5m",
      "subreddit": "singapore",
      "title": "S'porean woman catches on CCTV man loitering outside her Punggol flat, allegedly finds semen on gate after",
      "url": "https://old.reddit.com/r/singapore/comments/1rbhc5m/sporean_woman_catches_on_cctv_man_loitering/",
      "score": 118,
      "num_comments": 32,
      "created_at": "2026-02-22T17:16:13",
      "selftext": "",
      "comments": [
        {
          "text": "Damnn this is the next level of creep and disgusting shit",
          "score": 99
        },
        {
          "text": "From the photos in the article, it doesn’t look like there is any clothing rack outside the unit.\n\nSo the creep jerked off to a gate? Or to footwear? The kinds of people we get these days…",
          "score": 94
        },
        {
          "text": "This is so hard to understand. Let's deal with such perversion harshly",
          "score": 21
        },
        {
          "text": "[deleted]",
          "score": 16
        },
        {
          "text": "I think this man most likely the mind sotsot already as the person mention she never saw the person before or he has a fetish for makcik as the person who post is a makcik",
          "score": 14
        },
        {
          "text": "The camera has such good high definition. Trust our Singapore police to identify the pervert soon.",
          "score": 14
        },
        {
          "text": "Why are there so many cases like these?",
          "score": 10
        },
        {
          "text": "There's also a fat guy looks like a pig, wearing black frames. Disgustingly ugly. Always wandering outside my door. I called the police on him but they couldn't find him cause he would go into hiding one they arrived. I live at Tampines. I believe he stays around the block. Sick people like these are likely single, lonely and nobody wants them.",
          "score": 10
        },
        {
          "text": "Bloody hell",
          "score": 9
        },
        {
          "text": "![gif](giphy|ukGm72ZLZvYfS)",
          "score": 5
        },
        {
          "text": "WTF I would have the gate chemically deep cleaned and then conduct exorcism rituals by the major religions.",
          "score": 5
        },
        {
          "text": "Erm. Why? Damn...    Door/gate fetish?",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1rbnm5l",
      "subreddit": "singapore",
      "title": "‘I have better work-life balance now’: Dental assistant turned fishmonger",
      "url": "https://old.reddit.com/r/singapore/comments/1rbnm5l/i_have_better_worklife_balance_now_dental/",
      "score": 119,
      "num_comments": 23,
      "created_at": "2026-02-22T22:45:35",
      "selftext": "",
      "comments": [
        {
          "text": "she seems happy, and it's all that matters",
          "score": 111
        },
        {
          "text": "I am happy for people who found the things they want to do happily.",
          "score": 67
        },
        {
          "text": "Location: Tiong Bahru Market. She's married and her husband is manning another stall.\n\nIf that matters and for those who are interested and lazy to click and read.",
          "score": 60
        },
        {
          "text": "The transition must be tough at first but glad that she found her work life balance",
          "score": 36
        },
        {
          "text": "Tbh I don't think dental assistants make much at all..",
          "score": 20
        },
        {
          "text": "sometimes the comments here feel like they come from facebook\n\n",
          "score": 19
        },
        {
          "text": "She is probably earning more as well, good transition!",
          "score": 16
        },
        {
          "text": "There’s a couple of stores there that have younger gen owners actually!",
          "score": 12
        },
        {
          "text": "Nobody can defeat my fav fishmonger Tasteofthebay.",
          "score": 9
        },
        {
          "text": "Well I’m happy that she’s happy",
          "score": 6
        },
        {
          "text": "At the end of the day, being happy and fulfilled is the most important, good for her",
          "score": 5
        },
        {
          "text": "I envy people like that who successfully made the switch into something they like. I’ve been trying to for a prolonged period and all I can say is, pray for me thank you. \n\nBut also it spotlights into how dental assistant in general, operating in an industry which I think is toxic generally.  Her ex-boss was probably one of the rare few who was nice and healthy to work with, then when he passed, probably realized how it’s like out there and switched.",
          "score": 3
        },
        {
          "text": "Very good.\n\nAny inspiring stories about high flying  mercedes driving elites becoming fish mongers for better WLB?",
          "score": 3
        },
        {
          "text": "Thought the thumbnail was a catfish but dang shes pretty. Anyway props to her I need to support our fishmongers more!",
          "score": -3
        },
        {
          "text": "Noted ",
          "score": -11
        },
        {
          "text": "[deleted]",
          "score": -17
        },
        {
          "text": "she might just regret it. \n\nbetter work life balance but with the physically demanding job, you'll age very, very quickly.\n\n ",
          "score": -33
        }
      ]
    },
    {
      "id": "t3_1rbj831",
      "subreddit": "singapore",
      "title": "Murder of Liang Shan Shan",
      "url": "https://old.reddit.com/r/singapore/comments/1rbj831/murder_of_liang_shan_shan/",
      "score": 88,
      "num_comments": 22,
      "created_at": "2026-02-22T19:10:49",
      "selftext": "I remember this case sent ripples of fear when Liang Shan Shan’s body was first discovered. Very sad c ade. I recall the newspaper showing her bereaved parents. \n\nMy sister was in Mayflower Secondary school then and I remember how everyone was afraid when the body was first discovered ",
      "comments": [
        {
          "text": "the fella who did it was a serial killer. he killed a malay girl a few years earlier and dumped her body in the sngs construction site... may the two victims rest in peace",
          "score": 103
        },
        {
          "text": "Wow acquitted at first",
          "score": 23
        },
        {
          "text": "Wow can't believe I've never heard of this case. Poor girl.",
          "score": 9
        },
        {
          "text": "FYI if yall interested in this case yall can watch true files in mewatch",
          "score": 2
        },
        {
          "text": "[deleted]",
          "score": -99
        }
      ]
    },
    {
      "id": "t3_1rbftk5",
      "subreddit": "singapore",
      "title": "Woman jailed for assaulting four in Singapore",
      "url": "https://old.reddit.com/r/singapore/comments/1rbftk5/woman_jailed_for_assaulting_four_in_singapore/",
      "score": 52,
      "num_comments": 43,
      "created_at": "2026-02-22T15:44:39",
      "selftext": "",
      "comments": [
        {
          "text": "&gt; But Nur refused to and instead grabbed the officer’s phone and threw it on the floor, the prosecutor said.\nWhen the officer bent to pick up her phone, Nur slammed her against the wall and struck her head multiple times.\n\nReading this alone, assaulting on a police officer who is discharging her duty, I find the 36 weeks sentence surprisingly lenient.",
          "score": 65
        },
        {
          "text": "36 weeks seem too short for someone who would assault people randomly.",
          "score": 56
        },
        {
          "text": "WHY ARE WE LETTING PEOPLE WITH A PATTERN OF REPEAT ANTI SOCIAL BEHAVIOR LOOSE ON THE STREETS?",
          "score": 41
        },
        {
          "text": "So violent, the jail sentence should be 36 months instead of 36 weeks, since cannot cane anyway",
          "score": 28
        },
        {
          "text": "Awful woman, also the 2 days MC is hilarious “we know you’ve just been beaten up and choked out by a stranger but we do need you back at work on Friday”",
          "score": 12
        },
        {
          "text": "This episode will give some people idea…can go about wrecking havoc after posting bail, and in total still walk off with minor punishment.",
          "score": 9
        },
        {
          "text": "Press harsher punishments for her, such brazen violence towards unsuspecting people should not be tolerated.",
          "score": 7
        },
        {
          "text": "the case w the bus stop old lady and policewoman could have easily turned fatal. how is 36 weeks sufficient jesus",
          "score": 7
        },
        {
          "text": "And likely after serving her sentence, she will live off grants and subsidies, and continue to commit more crime",
          "score": 7
        },
        {
          "text": "Is that all - sounds like she needs a bit more than 12.months....or meds, nutcase",
          "score": 6
        },
        {
          "text": "Just light sentence 8 months. No wonder more and more such cases.",
          "score": 6
        },
        {
          "text": "Half a ip man",
          "score": 1
        },
        {
          "text": "I thought it was 36 months but 36 **WEEKS**?",
          "score": 1
        },
        {
          "text": "It’s ironic that the woman’s name meant patience (sabar).",
          "score": 1
        },
        {
          "text": "No MTO? Imh must be full again. ",
          "score": 1
        },
        {
          "text": "[ Removed by Reddit ]",
          "score": 1
        },
        {
          "text": "No caning?",
          "score": -8
        }
      ]
    },
    {
      "id": "t3_1rbdste",
      "subreddit": "singapore",
      "title": "Police search for suspect who trespassed into house in Upper Thomson",
      "url": "https://old.reddit.com/r/singapore/comments/1rbdste/police_search_for_suspect_who_trespassed_into/",
      "score": 52,
      "num_comments": 15,
      "created_at": "2026-02-22T13:48:01",
      "selftext": "",
      "comments": [
        {
          "text": "Maybe the PRC burglar syndicate came back for more",
          "score": 42
        },
        {
          "text": "under investigation, the one who reported isn’t any politician , special op called in because the man escaped and the forest is right behind",
          "score": 31
        },
        {
          "text": "Burglary?",
          "score": 17
        },
        {
          "text": "Sleep over ?",
          "score": 5
        },
        {
          "text": "Are they sure not monkey?\n\n![gif](giphy|H5C8CevNMbpBqNqFjl)",
          "score": -4
        }
      ]
    },
    {
      "id": "t3_1rc4iti",
      "subreddit": "singapore",
      "title": "LTA has new renders for the next 10 towns included in the friendly streets initiative",
      "url": "https://old.reddit.com/r/singapore/comments/1rc4iti/lta_has_new_renders_for_the_next_10_towns/",
      "score": 43,
      "num_comments": 33,
      "created_at": "2026-02-23T09:53:48",
      "selftext": "",
      "comments": [
        {
          "text": "Lower speeds at heavy pedestrian areas is good. What I don't see is any infrastructure for cycling - many families and seniors rely on bicycles to cover longer distances and connect from home to other destinations, and doing so safely for both cyclists and pedestrians would go a long way.",
          "score": 39
        },
        {
          "text": "the bedok one… i see basically no difference from the current aside from the speed limit paint(?)\n\nall of these friendly streets have been a joke. just paint the road and call it a day.\n\nlike for gods sake they literally have a render of a person pushing a wheelchair seeking refuge in a median on a unlabelled crossing",
          "score": 11
        },
        {
          "text": "From the title I thought we are building 10 more new towns in Singapore 🤣",
          "score": 10
        },
        {
          "text": "Overall good initiative, but some of these implementations make me worried about whether LTA understands road hierarchy. For example, Toa Payoh Lorong 2 while not a major road collects a lot of vehicles from Lorong 1A and Lorong 3, Central to feed into the PIE exits. Likewise Pending road distributes vehicles from Petir Road, Bukit Panjang Road and Bukit Panjang Ring road and thus are major sources of traffic.",
          "score": 4
        },
        {
          "text": "T-shirts \"Painting is not infra\" would hit hard.\n\nMaroon t-shirts with white or yellow text. ",
          "score": 4
        },
        {
          "text": "sooooo what happened to the pedestrianisation of orchard rd outside plaza sing?",
          "score": 1
        },
        {
          "text": "I notice an American accent in that Youtube video, e.g. with pronounced 'r' and soften 't' that sounds like 'd'. I wonder when LTA started using the American accent in their communications. Official verbal communication, e.g. MRT announcements and news programs, tends to be non-American even if not strongly British.",
          "score": 1
        },
        {
          "text": "When can we have a friendly driver initiative?",
          "score": 1
        },
        {
          "text": "Please stop...I don't think the country can handle more LTA ideas.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rbn6iw",
      "subreddit": "singapore",
      "title": "Tampines Rovers end Lion City Sailors 10 game win streak with a 1-1 draw",
      "url": "https://old.reddit.com/r/singapore/comments/1rbn6iw/tampines_rovers_end_lion_city_sailors_10_game_win/",
      "score": 37,
      "num_comments": 10,
      "created_at": "2026-02-22T22:26:41",
      "selftext": "",
      "comments": [
        {
          "text": "Great defending from Tampines Rovers",
          "score": 9
        },
        {
          "text": "I think LCS's strategy is just to draw Tampines in all of the three games since they can easily whack teams like Hougang, TPU. But I think the banana peel is next week when they are away at Albirex because Albirex is improving secretly.",
          "score": 8
        },
        {
          "text": "Jansen Foo and all his questionable decisions today. Handball, penalty calls, that Madhu Mohana elbow. Coming from an LCS fan btw.",
          "score": 1
        },
        {
          "text": "Stop trying to get us interested in sg soccer",
          "score": -41
        }
      ]
    },
    {
      "id": "t3_1rbjoc0",
      "subreddit": "askSingapore",
      "title": "Do all Singaporeans face cockroach problems at home?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rbjoc0/do_all_singaporeans_face_cockroach_problems_at/",
      "score": 145,
      "num_comments": 164,
      "created_at": "2026-02-22T19:37:19",
      "selftext": "I am a Singaporean. I always tend to have some cockroaches roaming in my home. \n\nNo matter how much cockroach we catch in my home, a new cockroach appears a few days later. No matter how much we keep our home clean, cockroaches still get attracted to our home. \n\nWe have a in-built rubbish chute in our home and I wonder if that is the reason why we keep attracting cockroaches in our home.\n\nFor those who live in flats whereby the rubbish chute is outside the house, do you also face cockroach problems at home?\n\nI am curious to know if there are some people living here who are blessed that they totally don't face cockroach problems at home.\n\nDo all Singaporeans face cockroach problems at home? Is it a common problem that is faced by everyone no matter how much they clean up the house?",
      "comments": [
        {
          "text": "Rubbish chute is outside the house and far from the unit. Barely any cockroaches seen for the past 10 years",
          "score": 254
        },
        {
          "text": "We used a paste of 3 parts diatomeceous earth 1 part water and pasted it along entrances such as windows and cracks. Bug free now.\n\nIt costed me 25$ for a 5kg bag. I have 4kg left.",
          "score": 107
        },
        {
          "text": "It’s very common problem. Cockroaches don’t respect unit boundaries. Neighbours’ uncleanliness will breed them and they will find their way to your unit. Rubbish chutes are a common cause as they’re shared as is poor maintenance. You can get rubbish chutes that are totally air tight sealed but it’s not going to solve the problem entirely.",
          "score": 66
        },
        {
          "text": "My cat destroys them . Leaves pieces everywhere",
          "score": 53
        },
        {
          "text": "My AC is on 24/7. Windows and doors all have rubber seals around the gaps, as well as around the rubbish chute. Lemongrass oil in a small bowl under the chute cover which I change every 2 months or so. And roach spray first whenever I open the cover before I toss something down.\n\nI never ever leave any food out for long. Any cooked leftovers goes into fridge as soon as its cooled. And I clear my garbage after every meal/cooking session instead of letting it sit there whole day.\n\nWhole house I use Bath and Body Works' wallflower plugs, eucalyptus and spearmint scent.\n\nLiving in old resale 3 room flat that has been renovated to 1 bedroom. Cabinetry are from prev owners.\n\nSo far no issues.\n\nI absolutely really despise and hate roaches so I will do whatever it takes to never see them.",
          "score": 47
        },
        {
          "text": "We seal our in-house chute and never have problems with cockroaches now.",
          "score": 35
        },
        {
          "text": "It's your distance to a chute in general. Lived in a HDB with chute in kitchen: I saw cockroaches all the time. Lived in HDB with shared chute but outside our door: occasional cockroach. Now living in HDB with shared chute far away: saw two cockroaches in 3 years. As other have mentioned, it helps to replace the seal around an indoor chute or seal it off entirely. On a side note, we also keep our windows and door closed to avoid dust and mosquitoes, so they don't fly in through windows.",
          "score": 18
        },
        {
          "text": "My wife complain this to MP. Immediate action by Town Council within 2 days.",
          "score": 17
        },
        {
          "text": "It could be your neighbouring unit/s that is festering the issue. ",
          "score": 16
        },
        {
          "text": "When I moved into an older high floor unit  with chute inside I kept finding roaches in the cabinets. Turned out they were coming up from the downstairs unit through the pipes. I sealed the access trap, cultivated a big lizard, and now I only find occasional body parts. But really feel like calling TC on the downstairs neighbour sometimes cos roaches is just one of several issues they have been causing. ",
          "score": 14
        },
        {
          "text": "Firstly, you need to have a good idea of all the places they are coming from. Spend a few nights working late and wander around your home late at night at random intervals. When you spot a cockroach, besides killing it, notice where it's coming from. Also check all your cabinets late at night to see if cockroaches show up in them. They are typically attracted to places closer to food sources so it's usually your kitchen cabinets. If you do find them in cabinets, don't kill them or empty your cabinets yet.\n\nSecondly, order Advion roach gel from online. I don't know the size of your home but the 4-tube pack (around 50-60 SGD) will be more than enough. I recommend avoiding any gel/bait you can find in local supermarkets because believe it or not, they're all useless. (Sprays are only good for manual kills and even then they leave behind residue which is a hazard for babies and pets which you have to clean up after.)\n\nThirdly, having identified all the areas they are spawning, now then is the time to empty any infested cabinets and do a one-time mass cleaning / manual cockroach killing with spray and/or good old slippers. Having done that, you can then squirt tiny, droplet-sized squirts of roach gel in the all places you think roaches are most likely to reappear, especially the pathways you think they frequent (Take care not to use gel in places babies/dogs/cats can reach). **I guarantee if you do this carefully and diligently, you will turn the tide with just 1-2 tubes of Advion with waves of dead roaches in 2 weeks and completely obliterate them within 3 months**. There, I gave you the solution, all that's left to do is execute. (I also heard good things about diatomaceous earth but I cannot vouch for that one because I've never tried it).\n\nOne thing to note: some old flats don't just have a built-in chute problem. They have a vent below the gas stove that allows any leaked ~~methane~~ LPG gas to sink to the floor and pass through. That is an even more direct highway for roaches into your kitchen. If you have that, I recommend gating it with a bit of stainless steel wire screen mesh sealed in place with silicone sealant. Do some research to learn the equipment you will need for this.",
          "score": 11
        },
        {
          "text": "I seal my chute and if there are cockroaches they come in from the main door. You can partially seal it too if you want to \n\nImo it’s unavoidable even if you do everything, some will just climb in through pipes or open toilet windows or whatever way. I had this nightmare scenario of many just recently- thought I didn’t need to on the lights in my kitchen to grab a drink from the fridge and I step on something prickly , I knew immediately what it is. Luckily I am not too bothered by it. My wife would have perpetual nightmares if it happened to her",
          "score": 9
        },
        {
          "text": "I have an indoor chute (older HDB) and don't have cockroach problem. I replaced the chute with one that has a tight seal around it to cockroach proof it. And I also keep my house clean.\n\nKitchen scraps gets thrown away every day, never left out overnight. Kitchen countertops and the sink also get a thorough wipe down every evening after I'm done cooking for the day. Any food that's kept on the counter tops (biscuits, snacks) are in airtight containers. I don't keep clutter around my house, like random cardboard boxes and old newspapers especially. Oh, and I clean my chute area once a week as well. Like wipe the outside and inside to get rid of the bin juices and residue food stains.\n\nNo food and no clutter to hide in means less chances of cockroaches wanting to set up shop here. I would still get the occassional flying cockroach coming in from the windows, that's unavoidable unless I want to install window mesh. But no baby roaches or roaches in the cabinets or anything.",
          "score": 9
        }
      ]
    },
    {
      "id": "t3_1rc50pb",
      "subreddit": "askSingapore",
      "title": "Can I report my manager for insulting me for taking MC?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rc50pb/can_i_report_my_manager_for_insulting_me_for/",
      "score": 102,
      "num_comments": 49,
      "created_at": "2026-02-23T10:16:25",
      "selftext": "hi yes it's me the person who asked if I can take MC during notice period\n\nso today when I went to work my manager instantly started insulting me calling me 废材 and asking me if I 爽了没有 and said that I purposely take MC and \"calculated it perfectly\" and said that because I took MC I “害死他们”  so I got very angry as well, so I started talking back and asking if he died already or not, and then he started getting aggressive and wanted to attack me or smth but a bunch of people stopped him\n\ncurrently I already left and is on the way back home and wondering if I can do anything or report him or smth, I already told the HR about it and ask if I can shorten my notice period because I don't want to work anymore. I don't feel safe working in the kitchen with someone with anger issue",
      "comments": [
        {
          "text": "Reprt him please, you might just save the other employees too.",
          "score": 142
        },
        {
          "text": "I hear a lot of complaints about managers/bosses in Singapore. Why do they think it's okay to insult/screen at employees. It's like Singapore is stuck in the 80s management style. I especially here bad things about banks. It is just the boomers personality traits? No one complains in fear?",
          "score": 57
        },
        {
          "text": "I think you can escalate to MoM or TAFEP. \n\nhttps://www.tal.sg/tafep/employment-practices/workplace-harassment/seek-help-on-workplace-harassment#",
          "score": 54
        },
        {
          "text": "If I were you, I will just make a police report.\n\nSo, it's very clear it was never about you taking MC in the first place, your manager just hated your guts apparently.",
          "score": 31
        },
        {
          "text": "If one of your staff take mc will cause your company to \"die\", in any sense of that word, be it someone collapse and die, shortage of manpower, slowing of service and you cannot be step up to be the manager that you are supposed to be, then your business deserve to \"die\".\n\nFewer worker for the day then so be it. It's f&amp;b, not fucking a&amp;e in hospital where people are dying and need saving.\n\nNot enough workers then serve slower and business slower and fewer customer, you are the manager. MANAGE.\n\nOP just take more mc and slp at home. If go to work just fuck the manager upside down if he decides to be an ass again.",
          "score": 22
        },
        {
          "text": "Translation for the mandarin words:\n\n废材 = useless when being used as an insult\n\n爽了没有 = satisfied or not (almost always said in a sarcastic tone in conflicts) \n\n害死他们 = causing them to die",
          "score": 15
        },
        {
          "text": "Kitchen Job.  \n\nSo I conclude it's F&amp;B which is already notoriously short staffed. If they were responsible and smart they'd just post for a cook to do the shift using Staffie.\n\nAs others suggested go ahead and report him.\n\nThis guy should have more respect for the workers. No wonder nobody wants to work in F&amp;B.\nBad attitudes.\nNo payment of CPF, sometimes salaries, what a shit show this industry appears to be.\n\nAsk the DR for a two day MC",
          "score": 11
        },
        {
          "text": "Wa got threat of physical violence ah. Report to MOM liao lol.",
          "score": 8
        },
        {
          "text": "Malaysian ?",
          "score": 4
        },
        {
          "text": "Tell him not happy fire you la! Sucks to be working under a crazy narcissistic boss but I hope you’re going to a better company.",
          "score": 3
        },
        {
          "text": "Your manager action is totally unacceptable. He was the dumb one here. There are ways to manage the situation but apparently he didn't know how. I am not sure if this is common in your industry but if it is, just be calm, turn on your recording and confront him after. This way I am sure he will be at the losing end.",
          "score": 3
        },
        {
          "text": "Your manager reaction is very unprofessional but I am also hearing your side of the story here. I have a team member who utilised all her 14 days paid MC and it is always on Monday or after PH and informed me at 7AM when work starts 8:30AM. The MC are mostly from teleconsulting clinic. \n\nWhat happens is that all her work she will push to her colleagues to answer/follow up and there was an incident when one colleague could not help cover most of her tasks - she wrote a nasty text msg to her calling her selfish and irresponsible.",
          "score": 3
        },
        {
          "text": "As it is all verbal and no physical evidence the reporting is mostly for them to take note if there were any future incidents unless you have security recordings which the HR might not release to you. So it is unlikely MOM will take action without evidence from you.\nBut it is better to be safe cos you are working in the kitchen where stuff like knives are abound",
          "score": 3
        },
        {
          "text": "To properly document the event that happen, I would suggest making a police report, no need to go police station can do so online and type it out yourself stating that it is for record purpose and for you to refer to MOM.\n\nThen use the police report submit to MOM and TAFEP, see any action taken by them.\n\nAll the best!",
          "score": 3
        },
        {
          "text": "I will just make fun of the manager everyday, and maximise my earned medical leave. Train yourself not to let words affect you and you will win a thousand battles.",
          "score": 3
        },
        {
          "text": "My only worry is if this was all verbal it would become your word against his.\n\nHopefully you have a colleague or 2 that can bear witness to this.",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1rc4k4x",
      "subreddit": "askSingapore",
      "title": "Is it a norm that I’m no longer interested in attending some friend gatherings/dinners because I feel like I don’t have anything in common with them anymore?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rc4k4x/is_it_a_norm_that_im_no_longer_interested_in/",
      "score": 99,
      "num_comments": 58,
      "created_at": "2026-02-23T09:55:25",
      "selftext": "This group is special because we all attended the same university, and they are **mutual** friends of my husband and me. However, after my career change, I am no longer in the same field as the rest of them. They often discuss company news, government regulations, and paperwork, topics I no longer relate to.\n\nWhile my husband thrives as the centerpiece of these gatherings, leveraging his career success to lead and engage in every discussion. I am myself  naturally quiet nature, feeling more disconnected by the minute. \n\nWe transitioned from an inseparable gang in university to merely casual acquaintances, and I find the effort of attending these dinners increasingly exhausting. I’m torn.\n\nI want to stop attending, but really having lesser and lesser friends now, especially since making new friends in my 30s feels difficult. Is choosing to skip these dinners a matter of self-care or I am just low social capabilities?",
      "comments": [
        {
          "text": "It’s natural to feel this way as people’s life paths diverge. Single people will eventually feel out of place when spending time with couples. Childless couples will feel the same when with couples with children. Financially poorer people will feel the same when with richer people.\n\nEnjoy the food and company when you feel like it, but don’t force yourself to stay too long or participate in conversations you’re not interested in.",
          "score": 83
        },
        {
          "text": "I confirm that.. when u enter your 30s, u lose friends at exponential rate. Am nearing 40 and the number of friends I have can be counted by 1 palm man. \n\nVery normal. And so find peace in that. \nAs we enter into 30s 40s, Find friends with common values, not interests.",
          "score": 38
        },
        {
          "text": "You know how they say it takes a village to raise a child? Even as we grow, we need a village too. But the thing is - you need to participate in the village if you want to stay in it.\n\nIf things go wrong and you need a friend to turn to, but you haven't put in effort or meet him/her for the last 5 years, its unlikely that friend would be able to support you well. Seems like you dont find the conversations meaningful anymore. Which means you need to force yourself to find common ground constantly to maintain the friendship. Not easy, but rewarding if a long term friendship is a reward to you\n\nSometimes there are inconveniences that we need to suck up for the benefits of it. So if the trade off is worth it - your convenience/comfort over any long term friendships. Then go ahead. Just be ready to face hardships alone or just with your family. Nothing wrong at all. Everyone's different.\n\nAt the end of the day, think long term.",
          "score": 38
        },
        {
          "text": "Gonna be contrarian (at least within Reddit) here:\n- This is a group of common friends you used to be close with, you don’t dislike them. At some point you had more common interests than now\n- You only meet them 2-3 times a year. Not like every week every month.\n- Your husband at least, seem to be ok with the group flow and remains quite engaged (even to the extent he is described as a centerpiece).\n- [Less Relevant] you don’t seem to have that many other friend groups either, so I can only assume 52-3 weeks you mostly own time anyway\n\nSure. You’re within your rights to disengage and leave. Prioritize “self-care” on that 3, two hour sessions a year. But shouldn’t you also consider \n- It’s a good chance to hear out what your husband is interested in at work, his viewpoints on things?\n- staying engaged with industry changes, albeit no longer immediately relevant to you? \n- the possibility of switching conversation tracks with your old friends\n- simply being a good partner and attending something you less prefer with your partner 2-3 times a year? It doesn’t sound unbearable anyway\n\nUltimately it’s your choice to exclude yourself. I do think a relationship is both ways (both with your spouse and your friends), and sometimes one party paddles harder to get the boat moving",
          "score": 13
        },
        {
          "text": "Always prioritise yourself first. What is the pt of presence if it is not mutual engagement?",
          "score": 8
        },
        {
          "text": "Sure it’s ok. As we go through life our priorities change. Family first, then self, then social connections. Self care is important, use your time wisely on things you enjoy.",
          "score": 7
        },
        {
          "text": "Your path changed, not them though, hence the lack of topics.\n\nbut then again if friends for so long, is that all you guys talk? Its rather sad, old friends hardly talk about such, at most, touch and go. Most joke and laugh and all the experiences we had on travel, family, reminisce old times\n\nYou dont have to join every session, maybe once a while then if you really dont find connection anymore",
          "score": 7
        },
        {
          "text": "It is common. I don't bother with my school's alumni meet ups, i just kept in contact with a hand full of my friends from primary/secondary/jc (all affliated) and haven't seen the rest for at least a decade or 2. Even friends whom i partied and shared many memories (good and bad ones), i rarely see them UNLESS they also have kids that are +1-2 years old from mine. That's when we see them pretty frequently. ",
          "score": 6
        },
        {
          "text": "When I reach my 30s, I have also cut off social gatherings with so called \" acquaintance friends\" because we no longer share the same interest/values or I noticed that some of them have this attitude of comparison and are putting people down because others are not at the same level of success as them.\n\nIt's perfectly normal for you to become disinterested in attending such social gatherings. We have to work from Mon to Fri and honestly weekends are our precious time to rest and recover. I find it socially exhausting and a complete waste of my precious time meeting \"acquaintance friends or ex classmates\" with whom I have no true connections with. I rather use this time to learn technical skills to grow my investment portfolio.\n\nI only have that 1-2 friends whom I truly connect with and that's good enough. As you grow older, its normal that you have fewer friends and that you become selective of who you want to be in your inner circle. Because you dont want to waste time.",
          "score": 5
        },
        {
          "text": "These are situational friends, i.e. only have things in common because of a certain life stage. It's okay to move on.",
          "score": 4
        },
        {
          "text": "Yes. When everyone is asking how much you making and what kind of work you do as the only conversation topic it gets tiring very fast. It’s not you, it’s the toxic environment. Seeing branded bags and cars people show off doesn’t help either. Instead, much better to go fishing at Marina South. ",
          "score": 4
        },
        {
          "text": "Need to steer the convo topics to things that are more your stuff.\n\nTry to find any common ground to talk about lor. Can be boliao stuff like tv shows or new attractions or nostalgic 想当年 things",
          "score": 3
        },
        {
          "text": "Good news 👍. You out grown your old social circle.",
          "score": 3
        },
        {
          "text": "Try sharing your current work and life.  If they can listen with curiosity, without judgement, then it might make the company less distant.  \n\nIt will take effort for introverts because we hate being the centre of attention, but if we don’t open up, nobody knows.  The most important thing is whether you feel safe to be your current self in this group.  If you find that safety still exists despite your changing life, it might be worth the effort.  If the safety and curiosity about you as an evolving individual is no longer there, then maybe not.  \n\nAlso, does your husband feel the same way?  Does he know how you feel?  For me, if the group is still important and meaningful to my husband, I will still put in the effort to fit in.",
          "score": 3
        },
        {
          "text": "Well, this is Reddit, where social isolation and introversion are glorified and seen as a “cool, subversive” thing.\n\nBut in the real world, lack of friends and social skills can lead to many problems, such as hurting your career prospects and even early development of dementia.\n\nNot saying you should hang with this particular group of friends, but try to find people beyond your husband whom you have affinity and form a small but solid social circle.",
          "score": 3
        },
        {
          "text": "*fewer friends (not lesser). And it is natural across the world for our social circles to shrink. You need to make new networks based on shared interests and activities if you wish to reverse the trend.",
          "score": 3
        },
        {
          "text": "I guess it’s also the topic of discussion. Aren’t there other things to talk about other than the industry that the group is in? \n\nBut yes, it’s normal to want to skip out occasionally. Think about your mental health and social capacity. But continue to stay connected cos it’s true that friends are lesser now that you hit 30s. I’ll suggest talking to your husband too so that you are both on the same page, especially when it starts to become only him attending these gatherings instead of the two of you because I’m sure people will ask, so he needs to be on your side.",
          "score": 2
        },
        {
          "text": "Do what makes you feel happy, and not what people enforce on you",
          "score": 2
        },
        {
          "text": "I can relate somewhat. Went for a dinner once with 3 doctor friends and they just cannot help it but go back to talking about the hospital and the medical system and other doctor friends that they know. As someone not in the industry, it gets kinda boring LOL I just keep finding myself zoning out and mechanically nodding my head after a while.\n\nSounds like your husband is really passionate about the industry that he and your mutual friends are in. Also seems like he’s the lead talker at the dinner table haha. How about asking him to prepare and direct certain topics that are not related to that particular industry so that you can be included?",
          "score": 2
        },
        {
          "text": "Well, I think it takes two hands to clap\n\nOn your part, maybe you could reflect on whether you've been engaging with them in ways that allow the friendships to grow alongside you? As life paths change, we have to be intentional about introducing new topics, inviting different kinds of conversations or even suggesting new activities that reflect who we are now. By doing this, you could draw them out of their usual comfort zones to create space for connection beyond shared history or careers\n\nThat being said, don’t put the entire responsibility on yourself to tank this as friendships require reciprocity. They also need to show curiosity about your life, meet you halfway and make an effort to grow with you. It shouldn't feel like you’re the only one trying to bridge the gap\n\nSo if you've made the effort and still feel disconnected, it's okay to let some relationships naturally drift. Not all friendships are meant to evolve in the same direction and that doesn’t mean you lack social ability; it may just mean you've all grown in different ways and that's completely fine too\n\nOh yes – where does your husband come in in all this? Have you let him know how you feel? I think he should do his part too in terms of what I mentioned above given that he seems to have the most social clout in your friend group",
          "score": 2
        },
        {
          "text": "Time is precious. If you feel like you are wasting time doing something, then stop.",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1rbkvyu",
      "subreddit": "askSingapore",
      "title": "How's your bonus? (banking sector)",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rbkvyu/hows_your_bonus_banking_sector/",
      "score": 100,
      "num_comments": 80,
      "created_at": "2026-02-22T20:40:53",
      "selftext": "Local bank, back office: 2 months bonus. \n\nHeard different stories in the banking sector (foreign bank: 1.7mths, VP rank and above: bonus cut by half). ",
      "comments": [
        {
          "text": "Foreign banks scaling down on bonuses and increased outsourcing to india and other countries.\nLocal banks still pouring out bonuses though.",
          "score": 95
        },
        {
          "text": "Local bank, back office: 3.5months",
          "score": 50
        },
        {
          "text": "Hiring freeze is not a good sign. Impending restructure",
          "score": 49
        },
        {
          "text": "Local bank, front office, 11.7 months.",
          "score": 46
        },
        {
          "text": "Local bank, front office. Slave my ass off to get 4.5 months",
          "score": 26
        },
        {
          "text": "temp staff / contract for local bank. \n\n  \n0 , tried to ask for increment but not even $1.",
          "score": 22
        },
        {
          "text": "Local bank: 4.5 months",
          "score": 13
        },
        {
          "text": "What is bonus? My company allergic to bonus. Never see before. ):",
          "score": 11
        },
        {
          "text": "Foreign bank, back office. 1 month",
          "score": 7
        },
        {
          "text": "AM, 3.6 months. Highest for the past 3y.",
          "score": 7
        },
        {
          "text": "Local bank, tech, 0 0",
          "score": 6
        },
        {
          "text": "Bank-ish fintech. 0%",
          "score": 4
        },
        {
          "text": "Foreign Bank, Back Office, 1.4 mths",
          "score": 4
        },
        {
          "text": "local bank front office, 4.3 months",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1rc01uj",
      "subreddit": "askSingapore",
      "title": "What are some Malay words non-Malay Singaporeans use in their daily lives?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rc01uj/what_are_some_malay_words_nonmalay_singaporeans/",
      "score": 64,
      "num_comments": 144,
      "created_at": "2026-02-23T06:40:21",
      "selftext": "please exclude military drills used exclusively within the military\n\ne.g. hentak kaki as a military drill. But hentak kaki to mean career plateauing is OK (but do people actually use it in that sense?) ",
      "comments": [
        {
          "text": "I think the obvious one is makan and maybe rabak",
          "score": 153
        },
        {
          "text": "Kena but mispronounced as kanna",
          "score": 101
        },
        {
          "text": "Alamak is probably a common one as well",
          "score": 65
        },
        {
          "text": "Bodoh",
          "score": 64
        },
        {
          "text": "The following words, which tend to be completely butchered in spelling.\nMacam -&gt; Machiam\nTerbalik -&gt; tombalek\nSekali -&gt; Scarly\nAgak-agak -&gt; Agar agar",
          "score": 58
        },
        {
          "text": "my bosses constantly say “akan datang” or “agak agak” 💀",
          "score": 41
        },
        {
          "text": "Nasi LOWmak\nMee ROWboos\nTOMbalik\nLOWti Prata (okay not malay but adjacent)",
          "score": 41
        },
        {
          "text": "Nasi kangkang",
          "score": 28
        },
        {
          "text": "Sayang, I use it like ten times a day\n\n(I’m a preschool teacher)",
          "score": 20
        },
        {
          "text": "\"Tak boleh tahan\"\n\nMeans cannot take it anymore. Used to express frustration.\n\n\"Rosak\"\n\nMeans broken. Used to describe appliances or something that is not functioning. As in, the fan in the room rosak already. The word was quite common in Singlish in the 80s and 90s, but nowadays, young Singaporeans stare blankly at me when I use the term.",
          "score": 18
        },
        {
          "text": "Cannot tahan",
          "score": 17
        },
        {
          "text": "Lah is a term originated from malay, Lor is a term originated from Chinese, dei is a term originated from Indians, man is a term originated from Ang moh... All are used at the end of sentences",
          "score": 15
        },
        {
          "text": "Mampos",
          "score": 14
        },
        {
          "text": "Hokkien use kaoying (kahwin) and suka",
          "score": 8
        }
      ]
    },
    {
      "id": "t3_1rbjldk",
      "subreddit": "askSingapore",
      "title": "Sabbatical after 2–2.5 years of work—looking for someone to talk thru ideas",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rbjldk/sabbatical_after_225_years_of_worklooking_for/",
      "score": 40,
      "num_comments": 32,
      "created_at": "2026-02-22T19:32:30",
      "selftext": "Hey fellas, looking for someone to talk through ideas with.\n\nNot really earning much nor fulfilled in current role, so I'm (28M) considering resigning in around July to take an extended break (at least 3 - 6 months). Might sound reckless given how the job market right now might not be so good, but I think a break might be a good time to rest, pick up new skills (familiarising myself with LLMs maybe), and do something that fulfils me more (perhaps study math...?).\n\nOne concern I have is that I might struggle to find a suitable role once I return from an extended break - like it'll look like I've been unemployed for months. But I feel like staying doesn't seem like the right choice either, nor am I sure if I really want to continue down the career path I'm on.\n\nI expect to save up maybe around S$35-40k when I leave. Expenses about S$2k/month if I don't go on trips etc. I might want to go on a trip though. And thereafter, I might be interested in the startup space in general (great if there are communities I can look into).\n\nConsidering applying for roles in my industry in meantime to see what kind of salary I can get if I continue in similar roles, so I might be able to establish some sort of baseline opportunity cost.\n\nHoping that some might be able to help talk me through ideas please\n\nEDIT: Ideas gathered thus far:\n\n1. Apply for jobs in meantime - see what kind of pay I can get\n2. Take 3-weeks leave first to chill, think, and plan\n3. Then, take one-month notice after coming back if planned\n4. After resigning - maybe a trip!\n5. May take CFA. Or prep for potentially higher paying role\n6. May take tech courses too, e.g. to use LLMs to get better at current or other work\n7. Attend events, talk to people, message people on LinkedIn, cold email others\n8. If returning to another job next time, prepare narrative\n9. ???\n\nHoping to get more ideas and talk thru more, DMs welcome!",
      "comments": [
        {
          "text": "I got laid off during covid and I ended up not working till 2022, it was a total of 20 months, barely short of two years. It was covid so I didn't do any travelling, also stayed home a lot, hence expenditures were really low.   \n  \nI did a ton of courses and self learning during that time but most of all was just taking a mental break. I was 29-31 when I had that break and it was really much-needed, even though I hadn't planned for it at all. I'm married now with commitments, so I don't think there'll ever be such an opportunity ever again. \n\nThat said, I'm in the built environment sector, so not a very hyper competitive sector. Back then I felt confident that whenever I wanted to start working again I could. Just do your due diligence first, but if you can, I really suggest you do it. \n\nAll the best!",
          "score": 41
        },
        {
          "text": "Have you tried asking your employer if you can take a sabbatical? \n\nI know a colleague who took close to 6 months break to travel all around the world. My boss was supportive of his long break and he came back to work more motivated than ever before.",
          "score": 18
        },
        {
          "text": "What do you want to achieve by studying Math or LLMs? What aspect of Math or LLMs do you want to study? You also want to do the CFA? Which level? Is that part of your planned Math curriculum? It’s easy to piss a break away when you don’t have clear objectives for them. I’d recommend crafting clearer objectives first before taking the plunge. \n\nYou should also have executive search people in your field who can give you a realistic idea of the hiring market of your field.",
          "score": 13
        },
        {
          "text": "Job market is tough unless you are a unicorn.\n\nMy honest thoughts are start applying to jobs now, see how long you can tahan in this job. \n\nMaybe give yourself a 3-6 month gap to rest and relax but you gotta start applying now.\n\nSource: applied for jobs for 1.5 years before getting one, didn't quit my current one",
          "score": 11
        },
        {
          "text": "What’s your current qualification in? Does it make sense to pivot to LLM and how likely is that? \n\nDo you have any responsibilities financial or otherwise? Can you handle a year without employment? Given that you’re relatively young I’d imagine you can find employment readily after your break, but you never know.",
          "score": 3
        },
        {
          "text": "i applied for jobs for 9 months without a break in 2024 while still working for another company. my CV has a lot of reputable names. a friend of mine took a 6 month sabbatical to find herself pre covid. She couldn't find a job for 2 years after, had to pivot to another industry and at the same time a connection helped her with it. If job market was considered decent especially back during my friend's time, I can't imagine how much more difficult it would be if you take that break now. If you have enough savings for at least 3 years without trips, go ahead!",
          "score": 2
        },
        {
          "text": "Apply for and secure a job now. Then negotiate to start a few month later. Quit and use those few months as your sabbatical",
          "score": 1
        },
        {
          "text": "You cannot be doing nothing or it will be tough to get back.\nPM, if you want to chat",
          "score": 1
        },
        {
          "text": "Have you ever considered trying something new?\n\nNew Zealand offers work holiday for individuals under 30 for low end jobs.\n\nGives you a valid reason for break from real work and valid reason to not be in the rat race for a while.\n\nAustralia does the same but needs to put in about 5k of deposit.",
          "score": 1
        },
        {
          "text": "Is it really unbearable or just tired?\nMy take is that you have to find out what’s the underlying issue and there’s no guarantee that you won’t feel the same way in a new job supposedly with higher pay and what you “enjoy”. \n\nIf you really want to do it for mental health reason and making you really unbearable, then go ahead. Otherwise, find a job while you’re still employed? Lie flat and get money in. \n\nEmployers can smell desperateness, so never allow yourself to be put in that position.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rbmoip",
      "subreddit": "askSingapore",
      "title": "Shift workers, how do y’all cope?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rbmoip/shift_workers_how_do_yall_cope/",
      "score": 19,
      "num_comments": 21,
      "created_at": "2026-02-22T22:05:14",
      "selftext": "About to start full time work soon, and there will be shifts. Some shifts are like 7am-4pm, 230-1030pm, 1030pm-230am. How do y’all maintain your health and social life while working shifts? Any advices?",
      "comments": [
        {
          "text": "used to do 9 PM to 9 AM when was younger, loved the off-peak off times in the day when everyone else is working. Less crowd and ques in malls and when taking public transport.  Health-wise yes sleep schedule will need to adjust.. the shift allowance did make up for it fortunately.  Used that few years to build my pot before finding new oppty with better schedules.",
          "score": 23
        },
        {
          "text": "As a shift worker of 18 years I can tell you your body clock will go haywire after awhile. You’ll feel sleepy &amp; hungry at odd hours. My shifts are similar except I have night shift from 9-9. \n\nWhat I do is get enough sleep, I work out at least 40-45 mins a day, rotate between cardio, strength training or yoga. I only do home workouts, too lazy to go gym lol. Also have to eat right. For me what works is small meals through the day &amp; I avoid eating after 7. Quite tough for night shifts but I still perservere. If really can’t tahan then I have a 1/2 glass of milk. Also avoid snacking, high sugar foods, excessive alcohol. I don’t smoke either. Drinks lots of water as well. Some of my collegues take melatonin to help them sleep cos our bodyclocks are all crazy. \n\nMy advice is not to stay on shift for too long like myself. Shift work has it’s perks but not good on the body long term. You’ll also miss out on public holidays, weekend activites with family &amp; friends. We usually have to ballot for the religious festivals like CNY, Raya, X’mas &amp; New Year. I have not been with family for New Year’s for the past 4 years already haha.",
          "score": 13
        },
        {
          "text": "can u pick shifts or is it rotating? usually u just live life around the timing you get, ",
          "score": 6
        },
        {
          "text": "I’m in F&amp;B, full timer. My shifts are 11am-10pm 5 days a week (I do get a 1.5hr break time too), and I get two days off (not fixed, so each week is different). I maximise my off days by going about my routine (I still get to have a social life apart from doing solo things like gym) but during my work days, I make sure to hydrate and eat well (besides having staff meals). It can get tiring but I take things in my stride. After some time, your body will adjust to it too.",
          "score": 4
        },
        {
          "text": "A lot of coffee, and turning off the brain",
          "score": 3
        },
        {
          "text": "i go climbing lol, people there are so nice and everyone wants to help its such a nice activity\nyou can ask ur friends too great social bonding haha climbing can be a bit pricy tho\nbut they are usually open from 9-10am to 9-11pm\n",
          "score": 2
        },
        {
          "text": "How is your upcoming shift schedule like? Work 2 days, off 1 day? 2 days off 2 days, then 2 nights then off 2 days ?? Need to provide these kind of information before can provide any better opinions",
          "score": 2
        },
        {
          "text": "It will affect your health in the long run especially if there's night shift. Work at night, sleep during the day.",
          "score": 2
        },
        {
          "text": "Did regular night shifts for 2.5 years. Felt tired all the time, shoulders were stiff everyday. I ate a lot and no matter how much i exercised, couldn’t stop the weight gain. So I would say try to control your eating and try your best to remain active.",
          "score": 2
        },
        {
          "text": "Wtf is that 10.30pm to 2.30am, I hope that’s WFH or they cover your transport costs 😭 Besides that messed up shift tho, I work pretty similar rotating hours as you. \n\nDay before and after a night shift, I usually block out social wise for rest/re-adjusting body clock. \n\nInvest in good curtains, AC, ear plugs/ear phones so you can sleep better during the day.\n\nColleagues and I also spread out our AL/ML pretty evenly throughout the year if possible.",
          "score": 2
        },
        {
          "text": "Worked rotating shift day, afternoon, night for the past 18 years. I can endure all the fatigue. I feel sad when im going to work during weekends or nights, my kid pleaded with me to stay home. But now doing less shift work because position higher.",
          "score": 1
        },
        {
          "text": "Used to do rotating shifts.\nLoved it. Getting off work when others were at work or getting to work was sort of fun. The time you get to run personal errands during office hours was wonderful.\nTwo drawbacks. Lack of time with family and friends for obvious reasons. And damage to sleep cycle - permanent for me. Even though i no longer work shifts and have not done so for a long time, my sleep cycle does not easily fit the office hours routine. Even if i force it, just one late night will imbalance it.",
          "score": 1
        },
        {
          "text": "Must be SN",
          "score": 1
        },
        {
          "text": "Let me forewarn you. PAPA shifts are the worst. PM AM PM AM. All my nursing friends hate it. \n\nYou’ll find pockets and adapt to that life eventually one way or another. Good luck!",
          "score": 1
        },
        {
          "text": "caffeine.\ni work as a junior doctor, and for full calls, my work timings are as follows:\nnormal working from 6:30 am to 5 pm.\novernight call from 5 pm to next day 8 am.\npost-call rounding from 8 am to about anywhere from 11:30 am to 1 pm.\n\ncaffeine at around dinner and midnight helps.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rbhpoq",
      "subreddit": "askSingapore",
      "title": "How much tip to give lion dance to bless my desk in the office?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rbhpoq/how_much_tip_to_give_lion_dance_to_bless_my_desk/",
      "score": 16,
      "num_comments": 21,
      "created_at": "2026-02-22T17:39:56",
      "selftext": "So my company will be having lion dancers to bless the offices (including the management). As ending of last year is super suay for me (cos of siao zhabor in my team) I would like to have the lion dancers to bless my personal desk which is new but face directly towards the siao zhabor's former seat. \n\nMay I know how should I distribute the ang baos? \n\n2 big ones for the lion dancers and maybe 8 small ones for the rest of the troop?\n\nHow much ang bao to tip them? \n\nThank you in advance!",
      "comments": [
        {
          "text": "Generally just $8 (can be more if you are feeling generous but remember to give in auspicious figures) in an Ang Bao with 2 mandarin oranges on your desk is the signal that you want the Lion Dance to bless your table.\n\nPut a calculator beside those if you want a 4D number.\n\nThe Lion Dance troop would have already gotten a fee / big Ang Bao from the company to come to your company. Any additional Ang Baos from the desk blessings are extras, the troop will consolidate all those Ang Bao at the end and redistribute among themselves. So no need to give separately.",
          "score": 54
        },
        {
          "text": "$211 for each of the 2 big dancers. The 11 will act as daggers pointing towards the Xiao zhabor.\n\n\n$81 for each of the small dancer. Each 8 has a 1 acting as a dagger in her direction. You got all round defence and blessing for the year liao.",
          "score": 33
        },
        {
          "text": "You're better off going to 打小人 at this point",
          "score": 29
        },
        {
          "text": "Just put $8 and 2 orange on your desk. The lion dance will come over and bless you and the table. Regarding siao zhabor, lion dance cannot help much. Maybe can consider engage fengshui master to help you counter bah.",
          "score": 18
        },
        {
          "text": "888sgd due to inflation as determined by the committee",
          "score": 4
        },
        {
          "text": "I think lion dance not enough thou",
          "score": 3
        },
        {
          "text": "Roll pineapple too",
          "score": 1
        },
        {
          "text": "Sometimes lion dance can also bring bad luck",
          "score": -6
        }
      ]
    },
    {
      "id": "t3_1rboj0n",
      "subreddit": "askSingapore",
      "title": "Those who have gone to BFT, is it worth it?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rboj0n/those_who_have_gone_to_bft_is_it_worth_it/",
      "score": 16,
      "num_comments": 15,
      "created_at": "2026-02-22T23:23:08",
      "selftext": "I have one outlet that is walking distance from my house and I'm thinking of whether to join. To be honest, I'm considering it more for the social aspect but improving my fitness would be a plus. Those who have gone before, would you say that the community is worth it? Have you made close friends from there?\n\nMy profile: Mid-twenties F, average fitness.",
      "comments": [
        {
          "text": "Join their 1 week free trial and see how you like it. From my experience in that 1 week trial i spoke to several guys and i gathered:\n- most come quite regularly but most still look very out of shape\n- some guys remarked that they have gotten injured in bft before. I attribute it to the rush format of going station to station with time limit and the pressure to pass it on to your partner results in bad form and injuries",
          "score": 19
        },
        {
          "text": "The plus point is that you can suspend the membership for 90 days in year. Meaning u can actually pay only 9/12 months per year and get staggered rest or when travelling. \n\nI heard anytime fitness locks you in and have unreasonable contracts (look up reddit, 2 or more recent post)\n\nIf you are looking for social aspects it is quite ok. I go for fitness only so its good for introverts as well. \n\nSome gyms have really good trainers that look out and correct your forms. Good thing is that BFT membership can go any gym even worldwide as long as you primarily go to your home bft. \n\nThe community is good. I think you will enjoy it.",
          "score": 13
        },
        {
          "text": "Highly recommend you to download the BFT app and sign up for the trials offered by the various outlets. Those trials are way cheaper on a per class basis compared to a full membership.\n\nYou can even go for trials at different BFT outlets to fully take advantage of the cheap prices.",
          "score": 10
        },
        {
          "text": "So bft, REVL, F45 uses a rotation of cardio and strength classes. E.g Monday wed Fri strength\n.. Tues and Thurs and sat cardio.. IMO, if you are someone just into fitness, this could be for you. Because it motivating to have studio friends pushing each others.. If you are not disciplined, this is for you, becuase if you book classes and skip it or cancel you pay a fine.... If you are someone who is lazy or dunno how to programme workouts, this is also for you..",
          "score": 9
        },
        {
          "text": "In my opinion, very worth it for me as the community is awesome. After 1 month, I also visit other outlets closer to office. Surround yourself with fit and encouraging people and you will reap the rewards.\n\nGiven that it is super competitive now, I heard of some outlets offering very good deals.",
          "score": 5
        },
        {
          "text": "depends on your branch. my home gym compared to a few other outlet i've visited is less clique-ish which i appreciate as an introvert.\n\nhave chats with other members here and there but i not really there for the social aspect.\n\none gym i went was full of the ra-ra kind who seem to all know each other and i couldn't wait to nope out of there once my class ended lol\n\nfor fitness its up to you and your coach. my home gym coaches will pressure me and others to push a bit more. personally i saw progress over the past months doing mainly strength training with them 3x a week, and its worth it instead of paying specifically for PT.",
          "score": 4
        },
        {
          "text": "It really depends on the outlet! \n\nI went to one and really liked the vibe, the person who partnered with me was super encouraging and the instructors were super chill, so people were also quite friendly on a whole. However, at another outlet, the instructors were kinda intense and clique-y, I was having my period so almost fainted during one of the exercises and had to stop - got treated kind of weird by the instructors, a little condescending, as if I was too weak? And when I was informing them about leaving midway as I wasn’t getting better, they didn’t care at all haha. It felt really unfriendly. \n\nI’ve heard good things overall though!! Maybe I just went there on a bad day but it kinda soured it for me.",
          "score": 2
        },
        {
          "text": "yes but it’s a gamble with coaches. not all coaches care to fix form; most are just there to socialise and take videos/pics. but since you say you’re looking at the social aspect of it, then i guess you’ll have no problem 😂 go for trials first",
          "score": 1
        },
        {
          "text": "gym friends are gym friends. it's pretty rare to convert them into long-lasting friends. if you're just looking for medium-term friends, then sure!",
          "score": 1
        },
        {
          "text": "Was it $59.90 per week ?",
          "score": 1
        },
        {
          "text": "Errr depends cause if you are there for the social aspect, to be frank, any fitness class/groups, even your regular gym can a place for socialising.\n\nYou just need to filter out those who are there for real training, creepy hook me up bro/sis and the people who are there for the same reason as you…",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1rc6g6x",
      "subreddit": "askSingapore",
      "title": "Managing finances as an adult in SG",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rc6g6x/managing_finances_as_an_adult_in_sg/",
      "score": 12,
      "num_comments": 44,
      "created_at": "2026-02-23T11:23:36",
      "selftext": "Want to seek everyone’s opinion on this! I would love to have pov from both sides so that I can be fair to my partner about this issue! \n\n(Prev post got removed hence posting again) \n\nMy partner and I are discussing about having a joint account for our family.\n\nFor context, I earn almost 2x more than my partner. She says she wants to have a joint account where we deposit all our money into that one account and use it for home loan repayments or other expenses like going out for meals. However, I feel that we shouldn’t combine all our money 100% and should still have our own individual accounts.\n\nFor me, my parents have always had their individual accounts and one joint account where they contribute to it monthly (Ofc if I earn more I will contribute more kind of scenario). Whereas, my partner’s family have always had one singular joint account.\n\nMy POV:\n\n1.\t⁠having your own individual account and watch it grow when you save is satisfying and kind of gives me motivation for working so hard\n\n2.\t⁠I can have guilt free spending without having to ask my partner. What I mean by that is for example I feel like having a bowl of salad today instead of caifan or grab a cup of matcha or coffee instead of grabbing a drink from office. (ofc barring those big purchases where it is still out of respect to ask your partner for their opinion)\n\n3.\t⁠I work for myself, my parents and her, not for her family (parents or siblings or friends). She’s the type to like to travel with friends without me and treat her parents to food. How do I know where to draw the line on this? I feel that this may lead to arguments. Also, as I am an only child I like to treat my parents to a meal once in a while but I feel guilty using from that account and I feel like I have to ask for her permission.\n\nHer POV:\n\n1.\t⁠Her parents does that and it works fine. (No it doesn’t honestly, I saw her parents fought over finances bcoz one side wanted money to for their parents medical bills)\n\n2.\t⁠All her friends also combine salary.\n\n3.\t⁠She does not feel like I want to take care of her and cannot rely on me.\n\n4.\t⁠The most valid point imo: she feels like she can never stop working because the day she stop working is the day she runs out of cash for her own personal use.\n\n(Maybe there are more points but if I can think of them, I’ll add in)\n\nI am not saying I don’t want to take care of her but I believe it is important to not comingle all our finances as it may lead to very bad arguments down the road (especially if the use case for the finances are not for ourselves).\n\nWhat do you guys think? I want to concede to her on this because it hurts me when she says she feels like she can never rely on me fully and that she can’t quit when she wants to (as entitled as it sounds) but I promised to take care of her.\n\nTLDR: should maintain separate accounts and 1 joint account or combine all into 1 joint account?",
      "comments": [
        {
          "text": "Maintain separate accounts and create a joint account where you guys transfer your share/percentage of salary into that account. All expenses will be deducted from that joint account",
          "score": 28
        },
        {
          "text": "This low key feels like a trap that ends in “my money is my money and our money is my money”. Draw strong boundaries from the start. It’s hard to redraw them once a precedence’s set in a relationship. \n\nHaving a joint account where you both contribute a portion and a clear understanding of how it should be utilised and also split in case of a breakup should be the bare minimum.",
          "score": 15
        },
        {
          "text": "Major red flag.\n\nIf she truly loves you, why is she so fixated on your money?",
          "score": 12
        },
        {
          "text": "most people i know will have their own account and a joint and do a monthly contribution to the joint. if your take home is 6k and hers 3k then maybe she puts 2k and you do 4k or something like that for joint expenses. but you definitely need to iron out what you can spend from that account though. if you will pay for personal meals and shopping from that account then not really much point having that. usually people keep for stuff like paying rent, paying for stuff for the household, dates etc. ",
          "score": 7
        },
        {
          "text": "My POV:\n\n1. ⁠having your own individual account and watch it grow when you save is satisfying and kind of gives me motivation for working so hard\n2. ⁠I can have guilt free spending without having to ask my partner. What I mean by that is for example I feel like having a bowl of salad today instead of caifan or grab a cup of matcha or coffee instead of grabbing a drink from office. (ofc barring those big purchases where it is still out of respect to ask your partner for their opinion)\n3. ⁠I work for myself, my parents and her, not for her family (parents or siblings or friends). She’s the type to like to travel with friends without me and treat her parents to food. How do I know where to draw the line on this? I feel that this may lead to arguments. Also, as I am an only child I like to treat my parents to a meal once in a while but I feel guilty using from that account and I feel like I have to ask for her permission.  (I think this one is think too much, but if she goes traveling without you and it happens many times, then i wonder why. on the part of treating her parents food, I think you can be generous with that right? its just food)\n\nHer POV:\n\n1. ⁠Her parents does that and it works fine. (No it doesn’t honestly, I saw her parents fought over finances bcoz one side wanted money to for their parents medical bills)\n2. ⁠All her friends also combine salary. (General statement of all her friends, ask her to prove ALL her friends does that)\n3. ⁠She does not feel like I want to take care of her and cannot rely on me. (This should be a big red flag for you, cuz it seems like money is the only way to take care of her. )\n4. ⁠The most valid point imo: she feels like she can never stop working because the day she stop working is the day she runs out of cash for her own personal use. (then it's  a her problem right. Touch wood what if one day you are the one who have no more money, who is she supposed to depend on?)",
          "score": 2
        },
        {
          "text": " I loled when you mention she travel with friends without you\n\nAnyways, nothing wrong about your view or your gf view. There is no fairness in relationship. It’s about finding someone who share the same mindset",
          "score": 1
        },
        {
          "text": "You can disclose wealth, but still managed separately.\n\nYour partner hasn’t work for at least 30 years, and she wants to quit workforce already ah. You really become daddy liao.\n\nHer parents, twenty years. You, rest of her life.\n\nParenting and marrying off the kid is a better deal.",
          "score": 1
        },
        {
          "text": "To clarify- are you guys married?\n\nIf not I’d see it as a red flag. I’m not gonna handing over 100% of my income or letting someone frame basic financial boundaries as a lack of love. Stick to separate accounts plus one joint account, and if that isn’t acceptable to her, then the mismatch isn’t about money, it’s about values.",
          "score": 1
        },
        {
          "text": "Huh I feel like your most valid point is actually the most invalid point. What do you mean she feels like she can’t stop working if she doesn’t have access to your money? That’s a red flag for me lol. Like even if you promised to take care of her and she don’t wanna work anymore that’s still a proper discussion for both parties first and then lots of further planning for how to proceed financially, not hey you promised to take care of me so “let’s join our money so I feel like I can stop working whenever I want and treat your income like it’s my income”. That’s not responsible or respectful\n\nJoint accounts are ok (but risky), my parents have one but they are the old fashioned type where my dad and mom are both reasonably frugal and responsible with it. With her mindset though, I’d suggest you keep separate accounts and have one combined one for shared usage.",
          "score": 1
        },
        {
          "text": "Stupid idea.\n\nBased on (4) she just want you to support her so she can retire.\n\nObvious different financial goals.\n\nAnd never heard of this arrangement before either. But her parents and all her friends does it? Odd.",
          "score": 1
        },
        {
          "text": "as mentioned by others, the best way will be to open a joint account whereby you both contribute a fixed percentage of your salary into this account for household expenses. \n\nthis way the impact to each of you will be fair regardless of the difference in salary. this is how my wife and i does it as well.",
          "score": 1
        },
        {
          "text": "She said she will run out of cash if she stop working so she needs the joint account?? Huh? So she can use you as her ATM?\n\nThen shouldn't she learn to manage her money better, or upskill and find a higher paying job? If she can afford to travel then she can afford to save.\n\nMe and my partner's solution: once our BTO unit is ready we will open a joint account, each month we contribute x% of our salary. We still keep our individual accounts.",
          "score": 1
        },
        {
          "text": "If she makes $5K and you make $10K, then it’s totally fine if you have a joint account which she contributes $4K and you contribute $8K every month for shared household expenses and family savings, and keep the rest for individual spending or saving.\n\nIt your salaries are much lower than that, then it’s kind of pointless to have this discussion and you’re better off being more protective of your own money instead of giving her free access to yours.",
          "score": 1
        },
        {
          "text": "You need financial compatibility for maintaining a successful relationship. It's perfectly reasonable to maintain a shared account for shared expenses and separate individual accounts. If she isn't able to compromise and you aren't comfortable with fully combined accounts, then I think you might not be financially compatible. From my perspective, it sounds like her entire argument is \"you need to provide entirely for me\". Not sure if that's a healthy relationship requirement.\n\n&gt;she feels like she can never stop working because the day she stop working is the day she runs out of cash for her own personal use\n\nDoes she not save any money? Sounds like she either has a spending problem or she wants to retire soon or both.",
          "score": 1
        },
        {
          "text": "&gt;TLDR: should maintain separate accounts and 1 joint account or combine all into 1 joint account?\n\n  \nThere is no one solution that works for everyone.  Both of you have to come to a compromise/understanding.\n\n\n&gt;⁠I can have guilt free spending without having to ask my partner. What I mean by that is for example I feel like having a bowl of salad today instead of caifan or grab a cup of matcha or coffee instead of grabbing a drink from office. (ofc barring those big purchases where it is still out of respect to ask your partner for their opinion)\n\nHaving a combined finances doesn't mean you have to ask your partner for permission when it comes to having a bowl of salad or the likes of it.  Even when it's separate finances, it is respectful when you ask/inform your partner about it. \n\n\n",
          "score": 1
        },
        {
          "text": "I actually just have a joined account. We keep each other accountable for the amount of money spent. Ofc if it is on food, then we are not so anal about it but it is on general purchases where we will discuss. If she disagrees with something that I want, I will explain why it is useful and if she still says \"no\" then I move on and trust that she knows me too◡̈That will often make me slow down and consider my purchases as well. we keep each other in balance and that is what it means to be in union too. There is nothing for me to hide and nothing for her to hide as well ◡̈Hope this helps\n\n  ",
          "score": 1
        },
        {
          "text": "It's about ironing out the differences, compromise and communication.\n\nIt's better to do both, having a separate account to credit your own salary in and spending from it on your own personal needs. Because it sets clearer definitive boundaries and space.\n\nHaving a joint account where both partner either commit to it based on an agreed amount or based on % of ones earning so that both sides are pulling their own weight in the relationship.\n\nBut most importantly, it's to understand what is the joint account being used for; eg shared expenses, saving towards renovation or house or wedding. This must be set clear and communicated.\n\nIt sounds more like you both are basing your financial habits and belief on what your respective parents are doing, however it seems like you feel her side's ways of doing things has its own conflict.\n\nMaybe it's to understand and allay your partner's concerns and wishes so that you both can understand each other more. Finances is an important factor to be discussed before marriage because it's to understand each other's needs, expectations and wants: be it still having to contribute to one's family of origin expenses and needs or to ensure funds are to foster the new family.",
          "score": 1
        },
        {
          "text": "There isn't a right/wrong, but question: how are your expenses currently split? Is it proportional i.e you pay for 2/3 of expenses because you out-earn her? If no, then she has a reasonable basis for her fear that she is taking on more risk. \n\nWhat my partner and I (who also have an earnings discrepancy) do is: we each get assigned the same amount of discretionary spending each month, which is a number based on what the lower-income earner can afford - this covers coffees, meals out, Grabs, etc and in managed in our personal accounts so no need to check on how we each choose to spend it. However, the remainder of our expenses are unequally split - in general, I pay rent, he pays everything else for the household;  and holidays are split too (I cover airfare and accommodation; he covers meals and attractions; we each have our own pot of discretionary holiday spending). This is currently managed in an Excel which covers both accounts but the intention has been to put it into a joint account. \n\nFinally: It may be that you have incomptible views on finance and how to manage money and spending on friends/family. It is hard to face, but it's good to face the reality now.",
          "score": 1
        },
        {
          "text": "No right no wrong. The only wrong is you two do not agree, which is now becoming a problem.\n\nIt seems you do not trust her. Otherwise why won't you feel motivated by your joint retirement funds growing, probably under your care? Why wouldn't you both do guilt-free spending from the joint account without having to ask each other?\n\nBut on the other side, maybe you are right not to trust her, because what the heck is this \"she can never stop working because the day she stop working is the day she runs out of cash for her own personal use\"? She won't save on her own if you have separate accounts? Or she thinks you won't provide for her if she stops working for a good reason?",
          "score": 1
        },
        {
          "text": "[removed]",
          "score": 1
        },
        {
          "text": "Not bad... this is a good experience in how to \"agree to disagree\" and \"compromise\" without keeping a long term grudge. It's a compulsory skill to keep a marriage going.\n\nYour parents have 1 style and her parents have another style... now both of you are feeling friction only cuz of parents' different styles.\n\nWhy not think of a creative new idea instead of adopting either side's parents' style? How about a combined account where she puts in all her salary in then u match the amount by transferring the exact same amount in every month. Your excess funds, you keep in your own account to eat salad and drink matcha. However, it is a compromise and it's not gonna be fair in the end cuz her salad and her matcha and her holiday without you are all gonna come out of the joint account... but well, it is meant to be a compromise so I hope u r a gentleman and accept her spendings graciously.",
          "score": 1
        },
        {
          "text": "My view has always been to have a joint account where the both of us contribute a set amount every month for things like dates, eating out and even big ticket items. Everything else should stay separate. \n\nThat's how my folks did it and they rarely argue over money. I think wanting to combine everything is a red flag. And I'm saying this as a woman lol.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rbjqr1",
      "subreddit": "SingaporeRaw",
      "title": "Why are we paying this guy millions every year? For doing Captain Obvious's job, and reciting things tat we already know &amp; can read from online news. Anyone of us can also read out the tariff announcement from Trump &amp; then say, LL (suck thumb) we just have to accept the new rates lor",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rbjqr1/why_are_we_paying_this_guy_millions_every_year/",
      "score": 167,
      "num_comments": 81,
      "created_at": "2026-02-22T19:40:59",
      "selftext": "really Gan Boh Yong",
      "comments": [
        {
          "text": "Actually every time someone pointed out this obvious observation, I can't help but laugh because it means the people who voted for them are being slapped on the faces. That's right, those who voted for LW, GKY and folks need to ask themselves what kind of incompetent fools did they voted for?\n\nOf course, these shamed voters will try to deflect their imbecilic decisions by claiming that the opposition is even more incompetent, dubious and yadda, yadda. Just like when their parents are robbed in broad daylight, instead of trying to get the robbers arrested, they berated the bystanders for doing nothing and just watching.\n\nWhat to do when dealing with fools? Do the only thing that can be done, laugh at them.",
          "score": 54
        },
        {
          "text": "classic Singapore set piece, choose your fav combo: \n\n- monitor the situation\n\n- form a taskforce\n\n- form a multi ministerial committee \n\n- form a committee of inquiry (applies to opposition) \n\n- \"we\" but not when it comes to ministers salaries, that one is top top tier\n\n- something something harness AI\n\n- something something geopolitical climate\n\n- something something resilience\n\n- tax tax and more tax then give a bit back as vouchers, pat pat ownself on the back for good job done\n\n- are you stealing from the reserves?",
          "score": 42
        },
        {
          "text": "Yah he is useless. To deal with Trump, you need to praise him, give him some stupid award or gift golden golf set like what Japan and Korea did.\n\nQatar gave him a plane. And UAE partnerships for his sons to build properties in Dubai. \n\nPAP don't know how to curry flavour and kiss his ass because they are used to minions kissing their asses instead.",
          "score": 40
        },
        {
          "text": "65% said yes to whatever they want to do.",
          "score": 35
        },
        {
          "text": "As usual, when economy is going great then it is all because of their brilliant leadership. When things go bad then it is because of global events which we have no control over. \n\nBasically heads I win tails I also win. \n\nKNN. Taskforce man my ass.",
          "score": 24
        },
        {
          "text": "https://i.redd.it/a14izoaqe1lg1.gif",
          "score": 22
        },
        {
          "text": "Task Force Man...massive fail on the only TASK, which is to negotiate lower tariffs for Singapore\n\nThank you Punggol GRC!",
          "score": 21
        },
        {
          "text": "All these people ever do is give BS motherhood statements and suck up whatever other countries do to us. \n\nTrump and his tariffs have been going on for years. It's not a new thing. Has the task-force actually come up with *anything*, not just useless things, *anything at all*, after all these years?",
          "score": 20
        },
        {
          "text": "Whoever voted for him &amp; now feeling the disappointment, congratulations! You guys got conned &amp; shall live with it",
          "score": 16
        },
        {
          "text": "We have no cards. We have no cards. Taskforce is useless. Trump say 70% we still suck it up.",
          "score": 16
        },
        {
          "text": "I could have done that... I want to be task force man :(",
          "score": 14
        },
        {
          "text": "Is it just this guy? I think we are just too used to finding excuses for them and not thinking critically. \n\nWe attribute all positives to them. We don't see the unlevel playing field. We expect Opposition to come up with detailed plans when we don't expect the same of the resource rich incumbents. We find excuses for them. We whack the Opposition and don't realise it was worse with the incumbent but they imply legitimized.\n\nActually I guess it's same everywhere. People choose to be blind unless they feel it then they bitch about it. But that's already way too late. The ability to critically assess is just absent.",
          "score": 13
        },
        {
          "text": "The assumption is that any of them will land a top job in corporate world, which is likely not possible. By most FAANG measures, they would've missed on their OKRs.",
          "score": 12
        },
        {
          "text": "If the government wants to take world class compensation they had better demonstrate world class performance. Just taking millions to avoid corruption isn't good enough.",
          "score": 12
        },
        {
          "text": "We have signed the most open-legged FTA with the USA, which I think is good because we need the Americans to buy the stuff we manufacture and get American products at the best value too (And we can resell it to the rest of ASEAN).\n\nSo I don't get why we still have tariffs against us. They have had over a year to make our case with the Trump administration.",
          "score": 10
        },
        {
          "text": "So fast kena downvoted by IBs",
          "score": 10
        },
        {
          "text": "As useless as his useless friend Motherhood Statements Wong",
          "score": 9
        },
        {
          "text": "you can say the same about many MPs and ministers and even our president.\n\ncan't even solve the basic problem of having your locals fill up essential jobs. ya many countries have same problem, because many countries are filled with equally failing governments",
          "score": 8
        }
      ]
    },
    {
      "id": "t3_1rbdsry",
      "subreddit": "SingaporeRaw",
      "title": "New immigrants can role-play as SAF soldiers and wear the No. 2 uniform; however, most born-and-bred Singaporeans will never get to wear it",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rbdsry/new_immigrants_can_roleplay_as_saf_soldiers_and/",
      "score": 112,
      "num_comments": 65,
      "created_at": "2026-02-22T13:47:58",
      "selftext": "[https://www.youtube.com/watch?v=f00mC96WaKM](https://www.youtube.com/watch?v=f00mC96WaKM)",
      "comments": [
        {
          "text": "So when is Janil Puthucheary serving?",
          "score": 122
        },
        {
          "text": "I don't consider the volunteer corp as NS.\n\nI consider it the same as NCC. Just a CCA only.",
          "score": 85
        },
        {
          "text": "Such a fucking disgrace",
          "score": 65
        },
        {
          "text": "This is some volunteer core shit right lol",
          "score": 54
        },
        {
          "text": "Never wear no.4 but can wear no.2 is fucking joke",
          "score": 44
        },
        {
          "text": "Knn all the face like nvr go real outfield one still can wear no 2",
          "score": 36
        },
        {
          "text": "Sg citizenship is already free toilet paper, ns uniform is just rag cloth, don't give a shit too much, it doesn't matter anymore, earn as much as you can, gtfo before it sink.",
          "score": 29
        },
        {
          "text": "\"NS cannot be measured in dollars and cents\"",
          "score": 28
        },
        {
          "text": "It's called number 2 for a reason. No self-respecting soldier will want to wear it to attend a party.\n\n\n\n\nPertinent quote from The Last Castle:\nIrwin: [to captain Pertz, while looking at Winter's military collection, while Winters overhears their conversation] Any man with a collection like this is a man who's never set foot on a battlefield. To him a minié ball from Shiloh is just an artifact. But to a combat vet, it's a hunk of metal that caused some poor bastard a world of pain.",
          "score": 28
        },
        {
          "text": "Wear for what hot af and is a rental. Lol",
          "score": 22
        },
        {
          "text": "lol these fuckers will be the first to run if anything happens.\n\nwhere's our 10 year anniversary dinner for serving ns ah? \n\ntf.",
          "score": 10
        },
        {
          "text": "\"NS is a privilege\"",
          "score": 10
        },
        {
          "text": "They can wear No.1, 2, 3, 4 or whatever\n\nI just wanna wear my civilian and don’t bother me with Enlistment Act blah blah blah, report what, all those nonsense",
          "score": 7
        },
        {
          "text": "Frankly. We should just take people who are prepared to be the first line of defence in a Malaysian or Indonesian attack scenario.",
          "score": 6
        },
        {
          "text": "His qualifications is from from rubbish university",
          "score": 4
        }
      ]
    },
    {
      "id": "t3_1rbipwn",
      "subreddit": "SingaporeRaw",
      "title": "Taskforce man is a taskforce failure",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rbipwn/taskforce_man_is_a_taskforce_failure/",
      "score": 100,
      "num_comments": 65,
      "created_at": "2026-02-22T18:40:41",
      "selftext": "Naive thinking PAP-led Govt can persuade US president when its high nigh impossible since US president is the king of the world.\n\nSG have to suck thumb till Trump is removed from office.\n\nBut to mislead voters last election thinking taskforce man GKY can do something about it is pure utter rubbish.",
      "comments": [
        {
          "text": "https://preview.redd.it/yfwife5fz0lg1.jpeg?width=846&amp;format=pjpg&amp;auto=webp&amp;s=e3a85aa5ea03aa643ea54efd29776efd75325f2b",
          "score": 89
        },
        {
          "text": "Wake me up when y'all stop voting for failures, otherwise it's all just noise.",
          "score": 47
        },
        {
          "text": "Frankly, I don't think the sole purpose of the tariff taskforce is to ensure low tariffs - that is an impossible task.\n\nThe goal is to have measures to help businesses affected by the tariffs?\n\nThat said, even for that goal, I don't see any visible actions taken.",
          "score": 33
        },
        {
          "text": "In game theory, a threat is only effective if the person threatening can get away with their threats. We allowed Trump previously to get away with making his threats with impunity and now the nightmare is back again. \n\nWe had no backup plans even after the first round of tariff was imposed. As a result, we are effectively telling Mr Trump, please screw us as you like, any time you like.\n\nWe pay millions for leaders who are reactive, with no effective contingency plans (like what if the US decided to impose additional tariffs again in the future) and can only offer excuses, platitudes and empty soothing words to sinkies.",
          "score": 17
        },
        {
          "text": "Now Trump wants to invite SG to the Council for Palestine, membership is 1 billion.",
          "score": 16
        },
        {
          "text": "Punggol residents have several more years to repent. \n\nThey claim we need to send the best person to negotiate, turns out! It was never negotiable lol.",
          "score": 12
        },
        {
          "text": "Based on his time at MOH, roughly can tell liao. He was useless there also, so many screw-ups including the mass mis-diagnosis scandal, etc.",
          "score": 11
        },
        {
          "text": "In PAP's Singapore, everything PAP do is faultess. everything bad happpen is opposition fault.\n\nthis kind of mental illness, got medicine can cure meh? ",
          "score": 11
        },
        {
          "text": "Am I the only one thinking that it's funny that the incumbent puts up a response to every move Trump has made. They know for sure it's 15 today, 25 tmr, and maybe 0 when his president term ends. Trump negotiates and will do whatever it takes to get more money. \n\nTaskforce? What taskforce. We, sg have no cards.",
          "score": 10
        },
        {
          "text": "never play golf with the US ambassador",
          "score": 10
        },
        {
          "text": "Punggolians hoodwinked",
          "score": 10
        },
        {
          "text": "With the salary that he is receiving he’s the very definition of “task failed successfully”",
          "score": 8
        },
        {
          "text": "Expected Task force useless. 65%.",
          "score": 8
        },
        {
          "text": "only the 60+% are stupid enough to believe Singapore can negotiate with US. we are nothing to americans.",
          "score": 7
        },
        {
          "text": "Yah he is useless. To deal with Trump, you need to praise him, give him some stupid award or gift golden golf set like what Japan and Korea did.\n\nQatar gave him a plane. And UAE partnerships for his sons to build properties in Dubai. \n\nPAP don't know how to curry flavour and kiss his ass because they are used to minions kissing their asses instead.",
          "score": 7
        },
        {
          "text": "Enjoying his reward for being the best wingman during C19",
          "score": 6
        },
        {
          "text": "[New 15% US tariff likely to apply to Singapore, says DPM Gan Kim Yong - CNA](https://www.channelnewsasia.com/singapore/new-us-tariff-apply-singapore-trump-gan-kim-yong-5945361)\n\nsee the CNA news title, so what do you think?",
          "score": 4
        },
        {
          "text": "https://preview.redd.it/5570r40631lg1.jpeg?width=1280&amp;format=pjpg&amp;auto=webp&amp;s=33f6f887f7880b6bc46006be81fd986750e8a2db\n\nYugi attacks with Trump Card!  Taskforce man stunned like vegetable!",
          "score": 3
        },
        {
          "text": "https://i.redd.it/8eqf0skls1lg1.gif",
          "score": 3
        },
        {
          "text": "Like COVID, Trump mutates.\n\nLike COVID, our G reacts (too slowly)",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1rc11to",
      "subreddit": "SingaporeRaw",
      "title": "Who in singapore actually believe in 中华民族? it's absurd ccp can simply target any high profile chinese who no longer have citizenship or ties to china",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rc11to/who_in_singapore_actually_believe_in_中华民族_its/",
      "score": 68,
      "num_comments": 98,
      "created_at": "2026-02-23T07:21:18",
      "selftext": "",
      "comments": [
        {
          "text": "Chinese influence operations and coercion works like this. Government security forces can only do so much to arrest/expel physical actors in Singapore but there's not a lot you can do against targeted campaigns on social media or hitting SG businesses interacting with the Chinese market.\n\nThe only way is for the Singapore population itself to strengthen our own identity. Tactics like calling for Chinese loyalty will not work for \"true\" Singaporeans like me for the sheer reason that I have little in common with a mainlander besides speaking mandarin (well my accent is rather different though). \n\nI will never have any kinship with a people I do not understand, have little cultural ties, and a regime which attacks the country I now call home. Hence, I' worried that accepting a flood of Chinese as new citizens is going to weaken our ability to resist influence.",
          "score": 68
        },
        {
          "text": "go to fb and see how many idiots actually believe this racist 中华民族horseshit.\n\nreddit have their fair share of these racist idiots as well.",
          "score": 36
        },
        {
          "text": "Isn’t this the self-righteous bridezilla who got Amos Yee to the US?\n\nThough yes, her points are pretty valid.\n\nI can’t speak for Singaporeans as a whole, but we aren’t part of China. At least, all those I’ve met from generations Gen X and onwards makes that distinction. It was a point of contention and friction for us.\n\nThose older, however… Jialat.",
          "score": 23
        },
        {
          "text": "It’s quite ironic because the CCP wiped out all the Chinese values and traditions during the madness of the cultural revolution. The overseas Chinese and Taiwan are actually the true torch bearers of Chinese civilisation, not CCP’s PRC.",
          "score": 22
        },
        {
          "text": "I understand the CCP having this mindset as it helps their direction. I understand the ex PRCs who have this mindset as they spent a large portion of their lives within the China bubble. What I don't understand is why the F are Singaporeans and Malaysian Chinese having this mindset.\n\nThese bunch of clowns have never lived in China, most of them have never even visited China. But somehow they have this China as their motherland mindset. This is extremely stupid and ridiculous. \n\nI have seen mostly Malaysian Chinese defending CCP's policies and actions even when it was directed against their own country. I really cannot understand this type of mind numbing mind F these clowns psyched themselves into. Unbelievable.",
          "score": 11
        },
        {
          "text": "The CCP has caused the death of more Chinese citizens than foreign powers combined.\n\n\nThis is a fact. \n\n\nThe communist have killed more Chinese people than the Gwei Los. \n\n\nThe communist are the real enemy of the Chinese people. ",
          "score": 11
        },
        {
          "text": "Coming from her? Lmao",
          "score": 10
        },
        {
          "text": "We are quite aware of continued attempts by foreign interests to influence our people and this has been ongoing for quite a long time.\n\nChina Cultural Centre (Singapore) - Wikipedia https://share.google/7N5r9RS9tMKuTJ75U was opened by XJP and GCT in Nov 2015\n\nAnd in response, Singapore Chinese Cultural Center was setup soon after, not too far away\nA tale of two Chinese cultural centres - CNA https://share.google/vy8SfdCALhjLaUZ38\n\nAlthough I am pointing out just these examples, Singapore and all other countries have been subject to all sorts of external influences on \"national\" politics/culture, from soft (kpop, Hollywood  Bollywood, etc) to blatant (1960 CIA bribery attempt, Hendrickson affair, Responses to our position on the russian-ukraine war, etc)\n\nIt is folly to think that we can / should preserve our culture and identity, not is it necessary to. It is something that will continuously evolve, hopefully in a progressive direction. Critical thinking skills are vital here. What we should reject are attempts to mass subvert / influence our thinking and ideology for others interests, to the detriment of our own",
          "score": 9
        },
        {
          "text": "Things like this explain why Shou Chew keep getting asked about his alignment. Motherland imposed bamboo ceiling.",
          "score": 8
        },
        {
          "text": "Don't want la. Being associated with China these days is embarassimg",
          "score": 6
        },
        {
          "text": "The new PRC immigrants bought in by PAP and the boomers like Tan Kin Lian, Goh Meng Seng.\n\nDuring the 2011 election, I overheard a PRC mother telling her kid not to forget that they are zhong guo ren despite obtaining Sg citizenship. I saw same family bringing their entire family down to the voting place with their grandmother in a wheelchair. Family asked which party logo is the PAP.",
          "score": 6
        },
        {
          "text": "You don’t need to believe. The China Chinese believes can already.\n\nWe are all one step away from being forced into operating as an autonomous state and tribe of their “motherland”.",
          "score": 4
        },
        {
          "text": "If they really expect overseas chinese stay true to their race then as per chinese values loyalty and gratitude to the country that actually took care of the you come first 🤷",
          "score": 3
        },
        {
          "text": "Why not trace back even further back? Which Africa tribe was your ancestors in 200,000 years ago?",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1rbm4h2",
      "subreddit": "SingaporeRaw",
      "title": "I also want to be a fishmonger!! Female dental assistant turned fishmonger: She runs a market stall solo",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rbm4h2/i_also_want_to_be_a_fishmonger_female_dental/",
      "score": 54,
      "num_comments": 19,
      "created_at": "2026-02-22T21:40:28",
      "selftext": "",
      "comments": [
        {
          "text": "Be the change you want to see in the world\n\nIf we want to preserve our local identity, complaining about the foreign takeover is not going to solve it. I myself a bit guilty too, but we need to actively be part of the movement that keeps it alive",
          "score": 31
        },
        {
          "text": "My ex sales manager say he sell fish part.time on weekend also earn more than in office",
          "score": 18
        },
        {
          "text": "Mad respect. I cannot even get near fishmonger stall because I hate the smell.",
          "score": 13
        },
        {
          "text": "You can be 卖鱼哥王雷😄😄😄",
          "score": 8
        },
        {
          "text": "She managed to overcome the steep learning curve within such short span and setup her own stall. \n\n![gif](giphy|gKOKjThWebZo9Fsr0E)\n\n",
          "score": 7
        },
        {
          "text": "Great for her to continue a legacy. I cannot stand the smell of a wet market, I would die instantly.",
          "score": 6
        },
        {
          "text": "Always passed by her stall, never tried it. But good to know she’s doing fine.",
          "score": 6
        },
        {
          "text": "From dental assistant to fishmonger. The Singapore Dream has come full circle. \n\nStudy hard, work hard, and someday you may become a fishmonger, butcher, fruit stall owner, hawker, gig worker, delivery rider - just like 2 generations ago.\n\nFrom developing to developed, back to developing all in one lifetime.",
          "score": 3
        },
        {
          "text": "She’s fabulous.",
          "score": 2
        },
        {
          "text": "Haha fishmonger she is a business woman and can earn alot. Dental assistant not much, she is not a qualified dentist, just the assistant. Of course better $",
          "score": 1
        },
        {
          "text": "Ok noted",
          "score": 1
        },
        {
          "text": "wasted, got tattoo ",
          "score": -33
        }
      ]
    },
    {
      "id": "t3_1rc5ha1",
      "subreddit": "SingaporeRaw",
      "title": "About 45,700 foreign visitors were refused entry into Singapore in 2025",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rc5ha1/about_45700_foreign_visitors_were_refused_entry/",
      "score": 39,
      "num_comments": 17,
      "created_at": "2026-02-23T10:37:48",
      "selftext": "[https://www.channelnewsasia.com/singapore/foreign-visitor-refusals-rise-2025-ica-checkpoints-security-immigration-5940476](https://www.channelnewsasia.com/singapore/foreign-visitor-refusals-rise-2025-ica-checkpoints-security-immigration-5940476)",
      "comments": [
        {
          "text": "&gt;ICA noted a case in December where two male **Indian nationals** who arrived at Changi Airport were found to possess forged Ministry of Manpower approval letters after they were flagged for further checks.\n\nour best friends again",
          "score": 40
        },
        {
          "text": "Nice nice. Good good. Well done.",
          "score": 12
        },
        {
          "text": "damn didnt know we did that",
          "score": 9
        },
        {
          "text": "Sinkies open leg policy with restrictions.",
          "score": 6
        },
        {
          "text": "Kongwee any of your hacker friend here",
          "score": 4
        },
        {
          "text": "The investments in better systems and enhanced screening process will pay for itself in the long run. Well done.",
          "score": 3
        },
        {
          "text": "Those who are already here as new citizens also should be reviewed. My noisy PRC neighbour also refused to cooperate after going to court multiple times on noise dispute, verbally threatened me, lied to the police, and other municipal offences (also warned multiple times). Should ban him too. Nuisance ah tiong.",
          "score": 3
        },
        {
          "text": "Give visa free some more la",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rc68eh",
      "subreddit": "SingaporeRaw",
      "title": "Wah i haven’t makan at McDonald’s in a long time, anyone saw this yet?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rc68eh/wah_i_havent_makan_at_mcdonalds_in_a_long_time/",
      "score": 40,
      "num_comments": 18,
      "created_at": "2026-02-23T11:13:07",
      "selftext": "",
      "comments": [
        {
          "text": "This post is an ad",
          "score": 16
        },
        {
          "text": "Pergormative",
          "score": 13
        },
        {
          "text": "Mehnonner biggest clientele is ahmad and siti",
          "score": 9
        },
        {
          "text": "I saw a lot at people's park mcd outlet all the tables are placed with these heartfelt lights",
          "score": 6
        },
        {
          "text": "wat is jus a light i dun git itttttttttt",
          "score": 4
        },
        {
          "text": "I saw em at bugis junction mcd last thursday, so nice looking.",
          "score": 2
        },
        {
          "text": "Virtue signaling nia",
          "score": 2
        },
        {
          "text": "So if it lights up at 12PM means?",
          "score": 2
        },
        {
          "text": "Nice!",
          "score": 1
        },
        {
          "text": "Very interesting ! I like what this does for the community.",
          "score": 1
        },
        {
          "text": "You got share table or not?",
          "score": 1
        },
        {
          "text": "Huh means wat? Normally if ppl buy food from\nMcd also can sit there and consume their breakfast wat",
          "score": 1
        },
        {
          "text": "Is just like priority seat. Can we light up priority seat to indicate can share too? So much gaslighting",
          "score": 1
        },
        {
          "text": "Not true. AI",
          "score": -9
        }
      ]
    },
    {
      "id": "t3_1rbr41h",
      "subreddit": "SingaporeRaw",
      "title": "Anyone felt the ground shaking",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rbr41h/anyone_felt_the_ground_shaking/",
      "score": 37,
      "num_comments": 40,
      "created_at": "2026-02-23T01:02:56",
      "selftext": "Or it's just me",
      "comments": [
        {
          "text": "Anybody in the north heard a booming kind of noise that went with the tremors?\n\n\nAlmost sounded like artillery or something like that ",
          "score": 36
        },
        {
          "text": "There was a shake 7.0 magnitude at Borneo side, recorded at 12:57am. I didn't feel it though.",
          "score": 21
        },
        {
          "text": "Yes, Spurs equalised.",
          "score": 19
        },
        {
          "text": "Advisory:\n\n[Updated at 1.13 am 23 Feb 2026] A 6.8 magnitude earthquake was detected in Borneo, approximately 1509 km ENE of Singapore or 100 km N of Kota Kinabalu at 12.57 am (Singapore Time) on 23 Feb 2026. No reports of tremors. Nil tsunami advisory.",
          "score": 14
        },
        {
          "text": "Fuck I thought i was gonna get heart attack, suddenly felt the whole building was shaking",
          "score": 9
        },
        {
          "text": "I did! I thought it’s just me 😲",
          "score": 6
        },
        {
          "text": "could heard booms in northeast side earlier, thought it was construction",
          "score": 6
        },
        {
          "text": "omg same, i thought i was hallucinating",
          "score": 5
        },
        {
          "text": "Be gentle on yourself",
          "score": 4
        },
        {
          "text": "No wonder I can’t sleep",
          "score": 3
        },
        {
          "text": "Same here. I felt tremors while I was asleep.",
          "score": 1
        },
        {
          "text": "was at north west and thought i was lowk tripping but heard boom boom boom also",
          "score": 1
        },
        {
          "text": "I heard a loud sound like a boom of sorts. Isit earthquake? Damn",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rc41mr",
      "subreddit": "SingaporeRaw",
      "title": "French girl praising singapore 😍",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rc41mr/french_girl_praising_singapore/",
      "score": 36,
      "num_comments": 25,
      "created_at": "2026-02-23T09:31:26",
      "selftext": "",
      "comments": [
        {
          "text": "Why never mention like I don't need to worry about getting a pickpocket at public transport.",
          "score": 42
        },
        {
          "text": "France, especially Paris, is a shitshow nowadays.",
          "score": 23
        },
        {
          "text": "Paris is so bad these days. It has the 3Ps. Piss, puke and pickpockets. It makes you want to shout the 4th P. Putain",
          "score": 19
        },
        {
          "text": "At least she is appreciative of what we offer here and understands the working culture here.",
          "score": 6
        },
        {
          "text": "Sounds like she is adapting well, especially the long hours at work.",
          "score": 5
        },
        {
          "text": "I wonder if she's working in a french company.\n\nHave a few ex colleagues who worked in French companies and the pace and response rate is French standard.",
          "score": 3
        },
        {
          "text": "The oz girl a few wks back was just saying lunch breaks in sg was sacred. Lol",
          "score": 3
        },
        {
          "text": "Having mee hoon kuey is the most local ol thing.",
          "score": 1
        },
        {
          "text": "Oh but the Oppies are not happy… they want “alternative voice” and ways of doing things different. Best if can just lie down on bed all day and have the reserves raided.",
          "score": 1
        },
        {
          "text": "Ok, good for her lor. Happy that she surviving.",
          "score": -7
        },
        {
          "text": "lj, which part of singapore she stay of course no need to fight with crowd for metro la.\n\nand last 4 years no delays? rubbish. so many breakdowns.",
          "score": -8
        },
        {
          "text": "Oui oui fromage croissant pain",
          "score": -10
        },
        {
          "text": "Oui oui bonjour monseur l, saperlipopette. La moutarde me monte au nez",
          "score": -10
        },
        {
          "text": "Missing the french girl",
          "score": -12
        },
        {
          "text": "It's true. Last time, Europe and USA might be the place to work.  \nBut after the WOKE culture took roots and the mass immigration (without scrutiny), their countries are mostly ruined.\n\nSingapore will be the global hub for the next decade!   \nwe just need to vacate more non-productive assets off to Johor to make space for talents and bring in the golden era. \n\nGovernment, please setup GLC hospital, education, elderly center over Johor with subsidized bus for Singaporeans transiting daily.\n\nMake Singapore Great Again! And of course, let elderly retired with dignity, they can get a large development to live in with the elder care facilities.  Basically Retirement Village (not homes) is very doable in Malaysia. Singapore tried once but failed coz the cost are too high.",
          "score": -12
        }
      ]
    },
    {
      "id": "t3_1rbkusp",
      "subreddit": "SingaporeRaw",
      "title": "Why amk got so many siaolang ah?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rbkusp/why_amk_got_so_many_siaolang_ah/",
      "score": 13,
      "num_comments": 49,
      "created_at": "2026-02-22T20:39:14",
      "selftext": "Go there walk 1h kena so many siaolang\n\nWalk into you bo chup\n\nGot one woman suddenly call me rudely like dunno wanna do what\n\nA lot of miserable looking ppl and post 65 and old ah beng ah lian types...damn rude type everyone call xiao di xiao mei instead of mr miss",
      "comments": [
        {
          "text": "ask lhl his area",
          "score": 33
        },
        {
          "text": "Amk is lowkey crazy like Yishun. Within a few years of moving in I've seen child stabbings, a madman fighting riot police in a dumpster and more.\n\nMost recently an elderly aunty stole a mango right infront of me. Before she slipped away into the shadows she shot me a piercing cold glare like warning me she'll stab me if I snitch. Never knew people could be so daring.",
          "score": 22
        },
        {
          "text": "what's so wrong about xiao di?",
          "score": 15
        },
        {
          "text": "No need go AMK. See in front of mirror can already.",
          "score": 14
        },
        {
          "text": "Why don't you head north of AMK to see a real show?",
          "score": 9
        },
        {
          "text": "Footpath outside uniqlo many PMA, PMD speeding and misuse.",
          "score": 6
        },
        {
          "text": "Who ask you always go around laughing at yourself hehehehehehe.",
          "score": 4
        },
        {
          "text": "It's the same people who voted for LHL, of course they're like that.\n\nParts of AMK are on par with Boon Lay in terms of dodginess.\n\nBut the area served by the Thomson East Coast line are decent (Except around Kebun Baru FC, that area is weird), probably because wealthy neighbourhoods are nearby.",
          "score": 4
        },
        {
          "text": "tot its Yishun the numero uno undisputed Land of Siao Lang?",
          "score": 4
        },
        {
          "text": "https://preview.redd.it/qmqndczcq2lg1.jpeg?width=436&amp;format=pjpg&amp;auto=webp&amp;s=285815c9d8d2baca9cdf3c5ed6c2731b6f1d8acd\n\n我 on duty",
          "score": 2
        },
        {
          "text": "Because some residents in AMK are running AMoK",
          "score": 2
        },
        {
          "text": "Hahah How is xiao di xiao mei disrespectful??? i like it when uncles aunties call me this cause means i look young 😁",
          "score": 2
        },
        {
          "text": "You will join that group soon in future.",
          "score": 2
        },
        {
          "text": "2 stops MRT stops to Yishun. 10 mins to IMH",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1rbl80l",
      "subreddit": "singaporefi",
      "title": "After modeling CPF, I modeled SRS withdrawal and here are some of my learnings",
      "url": "https://old.reddit.com/r/singaporefi/comments/1rbl80l/after_modeling_cpf_i_modeled_srs_withdrawal_and/",
      "score": 9,
      "num_comments": 11,
      "created_at": "2026-02-22T20:58:01",
      "selftext": "I’ve been modeling CPF LIFE payouts and recently started thinking more seriously about how SRS fits into retirement planning. Wanted to get your thoughts.\n\nhttps://preview.redd.it/hv7s773kl1lg1.png?width=1230&amp;format=png&amp;auto=webp&amp;s=00161ac62c7ccdd4ef6fb1ec17764546b6694334\n\nhttps://preview.redd.it/gj83e93kl1lg1.png?width=1199&amp;format=png&amp;auto=webp&amp;s=2ffe6a2cf3774144b61643aa90bffc827aca223b\n\nhttps://preview.redd.it/kd80183kl1lg1.png?width=1197&amp;format=png&amp;auto=webp&amp;s=1c6677fa8a1f43b07dbd5feb68b29c81fb3e320a\n\n**A few observations:**\n\n1. SRS seems powerful because withdrawals are spread over just 10 years. If structured properly, it can cover a meaningful portion of living expenses during that window.\n\nWould you plan to fully draw down SRS to zero over those 10 years? Or pace it more conservatively?\n\n1. The timing between SRS and CPF LIFE feels slightly misaligned. SRS penalty-free withdrawals start at 63, but CPF LIFE payouts begin at 65 (earliest). That creates a 2-year gap.\n\nWas this intentional policy design? Or just historical layering of schemes?\n\n1. Because of that timing difference, some retirement years feel more “secure” than others with SRS or CPF LIFE payouts reducing the need for investment drawdowns.\n\nPost-65 looks relatively stable under current policies. The real challenge seems to be retiring earlier (say 55) and bridging the 55–65 gap.\n\nWhich brings me to CPF OA.\n\nHow do you think about managing OA in retirement planning?  \n• Regular withdrawal?  \n• Lump sum withdrawal and invest externally?  \n• Leave it untouched as a conservative buffer?\n\nCurious how others are structuring this?\n\nSeparately, I built a small tool to model CPF LIFE and SRS projections while exploring these questions. If others are keen try to model their cashflows from CPF Life and SRS do let me know.",
      "comments": [
        {
          "text": "hi, can you share your model as a link? it's a bit hard to see how you modelled certain assumptions.\n\nalso why not CPF-IA investment above 20 K SGD into Amundi world UT or even UOB gld or something?",
          "score": 6
        },
        {
          "text": "SRS and CPF are separate schemes. Hence, there's no particular reason why SRS doesn't line up with CPF Life payout age. To me, CPF starts paying out from 55 (if one has more than FRS, which you likely would based on your previous post), hence, I see SRS as boosting retirement income from 62 with flexible withdrawals and then annuity payments from 72 (life annuities are not subject to the 10-year withdrawal window). \n\nDo note that you can withdraw investments directly e.g. equities.",
          "score": 3
        },
        {
          "text": "SRS allows you to retire the moment you are able to withdraw without penalty. This means 62 for some and 63 for others, provided you have enough based on your retirement needs which should be quite manageable (I.e 50k per annum). Smart thing to do is to spread out your SRS over the 10 year withdrawal period for most healthy people.\n\nFor people that want to retire even earlier you just need to have enough to last you from the day you stop working till your SRS kicks in. Example 350k invested with 6% return should fuel 10 years of 50k per annum spending.",
          "score": 1
        },
        {
          "text": "Keen to try out your model as I'm keen to try to project my cash flow situation past 55, and I have yet to find a proper tool that can help me, and I was planning on creating my own.\n\n\nDM me a link?",
          "score": 1
        },
        {
          "text": "Honestly, i think depending on how old you are, (assuming 35 years to retirement) CPF Life minimum age of payout is unlikely to be 65 by the time u retire.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rbjfiw",
      "subreddit": "singaporefi",
      "title": "New to Singapore - DBS SRS",
      "url": "https://old.reddit.com/r/singaporefi/comments/1rbjfiw/new_to_singapore_dbs_srs/",
      "score": 5,
      "num_comments": 40,
      "created_at": "2026-02-22T19:22:43",
      "selftext": "Hi there, new to Singapore. Move here has been super smooth and I look forward to working hard and contributing to society here. Since im not Singaporean, my company is paying me what they would pay a Singaporean into a CPF into an SRS account at DBS instead. I would like to put my money to work with US Stocks like GOOG and Irish domiciled ETFs like CSPX or VUAG. I haven't been able to figure out how to do that. Calling, visiting or even meeting with DBS has proven useless. They are interested in talking about selling me super high fee mutual funds or insurance products. I want to self manage and just buy low cost ETFs or stocks. According to my company, I am not allowed to use a different bank for the SRS.\n\n1)  I am told, I might be able to buy US stocks and ETFs in the SRS if I open a DBS Vickers account but no one can confirm for sure, is this the way? Any costs? Is there a better way?\n\n2) Can I move the money from DBS SRS to another SRS that's easier to invest in while keeping the DBS one open so that I can receive new money every month? If so, which bank? Any fees?\n\n3) Anything else I should be aware of? Or things to look out for?\n",
      "comments": [
        {
          "text": "The main thing to know is that your SRS account and your brokerage accounts are 2 separate things.\n\n  \nSRS = account where the money sits (think of it as any other bank account). There is no difference where this account sits. They all operate the same way.\n\n  \nBrokerage = account where you can buy stocks / ETFs. DBS Vickers is DBS's version of a brokerage account. The brokerage account provider and SRS account provider do not need to be the same. Also, do not use DBS Vickers for SRS investing as fees are ridiculous. What you can invest in depends on your brokerage account.\n\n  \nSo what you need now is to find a brokerage that can support SRS investing. The most common ones are POEMS and Stashaway. For Singapore, you generally can't find a good way to invest SRS funds into single stocks like GOOG but LSE ETFs are more easily accessible. Typical investments for SRS funds include the Amundi World Unit Trust (similar to SWRD) via POEMs and Amundi US Trust (similar to CSPX I believe) via POEMs. Note that these are Unit Trusts, not ETFs.\n\n\n\nStashway recently introduced a new product called ETF Explorer where you can buy ETFs directly via their platform at a 1 USD fee. You have access to ISAC, which is again similar to SWRD via this route.",
          "score": 8
        },
        {
          "text": "The DBS SRS account is just like a bank account. To invest the monies you link it with a brokerage account, this can be DBS Vickers but it doesn’t have to be. Other popular choices that have low cost ETFs are to use endowus or poems.",
          "score": 2
        },
        {
          "text": "there are 3 banks that allow SRS. DBS OCBC UOB.\n\nactually a lot of the information you are mentioning here is stated on the Iras website, please check that for more accurate information. most people here use it for tax savings as it is a deferred taxes scheme.\n\nmy post history yesterday, OCBC gave me some cash 50 bucks for creating and contributing more than 10 K into it. that was a promo, you can check if there's more promos like that, as far as I'm aware none exist for now.\n\nwhat some advice that has been given which is very sensible, is poems to buy MSCI world + emerging in the percentage of 89%+11% tho other options such as S&amp;P 500 funds that are unhedged exist too by S27. I think there's even a SGD hedged UTone launched by OCBC recently. Infinity U.S. 500 Stock Index Fund (SGD Hedged)\n\nGenerally the banks to invest has higher transaction costs and minimum sum commission than poems or endowus or whatever other brokerages, so most that do this method try to save fees by linkage to other external brokers.\n\nHappy to answer any questions, tho I find it funny that your company can credit into your srs account? Usually for us it salary goes into bank account then we contribute for tax savings.\n\nOther things to look out for is S&amp;P has been more or less flat since year to date.\n\nEmerging markets outperform in the last few months.\n\nYou can even buy physical gold which was the winner in terms of total growth adding div + etf growth under SGX:GLD",
          "score": 2
        },
        {
          "text": "If you want to invest in S&amp;P500 ETF, use an SRS broker to buy S27; it's the literal SPY with minor differences in price/spread due to lower liquidity. If you're buying Mutual Funds (we call them Unit Trusts here), then use a fee-free platform like Dollardex (the oft recommended Endowus charges obscene platform fees).",
          "score": 2
        },
        {
          "text": "I have endowus and link to my SRS account so i can just auto deposit and invest in money market funds and etfs",
          "score": 2
        },
        {
          "text": "You cannot buy individual stocks on other indexes using SRS . Hence google is not possible. But you can buy funds , ETFs, local bonds or invest into SRS. All the proceeds will be accumulated in SRS account itself",
          "score": 1
        },
        {
          "text": "Besides separating the DBS SRS account conceptually from the brokerage or investment platform, which others have explained, the key here is that SRS investing is restrictive and the only stock exchange you can interact directly with is the Singapore stock exchange (SGX). \n\nYou cannot buy individual US stocks directly at all.\n\nFor index funds, you can either buy S27 which is SPY listed on SGX, or it’s easier to buy unit trusts (aka mutual funds) through Poems or Endowus. It has recently also become possible to buy ISAC (and IVV for S&amp;P500 but that’s US-domiciled) through Stashaway ETF Explorer in SRS for $1 transaction fee. This might be the lowest fee SRS method for a global index fund.",
          "score": 1
        },
        {
          "text": "Forgot to mention: I read the whole wiki and couldn't find anything on SRS specifically. Thanks again",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1rbdepf",
      "subreddit": "singaporefi",
      "title": "OCBC 360 Insure bonus",
      "url": "https://old.reddit.com/r/singaporefi/comments/1rbdepf/ocbc_360_insure_bonus/",
      "score": 2,
      "num_comments": 1,
      "created_at": "2026-02-22T13:26:25",
      "selftext": "Hi, does anybody know if the Great SP qualifies for the insure bonus under the single premium category. Quite a few products are listed there and I'm not too sure if this particular product qualifies",
      "comments": [
        {
          "text": "No it doesn't.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rbnij7",
      "subreddit": "singaporefi",
      "title": "Deferred Income Assessment (DIA) for BTO",
      "url": "https://old.reddit.com/r/singaporefi/comments/1rbnij7/deferred_income_assessment_dia_for_bto/",
      "score": 0,
      "num_comments": 1,
      "created_at": "2026-02-22T22:41:11",
      "selftext": "Hi everyone, just wanted to know if any of you have a better picture for this as I am confused on the DIA for BTO\n\nIf I have officially graduated in Oct 2025 but have been working since June 2025. Will I still be eligible for this income deferment if I were to re-apply for my HFE this year by June 2026?   \n  \nI understand that this deferment is based on 12 months after the applicant has graduated. But if I have been working before this official graduation, will I still be applicable for it?\n\nAnd as a side note, are there any tips and tricks to what to look out for as a first time BTO buyer? \n\nThank you! :)",
      "comments": [
        {
          "text": "But if I have been working before this official graduation, will I still be applicable for it? &lt;-- yes can, at the flat selection appointment you get ready to give them your graduation certificate (make sure this is a full-time course, part-time degree is not counted). If your graduation cert dated Oct 2025, you have graduated less than 12 months ago as at the point of HFE application in Jun 2026, so yes you can qualify for DIA.\n\nEh but why apply HFE in Jun 2026 de ah? I thought next BTO launch in Jun itself? Must apply HFE by 15 May 2026 de lei",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rc2nac",
      "subreddit": "singaporefi",
      "title": "If i want to hit coastFI, should i invest 80-90% of my salary into investments since i have already saved up my rainy day funds?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1rc2nac/if_i_want_to_hit_coastfi_should_i_invest_8090_of/",
      "score": 0,
      "num_comments": 12,
      "created_at": "2026-02-23T08:29:14",
      "selftext": "I have mortgage to pay but i realized that i spend average around 2k max every month. I want to just coast in life because i am dragging my feet to work everyday and i don't know when i might just break at work and call it quits. But before i do that, i want to know if i have enough ammo.\n\nIs it wise? And how much is a good and safe benchmark.",
      "comments": [
        {
          "text": "You expect others to read your mind on your income, expenses and age/timeline?",
          "score": 21
        },
        {
          "text": "You no share any info how you want ppl to comment?",
          "score": 21
        },
        {
          "text": "Apart from the extreme lack of IMPORTANT information...\n\n1. If you quit, is there any other income to supply the rest of your lifestyle?\n2. If yes, how do your investments look like if you invest the difference into your existing portfolio and extrapolate the value till retirement age.\n3. Is this amount at your retirement age in line with SWR guidelines or is it sufficient?\n4. Are you sure you've accounted for your retirement expenses properly? Theres kids and insurance and stuff maybe as well...\n\nAnyway, im guessing that since you didnt provide important information, you probably didnt think too deep / been in the game for so long. So the answer is probably not.",
          "score": 7
        },
        {
          "text": "Yes invest all leftover funds. If you have 80-90% leftover, invest 80-90%. ",
          "score": 3
        },
        {
          "text": "No",
          "score": 2
        },
        {
          "text": "Are you saying that 2k spending is 10-20% of your salary? And the remainder 80-90% is free to invest? Then invest lor. Invest as much as you can bear. ",
          "score": 2
        },
        {
          "text": "Yes u should invest, yes u have enough ammo",
          "score": 2
        },
        {
          "text": "No comments about whether you are ready to coast fi or when. But the answer to the qn in the tagline is:\n\nYes if you have\n- also covered yourself with hospitalisation insurance\n- rainy day fund can cover potential retrenchment time frame\n- no short to mid term (within 3-5 years) large spending needs like housing down payment, weddings, renovation, kids\n- accounted for non monthly spends like travel, gifts, replacement of items that can be costly",
          "score": 1
        },
        {
          "text": "Good idea.",
          "score": 1
        },
        {
          "text": "What's your definition of CoastFI in your mind or are you just asking for 'permission' to quit one day?\n\nStart with worst case scenario. If 80-90% goes into investment and let's say we go through a 10 year crash cannot withdraw, then after you quit, your 10-20% liquid can pay mortgage? Can support lifestyle? Can last until your last day or until you find next job or until market recover to sell and retire off?",
          "score": 1
        },
        {
          "text": "What are your other options?",
          "score": 1
        },
        {
          "text": "I was able to do this when I was single. If you can save a high rate do it! \n\nSeparately try to find a different job",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1rbtm4z",
      "subreddit": "singaporefi",
      "title": "Remember Lehman?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1rbtm4z/remember_lehman/",
      "score": 0,
      "num_comments": 7,
      "created_at": "2026-02-23T02:35:50",
      "selftext": "Be careful kids, when institutional dumps retail always gets the full brunt first ",
      "comments": [
        {
          "text": "I can one up you, remember Enron?",
          "score": 8
        },
        {
          "text": "Remember the tulips",
          "score": 4
        },
        {
          "text": "From what I can tell, this is skittish retail investors dumping (and institutional smelling blood in the water and trying to buy over the loans with discount). It's not institutional dumping first. 1.4 billion was sold to institutional investors, kind of the opposite of what you're saying. \n\nSo something like the Chocolate Finance mini-crisis where less savvy newbies got freaked out (by influencers and gossip), not really understanding that instant liquidity should not even be the norm for short-term bond funds, then CF had to pause withdrawals. ",
          "score": 3
        },
        {
          "text": "Remember the Great Depression?",
          "score": 2
        },
        {
          "text": "Look at RAMLH.\n\nThat's the high yield spread.  If there's fear of contagion, it will spike.  Just like it did before 2008.  Right now, it's way below historical average, i.e. no concern.",
          "score": 2
        },
        {
          "text": "LFG",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rbohwc",
      "subreddit": "singaporefi",
      "title": "Ahlong",
      "url": "https://old.reddit.com/r/singaporefi/comments/1rbohwc/ahlong/",
      "score": 0,
      "num_comments": 18,
      "created_at": "2026-02-22T23:21:50",
      "selftext": "dont know if this the right place to ask but imma js shoot anyways... Hi everyone, I really need some advice and pls don’t judge me too hard. I’m currently in quite a bad situation, I owe money to 3 different ah long. It started with one small loan because I was short of cash and thought I could pay back fast, but interest snowball like crazy. Then I panic and stupidly borrow from another one to cover the first, and now it become 3. I know it’s my own fault, I damn regret already. They keep calling, texting, threaten to come find me , I haven’t never told my parents because my relationship with them was never stable and i always act on my own, but the stress is killing me. I cant sleep properly and everyday Im scared they splash paint or harass people around me. I’m trying to work and save but the interest keep increasing until I feel like no way out. Has anyone been through this before?  I really want to settle properly and stop this cycle. Any real advice appreciated, thanks. 🙏🙏",
      "comments": [
        {
          "text": "are they unlicensed? verify on registry of moneylenders list. if so, call the police. if they are legal, credict counselling singapore ",
          "score": 10
        },
        {
          "text": "Honestly what can they do tho apart from threatening you? Let them come and tip of the police. They will be arrested immediately upon trying to vandalise your property right? Or harassment / attempted arson?   \nSo your loan become a write off  ",
          "score": 4
        },
        {
          "text": "I mean… u borrowed money… then don’t want return and now call the police on them. Not sure if it will end nicely though.",
          "score": 3
        },
        {
          "text": "Ah long means illegal moneylender? Call the police on them.",
          "score": 2
        },
        {
          "text": "Call police and if they all get caught means you don’t need pay anything back",
          "score": 2
        },
        {
          "text": "If unlicensed just call the police and don't ever pay them a single cent. They will just keep harassing u regardless u pay or not. \n\nThen buy a security cam and put outside ur door. Capture anyone trying to do funny things outside ur house.\n\nStay safe and I wish u all the best",
          "score": 1
        },
        {
          "text": "Arrange a time to pay them, then before they come. Call the police",
          "score": 1
        },
        {
          "text": "Do not pay the Ah Longs, if you do, they will just come and squeeze you for more. Ignore them and just ride out whatever harassment they send your way. Soon enough they’ll run out of runners to disturb you once the police catch enough runners.",
          "score": 1
        }
      ]
    }
  ]
}