{
  "schema_version": "raw_scrape_v1",
  "report_id": "2026-02-09",
  "scraped_at": "2026-02-09T12:53:10.567908",
  "subreddits": [
    "singapore",
    "askSingapore",
    "SingaporeRaw",
    "singaporefi"
  ],
  "total_posts": 38,
  "total_comments": 473,
  "posts": [
    {
      "id": "t3_1qz6kvu",
      "subreddit": "singapore",
      "title": "Body of girl, 6, who died in Chinatown car accident repatriated back to Indonesia",
      "url": "https://old.reddit.com/r/singapore/comments/1qz6kvu/body_of_girl_6_who_died_in_chinatown_car_accident/",
      "score": 632,
      "num_comments": 229,
      "created_at": "2026-02-08T19:26:47",
      "selftext": "",
      "comments": [
        {
          "text": "Hope the driver gets the heavy punishment that she deserves.",
          "score": 534
        },
        {
          "text": "Heart breaking 😢",
          "score": 316
        },
        {
          "text": "may she never have a good day in her life from here on",
          "score": 270
        },
        {
          "text": "We need to get foreigners to take a proper driving test and not allow them to just convert so easily. Especially when they come from countries with less stringent test requirements like India, usa and Malaysia.",
          "score": 258
        },
        {
          "text": "Authorities better handle the murderous culprit driver to give proper justice. \nIt’s a message SG is sending to the world about safety of Tourists.",
          "score": 222
        },
        {
          "text": "How’s the wife, healthy enough to go for her daughter funeral?\n\nIf not she, I think she’s might be anguished not able to attend and give her farewells :(",
          "score": 93
        },
        {
          "text": "This demands jail time to be handed down if they want to jail Edmund Chen when he didn’t kill anyone.",
          "score": 69
        },
        {
          "text": "My condolences to the deceased at this moment of grief. Regardless of where they came from, no words can express the horrors of losing their only child before their prime.\n\nWhile the offender must be punished to serve as a strong deterrence against poor driving conduct, our laws must be strengthened to enforce good and courteous driving conduct in our roads. We should never give the excuse that there are only a minority of bad drivers out here; if you are a courteous driver who abide by traffic laws and give way, these enhanced penalties should not impact you in any way. Accidents do happen, and that’s why we have no minimum sentencing for the courts to exercise leniency. It is only the maximum limit that matters for us to apply to the most recalcitrant and undesirable drivers out there.",
          "score": 65
        },
        {
          "text": "Somehow the news in Singapore very slow. Arrested on the 6th, but only show on the news today. Victim already buried today, only now reported repatriated.\n\nIndonesian news already reported victim buried 6 hours ago\nhttps://lifestyle.sindonews.com/read/1674841/166/suasana-duka-iringi-pemakaman-sheyna-bocah-6-tahun-korban-tabrakan-di-singapura-1770530565",
          "score": 54
        },
        {
          "text": "Stop sign means = Full stop before stop line. Check. Go.",
          "score": 39
        },
        {
          "text": "Rest in peace little one. That perpetrator needs maximum sentence because of recalcitrance. She can and will do it again.",
          "score": 16
        }
      ]
    },
    {
      "id": "t3_1qzc2na",
      "subreddit": "singapore",
      "title": "PM2.5 is at 151 right now",
      "url": "https://old.reddit.com/r/singapore/comments/1qzc2na/pm25_is_at_151_right_now/",
      "score": 499,
      "num_comments": 74,
      "created_at": "2026-02-08T23:39:11",
      "selftext": "",
      "comments": [
        {
          "text": "I'll never forget that crazy time period back in 2013 where the daily PSI was like 250-300, outdoors was basically whitewashed and the smell was so bad.",
          "score": 255
        },
        {
          "text": "It’s getting quite bad, my eyes are getting teary and throat’s scratchy.",
          "score": 202
        },
        {
          "text": "That's wierd. Why only central area, of all places.",
          "score": 75
        },
        {
          "text": "OMG, I was scared to smell something burning at my house, sniffed everywhere but didn't find anything, and then I realized it was the haze!",
          "score": 73
        },
        {
          "text": "the real shocker should be that NEA website says it's \"normal\" levels",
          "score": 64
        },
        {
          "text": "Who should we thank this time",
          "score": 46
        },
        {
          "text": "For those saying reading is broken, im typing this with my eye itching and smelling burning in my AIRCON ROOM. I stay in tpy/bishan.",
          "score": 41
        },
        {
          "text": "Only 1 station reads 151. Could mean that station is broken.\n\nEdit: not broken as people said they were affected by air quality in central area.",
          "score": 34
        },
        {
          "text": "been smelling smoke/haze here in CCK this weekend",
          "score": 26
        },
        {
          "text": "why the fuck is myENV app showing 39 for central region 1hr pm2.5 then? I can smell it when i open the windows so 151 sounds about right.",
          "score": 20
        },
        {
          "text": "That's the MacRitchie reservoir? Why would only that place be 151? The place on fire ah",
          "score": 16
        },
        {
          "text": "Smoke / Haze smell appeared in the west at 7pm just now. Quite strong too.",
          "score": 13
        },
        {
          "text": "What's happening in central Singapore???",
          "score": 9
        }
      ]
    },
    {
      "id": "t3_1qz2n5q",
      "subreddit": "singapore",
      "title": "Which form of public transport is really the most usable?",
      "url": "https://old.reddit.com/r/singapore/comments/1qz2n5q/which_form_of_public_transport_is_really_the_most/",
      "score": 469,
      "num_comments": 144,
      "created_at": "2026-02-08T15:28:32",
      "selftext": "Another new post from shopping mall guy that I thought was a pretty good comparison. The spoiler in this one is I thought the two images in the cover were comparing bus to MRT, but I realised they are actually supposed to be ||lift doors||.\n\nQuite a good take that I sent to many of my friends. Some of them still feel that we should subsidise cars on needs basis but better understand what public transport activists are fighting for now.",
      "comments": [
        {
          "text": "Who tf resists improvements to public transport?",
          "score": 343
        },
        {
          "text": "I find it pretty cool that our urbanist/transport community is growing with this page entering the scene, and with Tehsiewdai (Vareck Ng) following this page, I think they have his \"approval\".\n\nI don't fully agree with their points, and I know that the Singapore urbanist/transport community is divided into factions who don't always agree with each other, but a bigger community is better than none lol.",
          "score": 153
        },
        {
          "text": "actually if ministers dont have 2 cars and take public transport i think complains would be lesser as we are all in this together.",
          "score": 107
        },
        {
          "text": "Great take. Making public transport cost money is stupid. If you are forcing poor people to take public transit by making cars prohibitably expensive, the only alternative should be free.",
          "score": 49
        },
        {
          "text": "The previous post was sorta interesting but this post is just messy.\n\nIdeas trying to be conveyed on each page is not clear despite purportedly trying to answer the questions on the first page. I know you're not the writer but do schools not teach people how to write anymore? PREP (Point Reason Example Point) is a simple way to structure a paragraph. And, don't randomly bold things.\n\nTo the questions, is there anyone in the transport sector, especially someone from the Govt, arguing in favour of cars vs public transport investment? At the policy level, Govt has been clear it's in favour of car lite. If execution doesn't match that, call that out but don't need to relitigate a policy point you're essentially agreeing with the Govt on.\n\nEdit: my post came out more critical than I intended. I do want to give kudos to the writer for putting effort into pushing people to engage with the authorities on this so voices on the ground can be heard. It's certainly more than what I'm doing lol.",
          "score": 40
        },
        {
          "text": "I just don’t like how they keep increasing fares, like if you provide better services like bus with more seats, better routing,more buses to reduce waiting time etc,i would say increase is somewhat okay, but then u have bus anyhow coming sometime 5-10min earlier or sometime 5-10min later, somemore keep changing the buses to reduce seats and have more people stand, just for “cost savings” then u still increase prices of fares? U increase fares got change anything to benefit users meh, more breakdowns isit?",
          "score": 36
        },
        {
          "text": "I think MRT doors should close a few seconds earlier per station instead of idling per stop without anyone boarding. It would save a few minutes per line.",
          "score": 32
        },
        {
          "text": "What every sg transport users actually wants:\n\n-when mrt breakdowns, boss will understand especially when they drive a CAR. And dont say shit comments like come in early lah and still fault you. What if come early still breakdown?\n\n-when transport price hike, those who have transport allowance  can adjust increase to match the price hike?",
          "score": 27
        },
        {
          "text": "IMO weather is a factor. There’s always a risk of downpour or scorching heat. I’d walk a lot more or take public transport if those were non factors",
          "score": 24
        },
        {
          "text": "The further you are from your destination, the worse public transport tend to get. The difference in commute time widens. Unless something is done to address it, people will continue to think that cars are better (because they are).\n\nThen, people will get angry as public transport quality declines.\n\nAs of now, the main reason stopping people from far flung areas switching to cars is the high cost, not because it is not logical (it is in fact very logical for you to want to switch, if you can afford it).\n\nThat and people living further out tend to be less wealthy.\n\nIn other countries and cities, jams and heavy traffic forces the car option to be equally shit, so there is no “alternative”, whether you can pay your way out or not.\n\nHere, people are priced out by design. Urban planning and car policies forces non-wealthy citizens into public transport and remove alternatives.\n\nThe barrier is not because people like public transport! It is because although someone can take 1/3 the time of their usual (peak) commute to travel by say taxi, it is financially unfeasible because it costs almost $100 a day to do so for some areas.\n\nThe layout of our country forces poor people to the far out area, concentrating the relatively wealthy people around the central core.\n\nThis made it seems like we are controlling car usage by forcefully locking in people who are more likely to switch away from public transport by pricing them out out private transport.\n\nThen, the wealthy people who do drive have less incentives to switch from cars, because they are not going to switch to the public transport option anyway even if it is competitive. Their trade off was never really about commute time, so how can you incentivise them out of cars even if you built a MRT station in their front porch?\n\nThen, the non-wealthy people who still overcame high cost to buy cars will try to maximise their value, so they will keep using and get pissed if the value of using cars is infringed.\n\nPrice them out, they get angry because the alternative really sucks and you are forcing them out without giving them a fair alternative. To cater to them, the alternatives need to be good (as direct and point-to-point, which runs counter to LTA’s hub-and-spoke approach).\n\nIn the end, trying to incentivise “car-lite” is doomed. For car-lite policies to work, people need to have cars vs public transport as their core question. But this seems to be not the case!\n\nAs I said, people who uses public transport are forced to. A large segment who do not does so by choice and could afford it. A smaller segment can be coaxed out but the way to do it contradict current policy directions.\n\nSo where is the large segment that policies can work on and incentivise change? If they do not exist, then how can existing policies work?\n\nUnless LTA abandon efficiency-maximisation and allow more point-to-point (direct) options in public transport, car will be king and users will still fight tooth and nail against public transport.\n\nExpress trains and buses are probably some of the things that are needed to coax the car users who could be coaxed.\n\nI am sure users are willing to pay more to a degree for more direct public transport options. And by direct I do not mean the current express bus system. Those sucks because of lengthy non-express sectors and limited routes/timing, which means you are often just paying with money and time for a seat, if it is even an option for you.",
          "score": 17
        },
        {
          "text": "I'm all for public transport improvements (I own a car and drive). Heck, if public transport becomes so good that car owners choose to not drive, it is a win win situation. But public transport is not there yet. It is better than most countries but still not good enough. Due to the last mile and other transition factors.\n\nI wrote to LTA to suggest some options for a bus service. You see my work place is like 5 mins away (by car, about &lt;5km away and about &lt;3km from the interchange) but I need to take 3 buses to get to work (1 to interchange, then 1 from interchange to 2 bus-stops away, then the last bus is another 2 bus stops after that). I researched the route and discovered that there 5 buses from the interchange heading so close to the bus stop i need to alight at, but all turn off (1 bus stops before) reaching my destination. Note that 5 bus stops in total are all quite far apart as there are along the PIE. \n\nI asked LTA to consider having a direct bus to my work location bus stop from the interchange as based on observations, hundreds take the same route as myself every morning. I see the same faces at the interchange. LTA said no.\n\nI understand that the MRT can't cover every gap, but at least buses can. Then to my horror, I discovered I do have a direct bus from my home bus stop to my work location. But you know what? Before it reaches my work bus stop, it goes on express not stopping at my work bus stop. Wow, amazing, striking 4D would be easier. \n\nLooks like I will eventually need to drive to work which is such a waste as the distance is so near. Taking the bus is hectic (For a 60+ year old) as the last bus is always crowded and it often is late due to jams on the PIE. Going home is no ride in the park as well and it gets worst when it rains. ",
          "score": 11
        },
        {
          "text": "trains are by far the most efficient way to move people.  \nhad we built extra tracks back when MRT was still new, we could have reduced the advantages of a car while improving reliability.  \nthose extra tracks are crucial for Express train services.\n\nwe could have trains run on alternate tracks while some segments undergo maintenance **during the day,** rather than trying to squeeze it all into the few hours in the middle of night.  \nby moving large number of people to a destination faster, you would rely less on bus services and a car would have lesser appeal (because cars need to stop at traffic lights)\n\nconcept of express trains needs some truly forward thinking people.  \nbut back then key members were already resistive to MRT itself.  \nasking to approve doubling space needed and  continuous upkeep of tracks was even harder.  \nwe could have allocated more space around track in case of future construction  of 3rd and 4th tracks. but they rather build  houses as close as possible to the tracks, so that we could maximize population numbers.",
          "score": 11
        },
        {
          "text": "A 特急/快速 train option would be nice but the amount of revamp required to achieve that is huge. 2050?",
          "score": 10
        },
        {
          "text": "&gt;Why do so many people resist improvements to public transport?\n\nVery interested to see the stats /studies that shows this because this is the first time I've come across this argument, but often hear and read about the opposite.",
          "score": 8
        }
      ]
    },
    {
      "id": "t3_1qzretu",
      "subreddit": "singapore",
      "title": "A guide on how to 'siam' your pesky relatives for upcoming CNY",
      "url": "https://old.reddit.com/r/singapore/comments/1qzretu/a_guide_on_how_to_siam_your_pesky_relatives_for/",
      "score": 351,
      "num_comments": 38,
      "created_at": "2026-02-09T09:56:48",
      "selftext": "",
      "comments": [
        {
          "text": "Me: *laughs and cries in having to go overseas for work trip, super effective in siaming them*",
          "score": 51
        },
        {
          "text": "ROFL the agent persona.............. they sure siam u",
          "score": 49
        },
        {
          "text": "I tried the strat on slide 1 but my younger relatives called me uncle instead of korkor (big brother) and I turned to dust immediately.",
          "score": 38
        },
        {
          "text": "Realistically this happens to large extended families, or when all relatives all gather in one spot and you only see each other for that time of the year.\n\nFor small ones like mine with regular visitations (like I visit my relatives/cousins every other week or so) they already know and are up to date about stuff in my life, so CNY is mostly a peaceful lunch and chill out session",
          "score": 36
        },
        {
          "text": "❤️your comics. Really well made and nice",
          "score": 34
        },
        {
          "text": "Daiya is zeh zeh, not aunty meh?\n\n\n*runs away*",
          "score": 17
        },
        {
          "text": "Growing up was realising my relatives were horrible at conversing",
          "score": 16
        },
        {
          "text": "That time of the year again huh lol\n\nTbh tho I never understood the misery over nosy relatives, unless they are downright rude or condescending. They can't hurt you because they don't have any power over you. Just laugh it off, they're mostly well-meaning anyway.\n\nLook at it this way - you take far FAR worse shit from your manager/clients/colleagues every damn day, and they are definitely not well-meaning. Being asked when you're getting married is the least of your worry.",
          "score": 14
        },
        {
          "text": "So Daiya, when you getting married? :p",
          "score": 10
        },
        {
          "text": "My best strategy, appear only for the first day for reunion dinner, rest of the day either go overseas or stay at home.\n\nOnly works if your relatives have a major hub to gather (ah gong/ah ma place), and your home (parents place or your own place) don’t have much visitors.",
          "score": 8
        },
        {
          "text": "Run away with cousins to get \"coffee\", spend all afternoon at Starbucks",
          "score": 4
        },
        {
          "text": "Or me, be so absent minded that they don’t want to try",
          "score": 3
        },
        {
          "text": "That is 1 fine comic ! 👍👍👍",
          "score": 3
        },
        {
          "text": "GOATED art zeh zeh, keep it up, always love to see relatable art pieces like these :&gt;",
          "score": 3
        },
        {
          "text": "![gif](giphy|TR996IaHtmDi1x98zW|downsized)",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1qz7mge",
      "subreddit": "singapore",
      "title": "Haze feels choking bad for me today",
      "url": "https://old.reddit.com/r/singapore/comments/1qz7mge/haze_feels_choking_bad_for_me_today/",
      "score": 242,
      "num_comments": 49,
      "created_at": "2026-02-08T20:25:11",
      "selftext": "Is it just me? Today’s haze is extremely much worse for me. Throat, nose and eyes are all suffering. \n\nI recall that in 2013 or 2015 there was school closure even due to the haze. Anyone remember that? \n\nAnyone has good home remedies to recommend to soothe throats, eyes or noses? The air purifiers are all on already but it’s still bad ",
      "comments": [
        {
          "text": "Highest pm2.5 so far despite how bad it smells is only moderate ~50-60. Dunno why got so big disparity. Headache all day with\n\nAs of right now moderate all across sg 55-64, worst central",
          "score": 134
        },
        {
          "text": "I stay in the East and today is the rare time where other parts of Singapore can smell the haze, but my area can't",
          "score": 124
        },
        {
          "text": "Yall too young to remember when school got cancelled due to haze. Also, cant even see the SG skyline.\n\nIm in the east right now and its all clear here. But  I live central east and it was very irritating and itchy last couple weeks.",
          "score": 75
        },
        {
          "text": "https://aqicn.org/city/singapore/central/\nIt was over 300 iirc that time",
          "score": 33
        },
        {
          "text": "I was doing sentry (army) during that haze, 500+... Even N95 masks we were choking and had burning eyes. Did rotations of only 30 mins due to the haze.",
          "score": 19
        },
        {
          "text": "Fuck me im at amk and and stay higher than 10 stories, its impossible to avoid, now the winds are strong too.\n\nIts rancid. Stay safe everyone",
          "score": 18
        },
        {
          "text": "DIFFLAM - Herbal Mouth Spray with Natural Extracts (with Propolis + Echinacea) is my go to the moment I have an itchy throat. Used to get sore throats quite regularly but now barely every goes to the next stage",
          "score": 14
        },
        {
          "text": "Yeah it's bad. Trying to recover from a cough and the haze is just making it worse.",
          "score": 10
        },
        {
          "text": "tbh i could 'smell the haze' a few times when I was in sg recently (december/january) but then I check and it says normal so yeah maybe I wasn't hallucinating.",
          "score": 10
        },
        {
          "text": "I'm not gonna lie, I didn't even realize there was haze. The air didn't smell different at all to me these past few days.",
          "score": 10
        },
        {
          "text": "same here it smells so bad, like when i am at home. its worse when i walk out of home....",
          "score": 9
        },
        {
          "text": "Central is bad. Once you step off the bus it hits you. I hope it dies off before CNY",
          "score": 8
        },
        {
          "text": "Definitely smelling the haze when I was out today. I think it was in 2013, I rem the haze was so bad I cant even see MBS from OUE bayfront. But its not something new, in the 90s, I vaguely rem there was a sch closure if my memory never fail me ",
          "score": 7
        },
        {
          "text": "I can smell it inside the house.",
          "score": 5
        },
        {
          "text": "Im having dry and sore throat so its defo not 60PSI for PM2.5",
          "score": 5
        }
      ]
    },
    {
      "id": "t3_1qzpxtg",
      "subreddit": "singapore",
      "title": "Gem alert in parliament",
      "url": "https://old.reddit.com/r/singapore/comments/1qzpxtg/gem_alert_in_parliament/",
      "score": 183,
      "num_comments": 12,
      "created_at": "2026-02-09T08:43:06",
      "selftext": "",
      "comments": [
        {
          "text": "Was he planning to quote from the book or something",
          "score": 54
        },
        {
          "text": "This is me reading the book before being asked to do a book review lol\n\nP.s The book title is \"A matter of duty\" by Tan Chin Tiong, I edit until pic quality cmi",
          "score": 43
        },
        {
          "text": "Did he use his culture voucher?",
          "score": 28
        },
        {
          "text": "Walau eh. Kids are banned from bringing phones to class because they are distracting, then as an adult, as a leader, I expect much better from you in having self discipline.",
          "score": 9
        },
        {
          "text": "wats d real book behind d book cover!🤣🤣",
          "score": 6
        }
      ]
    },
    {
      "id": "t3_1qz2lgr",
      "subreddit": "singapore",
      "title": "1 in 3 employers of foreign domestic workers don't give regular weekly rest days: NTU student survey",
      "url": "https://old.reddit.com/r/singapore/comments/1qz2lgr/1_in_3_employers_of_foreign_domestic_workers_dont/",
      "score": 186,
      "num_comments": 39,
      "created_at": "2026-02-08T15:25:46",
      "selftext": "",
      "comments": [
        {
          "text": "singaporeans complain bad bosses but they ownself also a bad boss",
          "score": 203
        },
        {
          "text": "My Mil can't bear to see my helper rest. Imagine this kind of boomer mindset! They expect them to work like robots for some reason!",
          "score": 128
        },
        {
          "text": "Yeah my helper told me the neighbours helper gets the mandatory one day a month off but has to stay at home during that time",
          "score": 103
        },
        {
          "text": "any1 surprised at result? bodoh or buat bodoh?",
          "score": 75
        },
        {
          "text": "I’d wager a guess that these same employers bitch and moan about their own bosses, how they have poor WLB, low salary etc all while exerting the power they lack as employees onto their FDW.",
          "score": 45
        },
        {
          "text": "Many Helpers also want to forego their rest days to make extra. My helper is one of them, and she goes on 1 Sunday a month. She is compensated for the rest of said days",
          "score": 38
        },
        {
          "text": "My folks' helper said she doesn't want to go out because it'll cost her money so she just hangs out at home and the folks don't ask her to do anything 😆",
          "score": 33
        },
        {
          "text": "U think ridout helpers would go party on Sunday?\n\nThen who cooks dinner for the family and does house work in the palace?",
          "score": 20
        },
        {
          "text": "This also counts those that agree to no off days for additional pay right?",
          "score": 9
        },
        {
          "text": "Insane society. Shameless and classless",
          "score": 6
        },
        {
          "text": "If that's based on the word of the employer, then can we assume the number is closer to 2 in 3…?",
          "score": 3
        },
        {
          "text": "Should distinguish between those that voluntary give it up vs actual abuse . You might find 99% are voluntary (they get extra money it's legal). Yes other asean countries are really poor they have people willing to do this .",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1qz4s6k",
      "subreddit": "singapore",
      "title": "Tourist crowds stabilise at NUS and NTU",
      "url": "https://old.reddit.com/r/singapore/comments/1qz4s6k/tourist_crowds_stabilise_at_nus_and_ntu/",
      "score": 154,
      "num_comments": 35,
      "created_at": "2026-02-08T17:38:48",
      "selftext": "",
      "comments": [
        {
          "text": "One good thing about being in SIT/SUSS is that no tourist is gonna go there ",
          "score": 180
        },
        {
          "text": "Stabilise? Is that meant to sound reassuring?",
          "score": 112
        },
        {
          "text": "Dun stupid la obviously the main bulk of tourists are from mainland china and during this period most if not all of them will be back in china.\n\n\nIf that is what they meant by stabilize, they're gonna be in for a rude awakening after this festive period.",
          "score": 64
        },
        {
          "text": "&gt; an incident in which a tourist allegedly took a meal meant for students during a residential college orientation.\n\nF*cking locusts.",
          "score": 27
        },
        {
          "text": "stabilise but i saw a group of more than 100 tourist walking together in ntu just last week?",
          "score": 13
        },
        {
          "text": "Validated by???",
          "score": 6
        },
        {
          "text": "Only in Singapore people go tour universities while on holiday. Seriously, are they getting money out of this? It's unusual to tour universities like some place of attractions like that.",
          "score": -2
        }
      ]
    },
    {
      "id": "t3_1qz33tp",
      "subreddit": "singapore",
      "title": "NParks replaces casuarina trees on Coney Island, but expert says move could improve biodiversity",
      "url": "https://old.reddit.com/r/singapore/comments/1qz33tp/nparks_replaces_casuarina_trees_on_coney_island/",
      "score": 90,
      "num_comments": 33,
      "created_at": "2026-02-08T15:56:59",
      "selftext": "",
      "comments": [
        {
          "text": "Some of the comments here and elsewhere are an obvious example of ecologically illiteracy.\n\nWe're talking about an invasive tree species that has taken over so much of our secondary woodland and scrubland, as well as a tree species that while native, has dominated the habitat to the point that it has effectively formed a monoculture. These can have negative impacts on the establishment of other native plants, affecting transition to a mature coastal forest that can support more species. Removing them and growing native plants to speed up succession, including some that are classified as locally threatened? It's a textbook example of rewilding.\n\nBut no, people just see trees being removed and demonstrate that if the Internet Olympics existed, Singaporeans could easily clinch the gold in the Jumping to Conclusions event.\n\nI mean, the explanation could not be spelt out more clearly in the article itself.\n\n&gt;In their place, endangered native species were planted as part of reforestation efforts. These included trees such as the twin-apple (*Ochrosia oppositifolia*), which was presumed to be nationally extinct in Singapore. \n\n&gt;Mr Chia Seng Jiang, NParks’ group director for parks, said 185 native coastal trees, including the critically endangered mengkudu laut *(Timonius finlaysonianus)* and putat laut *(Barringtonia asiatica),* had been planted on Coney Island with community support.\n\n&gt;Over 1,000 native coastal shrubs were also planted to reforest storm-impacted areas, he added.\n\n&gt;These efforts involved the removal of storm-damaged casuarina trees, Mr Chia said. \n\nAnd further down,\n\n&gt;...Tropical ecosystems dominated by a single plant species – such as the casuarina on Coney Island – are rare in natural conditions.\n\n&gt;As casuarina needles decay slowly, they can form thick litter mats that suppress seed germination, inhibiting the growth of other native species, he explained. \n\n&gt;“If this dominance is reduced in a managed way and followed by replanting with appropriate native species, the impact can be positive,” he said. \n\nBut I guess expecting people to actually read is asking for too much these days.",
          "score": 298
        },
        {
          "text": "I keep thinking of curry when i see Casuarina",
          "score": 42
        },
        {
          "text": "Coney island is basically an environmental crime zone anyway",
          "score": 11
        },
        {
          "text": "Jalan Seaview near Amber Road was lined with these wonderful tall trees. When it gets windy, they would make rustling sounds and the road would be covered by the leaves and cones. Nice!",
          "score": 0
        },
        {
          "text": "Ya I believe\n\nLike how they chop down forests to build BTO and leave a green 'corridor' and pretend to be environmentally friendly",
          "score": -78
        }
      ]
    },
    {
      "id": "t3_1qzaq5x",
      "subreddit": "singapore",
      "title": "This Singaporean has been drawn nude by thousands",
      "url": "https://old.reddit.com/r/singapore/comments/1qzaq5x/this_singaporean_has_been_drawn_nude_by_thousands/",
      "score": 89,
      "num_comments": 17,
      "created_at": "2026-02-08T22:46:08",
      "selftext": "",
      "comments": [
        {
          "text": "And there’s Kurt Tay who enjoyed posing nude. He thinks it’s easy money because he doesn’t have to do anything. Until an embarrassing incident happened and he got blacklisted by NTU.",
          "score": 49
        },
        {
          "text": "Fair enough. Can't be easy holding some of those poses for a few hours. Kudos to the commitment",
          "score": 38
        },
        {
          "text": "I was one of the thousands who drew him, over a decade ago. I'm really glad to see that he's still working and modelling for figure drawing.\n\nWhen I was in school, Kim was extremely professional, held his pose for as long as we asked of him, no complaints, minimal movements, and no nonsense from him ever.  His physique was also quite something. He put in a lot of effort to maintain that physique, I'm sure. Was an absolute pleasure to draw.\n\nThis man has probably raised almost an entire generation of artists in Singapore. He had a huge hand in making me the artist that I am today, and I'm really honoured to have had the opportunity to draw him.",
          "score": 24
        },
        {
          "text": "I’ve drawn this dude. He showed up in a leopard thong.",
          "score": 12
        },
        {
          "text": "Fit bod for a 60+yr old sia",
          "score": 9
        },
        {
          "text": "Respect 🙏",
          "score": 6
        },
        {
          "text": "kim is my favourite live model.. he is solid as a rock (incredible at holding poses, not a single movement, like he's a statue) &amp; is well built (muscles are fun to draw!) &amp; also is just a lovely person in general. ",
          "score": 5
        },
        {
          "text": "That's crazy, I've drawn him in an art class... 10 years ago. Very professional. More tiring than it looks.",
          "score": 2
        },
        {
          "text": "what an enjoyable interview",
          "score": 1
        },
        {
          "text": "I’m one of the thousands! It must have been 15 years ago now. And yes, he’s a great model! Being able to know how to pose and hold it is so important. It really helped us draw better.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qz3je7",
      "subreddit": "askSingapore",
      "title": "How to unf*ck my life? 30 m and stucked in this loop",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qz3je7/how_to_unfck_my_life_30_m_and_stucked_in_this_loop/",
      "score": 238,
      "num_comments": 109,
      "created_at": "2026-02-08T16:22:48",
      "selftext": "been suffering with severe social anxiety ever since i was young. cant socialize with anyone at all. not sure if its learned or im borned this way, i remember i used to have at least a few friends at pri sch and it all went to shit after i reach sec sch and did not have a single friend from sec 1 to 5. fast forward to now, im 30 yrs old. still not a single friend and never had a romantic relationship and im still stucked with doing food delivery as i do not have to work in a team. tried to do admin assitant for like a yr but it was not for me due to toxic colleagues who disliked me for being quiet i guess? and stucked w doing this food delivery for the 6th year and im sick of it. how can i get out of this or i guess im gonna be this way till the day i die? i also took up a diploma (conversion) in web and programming which was only 1 yr and i did not apply what i learned for a long time so i think i forgot mostly everything i learned.\n\ntldr: 30 m, severe social anxiety, never had a single friend or girlfriend, cant even work as a entry lvl admin assistant, no skills no education… the only thing i have is probably some decent amt of savings due to my 0 social life and never went overseas",
      "comments": [
        {
          "text": "Start small and work your way up. Exposure therapy",
          "score": 228
        },
        {
          "text": "You honestly just need a reason to care. Find something you actually enjoy, like a hobby or a relationship, and use that as your 'why.' Once you are working to support something you love, the grind at work or school becomes way easier to handle.",
          "score": 81
        },
        {
          "text": "Consider getting on medication for the anxiety. No, really, medication can be life changing. Don’t worry about the social stigma. People are generally really understanding and accepting.",
          "score": 66
        },
        {
          "text": "Dude social skills are learned and no one is born to it. Extroverted people do have better social skills due to them inherently enjoying communicating with others. Im an introvert. I hate talking to others. I have a small circle of friends but i do well socially. Ive lead teams and had to do tons of team stuff in Junior College and unIversity.\n\nDo u have any hobbies? To interact with others is to have a common or interesting topic to share. Expereinces are the easiest way to do this. Go solo travel for a bit. See the world and come home after 5 months with a ton of experiences if you can afford it. Be it nearly getting robbed in paris or seeing some fella in the US running around without pants , you gotta have interesting topics to talk about if you wanna interact with others. \n\nNice food places you can chat about, nice views you would recommend others. \n\nSame thing for work and thats why work gossip is so prevelant since its a common topic people can share and discuss. \n\nIf you want interesting places to go you can just dm me haha\n\nand of course its not limited to just places or food or whatever. Do the business venture you thought of. Social butterflies have a huge host of experiences to pull from during conversations that make them fun to talk to and engages everyone. \n\n  \ni always felt anxious talking to others when I had nothing to contribute to the conversation is what i observed. But when the convo moves into familiar territory thats where i feel confident and can effectively be a social butterfly. \n\nYou got savings and time. Just go do stupid stuff(in moderation) and you will have things you wanna share with others.",
          "score": 29
        },
        {
          "text": "You better than I am. At least you're putting yourself out there instead of being a social recluse. I wish you all the best man, seriously",
          "score": 26
        },
        {
          "text": "go via the polyclinic route to refer yourself to a public hospital's psych clinic, and tell the psychiatrist there about your concerns and struggles with social anxiety. high chance that you will be enrolled into group therapy. be open-minded about it, but also don't expect a quick fix. all of this requires time and work. also, meds may help ease the symptoms of a panic attack when they arise but they are not a permanent solution. all the best!",
          "score": 24
        },
        {
          "text": "Join some interest group bro. Paddle, Hydrox gimmick, gym, or evening running club. 30yo is in ur prime man. Members will ease it in ND chat with you. Go out now!",
          "score": 17
        },
        {
          "text": "&gt; the only thing i have is probably some decent amt of savings\n\nNever, NEVER, never fucking discuss this! Ever! That should be your rule #1.\n\nIf you say your social skills are bad, there's plenty of opportunities for people to befriend you after finding out about this for whatever malicious reasons.\n\n\nAs for social skills, there are plenty of multiplayer games people play where they make friends on, and they may be from all over the world.",
          "score": 15
        },
        {
          "text": "You can't. Accept the fact that you are a failure in life and will be single forever alone. Once you admit and accept your true self. Just fk care your life, put on a mask, and be a gangsta mf that thinks everyone in life owes you money. \n\nI boosted my self-confidence this way at 27yo, single and socially awkward then with a failed poly gpa, got married soon after that.\nNow im 40, married with a kid. With no loans. Able to carry any conversation to whoever I talked too.",
          "score": 15
        },
        {
          "text": "1) Get psychologist/psychiatrist/therapy help (depending on what works for you). This can be costly and you need to be patient and also be able to find one you can build rapport with.\n\n2) Self help books. Right books work wonders but the key is to apply what you have learnt. There are websites which offer you books for free.\n\n3) Chatgpt. You will be surprised at the insights you can receive. Tell them your issues and ask to diagnose root causes, ask for targeted remedies or book recommendations depending on what you want. Use with care though. \n\nYou won't continue this way till you die unless you consciously choose to. 30yo isn't that old if you gonna live till 75yo. Why not make 2026 the year of change then by December this year, you gonna look back with a smile at how you have taken the first step and finally broke the barrier. Jiayou!",
          "score": 14
        },
        {
          "text": "You need fear to push yourself to be better. You are probably too comfortable with your current lifestyle.\n\nFYI, food delivery as a career is about to disappear in a few years time once Grab and other companies manage to perfectly implement AI into their ground services. Get a grip of your life and do something NOW.",
          "score": 7
        },
        {
          "text": "Work wise I heard warehouse work most people usually keep to themselves but interact once in awhile so many that'll happen get you adjusted slowly? :)",
          "score": 6
        },
        {
          "text": "In my opinion, more you focus on it the bigger problem it will become.\n\nIt’s great that you learnt web programming - programming is one of my greatest passions, and my hobby too. I found that because I am doing something I like, I naturally became very good at it. When you are good at something, people notice you and want to talk to you. And you can bring ideas and topics to conversations.\n\nWhat do you like to do with your time? What is your hobby - is there anything that you are particularly good at or find especially interesting?\n\nDeveloping a skill isn’t a quick win, it’s a life-long pursuit. Consistency is a superpower and I found it’s really true - everyday, keep a positive mind, stay away from toxic people, pursue the truth. It’s small steps that compounds over time.",
          "score": 5
        },
        {
          "text": "Actually good advice in this thread.. esp the exposure therapy/method and how social skills are learnt. Good luck OP",
          "score": 4
        }
      ]
    },
    {
      "id": "t3_1qz7zqh",
      "subreddit": "askSingapore",
      "title": "Is haze.gov.sg reliable?? What's the difference with aqicn.org",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qz7zqh/is_hazegovsg_reliable_whats_the_difference_with/",
      "score": 128,
      "num_comments": 32,
      "created_at": "2026-02-08T20:44:31",
      "selftext": "Smells worse than what is being shown.\n\n  \nAlso I see that a lot of people using [https://aqicn.org/city/singapore/central/](https://aqicn.org/city/singapore/central/) to see the PM2.5, but on [https://www.haze.gov.sg/](https://www.haze.gov.sg/) somehow its way lower -.-",
      "comments": [
        {
          "text": "Years ago, aqi and NEA use same method/reporting and results are the same. Then haze gets worse and NEA website hold/delay bad number reporting around 8AM and then over compensate after 9AM. People starts to make noise (reddit/HWZ) for playing with reporting. Most of us stick to AQI website and their update is tally with what we actually feel outside. That's the time NEA website suddenly changed the formula and make it looks good on paper/website regardless of actual situation outside. AQI still tally with what we actually feel out here. So I only check aqi website from that time onward.",
          "score": 122
        },
        {
          "text": "Sometimes the smell is quite strong, sometimes not obvious. Seems stronger at night.",
          "score": 35
        },
        {
          "text": "Post from 2y ago explaining the difference https://www.reddit.com/r/singapore/s/7JY7kNFGMZ\n\nIt’s a different scale used by AQI and NEA\n\nAnd AQI gets their data from NEA anyway",
          "score": 32
        },
        {
          "text": "it's just a different scaling, scaling is non-linear tho  \n[https://observablehq.com/@mbostock/pm25-to-aqi](https://observablehq.com/@mbostock/pm25-to-aqi)  \n114 on AQI converts to 41 on NEA PM 2.5",
          "score": 25
        },
        {
          "text": "Sg gov is like trying it's best to make people distrust their published stats, in order to look good on paper",
          "score": 16
        },
        {
          "text": "The haze.com.sg not reliable. Machine spoil long time ago liao. Knn they no money update",
          "score": 6
        },
        {
          "text": "the Singapore website is still monitoring the situation",
          "score": 5
        },
        {
          "text": "Seems worse at night.",
          "score": 4
        },
        {
          "text": "Today was bad. Haze was slightly visible at AMK area",
          "score": 3
        },
        {
          "text": "Wait, you think smell levels and PM2.5 levels are the same thing? 🤭",
          "score": 2
        },
        {
          "text": "[removed]",
          "score": 1
        },
        {
          "text": "I also smell damn strong then check shocked that the number so low. Thought I was hallucinating or smth",
          "score": 1
        },
        {
          "text": "NEA's number is an average. Average over an area over an hour or 24 hours. So it will never be the exact number for you at the particular location at the particular time.",
          "score": 1
        },
        {
          "text": "It is as reliable as our healthier choice labels on zero sugar soft drinks. Technically correct.",
          "score": 1
        },
        {
          "text": "Well it’s as good as the migration numbers🙈",
          "score": -3
        }
      ]
    },
    {
      "id": "t3_1qyzze7",
      "subreddit": "askSingapore",
      "title": "What is everybody doing on Valentine’s Day on 14th?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qyzze7/what_is_everybody_doing_on_valentines_day_on_14th/",
      "score": 54,
      "num_comments": 118,
      "created_at": "2026-02-08T13:00:50",
      "selftext": "Partner and me decided for a simple year with no expensive dinner dates or huge expense throughout the occasions as we are saving for our renovation for our upcoming BTO.\n\nCurious what are yall plan for this upcoming Valentine’s Day! Have considered utilising the culture pass but unfortunately nothing seems to catch our eye for now. Do share any gift ideas as well.",
      "comments": [
        {
          "text": "staying home so i dont see couples 🤣🤣",
          "score": 227
        },
        {
          "text": "Prolly testing positive for pregnancy if I make it",
          "score": 97
        },
        {
          "text": "Fapping",
          "score": 64
        },
        {
          "text": "Playing Eldenring since I am maidenless and all",
          "score": 59
        },
        {
          "text": "Spring cleaning for CNY",
          "score": 48
        },
        {
          "text": "Fly back to KL for CNY :D\n\nMy mom’s birthday is on V Day so",
          "score": 21
        },
        {
          "text": "Flying. Have to make it back to CNY.",
          "score": 19
        },
        {
          "text": "Hub and i are renting before BTO so need to save money and cannot splurge on $200 dinners haha so i’ll be making our favourite pasta and buy some cheap red wine and have a lil’ date at home ☺️",
          "score": 18
        },
        {
          "text": "Recently  single so probably stay home try to ground myself so that I don't feel overwhelmed.....",
          "score": 14
        },
        {
          "text": "Bringing the children for their regular enrichment lesson 😂",
          "score": 14
        },
        {
          "text": "Waiting for air con guys, then probably Buddy Hoagies for fish and chips. We really like it there!",
          "score": 12
        },
        {
          "text": "We are taking a small luxury trip to Langkawi",
          "score": 10
        },
        {
          "text": "my bf and I don’t bother with it. Seems like a rather capitalist holiday to us. We sometimes just have nice dinners when we feel like it but valentines isn’t really a big deal for us. It’s better not to have to battle everyone for reservations and all on one particular day imo.",
          "score": 10
        },
        {
          "text": "Our family, everyone's married with kids, decided to have early reunion dinner on that day. Two in one combo, I guess?",
          "score": 9
        },
        {
          "text": "Wife and I having reunion dinner with my folks!",
          "score": 7
        },
        {
          "text": "Visiting my late-wife at the columbarium.",
          "score": 7
        },
        {
          "text": "Chest day, cuz single af so will be hitting the gym.",
          "score": 7
        },
        {
          "text": "Busy preparing for CNY",
          "score": 6
        },
        {
          "text": "girlfriend explicitly said she doesn’t wanna go out to town/crowded places or do anything expensive\n\nso I’m just planning to have brunch at an italian place nearby that we like followed by cycling in the late afternoon to her favourite loklok spot",
          "score": 6
        },
        {
          "text": "going for classes, studying, gymming, getting my 7+ hours of sleep like any other day. i like my life single and i wouldn’t have it any other way 😌",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1qzs62r",
      "subreddit": "askSingapore",
      "title": "Which old-school SG blogger, YouTuber, or actor who disappeared do you actually miss?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qzs62r/which_oldschool_sg_blogger_youtuber_or_actor_who/",
      "score": 45,
      "num_comments": 60,
      "created_at": "2026-02-09T10:33:24",
      "selftext": "Thinking about the local scene years ago, dating back to the 90s, 00s\n\nWho are the Singaporean YouTubers, bloggers, or TV actors who were once popular but have now completely vanished or gone quiet?\n\nAnyone whose content or presence you genuinely miss from that era?",
      "comments": [
        {
          "text": "The Noose is epic",
          "score": 183
        },
        {
          "text": "Clicknetwork accompanied my teen years. But really, I miss nigahiga (not sg)",
          "score": 69
        },
        {
          "text": "I loved Mr Brown’s long form posts in the late 90s. Kim Huat not as interesting",
          "score": 44
        },
        {
          "text": "Seconding Clicknetwork. Budget Barbie, Tried and Tested and Rozz Recommends were my absolute favourite series.",
          "score": 36
        },
        {
          "text": "i rly liked the bald angmoh guy painting back in the days of kidscentral!! wa he was damn good at it",
          "score": 34
        },
        {
          "text": "Rockson Tan",
          "score": 24
        },
        {
          "text": "I loved the OG wah banana. 3 of them had great chemistry.",
          "score": 19
        },
        {
          "text": "there was once a hilarious local satirical blog called museum of twits, poking fun at teenage stereotypes of the time\n\nmysteriously disappeared one day but if the writers are still out there yall be real Gs",
          "score": 14
        },
        {
          "text": "I miss happeepill. I wonder what the guy is up to now.",
          "score": 8
        },
        {
          "text": "newnation",
          "score": 7
        },
        {
          "text": "Happeepillshow!\nWonder what happened to him",
          "score": 6
        },
        {
          "text": "Talking Cock.com , before youtubers",
          "score": 5
        },
        {
          "text": "Used to love numbnuts",
          "score": 4
        },
        {
          "text": "Einstein Kristiansen",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1qzrvjx",
      "subreddit": "askSingapore",
      "title": "Saw a child get slapped by her mother on the street. Should I have done something?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qzrvjx/saw_a_child_get_slapped_by_her_mother_on_the/",
      "score": 32,
      "num_comments": 72,
      "created_at": "2026-02-09T10:19:38",
      "selftext": "The other day, I was walking in a very busy area and saw something very disturbing. I was walking about 10 feet behind behind this girl (maybe around 8-10 years old), who was holding hands with a grandmother. On the other side of the grandmother, there was also a boy who I assume is her brother (maybe around 10-12 years old). All of a sudden, this extremely angry woman (who I assume is their mother) stormed towards them while screaming at the top of her lungs, and when she got close to the girl, she started hitting the girl very hard while continuously yelling at the girl and the grandmother. She slapped the girl's face very hard twice and also hit her on the back while berating her in front of everyone. I also saw the mom drag her daughter by some body part, but for the life of me, l cannot remember if it was her hair or cheek or ear or something else... I think I was so traumatized by what I saw that I blocked this detail out of my memory... The mom was yelling in Mandarin, and my Mandarin is not that good, so l have no idea why this was happening.\n\nThere were a lot of people walking by, and many people were surprised by the commotion, but scurried away without confronting them. The mom, girl, grandmother, and boy walked off quickly as the mom was rushing them away while continuing to yell at them very loudly. As they walked away, I paused and stood there in shock. I'm still thinking about it a few days later, and I'm now wondering if I should have said or done something to intervene at the moment. Again, there was a language barrier here, so l have no idea what she was so upset about, but nothing, absolutely nothing can justify slapping a child across the face so hard and hitting a child in anger like that. Should I have reported it to the police on the spot? Is it too late to make an online report to the National Anti-Violence Helpline? Am I overreacting cuz I'm not from Singapore?",
      "comments": [
        {
          "text": "I have never tried it before, but someone told me the best way is to ask the mother if she needs some help.. ",
          "score": 85
        },
        {
          "text": "There is some logic to not intervening on the spot.  \n\nWhen I was younger, my mother used to scream at me in public. When anyone intervened, she stopped in public, but then I’d get caned in private for “causing her to be humiliated.” \n\nFrom my personal experience, I do not interrupt scolding parents because I don’t know what will happen behind closed doors. But I will video and report them after.",
          "score": 58
        },
        {
          "text": "My mum confronted a neighbour before.\n\nI think the kid's parent divorced and the the father left her under the care of her grandma.\n\nOld ppl sometimes gender bias or blame the kid for her own son unsuccessful life.\n\nSo lots of crying from punishment until my mum knocked on her door and told her to stop else going to call police.\n\nMy mum even offered to adopt the kid if that family dun want. Because she worried that the grandma deliberately starve the kid.\n\nNevertheless, the crying stop after confrontation. I think my brother also tried to speak to the kids father.\n\nLater we got see the grandma send her to kindergarten etc.",
          "score": 56
        },
        {
          "text": "No it’s not too late. Just report it ASAP. Thank you for even taking the time to write all this out. There are CCTVs that the police can access so just report it! That’s extremely horrible treatment of a child!!!",
          "score": 31
        },
        {
          "text": "Yes you can actually call in the cops.",
          "score": 23
        },
        {
          "text": "Contact NAVH - they will refer the case to MSF for a follow-up if there’s a need to.",
          "score": 7
        },
        {
          "text": "Sigh, you know that child is gonna remember this for life and will never ever be the same again",
          "score": 6
        },
        {
          "text": "Maybe take video but give it to the police station instead of posting it online",
          "score": 2
        },
        {
          "text": "[removed]",
          "score": 1
        },
        {
          "text": "[removed]",
          "score": 1
        },
        {
          "text": "Do not physically intervene. Take out your phone, start recording. After that bring it to the police. You can start yelling to get their attention if you want, usually seeing someone recording this behavior will result in immediate cessation in the abuse. \n\n  \nAgain. Do not physically intervene. If the perpetrator approaches you, keep the camera on them, but do your best to maintain your distance. If your intervention resulted in physical harm to the person, its very possible that the family members might turn around and accuse you of wrongdoing instead. \n\n",
          "score": 1
        },
        {
          "text": "No, you shouldn't. Worst case scenario: you confront -&gt; parent feels embarrassed -&gt; gets even more angry at home -&gt; beats child harder.",
          "score": -1
        }
      ]
    },
    {
      "id": "t3_1qz2efk",
      "subreddit": "askSingapore",
      "title": "Missing cat - Bukit Timah area",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qz2efk/missing_cat_bukit_timah_area/",
      "score": 33,
      "num_comments": 16,
      "created_at": "2026-02-08T15:14:13",
      "selftext": "Not sure if this is allowed but all efforts count I hope. If this is not allowed, pls feel free to remove (hopefully not 😔🤞🏻)\n\nWe lost Ning Ning on 2 Feb, 8pm near 41 Namly Avenue. She’s a tuxedo cat with 2-3 spots of white specs on her top coat. If anyone spots her, please DM me\n\nShe’s not microchipped and has no collar because she’s a fully indoor cat and she escaped before getting chipped",
      "comments": [
        {
          "text": "I hope you find ning ning soon! Poor baby must have been so scared having never been outside before!",
          "score": 4
        },
        {
          "text": "[removed]",
          "score": 2
        },
        {
          "text": "praying for her safe return❤️\ni lost my cat once too, we searched for her all night and found her hiding inside a rubbish bin. maybe you could try that 🥺",
          "score": 2
        },
        {
          "text": "I lost my cat too, she went into someone’s house. Try to call out her name, maybe she will meow back!",
          "score": 1
        },
        {
          "text": "Sorry for you and her. Hope you find her as soon as possible..",
          "score": 1
        },
        {
          "text": "What have you done to find her? So we can help suggest other ways.",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qzh62y",
      "subreddit": "askSingapore",
      "title": "Is it just my impression, or does Singapore lack third-party venues other than shopping malls and libraries?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qzh62y/is_it_just_my_impression_or_does_singapore_lack/",
      "score": 27,
      "num_comments": 37,
      "created_at": "2026-02-09T02:48:52",
      "selftext": "I've noticed that when people try to relax, chat, or create, they always end up in a crowded café or a noisy shopping mall. Do you feel the need for a hybrid space? A place where you could learn a manual or artistic skill, or simply connect without the pressure to consume quickly or remain silent, like in a library? What do you miss most for your mental well-being in Saint-Germain-des-Prés? What would you like to have? Find? Do?",
      "comments": [
        {
          "text": "Do you mean third spaces instead of third party venues \n\n  \nWell, yes, Singapore society is very capitalistic and consumerist that people choose to hang out in malls over other places. It's not for lack of the government trying. They did build community centres, parks, libraries. There's big integrated developments like Heartbeat@Bedok and One Punggol, not just small community centres. We have so many high quality public libraries. There are quite a few constituencies where I always see the grassroots organisations organise fairs and events. \n\n  \nI notice from your profile that you're actually not Singaporean, but French, and not yet living in Singapore? These things may not be obvious to you then. Anyway while there are plenty of alternative third spaces, most Singaporeans *are* still going to choose malls and cafes and restaurants to hang out with their friends or family. Air con is a big pro that wins out humid weather alternatives like parks. But also many Singaporeans (not all) really enjoy being consumerist and spending money. Also eating together is the lowest common denominator for a group of friends, over trying to find a common activity that everyone enjoys. ",
          "score": 196
        },
        {
          "text": "You copy-pasted this question without changing the French location to Singapore?\n\nIf you were actually local and retired, you might hang out at hawker centres to chit chat with your buddies, exercise in a park, and go to Community Clubs (CCs) and Residents Committees (RCs) to participate in cheap classes and activities.",
          "score": 67
        },
        {
          "text": "Nobody is meeting at 2pm in the middle of bishan park to have a chat.",
          "score": 54
        },
        {
          "text": "Our old malls used to have plenty of seats and benches for people to rest or chit chat. All that is gone now. The new consumerism approach is to 'force' people into cafés or eateries. Most of the customers are there not because they want to dine in, but due to a lack of communal places for them to socialise. Sitting out in the open isn't ideal due to our weather. This is our sad reality.",
          "score": 35
        },
        {
          "text": "Well simply because of the climate, most of our hang out spots are going to be indoors. You can learn \"manual or artistic\" skills indoors, including at shopping malls. Just because they're in a mall doesn't mean they're less valid than other places lol.  \n\nIf you go to underground passages at like Bayfront/Esplanade/etc it also never fails to amuse me how MANY SINGAPOREANS are always dancing all the time?? Its kind of cute and annoying at the same time.  \n\nApart from hanging out at malls I feel like I mostly just hang out at my friend's places. Playing majong or Mario kart or just having hotpot etc.",
          "score": 14
        },
        {
          "text": "Our weather makes it so that no one wants to hang out in the middle of a park on a Tuesday at 1pm. Because we're either working, it's baking hot, or it's raining like Poseidon's paying a visit.\n\nMalls, cafes and restaurants are comfortable because it's indoors, there's air-conditioning and there's seating.\n\nIt's not to say people don't hang out in parks. Some families will have play dates there, some people will have weekend picnics, or meet up with exercise groups. But if you just want to chit chat and catch up, everyone wants to hide indoors.",
          "score": 7
        },
        {
          "text": "We used to. Much of our early urban planning had 3rd places. But they have been demolished at the altar of maintenance, economic value, and density.",
          "score": 7
        },
        {
          "text": "Void decks exist and are common. Children use it to play and adults use it for charity events, weddings and funerals, usually funerals.",
          "score": 6
        },
        {
          "text": "At the heartland hdbs, there is one block in about every 10 blocks that has a 'resident corner' or 'senior corner' . They built more permanent chairs and tables for residents to relax. \n\nMy mom occasionally will go there and chit chat with the other aunties. Some of the other aunties hang out there everyday. \n\nThe residents in my auntie area in pasir ris are even more active. Resident volunteers set up elderly activities such as drawing, picture card games for them. \n\nUnfortunately I think most adults and youngster usually dun hang out at these areas, except for the basketball  courts",
          "score": 6
        },
        {
          "text": "Vous avez copié-collé une question concernant la France et l'avez appliquée à Singapour. Il existe pourtant de nombreux 'tiers-lieux' gratuits ou abordables.",
          "score": 5
        },
        {
          "text": "Scape got a new space that is for wellbeing",
          "score": 4
        },
        {
          "text": "Probably karma farming. Location doesn’t even make sense. 2month old account",
          "score": 4
        },
        {
          "text": "There’s an initiative called Stranger living room, Google their IG, they are really active and have a space for anyone to chill and connect on common interests",
          "score": 3
        },
        {
          "text": "I think what you're thinking about is a Community Center- which is already in many local communities. ",
          "score": 3
        },
        {
          "text": "As much as I like public spaces, there’s not enough of them built in Singapore and most of them are open to the elements and in hot humid Singapore , it’s a no-go. \nBut you are right. I wish there are more “cultural” centre of community centres. In fact I wish Singaporeans can be more Open minded and allow foreign workers to have their own cultural / community spaces. \nIn western countries, foreign workers usually have their cultural / community spaces and they often host events open to the public. It makes for such lively vibrant events.",
          "score": 2
        },
        {
          "text": "There are many beautiful and nice spaces in singapore. It’s just the weather man. It’s just to hot to chill outside too long",
          "score": 2
        },
        {
          "text": "Local brewery taprooms are a great option, albeit only for drinkers",
          "score": 2
        },
        {
          "text": "Govt has built many parks but few ppl will go because no aircon. We still need our aircon so its shopping malls and library .",
          "score": 1
        },
        {
          "text": "People like to believe that Singapore is somehow lacking because of its small size. But singapore is not small as a city. So tell me this how many cities out there come with such so-called third party venues?",
          "score": 1
        },
        {
          "text": "Well there are country clubs and members clubs if youre so inclined. And those folks who pay for membership tend to use them.",
          "score": 1
        },
        {
          "text": "you will never see those that relax at their own homes, chat, and create stuff. ",
          "score": 1
        },
        {
          "text": "Our minister says no need big spaces to have sex, anywhere can be a 3rd party place, even your workplace and office as we can see from recent scandals.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qzb2ie",
      "subreddit": "askSingapore",
      "title": "Bad breath dentist recommendations?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qzb2ie/bad_breath_dentist_recommendations/",
      "score": 28,
      "num_comments": 27,
      "created_at": "2026-02-08T23:00:11",
      "selftext": "Hi, anyone has any recommendations for dentists that can help to diagnose/manage/treat potential halitosis?",
      "comments": [
        {
          "text": "Not recommending a dentist but sharing what I know.\n\nUse a soft bristled toothbrush and buy one with a small head, this is so you can squeeze that toothbrush to the back of your last tooth. Most ppl will miss this spot because their toothbrush too large, leaving the back tooth unbrushed with food decaying at that area.\n\nFor brushing technique you can google modified bass technique. Minimally brush the soft bristles of your toothbrush against the gumline. Ppl always think don't brush the gumline as it will hurt but that's wrong. With a soft bristled toothbrush and light force it shouldn't hurt. The gumline is where all the plaque is.\n\nYou can buy a dedicated tongue cleaner to clean your tongue. It can make a difference.\n\nAlways rinse your mouth after every meal like how you see the mouthwash ad does, swish swoosh sound strong tsunami inside the mouth wash off food particles. If toilet is unavailable rinse and gargle your drinking water and just drink the water\n\nIf possible floss too.",
          "score": 67
        },
        {
          "text": "Title sounds like you want a dentist with bad breath!",
          "score": 12
        },
        {
          "text": "I went to the dentist recently to prepare for 3 job interviews in a single week. Because I know I have bad breath.\n\nLast visited dentist on record is in 2014.\n\nOkay nevermind I am oversharing again. Need to stop this bad habit lol.\n\nTL;DR: persistent bad breath even after proper brushing and scraping of tongue, can be 100% cured by going to any dentist. Any. And doing the whole standard scaling and polishing and then they will most likely tell you that you have gum disease. Not saying you never brush properly or regularly since your last dentist visit. But persistent bad breath is caused by gum disease.\n\nOops. That's not TL;DR at all. LOL.",
          "score": 12
        },
        {
          "text": "Check for tonsil stones too and clean your tongue",
          "score": 9
        },
        {
          "text": "Easiest solutions to try first is flossing, tongue brushing/cleaning, check for tonsil stone build up\n\nIf these dont work then go dentist",
          "score": 8
        },
        {
          "text": "From title, I thought you are looking for a dentist with bad breath",
          "score": 6
        },
        {
          "text": "Can consider giving TheraBreath a shot.",
          "score": 2
        },
        {
          "text": "Also consider gut health :)",
          "score": 2
        },
        {
          "text": "You can check for tonsil stones yourself and even try to remove them",
          "score": 1
        },
        {
          "text": "at first I saw the title I thought you’re looking for dentists with bad breath 😅",
          "score": 1
        },
        {
          "text": "use a water flosser if you have not, haven't been to dentist for years.",
          "score": 1
        },
        {
          "text": "I think every dentist should be able to diagnose? Anyway, brush your tongue and the walls inside your mouth too. Use mouthwash too.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qzgb8z",
      "subreddit": "askSingapore",
      "title": "People with 2 Bachelors degrees- why?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qzgb8z/people_with_2_bachelors_degrees_why/",
      "score": 27,
      "num_comments": 24,
      "created_at": "2026-02-09T02:17:38",
      "selftext": "Hello! I’ve noticed on Linkedin that some people did a second Bachelor’s instead of a Master’s or Grad Dip, and just curious about the reasons behind it.\n\nContext:\n\nI currently have a third class honours in Economics and Management from SIM-UOL and I’m thinking of entering the socials services sector. I realised that business/finance wasn’t for me halfway through the degree and I didn’t do well. I forced myself to complete the studies so that I don’t “waste any money”. But I’m also aware that my grades aren’t good enough for masters or grad dip. I’m considering doing a part time BSc in social work in SUSS. I’ve a rather low GPA (&lt;2.5) from my diploma as my mental health was bad and was absent from school a couple of days.\n\nFor those who did 2 degrees:\n\n\\- Was it for a career switch?\n\n\\- Was your first degree not very employable?\n\n\\- Or was it cause you can’t get into postgrad due to grades?\n\n\\- Did having 2 degrees improve your job prospects/salary significantly?\n\n\\- Do employers view it positively or just like a normal degree?\n\nAppreciate your reply!\n\nEdit: 2 Bachelor degrees as in taking 1 after the other. Not “double degrees”",
      "comments": [
        {
          "text": "bachelors double degree at the same time, or double degree over different times? \n\nbachelors double degree at the same time (eg in ntu and nus)  means u take 2 degrees over a period of 4-5 years (normally) for bachelors. this is usually offered upon registering for uni after a levels (i guess if you’re smart lol)\n\ni mean, they chose to take 2 degrees at the same time, but it’s not because like ‘hey after 4 years of business school, i think i wanna take comp sci too’. it’s more of ‘oh i can get a business and comp sci degree now without spending extra time’. \n\nit’s not because they didn’t wanna do masters, more if there’s no point during masters unless u really wanna further your studies lol. but i feel this goes for many singaporeans. If u see those that register for masters, it’s usually china/indian/jndo instead of singaporeans lol",
          "score": 47
        },
        {
          "text": "Not me, but those I know did double degree. i.e. They can overload and graduate at the same time (some did 1 more semester) with two different degrees from the same IHL\n\nAnd they are usually the scholars too. So yes it does help",
          "score": 30
        },
        {
          "text": "Masters &gt;&gt;&gt; Double Degree",
          "score": 17
        },
        {
          "text": "my friend did two BAs over two diff periods out of pure interest (business then psych and criminology) and my other friend did two masters programme over two different periods out of pure interest too. his GPA was like 3.98 for both of his degrees (nursing then buddhist studies). he took the second masters because pure interest too and he’s planning to do research and to continue with PhD in the buddhist studies. ive graduated with BA in psych and criminology and planning to take another degree (next year, buddhist studies) because of interest too (im very happy with what i studied) and i generally enjoy studying if its along the social side (psychology etc) or buddhist studies, honestly i dont mind studying for life lmao. i have no intention for a career switch though and i love what ive studied. so for my friends and myself we study additional masters/bachelors because of interest and not because of better job prospects. \n\nif you ask me to take another bachelors in like business or comp sci i will reject immediately.",
          "score": 13
        },
        {
          "text": "Because they can, I did it. Not all uni offer. Local Uni double degrees are prestige, it's just like why secondary school offer triple science to some students, higher mother tongue etc. You expand your horizons and knowledge.\n\nPS: I should add. Double degree is not the same as MAJOR AND MINOR.. HR always get confused..",
          "score": 11
        },
        {
          "text": "You can enter social service with that degree doing something finance related / fund raising related. \n\nBut if you want to do direct practice like social work / counselling / psychology then you’ll likely need to get a relevant qualification as it’s a requirement + for registration purposes.",
          "score": 3
        },
        {
          "text": "Get a job. Some industries prefer candidates with heart. (Not job hopper)",
          "score": 2
        },
        {
          "text": "Every thing is about narrative, how you explain how you get to this stage. If it is reasonable I will accept it. Do not say to not waste money, that tell me you have sunken cost fallacy. If you say you realize you have no love for that line of work, it also show you do not research or realize the wrong early to fix the problem. \nBut what might work is, initially you feel it is a waste of money to quit early, you tried very hard but it still do not work out. By then you are ready third year so you feel that might as well finish up and use the time to think of what you want to do next. This the second degree.",
          "score": 2
        },
        {
          "text": "Did second degree for career switch, employers view two consecutive bachelor's as very sus for some reason in my interviews lol",
          "score": 1
        },
        {
          "text": "If you do another Bachelor, what makes u certain  that u will get a high GPA?",
          "score": 1
        },
        {
          "text": "A couple of my friends did double/triple degrees. Because their life already set due to rich parents and they just want to avoid working. So just keep studying and part-time help out their parents' business.",
          "score": 1
        },
        {
          "text": "Needed a hobby",
          "score": 0
        },
        {
          "text": "I did a double degree in the U.S. within 3 years. Film + Business. Proved useful in securing a job in the U.S.",
          "score": -1
        },
        {
          "text": "Who even has the time to take two degrees one after another",
          "score": -1
        },
        {
          "text": "Some schools offer double degrees. Honestly, for your situation, just try to find using your current degree first. If that's not possible then consider taking a master degree",
          "score": -2
        },
        {
          "text": "Degrees are a scam.",
          "score": -8
        }
      ]
    },
    {
      "id": "t3_1qz8ocb",
      "subreddit": "askSingapore",
      "title": "Cluster headache/migraine sufferers of SG, how do you cope/manage the pain?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qz8ocb/cluster_headachemigraine_sufferers_of_sg_how_do/",
      "score": 22,
      "num_comments": 27,
      "created_at": "2026-02-08T21:17:23",
      "selftext": "I've been suffering from cyclical cluster headache attacks for about 20 over years, and the cycle almost always starts around end January and stretches towards April. During this period, my dietary options are severely limited as tons of things trigger my attacks, and the pain is excruciating; like someone trying to push my eyeball out from the inside of my head. My skin becomes warm and dry, my eye starts tearing and my lips and mouth become very dry and the slightest noise/light just makes everything worse. \n\nSupport is almost non-existent from the people around me as they think that it's \"just a headache, take some panadol\", when cluster headaches are also widely known as suicide headaches for a reason. \n\nfor sufferers here in SG, how do you cope? All dietary suggestions/tips/lifestyle changes are welcome. \n\nThank you.",
      "comments": [
        {
          "text": "Get a referral to see a neurologist. Your symptoms sound severe enough to warrant specialist attention",
          "score": 40
        },
        {
          "text": "Keep a headache diary, see a neurologist and get on preventives + abortives\nThere’s public route, private if you can afford it and want to solve asap (try Zhao Neurologist)",
          "score": 21
        },
        {
          "text": "Make sure you eliminate the cause of it being a neck / scapula strain. \n\nUsed to have this alot, and subsequently found it it's because of tight neck, traps muscles and a weak scapula.",
          "score": 10
        },
        {
          "text": "pls see a neurologist if you have not already\n\nin the meantime, try to identify your triggers where possible:  https://migrainetrust.org/live-with-migraine/self-management/common-triggers/\n\nthe most common are things like caffeine, chocolate, citrus fruits, cheeses, but triggers can be very unique, eg specific scents, bright lights (could be LED white light, bright sunshine bouncing off a pavement or the sunshine glare from metal railings)\n\nit helps to keep a record of when your headaches hit, and what you ate and did before that. the causes may not always be immediately apparent\n\nplease take care!",
          "score": 6
        },
        {
          "text": "Im a Migrane sufferer for 30years, severe at timrs, i take neurofen, the one sold in watsons or guardian, grey colour box, 5.50 uk made, that was my saviour, your condition sound worse, you meed to see a specialist asap.i avoid chocolates, peanuts ,and coffee, it triggers it.",
          "score": 6
        },
        {
          "text": "I’m not sure if what I experienced was cluster headaches or a migraine. It would make my eye hurt a lot and I could barely open them, but I can’t recall if there was a pattern to the attacks.\n\nBut anyway, I found that leaving my work environment helped reduced my headaches by a lot (which is honestly not helpful advice tbh). I was triggered by loud noises, heat, bright lights and strong smells. All of which were present at my last job. I learned to identify the triggers and tried my best to find somewhere to lie down or rest when I felt an attack coming, especially if I can’t take things like anarex while at work. If I’m at home I’ll put an ice pack and lay on the muji soft cushion in a dark quiet room. Other pillows just hurt. I really think you should see a specialist though.",
          "score": 4
        },
        {
          "text": "Mine was due to the sun, weirdly. After I switched to transition glasses (couldn't wear sunglasses because I was still schooling), my migraines ceased.",
          "score": 4
        },
        {
          "text": "I had similar problem, and short of getting some CT scan, I decided to improve my lifestyle eventually, but they still come randomly. But prior to that, I was prescribed Sumatriptan. It's pretty strong painkillers, and usually does the trick for me (once i give in and take it, the pain will subside in abt an hour or less). Panadol and Ibuprofen seldom helps when I have a migraine (something I get randomly since I was a kid).\n\nHonestly I don't know what triggers it. One time I noticed it happens when I eat a lot of beef (or food with high nitrite) and it will trigger the next day. Sometimes it's cause I exert myself a lot when exercising. Sometimes, just getting woken up earlier than expected would cause it. ",
          "score": 3
        },
        {
          "text": "Hey OP, there are a variety of pain relief medications you can try aside from only panadol. Sometimes Pacofen or Anarex may work better, or a combo of paracetamol and then synflex. Sometimes you may need to try a cocktail of different medications before you find what works for you. Caffox was a godsend for me, and I was recently put on another medication that reduced my migraine instances by a significant amount. You need to discuss this with your PCP, and get a referral to a neurologist. \n\nWhat have you tried so far other than panadol as mentioned?",
          "score": 2
        },
        {
          "text": "I think you need to go for a check up",
          "score": 2
        },
        {
          "text": "My heart goes out to you. My cycle is about one to two months a year and it feels bad enough.\n\nFor my recent cycle i started to stack paracetemol and ibuprofen for the pain relief. Anarex is a pretty nice paracetemol source for when i manage to get a day off since it also has muscle relaxant features to help relaxation. Having fresh flow of air (open window) also helps relief the pain a teeny tiny bit.\n\nOther than that nothing seems to work long term for me. In case it helps, some things that had worked during certain cycles but not others include:-\n- hot coffee\n- sleeping on my left\n- cold redbull\n\nAll the best to you!",
          "score": 2
        },
        {
          "text": "I started drinking electrolyte drinks daily. Realised my body needed that balance to prevent migraines. From having migraine every few weeks to now 6 months migraine free is a miracle. \n\nOnce you find your trigger, its easier to manage",
          "score": 2
        },
        {
          "text": "Currently seeing a neuro at SGH, zomig works wonder for me and also on a monthly jab to reduce the attacks. But before taking zomig (not cheap, abt $10 a pill), the best investment I got was getting a migraine relief gel cap (can get from shoppee). Throw in the fridge, then use it when u feel an attack coming on. Otherwise if I am outside, coke and salt for me and spam medicated oil - Siang Oil(brown) or Heritage Brand Rheuma-salve pain relief roll on and sunglass on, be it indoor or outdoor. \n\nHave to watch what food are your triggers, mine are chocolate and cheese. Also check out the humidity level, it affects me alot, see if that is a trigger for you.",
          "score": 2
        },
        {
          "text": "Wah your symptoms sound really bad and im sorry you have to go thru it! Im a migraine sufferer and when it hits, the pain in my eyes become soooo bad i cant do anything. I usually request to leave work if i can and go home, shut anything that allows light in, switch off all devices and force myself to sleep. I will wake up feeling so much better if i do that and get at least 4 hrs of undisturbed rest but sometimes, im not so lucky. I cant take any meds coz i end up puking anything i try to eat but i will always rub my whole head using the top knuckles of my hand and just keep doing that until ive covered my whole head in a bid to release any tension/pressure. This usually provides some form of immediate relieve for a bit.",
          "score": 1
        },
        {
          "text": "My experience is similar as the comment above - prolonged over tense neck/shoulder muscles.\n\nWhat helped was acupuncture. Was a regular at TCM for other reasons and the sensei added weekly acupuncture treatment. Took a few months to see effect though. Now it’s down to monthly treatment.\n\nI also do daily stretches to maintain and rest my eyes regularly since bright lights and eye strain add to headache. \n\nHope you manage to pinpoint the cause and recover soon.",
          "score": 1
        },
        {
          "text": "Aside from the medication - Osteopathy helps. \n I had shoulder issues that led to neck issues and then jaw issues.\n\nSimilar to what others said.",
          "score": 1
        },
        {
          "text": "NUH had a headache clinic\n\n[https://www.nuh.com.sg/care-at-nuh/services/medicine/neurology/headache-service](https://www.nuh.com.sg/care-at-nuh/services/medicine/neurology/headache-service)",
          "score": 1
        },
        {
          "text": "heard a friend of mine takes &gt;300 panadols a month for years. find neurologist+MRI also found nothing.",
          "score": 1
        },
        {
          "text": "I'm a long term sufferer too and finally went to see the neuro via the polyclinic route. Go and get a polyclinic referral now if you haven't yet as the whole process will take a few months!\nUnfortunately for many of us, there isn't a cure and it can only be managed via painkillers and identifying possible triggers. I haven't really found out my trigger as mine comes randomly but I realised caffeine helps in suppressing it. So when my pain cycle comes, I drink coffee in the morning and take ibuprofen at night.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qzcnbr",
      "subreddit": "SingaporeRaw",
      "title": "Her name is Sheyna. She is not a statistic, and she is not a headline. She is a daughter whose entire future was stolen from her. She deserves to be seen for the child she is, not just another casualty. We are not angry enough about Singapore's lenient traffic laws. things must change.",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qzcnbr/her_name_is_sheyna_she_is_not_a_statistic_and_she/",
      "score": 912,
      "num_comments": 123,
      "created_at": "2026-02-09T00:01:18",
      "selftext": "Crossposted from a post on r/drivingsg by u/mystoryismine for visiblity",
      "comments": [
        {
          "text": "One problem I have is us recognizing the licenses of foreign countries where they can easily be bought or obtained without test as stringent as ours.\n\nBe it Indonesia, China, Malaysia, and in this case India, where it’s common knowledge that they get passed for just being able to move a car 3 minutes in a straight line. No education on blind spots, right of way, or defensive driving.\n\nWe should make all foreign driving license holders pass our practical driving tests, and not just the theory.",
          "score": 306
        },
        {
          "text": "RIP. I'm a dad as well with a 6yo girl.\n\nNo amount of jail or fine can bring her back. Everything revolves back to law makers. We need change.",
          "score": 192
        },
        {
          "text": "If anyone else noticed, this little girl Sheyna wore baby blue outfit matching with her mother on that day. Can just imagine the excitement they have starting the day in Chinatown.\n\nThis is just too cruel..\n\nRIP little angel",
          "score": 138
        },
        {
          "text": "https://preview.redd.it/qwv7ipmq1big1.jpeg?width=409&amp;format=pjpg&amp;auto=webp&amp;s=314dad534ec5d07dbdccde755c9d571ba7545665\n\nHais beautiful family destroyed cuz of some idiot driver.",
          "score": 122
        },
        {
          "text": "So infuriating to see the [witness clip](https://www.facebook.com/share/v/17m95Jm4Ew/) where you can see how the driver repeatedly grabbing her hand even PRESSING on the little girl chest whilst shes coughing up blood. SIGH\n\nRIP little angel Sheyna",
          "score": 89
        },
        {
          "text": "Everyone just start writing to your MP (email/FB message/IG message etc) for this matter to be raised be it calling a review of our traffic laws or even the way our news outlets have been perceived to be controlling the narrative. \n\nRemember MPs are NOT estate managers. They are LAWMAKERS and they cannot ignore any ground-up voices raised to them as elected officials. We all have to do our part. Start writing to them now.",
          "score": 72
        },
        {
          "text": "sg justice system and punishments on driving offences are too lax.  \n\n\nour PAP gov does not seem to be interested to change the punishment to deter driving offences, only have time to fix the opposition. ",
          "score": 49
        },
        {
          "text": "That woman murdered her and traffic laws are complicit. Why whenever a negligent driver runs someone over it’s “just an accident” and not manslaughter. It is always treated like the driver is the victim of chance and it’s not their fault or responsibility in anyway. In news articles it’s always reported “person dies in car accident” “kid is hit by driver” they dehumanise the negligent driver responsible and act like these occurrences are just a fact of life. We have drivers licences for a reason, you are supposed to be responsible with machinery that can take someone’s life in an instant. It’s like firing a gun at random and when you shoot someone claiming it’s an accident and you’re not at fault. \n\nA car did not kill this little girl. That woman murdered her, she ran her over twice, that is not an accident.",
          "score": 48
        },
        {
          "text": "What can you do? Your government scared of offending the foreign talent when we stringent with them. That's why we only stringent with our own people - and they love it! We keep fucking voting them in every 5 years anyway.",
          "score": 35
        },
        {
          "text": "My condolences and RIP. We will need justice for you to bring this cecadian to sentence",
          "score": 31
        },
        {
          "text": "RIP 🙏",
          "score": 21
        },
        {
          "text": "Absolutely heartbreaking, rest in peace Sheyna. \n\nI don't believe in an afterlife, but it's times like this that I really hope that one exists so the family will one day see their little girl again.",
          "score": 21
        }
      ]
    },
    {
      "id": "t3_1qzrpxh",
      "subreddit": "SingaporeRaw",
      "title": "Chinatown Accident Photo Compilation | This is what remorse looks like /s",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qzrpxh/chinatown_accident_photo_compilation_this_is_what/",
      "score": 269,
      "num_comments": 94,
      "created_at": "2026-02-09T10:11:49",
      "selftext": "Original eyewitness post: [https://www.facebook.com/nguyenthi.hanh.56481/posts/pfbid04SobuoZoPmaXcsxpm5Tt6jJ6u69NE76QbUVNydKru35KTTvMLiGXKFDzYovGABHml](https://www.facebook.com/nguyenthi.hanh.56481/posts/pfbid04SobuoZoPmaXcsxpm5Tt6jJ6u69NE76QbUVNydKru35KTTvMLiGXKFDzYovGABHml)",
      "comments": [
        {
          "text": "Is she someone fren or something. Why are they protecting her?",
          "score": 107
        },
        {
          "text": "Mothership reported she was in tears, ‘overcome by guilt’. Are there any pictures showing her expressing remorse and guilt?",
          "score": 100
        },
        {
          "text": "Fuck this bitch. But this scum aside, I really feel bad for the father. I think the internet should use the energy to help the father and his family instead.",
          "score": 51
        },
        {
          "text": "From the comments\n\nhttps://preview.redd.it/43ejqe42udig1.png?width=1061&amp;format=png&amp;auto=webp&amp;s=809850fb1817ca55cf76c9f2b2d1cbef6ee2a934\n\n",
          "score": 43
        },
        {
          "text": "Compilation is for my own reference, anybody know who she is?\n\nhttps://preview.redd.it/ck15oqafodig1.png?width=1380&amp;format=png&amp;auto=webp&amp;s=68313567897bed9a31d806e178e6a7d26ad8adf0\n\n",
          "score": 35
        },
        {
          "text": "She is such a sick and cold blooded human",
          "score": 25
        },
        {
          "text": "Ran over the mother leg as well? How’s the mum now?",
          "score": 22
        },
        {
          "text": "Any CCTV videos released? \n\nThis could easily be a lesson to some people.",
          "score": 18
        },
        {
          "text": "It’s crazy how cheap a human life is on the road. You could crowdfund to pay someone’s fine for killing someone “by accident”.",
          "score": 8
        }
      ]
    },
    {
      "id": "t3_1qzad8n",
      "subreddit": "SingaporeRaw",
      "title": "Alleged Indian national defends driver of fatal Chinatown accident. Urges Singaporeans to ‘relax’.",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qzad8n/alleged_indian_national_defends_driver_of_fatal/",
      "score": 234,
      "num_comments": 86,
      "created_at": "2026-02-08T22:31:05",
      "selftext": "Link: \n\n[https://www.facebook.com/share/p/1DpCLbEEb2/?mibextid=wwXIfr](https://www.facebook.com/share/p/1DpCLbEEb2/?mibextid=wwXIfr)",
      "comments": [
        {
          "text": "what is different is that the lives of other nationalities not as worthless/cheap than the lives in india tho…",
          "score": 178
        },
        {
          "text": "Could be a troll https://www.facebook.com/share/17pffkeSbt/?mibextid=wwXIfr[Aneesh Gupta](https://www.facebook.com/share/17pffkeSbt/?mibextid=wwXIfr)",
          "score": 69
        },
        {
          "text": "As someone who drives and ride, I can swear, the police or government is not pushing the rich that breaks these traffic rule enough. So many cases, and yet the charges is a joke. \n\nKnn.\n\nStay safe my brothers. It's okay to hate them, but don't let the hate goes to our Indian sg bros and sis.",
          "score": 53
        },
        {
          "text": "I am almost certain it's a troll account.\n\nBut that said, what kind of lowlife scumbag would use this incident for trolling?",
          "score": 36
        },
        {
          "text": "Pappies Darlings",
          "score": 19
        },
        {
          "text": "This isn’t New Delhi is it?",
          "score": 15
        },
        {
          "text": "Troll account, definitely not from DBS. Checked with someone I know there and no such profile from their MS teams lol",
          "score": 12
        },
        {
          "text": "He’s mistaken. Life is not cheap at this part of the world",
          "score": 8
        },
        {
          "text": "99% troll.",
          "score": 6
        },
        {
          "text": "Erm relaxes if the victim happens to them lor",
          "score": 5
        },
        {
          "text": "Rage bait, things that are common in their kampung especially life and death doesn't mean it should be common elsewhere",
          "score": 4
        }
      ]
    },
    {
      "id": "t3_1qz0j8h",
      "subreddit": "SingaporeRaw",
      "title": "Banned by r/Singapore for a comment on the death of the 6 years old girl on /sgraw",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qz0j8h/banned_by_rsingapore_for_a_comment_on_the_death/",
      "score": 199,
      "num_comments": 98,
      "created_at": "2026-02-08T13:29:49",
      "selftext": "\n\nNew low, the mods from R/Singapore banned me from posting there for a comment I posted on r/ Singaporeraw, on the news of the death of the 6 years old girl. Why are they so sensitive to comments on the arrested individual? They are watching you. Report here: https://redditinc.com/policies/moderator-code-of\n\n-conduct less",
      "comments": [
        {
          "text": "Fuck you /r/singapore",
          "score": 119
        },
        {
          "text": "i guess you mentioned ceca? the mods there and edmw belongs to same group, taking orders from some people one. i dont understand why they can feel sensitive against the word ceca when it means Comprehensive Economic Cooperation Agreement. Think they had too much things to hide and fear we know that they had betrayed singapore with this agreement?",
          "score": 110
        },
        {
          "text": "Chao ah neh.\n\nChao ah tiong.\n\nChao jiu hu kia.\n\nChao burmese.\n\nChao vietcong.\n\nFuck PAP.\n\nKnnbccb I can post whatever the fuck I want.",
          "score": 101
        },
        {
          "text": "What did you comment?",
          "score": 90
        },
        {
          "text": "You don’t know that place is a cesspool of CECA?",
          "score": 42
        },
        {
          "text": "That is why the number of visitors to the r/SGRaw Reddit community has now reached two thirds of r/Singapore. I recall that the ratio was significantly smaller in the past.",
          "score": 28
        },
        {
          "text": "Fuck the CECA mods",
          "score": 28
        },
        {
          "text": "Ceca-controlled sub.",
          "score": 28
        },
        {
          "text": "First time? r/sg is like the high paying jobs, r/sgraw is like grabfood. Get used to it",
          "score": 27
        },
        {
          "text": "That's why I migrated to other social media platforms instead of Reddit or Hardwarezone. Both are heavily censored by CECA admin. LOL!",
          "score": 24
        },
        {
          "text": "The mod there all from indian, moderating under the ceca agreement. \n\nWelcome to the banned group.",
          "score": 21
        },
        {
          "text": "Clarification: I didn't post on r/Singapore at all. I commented on r/Singaporeraw's thread on the Chinatown accident leading to the death of the child. \n\nMeaning the mods there are policing r/singaporeraw to weed out users before they even speak on r/Singapore. Hi there r/singapore mods, you must still be reading. There are more people for you to ban.",
          "score": 18
        },
        {
          "text": "Mine was a slightly different narrative. When **Mothership** first posted this news over at their FB page, I asked 3 questions. Within minutes, my comments were deleted and I was blocked.   \nI don’t even know that Mothership has the habit of deleting comments and blocking users. \n\nThese were the questions I asked: \n\n1. Since u managed to talk to the driver’s husband, did u ask about their nationalities? I mean wouldn’t that be your first question?\n\n2. There are so many post and pics on online from this incident and u choose to use these instead. Is it because it suits your caption of “overcome with guilt”?\n\n3. Does it ever occur to u to interview the Banh Mi seller who was one of the witnesses and the one who made a post in Vietnamese? But u chose the driver instead. \n\n\n\n",
          "score": 17
        },
        {
          "text": "You don't even tell us what you say. How to assess?",
          "score": 11
        },
        {
          "text": "You used the word right...you think we dont know.",
          "score": 9
        },
        {
          "text": "This is the real sg subreddit anyway.",
          "score": 9
        },
        {
          "text": "Learn from other country make 50 Reddit accounts with different profile and report the subreddit. High chance of the ceca sub closing down.",
          "score": 7
        },
        {
          "text": "you confirm mention “ceca” or “indian”, the sub is moderated by ceca…… any mentioned of these 2 word will instantly get you ban.",
          "score": 7
        },
        {
          "text": "Just comment RIP. You wont get banned",
          "score": 4
        }
      ]
    },
    {
      "id": "t3_1qz1wks",
      "subreddit": "SingaporeRaw",
      "title": "Singapore is truly an international city",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qz1wks/singapore_is_truly_an_international_city/",
      "score": 180,
      "num_comments": 55,
      "created_at": "2026-02-08T14:45:26",
      "selftext": "Car driven by a CECA hit Indonesians, witnessed by Vietnamese",
      "comments": [
        {
          "text": "And driving a CN made car lol",
          "score": 142
        },
        {
          "text": "Where’s the part where normal Singaporeans stepping forward to actually help?",
          "score": 44
        },
        {
          "text": "China car driven by an Indian that hit Indonesian, witnessed by Vietnamese that the news was hosted on United States platform that are being discussed by Singaporean.",
          "score": 28
        },
        {
          "text": "Legit no longer safe to live here as a local, can u fuckin imagine , it could be anyone, what if its you next? Fuckin unthinkable.",
          "score": 24
        },
        {
          "text": "Did anyone notice the area where the accident happened is a very open area where it is very hard to believe the driver did not see the pedestrians? See the photo please for analysis.\n\nhttps://preview.redd.it/vln8layws8ig1.jpeg?width=1206&amp;format=pjpg&amp;auto=webp&amp;s=1314754d406d8e7e9c09a14ddf13e1bfe97f79ed",
          "score": 18
        },
        {
          "text": "Bet the ceca driver is just thinking “oh no, going to be late for my nth chai latte of the day” while being wantonly nonchalant",
          "score": 13
        },
        {
          "text": "I think it's OK to import talent, but be quick to deport the jibai kia easily. Then the rest will be on good behaviour",
          "score": 4
        },
        {
          "text": "In CHINAtown, no less",
          "score": 2
        },
        {
          "text": "I mean it’s a popular tourist spot after all",
          "score": 1
        },
        {
          "text": "This one sarcastic max siol. But legit true",
          "score": 1
        },
        {
          "text": "CECA ?",
          "score": 1
        },
        {
          "text": "Spring street",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qz2b3b",
      "subreddit": "SingaporeRaw",
      "title": "Maybe it is time to tighten our borders. We cannot open our legs anymore.",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qz2b3b/maybe_it_is_time_to_tighten_our_borders_we_cannot/",
      "score": 177,
      "num_comments": 75,
      "created_at": "2026-02-08T15:08:45",
      "selftext": "",
      "comments": [
        {
          "text": "Pappies in their ivory tower: \"But...but...muh GDP\"",
          "score": 100
        },
        {
          "text": "who selling backside(s) ?",
          "score": 15
        },
        {
          "text": "As long as GDP is the KPI in government, all those working for government will always boost GDP no matter what. Fastest way is to get FTs in where they command higher pay than locals.",
          "score": 10
        },
        {
          "text": "Make singapore great again",
          "score": 10
        },
        {
          "text": "I don't. Next they want you to open your mouth.",
          "score": 10
        },
        {
          "text": "Wrong! Must open big big so home and car prices can continue to rise and govt make money.",
          "score": 10
        },
        {
          "text": "![gif](giphy|7vUBOECvNpUOs)",
          "score": 9
        },
        {
          "text": "Beat Annabelle record",
          "score": 8
        },
        {
          "text": "There is not maybe. 65% is ok so it’s majority.",
          "score": 7
        },
        {
          "text": "Before GE2025,\n\nAlready relax the road manslaughter law. People kpkb.\n\nCECA flooding our shores and many other countries kbkp and stop their flood but we embrace it.\n\nCitizens then double down and voted the incumbent in, again,heck even if they still in power but lose a few GRCs would have been a good wake up call for them.\n\nBut nope we keep blindly voting them in and see the many comments kpkb why this why that. 🙄\n\nWe all played your part in making this happen.",
          "score": 6
        },
        {
          "text": "Vell vell vell \\~",
          "score": 4
        },
        {
          "text": "blue collar job that locals dont want to do. introduce skillfuture and progressive wage but salary still cannot keep up with living expenses and standard. gst will increase by the time progressive wage reached locals' salary needs. locals mostly work in office role. business sector is where the demand is and that's why engineering are on the decline. infocomm and IT jobs are also in demand but business idea and goal comes first before implementing technologies. lot of locals are shifting away from engineering either before or after diploma.",
          "score": 3
        },
        {
          "text": "What do you mean? The bedrock of the country is growth at all cost.",
          "score": 3
        },
        {
          "text": "Sg is run as a revenue generator. The problems the general population face are not being solved, yet those up top are reviewing their salaries. \n\nImagine a company where the top executives are paid top dollar when the problems they are paid to solve only gets worse year by year",
          "score": 3
        },
        {
          "text": "Oh, and when the population starts shrinking and economy tanks.. the loser Singaporeans are gonna kaopeh some more. \n\nGive some real solutions, not half arsed suggestions to stem your individual disadvantage in this economy.",
          "score": 3
        },
        {
          "text": "Won’t hPpen one the fastest way to grow a simisai also don’t have island is import",
          "score": 2
        },
        {
          "text": "I feel this population ponzi policy once implemented is unable to u turn. Good luck to those still have hope this policy will stop. They need an ever increasing population to support the cards from falling. ",
          "score": 2
        },
        {
          "text": "Funnily enough lots of younger generation New Zealanders are migrating to Australia",
          "score": 2
        },
        {
          "text": "The goal is 10 million, son. ",
          "score": 2
        },
        {
          "text": "Don’t worry, next few weeks we will drop back to 4mil Covid times population, annual migration practices. Enjoy while it lasts.",
          "score": 2
        },
        {
          "text": "its not \"Maybe\", its long over-due.  \n\nbut PAP need to import FTs, give them new citizenship, otherwise no one will vote for PAP.",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1qz3ysy",
      "subreddit": "SingaporeRaw",
      "title": "I am so proud to be banned from AskSingapore, CECA MOD!",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qz3ysy/i_am_so_proud_to_be_banned_from_asksingapore_ceca/",
      "score": 179,
      "num_comments": 65,
      "created_at": "2026-02-08T16:49:20",
      "selftext": "",
      "comments": [
        {
          "text": "we need to compile a list of disgusting mod behaviours in r/Singapore and r/askSingapore. they’re actively silencing people from speaking out",
          "score": 79
        },
        {
          "text": "I love this subreddit. Lmao",
          "score": 57
        },
        {
          "text": "I've been pbanned there a long time ago. That sub should be renamed r/CECApore LOL.\n\nhttps://preview.redd.it/gu6lg1a3p8ig1.png?width=1000&amp;format=png&amp;auto=webp&amp;s=3b65d131ade03b43a4b729fce24682dc1b70c391",
          "score": 57
        },
        {
          "text": "https://preview.redd.it/hdipbd2ol8ig1.png?width=360&amp;format=png&amp;auto=webp&amp;s=33ebecf0c9e7bbb5d2a0a0434ea3d51015afdaeb\n\nLol same",
          "score": 30
        },
        {
          "text": "https://preview.redd.it/5dn82p2c69ig1.png?width=598&amp;format=png&amp;auto=webp&amp;s=8e7fb2a97de372d81f74406f187cdecd29c27759\n\n",
          "score": 22
        },
        {
          "text": "You have hurt the [izzat](https://x.com/MarcScottEmery/status/1992461284458315899) of the CECAs that run r/singapore and r/asksingapore and they must take revenge",
          "score": 22
        },
        {
          "text": "u/MightyMasala (reddit admin for sg and india) any thoughts?",
          "score": 16
        },
        {
          "text": "Every negative connotations associated with them is immediate race card\n\n![gif](giphy|t3KiY9mmAQHJ1pVWos)",
          "score": 15
        },
        {
          "text": "At least no police cars were burned or overturned after the accident unlike the riots in little India. That's a positive.",
          "score": 12
        },
        {
          "text": "the mods are a joke",
          "score": 9
        },
        {
          "text": "To continue the fight in r/sg\n\nAlways have an alt account ready, u need have a 40 day account (latest) and non negative points to post and comment there \n\nPro tip\n\n1. Uninstall the official reddit app, they track u and will inform the moderators of your alt account, even when u use VPN, change IP etc. \n\n2. Register an alt account WITH mobile data so the IP address will be unique",
          "score": 9
        },
        {
          "text": "Tbh I have never seen a race that is gather so much hate world wide. Last time use to be prc now is india.\n\nI guess cause they mass migrate out and they go to other nation to take jobs. It is ok that if their skillset is extremely good or talented but most of time 90 percent cannot really perform. The only one can perform are 10 percent only. \n\nYou dont see much hated towards angmoh in a lot of country or prc nowadays. Most of time this group really have some talent before they dare to sell themself to the world.\n\nThere a quote saying The trouble with the world is that the stupid are cocksure and the intelligent are full of doubt.\" \n\nThat means people who has poor talent tend to be more overconfident than people with real skills",
          "score": 8
        },
        {
          "text": "Welcome to sgraw, where all the rejects of r/sg and edmw hang out. Oh and Indian tourists looking for hookers.",
          "score": 5
        }
      ]
    },
    {
      "id": "t3_1qz7bca",
      "subreddit": "SingaporeRaw",
      "title": "I predict that there will be news about local terrorism",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qz7bca/i_predict_that_there_will_be_news_about_local/",
      "score": 167,
      "num_comments": 53,
      "created_at": "2026-02-08T20:08:52",
      "selftext": "The Chinatown accident may be drawing too much public attention. I suspect that in the coming days the government will attempt a distraction, perhaps by releasing news related to local terrorism.   \n  \nBased on my observations, whenever unfavorable news arises, it is often followed by reports of terrorism. \n\nLet's see if I'm right. If not, I chop.",
      "comments": [
        {
          "text": "There might be more complains from CECA that they are being targeted. Knowing how civil mindless they are. Screw them.",
          "score": 171
        },
        {
          "text": "The govt dun joke about terrorism. I can see they are doing their best to protect the woman identity. There are alot of IB( even in our sub), banning of users discussing about CECA in other subs.",
          "score": 124
        },
        {
          "text": "How you verify you chop? Taking out my popcorn",
          "score": 26
        },
        {
          "text": "Yeah you right they like to cover news, just like they start to catch e hailing carpool from malaysia at the same time same month they released news related about **autonomous driving** , grab ceo ask driver to go upskill etc.. meaning alot driver going to lose job when autonomous car successfully functioning",
          "score": 22
        },
        {
          "text": "Distract by bringing up former LO Pritam Singh again.",
          "score": 20
        },
        {
          "text": "![gif](giphy|SXkwx68Y4x6MlswX4Y)",
          "score": 12
        },
        {
          "text": "This kind of thing you better dont joke. one road good walk",
          "score": 12
        },
        {
          "text": "Yes and you lot who complain about CECA would be branded domestic terrorists by the PAP.",
          "score": 9
        },
        {
          "text": "Don't joke about this kind of matter. We're a peaceful country.",
          "score": 9
        },
        {
          "text": "They will bury news with more news: [https://www.straitstimes.com/asia/se-asia/child-opens-car-door-causes-accident-involving-six-cars-in-kuala-lumpurs-jalan-tun-razak](https://www.straitstimes.com/asia/se-asia/child-opens-car-door-causes-accident-involving-six-cars-in-kuala-lumpurs-jalan-tun-razak)",
          "score": 8
        },
        {
          "text": "Might stage a fake event that some CECA is being targeted due to rising xenophobia blah blah…you know the drill. We’ll see.",
          "score": 7
        },
        {
          "text": "Maybe not terrorism but they might be cooking something",
          "score": 6
        },
        {
          "text": "CNY,coming. All will be forgotten",
          "score": 4
        },
        {
          "text": "If they do attempt at a victimisation-motivated  protest, will it finally be high time to do a thorough cleanse of deporting the nationalistic ungrateful fraudulent ones?",
          "score": 4
        },
        {
          "text": "Popcorns rdy for the chop",
          "score": 4
        },
        {
          "text": "BRO YOU WERE RIGHT: \n\nhttps://www.channelnewsasia.com/singapore/full-time-national-serviceman-nsf-arrested-paya-lebah-air-base-fake-bomb-threat-5916901?cid=telegram_cna_social_28112017_cna",
          "score": 4
        },
        {
          "text": "Erm I thought it was the Feb 2026 Singapore budget to distract",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1qzs0jl",
      "subreddit": "SingaporeRaw",
      "title": "Even Malaysians are furious when they learnt about CECA",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qzs0jl/even_malaysians_are_furious_when_they_learnt/",
      "score": 86,
      "num_comments": 27,
      "created_at": "2026-02-09T10:26:13",
      "selftext": "",
      "comments": [
        {
          "text": "Other country is also learning from Singapore failure. That’s why never sign the CECA.",
          "score": 25
        },
        {
          "text": "Why can’t ceca go into Malaysia? Why must come here.",
          "score": 25
        },
        {
          "text": "Whoever signed the CECA caused so much hardship to Singapore",
          "score": 13
        },
        {
          "text": "As a Malaysian I am very flabbergasted about the low quality mainstream media you Singaporeans have at trying to cover up and gaslight the public by painting the woman to be 'remorseful' just so your government can justify their CECA initiatives. I've said it before and will say it again, your government is run by psychopaths and you have a high Cluster-B population count (sociopaths and narcissists)",
          "score": 9
        },
        {
          "text": "Woah woah woah are you a jhk creating unnecessary tensions between singaporeans and foreigners /s",
          "score": 5
        },
        {
          "text": "[ Removed by Reddit ]",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qz15u9",
      "subreddit": "SingaporeRaw",
      "title": "WTF is wrong with SG these days ?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qz15u9/wtf_is_wrong_with_sg_these_days/",
      "score": 86,
      "num_comments": 61,
      "created_at": "2026-02-08T14:04:00",
      "selftext": "We used to have high standards in safety, personal conduct, discipline and future plannings.\n\nThese days I also don't know what to say.\n\nTake simple case of having PMA on footpath.  With no clear guidances and minimum enforcement, people will abuse it for their convenience.  It is a safety hazard for all pedestrians.  Imagine a fast moving motorised vessel hitting you, it is going to cost you injuries or death.  If old people get hit, their bones can easily crack and thats it.  Why can't the authority see this coming?  Are they blind to the future impact?  Or they just want to apply a temp fix to their food delivery problem, that will be disastrous in the long run ?\n\nNow, lapses in enforcing driver license standards, causing current accidents.\n\nIt is like authority see a small leaking pipe, apply temp fix using masking tape, then ignore problem until water pipe burst big big.  Is this our gov standard these days ?\n\nWho is the F\\*cking Idiot, the ccb, simi lanjiao, dog F8ck you, who is sleeping on the job.",
      "comments": [
        {
          "text": "It's been like this after LKY",
          "score": 82
        },
        {
          "text": "Ministers nowadays no iron in them. Too afraid to take risk. Only know how to react, not prevent",
          "score": 36
        },
        {
          "text": "MRT reliability down too. Must ask the transport minister abt it.",
          "score": 26
        },
        {
          "text": "Waiting for so called PMD enforcement to conduct ICE like day time raids. Kicking people off PMD in broad daylight and crushing PMD on the spot. Busting down HDB doors to destroy PMD or snatching people off their PMD.",
          "score": 17
        },
        {
          "text": "Our current Leaders are too weak. You can label them useless. With or without them no difference.",
          "score": 15
        },
        {
          "text": "They just finished kicking leader of the opposition out from the main seat. Now just starting on the PMD and etc. after that take a break. After that focus on kicking ex- leader of opposition of parliament. Where got time to focus on things you highlighted\n\nDon’t forget we are the ones who voted for them 🤷‍♂️",
          "score": 15
        },
        {
          "text": "In sg, unless someone dies, the \"authorities\" will do nothing.",
          "score": 13
        },
        {
          "text": "It seems the politicians nowadays are too risk-averse. They don't want to impose anything that could be seen as too drastic because they're afraid they'll lose votes.",
          "score": 13
        },
        {
          "text": "This is what happen when the government becomes obsessed with GDP, runs the country like a corporate company and opening the country to foreigners without proper restrictions in place.",
          "score": 11
        },
        {
          "text": "Whored ourselves out for foreign investment.",
          "score": 10
        },
        {
          "text": "Coz they realised they can put in minimum effort or wayang a bit when things go wrong and still get 65% votes",
          "score": 10
        },
        {
          "text": "Learnt from the very top. The top only focus on fixing opposition. So.... Figure it out",
          "score": 6
        },
        {
          "text": "Singaporeans. \n\nWe used to be 3rd world, but we knew what was right and wrong.\n\nNow, we may be 1st world, but we lost ourselves somewhere along the way. \n\nNo one really knows what the point of Singapore is anymore, besides making more and more money.",
          "score": 5
        },
        {
          "text": "Who u voted for?",
          "score": 4
        },
        {
          "text": "Population.\n\nGood standards need time and space. \n\nBut to make $$$, you need more ppl/space less time.",
          "score": 3
        },
        {
          "text": "Its what happens if no pay rise in so many years...affects motivation in so many ways..",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1qzq6vh",
      "subreddit": "singaporefi",
      "title": "My 3 favorite things about getting rich",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qzq6vh/my_3_favorite_things_about_getting_rich/",
      "score": 500,
      "num_comments": 135,
      "created_at": "2026-02-09T08:55:10",
      "selftext": "Hi, long time lurker first time poster, using a burner account. I’m in my mid 30s and after working for a little over a decade, I’ve managed to accumulate about SGD 2 mil in liquid assets (not including my house and CPF). The screenshot provides some proof (my equity account). I don’t have generational wealth, but I’m very financially secure. \n\nThis financial security has made my life much, much better. These are my 3 favourite things about getting rich. \n\n1. **I can prioritise life over work.** \n\nMy kids had a bout of illness recently and I took time off work to care for them. As I went through my calendar for the month, I realised that on average, I had worked four days or less each week. And more importantly, I was never stressed about what this might mean for my work or my performance.\n\nThis mindset and ability to let go are new to me. I’ve always put my best into school and work, and this paid off. I scored well, got a high paying job, and promoted fast. But as my salary grew so did my stress, my belly, and the number of friendships I lost. So over the past two years I’ve consciously traded work to reverse these trends and spend more time with my family.\n\nWork-life balance looks different for everyone. I like but I don’t love my work, so having the peace of mind from my finances to no longer feel a strong need to work has absolutely done wonders for me. My family, health, and social life have taken priority over my work, and I feel a lot happier most days. \n\n2. **I have a portfolio that lets me sleep well at night**\n\nSince this is r/singaporefi I guess I should share my current portfolio. It’s roughly: 65% equities (LSE ETFs), 30%  cash and bonds, and 5% gold. \n\nCan I optimize my portfolio? Definitely. Given my age I should allocate more to riskier assets, maybe even crypto. In fact, I got rich not just through high savings from a high paying job, but also because my old portfolio was almost 100% equities with many stock picks (big tech) that did very well. \n\nBut my old portfolio was too risky and I often lost sleep over it. No longer. After crossing the SGD 1.5 mil mark I rebalanced it slowly to where it is now and I have never lost any sleep over my portfolio since then. Yet the returns on my suboptimised portfolio last year covered my \n\nentire annual expense. \n\nAnd that’s one of the best things about being rich. I don’t need to take financial risks. I don’t need to chase high returns. I don’t need to care about vagaries of the market. I can just do whatever preserves my wealth and lets me sleep best at night.\n\n3. **I spend whatever I want on people and things that make my life better.**\n\nMy family and I went to MBS last year. When we arrived we realised that we had forgotten one of our kids’ shoes. Driving home or letting kiddo walk around barefooted weren’t options. So we just waltzed into one of the atas MBS kids shop and picked up a ridic overpriced pair of kids shoes. In our calculus, it was more than worth it to spend three digits to save the effort of carrying our chonky kid around the whole day. \n\nI can’t afford to buy a GCB or a sports car or fancy watches. But I can take grab everywhere, order ala carte at restaurants, and fly premium economy. I can splurge on experiences like holidays and musicals with my parents and wife and kids. I can throw money at problems and buy time and convenience. And to me, these things are the best uses of money, and one of the greatest perks of being rich. \n\n——\n\nTL;DR Life gets much better as you get rich, but only if you let it.\n\nGood luck everyone! ",
      "comments": [
        {
          "text": "Abit hao lian but money really solve 99% of your problems",
          "score": 425
        },
        {
          "text": "One last thing I’ll say about wealth and happiness that has really helped me: stop shifting the goalpost. Don’t fomo when you see rich people flaunting on social media (I’ve deactivated all my socials less Reddit and I’m much happier). Don’t chase money for money’s sake. Set financial goals for yourself and once you hit them, learn to slow down and enjoy the rewards of your labours.",
          "score": 169
        },
        {
          "text": "有钱不是万能，没钱是万万不能。",
          "score": 77
        },
        {
          "text": "Hey op, happy that with wealth you started finding your meaning to life! I think the unfortunate part of SGs rat race is that we really really forget that money is just a tool to our goals but is not our be all end all.",
          "score": 74
        },
        {
          "text": "congrats and fk u",
          "score": 26
        },
        {
          "text": "Congrats! Curious what industry are u in to enable accumulation of wealth this quick?",
          "score": 16
        },
        {
          "text": "Well said. I’m in mid 30’s too but in the opposite pole financially 🤣. Maybe will reach you level one day, I’m confident. Regardless, wish you all the best",
          "score": 13
        },
        {
          "text": "Could you share more on ur portfolio- what’s included in these ((65% equities (LSE ETFs), 30%  cash and bonds, and 5% gold.)).. and how did you decide on these, did ur RM recommend or? .. I have a priority RM at SC too but never got recommended any of these. How’s the fees like to invest w SCB.",
          "score": 11
        },
        {
          "text": "Inspirational! Indeed some of the best things about having significant assets are not really caring about having to climb the corporate ladder, being able to help out loved ones and where needed, using money to solve problems. I don't think many would fully appreciate the line about not buying sports car, watches, etc - I'm pretty sure you can afford to pay for a sports car. Whether it's the wise thing is a completely separate matter. That separates the HENRYs from those with Financial Independence. \n\nAlso like that you were clear about how working hard when younger was one reason that enabled you to reach your current state - many just like to YOLO and then later be sour grapes (or just say it's due to luck/family wealth) about others who have achieved stability",
          "score": 6
        },
        {
          "text": "Well done on the GPGT!",
          "score": 5
        },
        {
          "text": "Being rich and debt free indeed changes life's priorities, no longer feel pressured by bosses because they don't have any leverage on me. Whereas I often see the hardest workers are always those with the biggest mortgage loans.",
          "score": 5
        },
        {
          "text": "Congrats OP and well done for posting this on a Monday morning to start off everyone's week! 🤣 \n\nI was in a similar boat as you, got lucky with investments during the pandemic, then jumped jobs for a nice pay bump. The difference is that I blew most of my cash on a nice 4 bedder. This was during the property upswing too so I doubt I'll see much appreciation in the coming decades.\n\nBut I have three kids and the extra space solves a lot of my headaches and makes me happy at the same time. And that's something I can't put a price on.",
          "score": 5
        },
        {
          "text": "Legit question, what are your insurance coverage looking like?",
          "score": 4
        },
        {
          "text": "I agree, especially your MBS shoe purchase. Money gives us options to make dailies easier, more comfortable. To be a little careless in our planning, and enjoy life. To be more spontaneous. \n\nI know many people who make conscious effort to avoid ERP’s either by going home later, or taking a longer route than waste another 20 mins or so. Most of these folks have family at home waiting. Or worse, stay in office for another 1 hour just to kill time and show their face. \n\nOr even folks who don’t mind inconvenience of parking far from their destination (and most of the time always not punctual). \n\nI guess the difference between frugality and being cheapskate is contextual and subjective.\n\nIf you (or your partner) had constantly complained or whined about overpaying for the shoe, berated each other for forgetting. Blaming each other for having to spend the money then that will be terrible IMO. But if it was taken as a fun memory for the family and a joke to not forget shoes in future etc, it’s all worth it. It’s really all about the individual and how they handle it.",
          "score": 4
        },
        {
          "text": "Congratulations! 🥳",
          "score": 3
        },
        {
          "text": "Well done and so early in life as well. Hope u find true happiness too beyond wealth.",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1qz1tkg",
      "subreddit": "singaporefi",
      "title": "U.S. job cuts soaring",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qz1tkg/us_job_cuts_soaring/",
      "score": 79,
      "num_comments": 23,
      "created_at": "2026-02-08T14:40:41",
      "selftext": "",
      "comments": [
        {
          "text": "Just keep posting, you’ll be right one day 👍🏻",
          "score": 39
        },
        {
          "text": "Just one data print and ppl can predict where market is going. Wow very impressive",
          "score": 21
        },
        {
          "text": "interest rates to fall. bullish.",
          "score": 17
        },
        {
          "text": "For those who think the bull run has started, just look at who is dumping and buying the dip. \n\nWhenever SP500 goes up you get a high volume dump from institutional (smart money), and retail (you) buys the dip at low volume to drive up prices, then smart money dumps again. Retail is being used as exit liquidity \n\nFriday’s pump was actually at much lower volumes than Wednesday and Thursday. What do you think happens at the end of the wyckoff distribution when retail stops buying?",
          "score": 12
        },
        {
          "text": "It has been quite clear that the US has entered some late stage capitalism phase.\n\nThe US stock market is even more decoupled from the actual US \"middle class\" than ever. Their companies make money hand over fist, but require no additional labour to do so. The stock market is dominated by not the Fortune 500, but by the Top 10 companies, which... surprise are all Tech or meme stocks (TSLA).\n\nWhat will happen first. A complete collapse of the stock market or A civil war in the US? I don't know.",
          "score": 9
        },
        {
          "text": "Welcome back. I was personally beginning to have some FUD myself but now I can confirm that it’s time to place my buy order.\n\nThank you.",
          "score": 7
        },
        {
          "text": "Job cuts imo just mean they're hiring and resetting the pay scale. Senior role jobs suddenly get changed to junior positions that cost less or same tier get reset from the one that hit salary ceiling to someone who get entry pay.",
          "score": 2
        },
        {
          "text": "Yes bro.\n\nNote also that stock market hit ATH in 2022 when most of US haven't even recovered from covid.",
          "score": 2
        },
        {
          "text": "Layoff season starts again😔",
          "score": 1
        },
        {
          "text": "Post your short positions",
          "score": 1
        },
        {
          "text": "SPX at ATH what are you talking about",
          "score": 1
        },
        {
          "text": "Still waiting for the recession word in the headline",
          "score": 1
        },
        {
          "text": "seriously, you have been posting bearish news about the US market, and bullish news on assets like gold since god knows when\n\nBut US market is healthy and gold recently had a correction. The us market will eventually correct itself and gold will eventually hit new highs, but you will forever be known as an idiot",
          "score": 1
        },
        {
          "text": "DCA into the s&amp;p500 like this sub tells you to. That's when you know it's time to run.",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qzdme4",
      "subreddit": "singaporefi",
      "title": "SBF Query",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qzdme4/sbf_query/",
      "score": 6,
      "num_comments": 24,
      "created_at": "2026-02-09T00:38:09",
      "selftext": "Hey everyone! First time here. My family and I (my wife, our 18-month-old son, and I) are planning to apply for an SBF flat that is estimated to be completed in Q1 2028. It is a 4-room HDB flat that would cost about $780K.\n\nWe have completed our HFE and it has been approved, showing that our maximum loan eligibility is $880K. Our household income is about $15K per month. I am a first-year PR (approved in May 2025). We currently have about $100K in savings (CPF OA + cash). I am 31 this year, and my Singaporean wife is 28. I also save at least 3.5K - 4K a month. \n\nGiven our current financial standing, do you think it would be ideal or wise for us to proceed with this purchase, or should we consider a lower-priced HDB instead?",
      "comments": [
        {
          "text": "isn’t the income ceiling for BTO/SBF $14k?",
          "score": 17
        },
        {
          "text": "Assuming your situation, HFE cleared all green.\n\nFirst issue is LTV. Youll only be able to loan up to 585k. The 195k youll have to cough up yourself.\n\nYou have 100k OA + savings. Thats another 95k shortfall. So 2028 is like 2 years, if you can cover up approximately another 47.5k annually for the next two years, you'll barely scrape by to afford this unit.\n\nMy honest 2c? Dont go for it, its beyond your current capacity. Straight answer to you is to get approximately 550k units, this way you're not going to strangle yourself for the next 2 - 3 decades. Assuming that your wife/family is fine, doesnt run away or cause trouble.",
          "score": 12
        },
        {
          "text": "The advice I got when I bought my first flat 20 years ago was to buy a larger flat slightly out of my budget (at the time) because my salary will rise annually. Plus kids will eventually come into the picture. But with retrenchments being so common these days it’s a bit more difficult to give this advise.",
          "score": 8
        },
        {
          "text": "Financials aside, some places SBF is 1:20 over application rate. You should apply first to up your chances (should you fail you get more priority next round)\n\nAlso dont get ur hopes up high. Bto and sbf hardly anyone gets it on first try application unless you are that lucky",
          "score": 4
        },
        {
          "text": "taking into account your future cash savings + CPF, id say go for it.",
          "score": 4
        },
        {
          "text": "I thought you can’t buy if you exceed income ceiling of 14k",
          "score": 2
        },
        {
          "text": "must be a damned high floor and good location unit. \n\nassuming you can make the math work - don’t forget LTV limits etc like some others have pointed out, ask yourself this:\n\nwill i be happy living here even if i don’t make any profit in real terms?\n\nif yes and numbers work out, go for it! yolo in the positive sense and it makes sense to live where you like.",
          "score": 2
        },
        {
          "text": "Buy the biggest Bto in the best location u can. Your future self will thank you.",
          "score": 1
        },
        {
          "text": "The numbers look ok to me. Go ahead. \n\nAnything in particular you are worried about? The only thing I can think about is a job loss I guess. But if your jobs are reasonably stable then seems ok.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qz789k",
      "subreddit": "singaporefi",
      "title": "Social aspects of FIRE",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qz789k/social_aspects_of_fire/",
      "score": 3,
      "num_comments": 42,
      "created_at": "2026-02-08T20:04:09",
      "selftext": "For those who have FIRed, how do you deal with the social aspects of FIRE? For example, how do convey your FIRE status to your in laws in a way that they can accept? Especially if you have children and there is an expectation to provide for your children by continually working?\n\nHow do you tell your friends and relatives?",
      "comments": [
        {
          "text": "Don’t tell anybody. \nFIRE gives u options. And one of the option is to retain peace.\n\nNot everybody has the capacity to be happy for u unless they can benefit from u. \n\nJust show up when they genuinely need it. Else, enjoy ur peace.",
          "score": 61
        },
        {
          "text": "Why must tell them?",
          "score": 48
        },
        {
          "text": "How to be financially independent but not independent.",
          "score": 19
        },
        {
          "text": "Why need to tell?",
          "score": 16
        },
        {
          "text": "That's your life to enjoy, and no one else's to interfere with. Carry on as per normal, and have some believable cover story about how you spend your time. Don't post your travel, dining, vehicle, and purchases on social media. The more private you are the better. No one is truly happy for you when you make money! ",
          "score": 14
        },
        {
          "text": "CNY is coming up. I just tell my relatives I'm still working even though I've relocated and continue to post my travel pics. Even when I was working in the past, I still post a lot of travel pics so it's up to them whether they want to believe or not. \n\nIf I told them I've FIREd, I think it will bring about a lot more questions and comments that I'm more of a lazy bum not contributing to society so I don't do that. Not everyone can understand saving up and spending below your means is the way to go.",
          "score": 14
        },
        {
          "text": "I won't tell my in-laws at all. If you don't tell, they won't know unless staying together. They come knocking at my house on a random weekday, I just don't open the door. If they ask, \"Still working at the same company?\" Just say yes. Relatives asking for job vacancy? Just say no vacancy at the moment.\n\nIf friends, only my best friend will know. Also, don't post on social media about you being FIRE-d and no one will know, really. Just live a quiet life and you'll be alright.",
          "score": 5
        },
        {
          "text": "Yes, there's an expectation to provide for your children. But if you can do that just with passive income, then good.",
          "score": 2
        },
        {
          "text": "why do u need their acceptance?",
          "score": 2
        },
        {
          "text": "How would your in-laws know whether you are working or not? U dun say, your wife dun say, who knows? ",
          "score": 2
        },
        {
          "text": "When someone asks me what i do - i just give them my profession (the truth) and say something along the lines of “consultancy” (which is a lie).",
          "score": 2
        },
        {
          "text": "Act broke and ask them for money instead hahaha",
          "score": 2
        },
        {
          "text": "Some people say they are a \"private investor\" when they FIRE, which is basically true.",
          "score": 2
        },
        {
          "text": "Loose lips sink ships",
          "score": 2
        },
        {
          "text": "don't tell. never tell. still go to work, admin job, be a loser in front of them, saves alot of trouble.",
          "score": 2
        },
        {
          "text": "You don’t need to tell anyone; you could be inviting more questions and doubts. Just tell them now you can work from home and your schedule for work is more flexible. \n\nFor friends, when you retire early, many will give you that doubtful eye and bring jealousy to the friendship. Now I don’t even say how I achieved FIRE and retired early anymore, I just enjoy in silent n continue to build my income stream.",
          "score": 2
        },
        {
          "text": "Why do you need to tell them anything? Are you living with them that they are monitoring whether you go to work every day?",
          "score": 1
        },
        {
          "text": "If uou wanna brag sure can just tell the whole world bout it",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qzls5d",
      "subreddit": "singaporefi",
      "title": "Seeking advice for portfolio",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qzls5d/seeking_advice_for_portfolio/",
      "score": 1,
      "num_comments": 6,
      "created_at": "2026-02-09T05:41:44",
      "selftext": "What I currently have\n\n\\-AIA Guaranteed Protect Plus (II)\n\n\\-AIA Solitaire PA (II)\n\n\\-GE Great Wealth Advantage 4 (GWA4), $6k/year\n\n\\-REIT+ (Property), $8k\n\n\\-Core Equity100 (Stocks), $8k\n\n\\-Income+ Enhance (Income-focused), $6k\n\nI currently take home about $3.5k/month. I’m struggling to see meaningful wealth growth or passive income and feel like I may not be allocating my money efficiently.\n\nThis made me question whether:\n\n\t•\tMy current setup makes sense\n\n\t•\tI’m over-insured / under-insured / misallocated\n\n\t•\tI should cut losses or restructure early rather than continue blindly\n\nAppreciate any honest feedback. Thank you!",
      "comments": [
        {
          "text": "brother, if before sunrise you post this kind of thing i sincerely suggest you just remain the policies that are for 1. Hospitalisation 2. Critical Illness 3. Personal Accident. \n\npls do not bother with so called growth policies. either take the plunge and be an index dumper or get SSB and similar and throw the rest into a HYSA. i promise you won’t be posting at 0530 AM on a Monday ever again.",
          "score": 16
        },
        {
          "text": "not surprised with the lack of growth when you are donating your money to fund your FA’s new car",
          "score": 10
        },
        {
          "text": "lol @ “portfolio” when it’s mostly insurance products.",
          "score": 3
        },
        {
          "text": "Why you mentioned all the insurance company names, but the actual investments you didn't list the platform? I think all 3 are Syfe?\n\nHow long have you been using Syfe that you feel that there's little gains? Are you merely being impatient or did you lose money in the REITs from starting a few years ago?\n\nThe GE ILP everyone will say is lousy (like all ILPs). But you need some details about how long you've been in it, surrender value etc to get advice on whether to surrender.\n\n",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qzt0h0",
      "subreddit": "singaporefi",
      "title": "Anyone into futures trading in full time or part time",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qzt0h0/anyone_into_futures_trading_in_full_time_or_part/",
      "score": 0,
      "num_comments": 10,
      "created_at": "2026-02-09T11:13:42",
      "selftext": "Hi i want to know if anyone doing full time or part time futures trading in btc or any other securities in singapore ? Want to discuss ….",
      "comments": [
        {
          "text": "Ok lets discuss, i am into full time/part time options trading, hahahaha",
          "score": 1
        },
        {
          "text": "Part time. The only way you can even have a hope of trading futures successfully is watch the tape.",
          "score": 1
        },
        {
          "text": "tried a few times, didn't do well, too fast for me.\n\ngood luck!",
          "score": 1
        },
        {
          "text": "For most people, they’re better off not dabbling into it. The chances of being consistently profitable in the long run are very slim. You not only need to learn the system to trade (different strategies can work), you need to be able to regulate the fluctuating emotions that come with trading so that you follow the rules of the system. The latter being the hardest to do well because it goes against human impulses. \n\nSome people just don’t have the ability to manage their emotions well and at some point they break - tilt, revenge trade, over leveraging. \n\nMost of the discipline that enables you to follow your rules of trading are actually built off the charts, in your everyday life, and that transfers to trading. \n\nSo in short, it will take a few years to learn and attempt to be profitable. At the same time, you’ll go through roller coasters and learn how to manage those emotions as you go. \n\nIf you don’t mind spending years, money, and going through emotional turmoil to have a shot at being a consistently profitable trader then go for it. For most, it should not be a path. Better off having an active income and invest passively",
          "score": 1
        },
        {
          "text": "May i know any resources that you follow to learn ? While you doing researches ? And may i know what s the minimum amount i can trade around ?",
          "score": -2
        }
      ]
    },
    {
      "id": "t3_1qz5t9m",
      "subreddit": "singaporefi",
      "title": "Career Opportunities at ICA. Mid career",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qz5t9m/career_opportunities_at_ica_mid_career/",
      "score": 0,
      "num_comments": 4,
      "created_at": "2026-02-08T18:41:19",
      "selftext": "Hi People,\n\nI am looking for opportunities to join ICA - Singapore immigration authority for mid career.\n\nI am mid 40 age . Basic degree no honours .\n\nDon’t know whether it is too late.\n\nFormerly in sales .\n\nWhat are the roles and job opportunities I can apply for .\n\nIs it difficult to get a job .\n\nHope can get more insights.\n\nThank you very much .",
      "comments": [
        {
          "text": "Is the job market so bad that people are switching to uniformed careers at the ripe age of mid 40s?",
          "score": 6
        },
        {
          "text": "Better than do GrabFood, bro.",
          "score": 4
        },
        {
          "text": "Just email them and enquire. \n\nI think they might have specific batches for intake because you’ll need to attend training for 20-26 weeks.\n\nYou will probably need to clear medical and fitness to get a job there though.\n\nCan refer to their recruitment ad they got mothership to release last year https://mothership.sg/2025/06/ica-sign-on-bonus/",
          "score": 4
        },
        {
          "text": "Honestly, doubt you will get an interview ",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1qzt7vo",
      "subreddit": "singaporefi",
      "title": "Did Relative FIRE or is in need of help?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qzt7vo/did_relative_fire_or_is_in_need_of_help/",
      "score": 0,
      "num_comments": 11,
      "created_at": "2026-02-09T11:23:36",
      "selftext": "How do I know if the relative FIRE or is need of help. \n\nthe person in question has  kids and I don't want the children to suffer. I was thinking of giving a bigger ang pow, but I don't want it to be \"reciprocated\". Also, someone reminded me that maybe the relative actually FIRE, and I should't just be so presumptuous. \n\nIt is too sensitive to ask why my relative has not been working for so long.. and too nosey too to me. so I won't be doing it. \n\nrelative is low key, doesn't have flashy lifestyle but doesn't seem to be keen on job hunting either. doesn't seem desperate to pack left overs, or penny pinch either. ",
      "comments": [
        {
          "text": "well.. i wont be peeping into relative's finance and i dont think i will want any of my relative to look into mine either.",
          "score": 23
        },
        {
          "text": "Your Ang Pao 10k/20k?\n\n\nDon't so kay po",
          "score": 9
        },
        {
          "text": "I wouldn’t even do it. It might give ideas that you are good to tap on for a loan or two. Give any about that you feel comfortable with. It doesn’t need to be super huge but you can give birthdays etc if you think they are looking a bit needy",
          "score": 7
        },
        {
          "text": "Just start a simple conversation about what he or she is up to. If you are close and no judgement, he or she will say.\n\nCan even include about yourself hearing on this term called FIRE in the chats.",
          "score": 5
        },
        {
          "text": "Just give lo. It’s a blessing to give",
          "score": 3
        },
        {
          "text": "hero complex?",
          "score": 3
        },
        {
          "text": "Don't pry if they are not asking for help.",
          "score": 2
        },
        {
          "text": "Don't be so kaypo la.  If people said they retired then just take it as it is.",
          "score": 2
        },
        {
          "text": "Not sure about your relative but I'm in need of help, can pass the angpao to me instead",
          "score": 1
        },
        {
          "text": "Look at whether the kids' lifestyle has dropped. Look at their clothes, talk to them about whether they have a lot of tuition or enrichment. If they say they used to do XYZ but now no need, that's a clue that these paid activities were dropped because the parent is struggling financially.\n\nIf everything is normal with the kids, then it might very well be FIRE. ",
          "score": 1
        }
      ]
    }
  ]
}