{
  "schema_version": "raw_scrape_v1",
  "report_id": "2026-02-12",
  "scraped_at": "2026-02-12T12:29:44.872852",
  "subreddits": [
    "singapore",
    "askSingapore",
    "SingaporeRaw",
    "singaporefi"
  ],
  "total_posts": 40,
  "total_comments": 473,
  "posts": [
    {
      "id": "t3_1r1ruds",
      "subreddit": "singapore",
      "title": "PRC Embassy’s statement on recent UNC3886 attack on SG",
      "url": "https://old.reddit.com/r/singapore/comments/1r1ruds/prc_embassys_statement_on_recent_unc3886_attack/",
      "score": 532,
      "num_comments": 182,
      "created_at": "2026-02-11T16:25:16",
      "selftext": "",
      "comments": [
        {
          "text": "So they don’t deny it.",
          "score": 585
        },
        {
          "text": "Sure sure",
          "score": 351
        },
        {
          "text": "China is gonna seize our Terrexes again to show their displeasure. 10 years have been too long with no Terrex seizures /s",
          "score": 196
        },
        {
          "text": "Translation: \"It's me but don't say so loud leh\"",
          "score": 156
        },
        {
          "text": "\"Responsible\" major country lol",
          "score": 121
        },
        {
          "text": "So, how much poking and pushing can they take before we see the same action that took against Japan? \n\nFor science.",
          "score": 119
        },
        {
          "text": "\"Singapore has hurt the feelings of the Chinese people\". \n\n- Standard PRC cookie cutter response to just about everything, and surprised this wasnt used. \n\nSG should feel honored that China took the time to craft a unique whiny-bitchy Karen like press release for them!",
          "score": 73
        },
        {
          "text": "![gif](giphy|1AIeYgwnqeBUxh6juu)",
          "score": 28
        },
        {
          "text": "But they didn't deny it's linked to the chinese government",
          "score": 27
        },
        {
          "text": "Do we have our own hackers ah? Or are ours so good that they never cock up and get discovered?",
          "score": 22
        }
      ]
    },
    {
      "id": "t3_1r2c0sz",
      "subreddit": "singapore",
      "title": "Scoot's handling of KL to SG flight Cancellation",
      "url": "https://old.reddit.com/r/singapore/comments/1r2c0sz/scoots_handling_of_kl_to_sg_flight_cancellation/",
      "score": 452,
      "num_comments": 62,
      "created_at": "2026-02-12T06:37:20",
      "selftext": "I was unfortunately on flight TR 497 from KL to SG which Scoot said: \"affected customers were provided with accommodation, refreshments and on-ground transport.\" Over here https://www.straitstimes.com/singapore/scoot-flight-from-kuala-lumpur-on-feb-9-cancelled-after-technical-fault-detected\n\n\nSurprised to read about the Refreshment and passengers being sent to hotel to rest, as quite a few of us had a totally different experience, went about 9 hours without food or rest.\n\nTill today, we have not heard directly from Scoot (although we booked through trip.com who reached out to us so wondering if Scoot only communicated with passengers who booked directly).\n\nWhile I can understand the technical issues was unexpected, Scoot's handling of the cancellation was extremely disappointing, there was lack of communication, clarity and proper process. \n\nWe only managed to get our boarding pass about 9 hours later, after much detours and abrupt changes, without sleep or food (even though Scoot mentioned providing Refreshments, it seemed like most passengers did not received it). Only arrived back in Singapore at around 12pm the following day, which meant the need to apply for leave from work.\n\nNevertheless, it was an interesting experience, we quickly became friends with strangers, including an elderly Korean lady who was travelling alone and anxious. When we finally boarded the next flight back 12 hours later, we saw many fellow passengers  who bonded and helped each other through the arduous 12 hours, taking pictures and biding farewell even though they did not speak the same language.\n\n\n-Sat on the runway for about an hour before the crew finally informed us of the issue\n\n-Only offered plain water at 12am. When we requested for snacks, after a 2 hours delay into a supposedly 1 hour flight, the crew informed us we had to purchase in flight meals\n\n-There was another airplane stuck behind us for about 3 hours since our flight was blocking access to the takeoff runway, it was eventually towed away\n\n-Could feel the Captain was empathetic which is appreciated, however, there were multiple occasions when they didnt update us for up to an hour even though they announced they would in 20 mins etc\n\n-Once we arrived back at the terminal, the nightmare continued, total chaos and lack of clarity + communication \n\n-There was a long queue to enter the only lift which would bring us inside  the airport, once we exited the lift we were told to head to counter P9\n\n-After queuing for a long time to enter P9, the other passengers in front of us suddenly turned around and walked towards the opposite direction, the staff did not communicate anything, we only found out through word of mouth from other passengers that P9 was for passengers who would like to cancel and get a refund.\n\n-It seemed like Refreshments were being distributed at P9 so we ended up with zero Refreshment as we had to follow the queue of ppl walking in the opposite direction if we're would like to take the next earliest flight by SIA.\n\n-Again, through word of mouth, at around 2 or 3 am, we were told that we would be heading to sunway pyramid hotel which was about an hour away, this created a lot of unrest among the weary passengers (many haven't eaten or rest since 10pm). It didnt make sense to travel to the hotel, spend proably an hour or two, or maybe even lesser accounting for potential traffic jam,  waiting time to check in hundreds of passengers,before travelling another hour back to the airport as we heard the earliest flight was around 9/10am (checked with the staff if we could opt for a later flight to get some rest if we were to go to the hotel but they seemed as lost as we were). At this point there was a queue of a few hundred passengers waiting to exit the immigration which would take some time too\n\n-When we finally exited immigration, a lot of us lost sight of the staff and did not know where to board the bus to the hotel, some passengers who did not speak English were very anxious\n\n-We ended up making friends with other passengers to share info and figure things out, \"adopting\" an elderly Korean who was travelling alone and spoke no English as she looked anxious\n\n-since we lost sight of the staff, about a hundred of us gathered at Scoot's terminal, which was unfortunately not opened yet\n\n-after some time a staff finally came to Scott's counter and told us to follow her to board the bus to the hotel\n\n-while waiting (what seems like an hour) for the bus,  at about 5am the staff told us we will not be travelling to the hotel anymore,  but head to the next terminal to board the 10am flight to Singapore\n\n-the airport shuttle bus which is used by the public to the terminal was full which led to even more waiting\n\n-once we boarded the bus, we were surprised to see the staff not onboard,  we were expected to make our own way, some passengers alighted at the wrong stop and we had to help inform them\n\n-finally reached SIA terminal at about 6am and got our boarding pass, close to 9 hours since the scheduled takeoff and about 6 hours since we disembarked from the plane\n\n-the staff at the counter seemed unaware about the flight cancellation and was surprised to hear our flight was supposed to take off 10 hours ago\n\n-we were finally issued 35RM meal voucher, proceed to have our first meal in 10 hours with our newfound friends and the elderly Korean passenger\n\n-quite a few of us had difficulty entering the departure hall as the Malaysian immigration doesn't seem to be aware of the flight cancellation, some ended up spending more than an hour after being sent on a wild goose chase by the immigration officers who did not knew how to handle passengers from the cancelled flight\n\nOverall a very tiring but interesting experience\n\nEdit\n1. We didnt really had time to get food as the staff told us to follow them, from the moment we dismebarked to the moment we were reissued a new boarding pass, it was endless waiting and queueing at immigration, bus stop etc as you can read from above. If u wandered off the get food you might get left behind. It would have been a different story if there was clear communication as to where to reschedule our flights as opposed to asking a few hundred ppl to follow them without much info.\n\n2. The point of this post is to highlight how the process was extremely disorganised and disappointing. Funny to see some snarky and strange comments focusing on 3rd party booking lol. From what we saw, Passengers who booked direct + 3rd party went through the same process and got the same treatment. They were so disorganised I doubt they even knew who booked direct and who booked through 3rd party.",
      "comments": [
        {
          "text": "Well they are being economical with words, providing you water at 12am and the rm35 voucher 10 hours later also constitutes refreshment",
          "score": 248
        },
        {
          "text": "Bro I was on this Scoot flight with my friends as well. The technical fault and wait onboard the aircraft itself wasn’t the issue, it was unforseen and that's completely understandable.\n\nThe real problem was everything after i.e. the ground management was damn jialat. Ground handling was chaotic with no clear communication, no directions, no proper coordination. \n\nContrary to what was reported in the news article, none of us got any timely transport or hotel accommodation. We literally disembarked the plane at 2 15 am leh. So we were basically left stranded and awake the whole night with no idea what to do until we checked in for our replacement SQ flight at 6 am. The post-disruption management was extremely poor and fell far short of expectations, especially for an airline under the SIA group.\n\nNonetheless, one heck of an experience lor especially considering we opted for a flight back instead of a bus to save time but end up the whole flight journey became 12 hrs+ 😂",
          "score": 146
        },
        {
          "text": "Sometimes feel it's unfair to associate Scoot with being \"the budget arm of Singapore Airlines\" \nScoot is just budget full stop &amp; becoming like our neighbours budget airline famous or rather infamous/notorious 😁😜🤣",
          "score": 96
        },
        {
          "text": "Why are you waiting for meal vouchers before you buy food and water? I would have said fuck that and paid on my own.",
          "score": 88
        },
        {
          "text": "Your mistake was booking with a third party vendor. Not sure how it plays out legally but the treatment you get will be completely different because I think most liability will lie on the third party vendor instead.\n\nOnce I was taking a flight from Iceland back to London on a weekend and there was heavy fog at Heathrow airport. All BA pilots said they are not going to fly in that condition so all the BA flights were grounded. But, BA then tried putting everyone on other flights going out, except for people who booked through a third party.\n\nI was supposed to contact them myself but their hotline doesn't work on weekends. Managed to book myself another flight out the next day on another airline, but after that incident I don't book through third parties anymore. The cost saving is not worth it.",
          "score": 85
        },
        {
          "text": "It's always going to be tough when there's a flight cancellation/issue, especially one abroad\n\nThese types of issues are usually handled by the Ground Handling Agents, which are essentially service providers to the airlines and not employed by the airlines themselves (think the people who man the check-in counters/boarding counters/handle luggage)\n\nAirlines might be able to send their 1-2 staff on duty, but ultimately, the majority of the logistics will be handled by the Ground Agents, 99% of the time\n\nThis is different if it happens in the country where the airline is based/a major hub since a majority of their staff are there, so there are greater resources staff-wise and aircraft-wise (could swap aircrafts etc)\n\nunfortunate that you had to go through this, but quite a bit of this sounds like issues on KLIA's side as well",
          "score": 48
        },
        {
          "text": "Your mistake was to book this through a third party.",
          "score": 9
        },
        {
          "text": "Isn’t it KL ground staff issue?",
          "score": 6
        },
        {
          "text": "On 2 flights on different days they have kicked myself and my friends off from ScootPlus to\nEconomy without compensation. 1st was during CNY period and there was zero compensation when they got kicked to economy. For me at least they offered ScootPlus on an earlier flight but that meant taking a different flight from my friends. Both were for the Singapore to Bangkok route. I don't get ScootPlus for that route anymore.",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1r1vhke",
      "subreddit": "singapore",
      "title": "Singapore spent 11 months evicting suspected telco spies",
      "url": "https://old.reddit.com/r/singapore/comments/1r1vhke/singapore_spent_11_months_evicting_suspected/",
      "score": 261,
      "num_comments": 53,
      "created_at": "2026-02-11T20:00:00",
      "selftext": "",
      "comments": [
        {
          "text": "Did using Huawei/chinese equipment play a part in them getting access?",
          "score": 98
        },
        {
          "text": "\"China-linked espionage crew\" means that there were actual human spies identified to be planted within the telcos? wonder what will happen to them",
          "score": 84
        },
        {
          "text": "Please tell me my TP-Link router and APs are safe…. Please",
          "score": 55
        },
        {
          "text": "#Just Say No to Communism.",
          "score": 45
        },
        {
          "text": "wonder wat dey afta🤔",
          "score": 5
        }
      ]
    },
    {
      "id": "t3_1r1ocnn",
      "subreddit": "singapore",
      "title": "Man smeared luncheon meat along HDB common corridor in dispute over 'noisy' kids, gets jail",
      "url": "https://old.reddit.com/r/singapore/comments/1r1ocnn/man_smeared_luncheon_meat_along_hdb_common/",
      "score": 191,
      "num_comments": 98,
      "created_at": "2026-02-11T13:05:26",
      "selftext": "",
      "comments": [
        {
          "text": "Penalty seems excessive compared to relatively weak penalties for serious crimes involving cars",
          "score": 280
        },
        {
          "text": "Why do idiots think Pork to Muslims is like Garlic to Vampires? \n\nAlso bit harsh of a sentence",
          "score": 272
        },
        {
          "text": "the noises created by children can be mentally overwhelming, parents need to remind their kids to be considerate. They can bring their kids to the nearest playground for them to expend their energy 🙏",
          "score": 132
        },
        {
          "text": "Jail for smearing pork but not reckless driving 🤦🏻‍♂️",
          "score": 100
        },
        {
          "text": "&gt;At around 10.15pm that day, Vikneswaran called the police and said: \"I feel like throwing luncheon meat at my neighbour's unit. I need police.\"\n\nI thought the title was bad enough. Turns out the story even worst. This guy must be mentally ill or something. ",
          "score": 44
        },
        {
          "text": "Sometimes noise generates by children can be overwhelming and noisy. Some parents just let their children go wild without control. This guy might be in tolerance for years or maybe speak to the patents, but some parents might say \"children will always be children\" excuse.",
          "score": 38
        },
        {
          "text": "Waste of perfectly good food",
          "score": 22
        },
        {
          "text": "People really think that pork is like kryptonite for Muslims ah?",
          "score": 21
        }
      ]
    },
    {
      "id": "t3_1r2f4ql",
      "subreddit": "singapore",
      "title": "AITA for insisting I was first at a taxi stand during morning rush hour?",
      "url": "https://old.reddit.com/r/singapore/comments/1r2f4ql/aita_for_insisting_i_was_first_at_a_taxi_stand/",
      "score": 187,
      "num_comments": 65,
      "created_at": "2026-02-12T08:46:23",
      "selftext": "This happened a few minutes ago and I just want to rant, so bear with me hehe\n\nI was standing under a taxi stand sign waiting for a cab. There’s no railing there, but it’s the usual informal system, the unspoken rule per se: the first person stands under the sign, others queue behind.\n\nA lady arrived after me, walked past me, and stood in front of me, maybe 4 to 5 ft away. I found it odd but didn’t immediately say anything. She was on her phone, so I thought maybe she was waiting for someone. After some time, a few people were already queueing behind me\n\nWhen a taxi came, we both flagged it. I said, \"Hello, I was here first, there’s already a queue\"\n\nShe replied, “Since when?”\n\nI said, \"Since before you arrived.\" (wanted to give her the benefit of the doubt maybe she ddnt notice but I was literally standing there the whole time in a bright coloured shirt, there's no way she didn't saw me right??, I know some might think it’s a crime, but c’mon, I like my shirt hahaha.)\n\nThere was about 5 seconds of awkward silence, and even the taxi uncle gave a small beep.\n\nThen she said, \"Ok you take lah!\" in a pretty annoyed tone. I took the taxi.\n\nNow I’m wondering, AITA for insisting? In my mind I was like, \"Not my first rodeo, lady.\" 😏 A few similar instances have happened to me before, and I tend to stand my ground if the person looks around my age.\n\nI know it’s morning rush hour and everyone’s rushing to work. But at the same time, isn’t there a basic taxi stand etiquette? Also, I realized I tend to feel more intimidated if it’s older people doing this. I get scared to confront them. But if it’s someone around my age, I can stand my ground.\n\nWas I being unreasonable for speaking up? All I want to say to the people who cut queues; I hope someone calls you out on the spot!!! And have some shame!!!",
      "comments": [
        {
          "text": "She knew you were there because if not she wouldn’t have easily let you take it first. Pretending not to see is an easy excuse.",
          "score": 325
        },
        {
          "text": "Ah? You held your ground, you feel paiseh for fuck?\n\nEdit: you did well! If there’s one thing I can’t stand about Singaporeans, it’s the tendency to not speak up and then go online kbkb.\n\nIf you back down because you’re conflict-avoidant, then don’t complain you tio makan. This is Singapore, nobody’s going to stab you or shoot you because you call someone out for cutting queue.",
          "score": 142
        },
        {
          "text": "NTA. And thank you for not enabling shitty behaviour on the lady’s part.",
          "score": 122
        },
        {
          "text": "Brother/Sister, no need to think so hard. You were first, you cannot suddenly become second right? Feel paiseh for what lol. \n\nYou're in the right, they're in the wrong. Nothing more, nothing less.",
          "score": 85
        },
        {
          "text": "I love calling out queue cutters, especially when they get angry. That tells me they knew exactly what they were doing.\n\nSome ntuc outlets don’t have clear markings for the self check outs, and people tend to cut the queue. Most feel paiseh and will apologise and go to the back, but some fuckers will argue/ignore and I will escalate to the staff. Don’t be afraid to speak up people!! This isn’t being confrontational or trying to pick a fight.",
          "score": 25
        },
        {
          "text": "Nahhh. You were right. Stand your ground! I’m not a confrontational person so I knw what you mean… like is there a better way to resolve it? Or was it better to just not ruin the mood? I get it! But nah. We need to learn to stand up for ourselves sometimes.",
          "score": 12
        },
        {
          "text": "When you see people jump queue, you ask instantly whether they are waiting for taxi.\n\nSome people have no shame, so it's not possible to ask them to have some shame or anything.",
          "score": 11
        },
        {
          "text": "You may feel like this is one specific incident you were involved in on a given morning. Now you are conflicted about speaking up. \n\n\nBut it is our collective speaking up to such people is what has formed the expectation of social manners. Because people have adhered to and chastised others for not adhering to the social etiquette is what has set good behavior as the norm. If we stop defending these norms, they'll be diluted and gone.\n\n\nSo I thank you for speaking up and making life easier for me.",
          "score": 9
        },
        {
          "text": "NTA. It would have been better if you immediately interacted with her when she first arrived, to establish that you are waiting for a taxi and to check if she is also doing the same.\n\nBecause there can be some ambiguity at such places, where some people are waiting for a booked PHV or an acquaintance to pick them up.\n\nThat avoids hostility down the road when one of you realizes that your assumption was wrong.",
          "score": 9
        },
        {
          "text": "NTA. Brings back memories of pre-Grab days where you stand anywhere along the side of the road and flag for a cab. There will always be some joker walk 50m behind you to flag a cab first. Wild wild west times. Haha",
          "score": 8
        },
        {
          "text": "Not at all. That lady is entitled. Maybe that lady should take grab next time.",
          "score": 3
        },
        {
          "text": "NTA. It's common courtesy to ask if someone is in line if unsure be it in a restaurant, hawker stall or barber shop. Tell her don't cibai lah.",
          "score": 3
        },
        {
          "text": "Same thing happened to me with an older lady. I was next in a queue, the cab stopped between us. She started walking towards it, I just cut in front of her and got in. \n\n\nDon't need to bother arguing with people abt etiquette when they have none. ",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1r1rnea",
      "subreddit": "singapore",
      "title": "Coffee Meets Bagel partners SG Culture Pass on perks for singles to go on artsy dates",
      "url": "https://old.reddit.com/r/singapore/comments/1r1rnea/coffee_meets_bagel_partners_sg_culture_pass_on/",
      "score": 168,
      "num_comments": 43,
      "created_at": "2026-02-11T16:13:04",
      "selftext": "",
      "comments": [
        {
          "text": "They rly tryna up that birth rate",
          "score": 145
        },
        {
          "text": "CMB got me more dates than Bumble or Hinge. +1",
          "score": 74
        },
        {
          "text": "They should partner with SG Pools.\n\n\nGo on date, get chance to win Toto to jump start your life.. or the other way around",
          "score": 43
        },
        {
          "text": "Best use of culture pass credits!",
          "score": 22
        },
        {
          "text": "This is great!",
          "score": 17
        },
        {
          "text": "This is funny because I bought the premium for CMB and I haven’t got any matches for the past month 😂",
          "score": 14
        },
        {
          "text": "&gt; They include priority access for the Orchestra of the Music Makers Singapore’s Pixar In Concert show, the Singapore Symphony Orchestra’s pop-inspired concert A Musical Box Of Chocolates and an acrylic painting workshop by Sage Artelier; $2 off tickets to the Hell’s Museum at Haw Par Villa; and an additional drink a guest at the immersive dining experience Wonderland Upside Down.\n\n\nWhere’re the anime/gaming events for the otaku?\n\nNot sure how many people fall into the audience for these artsy events.",
          "score": 13
        },
        {
          "text": "![gif](giphy|xT0GqgJ4EapuPA3AUo)",
          "score": 7
        },
        {
          "text": "They should partner with HDB for BTO",
          "score": 2
        },
        {
          "text": "There used to be SDN credits every but they removed it. Not sure why",
          "score": 2
        },
        {
          "text": "Gahmen paying people to pak tor",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r2gn3f",
      "subreddit": "singapore",
      "title": "S'porean private-hire driver, 46, hits &amp; kills M'sian motorcyclist, 38, after not realising red light on for 7 secs",
      "url": "https://old.reddit.com/r/singapore/comments/1r2gn3f/sporean_privatehire_driver_46_hits_kills_msian/",
      "score": 148,
      "num_comments": 69,
      "created_at": "2026-02-12T09:54:45",
      "selftext": "",
      "comments": [
        {
          "text": "This is the most crazy thing… we don’t allow people to use their phone while driving. \n\nBut after all these PHV comes onto the road, suddenly as long as they use a phone holder, these drivers can just use their phone all the time without repercussion.\n\nToo many times, I sit in a PHV, and the drivers are driving and scrolling for their next customer (esp TADA drivers) before even dropping me off. Too many times, as a fellow road user, I see a PHV car driving erratically, and upon driving beside, I glanced and see it’s a PHV driver using their phone on the holder. \n\nThis has to stop.",
          "score": 177
        },
        {
          "text": "If we were feeling outraged about the 6yo girl incident, we should feel the same for this guy. A needless death due to one's carelessness",
          "score": 146
        },
        {
          "text": "If you miss a red light because you're \"unfamiliar with an area\" you should NOT DRIVE, let alone be a Grab Driver. \n\nShe killed someone because she was too selfish to wait until she was stopped to use her phone. This may be a hyperbolic statement, but some Singaporean drivers are some of the most dangerous drivers in the developed world. I've lived in over 5 first world countries, and crossing the road here feels like a mission. Drivers not giving way, not using indicators, not slowing down for crossings...",
          "score": 124
        },
        {
          "text": "&gt;For causing the death of the motorcyclist, she faces a fine of up to S$10,000, up to three years' imprisonment, or both.\n\n\nPretty light potential maximum sentence given she killed someone.",
          "score": 29
        },
        {
          "text": "&gt;Her lawyer argued that as she was not under the influence of alcohol or drugs, and was not speeding, but only thinking about work, her sentence **should be no more than six months in prison**.\n\nWa this one I kenut. I understand lawyers have a job to do buy goddamn.",
          "score": 18
        },
        {
          "text": "“She also reportedly did not drive again following the incident.”\nWhat kind of defence is this? \nHer licence would have been suspended pending outcome of the trial lor.",
          "score": 17
        },
        {
          "text": "No one is going to talk about the lighting in the decorations? Honestly some of the lighting are way overboard, especially when there're multiple traffic lights in a short distance. Alot of times I either mistake the traffic light (looking at the one further ahead instead of the one directly in front of me), or mistake the decoration lighting (red or green led) for a traffic light.",
          "score": 11
        },
        {
          "text": "The charge has been downgraded so much it's laughable. \nCareless and negligent driving which leads to a fine of up to S$10,000, up to three years' imprisonment, or both, when they could charge her under s64 - maximum of 8 years imprisonment instead",
          "score": 9
        },
        {
          "text": "its gonna get worse as COE increases and grab car rentals increase ... strap in folks",
          "score": 7
        },
        {
          "text": "FYI 2024 case, alot of people of Facebook seems to think it's right after the recent Chinatown case",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r1qzv4",
      "subreddit": "singapore",
      "title": "S'pore teen, 16, sent to hospital after car accident in Toa Payoh, driver, 39, assisting with investigations",
      "url": "https://old.reddit.com/r/singapore/comments/1r1qzv4/spore_teen_16_sent_to_hospital_after_car_accident/",
      "score": 119,
      "num_comments": 26,
      "created_at": "2026-02-11T15:32:22",
      "selftext": "",
      "comments": [
        {
          "text": "sometimes i see teens crossing walkways without a care in the world, sometimes expecting cars to give at close distance",
          "score": 111
        },
        {
          "text": "is it me or are we hearing about serious traffic accidents every other day?",
          "score": 40
        },
        {
          "text": "Noise-cancelling earpods work!\n\nMy mother taught me that wearing headphones/earbuds/earpods while walking on the road is dangerous. Same goes to cycling.",
          "score": 14
        },
        {
          "text": "Given the lack of outrage so far I assume the driver is local and it's an unfortunate and honest mistake, not an indication of countrywide limitations in the ability to operate a vehicle?\n\nEdit: Bonus points for using a video for this article that was taken by a person while driving. Cool. That's fiiiiine. At least they got some clout and appeared on Mothership. That's everyone's life goal!",
          "score": -12
        }
      ]
    },
    {
      "id": "t3_1r2hrh7",
      "subreddit": "singapore",
      "title": "Singapore Budget 2026 Bingo – Speech Edition",
      "url": "https://old.reddit.com/r/singapore/comments/1r2hrh7/singapore_budget_2026_bingo_speech_edition/",
      "score": 95,
      "num_comments": 23,
      "created_at": "2026-02-12T10:45:15",
      "selftext": "Just thought it might be a fun way to look at the budget later. I guess someone can make a live post for it later. If someone has a better bingo, please go ahead and post, I cannot repost for the next 6 hours due to sub reddit rules.\n\nThere will be live updates from ST and CNA:  \n[https://www.straitstimes.com/singapore/budget-2026-how-to-get-live-updates-on-pm-lawrence-wongs-speech?ref=top-stories](https://www.straitstimes.com/singapore/budget-2026-how-to-get-live-updates-on-pm-lawrence-wongs-speech?ref=top-stories)\n\n[https://www.youtube.com/watch?v=He3lVNqx-iA](https://www.youtube.com/watch?v=He3lVNqx-iA)",
      "comments": [
        {
          "text": "We are in this together\nas One Singapore",
          "score": 32
        },
        {
          "text": "no CDC vouchers mentioned. -sheds tear-",
          "score": 22
        },
        {
          "text": "I'm putting my money all on \"AI\"",
          "score": 9
        },
        {
          "text": "We need a prediction market betting site for this",
          "score": 8
        },
        {
          "text": "Leave no one behind, we will continue support fellow Singaporeans*cough cough* more skillfuture credit hahahahah",
          "score": 6
        },
        {
          "text": "Here we go. Place your bets, ladies and gentlemen.",
          "score": 3
        },
        {
          "text": "Never see news spamming about income wealth gap or hdb income ceiling?",
          "score": 2
        },
        {
          "text": "More support for elderlies and \"middle age/mid-career transition\"\n\nZero support for fresh graduates or anyone with less than 5 years experience prior to university\n\nMention of UNC3886\n\nConfirm will have AI though",
          "score": 1
        },
        {
          "text": "Obviously The Public transport is a usual subject.",
          "score": 1
        },
        {
          "text": "Un employable segment of the 60s-80s",
          "score": 1
        },
        {
          "text": "upskill, upgrade, update",
          "score": 1
        },
        {
          "text": "Nah I don't think he will mention space or nuclear. Those are still too nascent and risky to be sold as standalones.",
          "score": 1
        },
        {
          "text": "\"We\" will be used at every possible opportunity to lie to you that they are with you and that they understand your suffering.\n\nAlso more upskilling for SME to grift but not enough jobs.",
          "score": 1
        },
        {
          "text": "Sorry, responsibility, do better, improve",
          "score": 1
        },
        {
          "text": "ask ChatGPT to come up with speech, given all those buzz phrases.   \n(of course, context is fiscal budget for singapore government in 2026)\n\n\n\nthen compare with actual speech and see how close ChatGPT is.",
          "score": 1
        },
        {
          "text": "Add in:\n\n- “Mr Lee Kuan Yew”\n\n- “Our Pioneer Generation”\n\n- “Rules based order”",
          "score": 1
        },
        {
          "text": "Sheng Siong share price  pulling back (past 2-3 sessions) -&gt; maybe smart investors anticipate a sizable pullback in CDC vouchers handout?\n\nSME wise -&gt; maybe some degree of pain, to force consolidations and to \"scale-up\"?\n\n**Basically PM in a very tight spot, most of the easy solution/quick fix got used up by his**   \n**ex-towkay. That leaves him with very little wiggle room to shift policy without jacking up prices even more.**\n\nThere is a physical limit to how much \"clean money\" he can bring into Singapore and not have it \"recycle into physical assets\" like GCB, shopping malls, shop houses at heartland area and COE.  \nThink we are close to that threshold (maybe a temporary one) until he can generate better ideas or solutions on those money coming in. But then it's the same old tricks.\n\nGDP numbers look great, per-capita GDP looks fine. But if adjusted for real-inflation terms, the storyline flips. Just look at the causeway traffic into Johor, that already reveal the pain point on daily essentials.\n\nMaybe he needs to make a tough choice.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r1rz82",
      "subreddit": "singapore",
      "title": "More support for workers to be announced at Budget 2026: PM Wong",
      "url": "https://old.reddit.com/r/singapore/comments/1r1rz82/more_support_for_workers_to_be_announced_at/",
      "score": 90,
      "num_comments": 64,
      "created_at": "2026-02-11T16:33:34",
      "selftext": "",
      "comments": [
        {
          "text": "Please don't be skillsfuture credits...",
          "score": 240
        },
        {
          "text": "I bet it'll be skillsfuture credit but u can only use for courses ran by ite/polys",
          "score": 60
        },
        {
          "text": "For the unemployed leh?",
          "score": 42
        },
        {
          "text": "Fix the ECT process first before talking about support for workers. \n\nWhy workers always kena force to fight for their own rights sia? Like become own lawyer, spend own money, drag company to Employment Claims Tribunal just because company break Employment Act?\n\nYou think workers got so much time and cash meh to go court fight? If nobody fight, authorities just let company keep violating Singapore law? \n\nWhat's the point of having Employment Act if MOM or authorities don't even enforce it? Might as well abolish the whole Employment Act sia, waste time only 😂",
          "score": 37
        },
        {
          "text": "Lowest hanging fruit in the history of Singapore budgets-more money for skillsfuture😂😂😂",
          "score": 30
        },
        {
          "text": "Same guys allowing jobs to move to JB also now giving support. Sometimes I wonder if they really through the SEZ properly",
          "score": 20
        },
        {
          "text": "Uhhh yeah lemme guess, more Skillfuture courses and “upgrading”.",
          "score": 16
        },
        {
          "text": "Please give cdc to individuals, like the sg60 vouchers not per household.",
          "score": 8
        },
        {
          "text": "\"I saw government giving you 1k right? Means no need raise this year, hor.\"",
          "score": 8
        },
        {
          "text": "going to be another boring speech for individuals then?",
          "score": 6
        }
      ]
    },
    {
      "id": "t3_1r1rt7c",
      "subreddit": "askSingapore",
      "title": "Parents went to DRC, would appreciate adulting advice",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r1rt7c/parents_went_to_drc_would_appreciate_adulting/",
      "score": 307,
      "num_comments": 67,
      "created_at": "2026-02-11T16:23:09",
      "selftext": "hi all! both my parents were sent to DRC a few days ago and i'm officially the main caretaker of the house for at least the next 6 months\n\nwould really appreciate it if anyone has any adulting advice for a 22yo that just finished uni and now has to be the main caretaker of the house. 🥹 it might not seem much since it's just my grandma and i, but i would really appreciate any advice or tips i can get! especially related to misc household things such as utility bills (as far as i know would be AXS but correct me if i'm wrong) and important things i should take note of in regards to the house or anything in general i should be aware of! my grandma's close to 80 and i rather not stress her out over these things especially since she's taking the whole situation really really hard.\n\nthanks in advance!\n\np.s: 22 might seem old enough for me to easily handle this by myself but my parents were always the ones handling it for most of my life and i'd always just give them a portion of money i had for the house bills etc. monthly, so i'm not really familiar with the admin/official side of things\n\nedit 1: DRC = Drug Rehabilitation Centre\n\nedit 2: thank you so much for all the advice everyone!!! i'm slowly reading through everything and i really really appreciate all the info and important checkpoints i have to look into ❤️ i'll be sure to take good care of my grandma and once again, thank you all so much for the help because i really didn't know where to start 🥲",
      "comments": [
        {
          "text": "I thought it's Democratic Republic of Congo",
          "score": 452
        },
        {
          "text": "1. Ask your parents in the next call/visit/email how they receive and pay their bills e.g. app or physical mail. Get log in details if necessary.\n\n2. The common kind of bills are utility, phone, internet, town council. Most if not all can be paid via AXS online or the respective apps. [https://e-station.axs.com.sg/wSDK/core/home.php](https://e-station.axs.com.sg/wSDK/core/home.php)\n\n3. Ask your parents to truthfully tell you if there are any outstanding debts - I hope not!\n\n4. Take note of your grandmother's medical appointments if any.\n\n5. Maybe ask your parents for access to their bank account so that you can withdraw government pay outs to help you tide through this period.\n\nGood luck!\n\n",
          "score": 181
        },
        {
          "text": "Hey i’m sorry about your circumstances. I would suggest figuring out first:\n\n1) Funds - where will the money to buy food, necessities and pay bills be coming from first? Where are your parent’s cards and cash stored? How much money in their bank account? Do you need financial aid? Approach your nearest family service centre or Social service office for assistance. \n\n2) Valuables - Where is everyone’s passports and nrics and other valuables. In the event of a fire or housebreak-in, do you know where to find them to make sure they are still there? \n\n3) Bills- Tax, Internet, Phone, Gas, Water supply and Electricity - they should have payment instructions on their website and also a phone number to call to find out if you have outstanding bills\n\n3.5) Debt and loans - Ask your parents if they owe anyone money. Are they still repaying a car or HDB loan or insurance premium? Need to figure out how to continue w monthly payments if needed. \n\n4) Communication - If your parents are working and were detained suddenly, there might be employers or concerned friends calling wondering where they might be. Be prepared for an answer acceptable to you? If your parents were known to social service before, do you know how you can reach their social workers for help?\nIf any of your parents friends or people in their drug consumption network approach u looking for them for whatever reasons- learn how to keep urself and grandma safe in case things go sideway. \n\n5) Medicine - Check if your grandma has any medicine she needs to take daily and where they are located. Can go to her GP or polyclinic to restock as they should have her records.\n\n6) HYGIENE - A house can get dirty really fast. Clean toilet and bathroom at least once a week. Do not mix bleach with toilet cleaner!!!! It will produce toxic gases. So yah I learned that the hard way the first time I cleaned my bathroom. Please for the love of everything do not anyhow mix cleaning chemicals just because they all advertise it can clean bathrooms. \nDo not let laundry pile up. Learn how to use washing machine, and iron. \n\n6.5) Food safety: Check your current food supplies and clear expired ones. Clear old food from refrigerators regularly - fresh fruit and veg can go bad in a week. check internet for food safety when cooking and food storage. Watch for mold. Usually if you dabao food don’t keep in fridge for more than two days. Try not to leave cooked food in room temperature for days. Also check if your containers can be microwaved - some cannot. No metal utensils on non-stick coating cos the surface will scratch and release toxic chemicals. Do NOT put metallic objects in a microwave unless they say its microwave safe. \n\n7) Emergency - if locked out or something leaking or spoil, save number of locksmith, 24/7 plumber, electrician, internet provider number in case got blackout. Learn where your house circuit breaker is and how it works in case power trips\n\n8) Community Support - This is a stressful time and you shouldn’t do it alone! Get help if you must! No shame ok there are more people willing to help someone whose parents are separated from them. Get to know your neighbours, religious community if any, and call your friends. They can help u with chores or getting stuff or just lending a listening ear. We are not meant to do this alone.\n\nJiayous!",
          "score": 100
        },
        {
          "text": "If you need any financial or legal help you can approach the neighborhood family service centres. They can assist on these issues. Can walk in or phone appt.",
          "score": 86
        },
        {
          "text": "First of all, big virtual hugs to you. Must be tough having to go through this and kudos to you for getting through to uni despite the challenges and instability you likely have faced. \nHow are you coping, emotionally?\nI hope you have a strong support system who acknowledge and validate all that you're going through. \n2nd of all, perhaps it may be useful to keep an app or excel sheet of running to do lists with regards to bills to pay so that you stay on top of them. \nSet calendar reminders for payment due dates or a standing giro transfer for things like utilities.\nE g. SP has app for auto payment deduction",
          "score": 26
        },
        {
          "text": "Worked in social services and have access to a vast network of changemakers at the moment (people who work in charities, people who run groundups). If you need help, just dm me. I have already dmed you on this.\n\nI think the rest here have already gave as much suggestions as they could so I won't share the same info",
          "score": 25
        },
        {
          "text": "What is DRC?",
          "score": 12
        },
        {
          "text": "Check if your parents are paying off any housing loan, and if so, are there enough funds?\n\nAlso, might be a little morbid but since idk what's the extent of your parents' condition, check if they have any insurance policies and in the worst case scenario what are the things you need to do or document to claim an insurance payout.\n\nCPF nomination - I hope your parents have done it, if not, please do it asap.\n\nBills are ofc important but it's generally quite quick and easy to pay a bill online or at AXS.",
          "score": 11
        },
        {
          "text": "Hi, can you DM me? I have experience dealing with a similar situation where I had to take charge for dealing with these family issues. Would be happy to drop you a WhatsApp to see how I can help.",
          "score": 7
        },
        {
          "text": "Big big hugs!! 22 years old is not old enough to easily handle this by yourself and nobody should have to go through this by themselves. Even then I’m so so so proud of you for stepping up!! \n\nThings that would help you financially - go speak to your MP, check with them what are the available financial aids that you can apply for. \n\nGo speak to your nearest SSO - they typically have a wide range of financial aids available. https://supportgowhere.life.gov.sg/schemes/COMCARE-SMTA/comcare-short-to-medium-term-assistance-smta \n\nhttps://aic.sg/Financial-Assistance\n\nDepending on your religion, you could also speak to the respective religious bodies to help you - getting financial aid &amp; support in different ways. \n\nThen if you just graduated, see if you can speak to your school’s financial assistance Center to see if they can help to defer the loan instalment payments due to the extenuating circumstances that you’re in. \n\nAnd if you haven’t gotten a job yet, get your university’s career Center to help you, even jobs within the campus would help a lot in tide-ing through this tough period. \n\nThings won’t be easy but as long as you persevere and work towards a better you, good things will follow for sure ❤️❤️ all the best!! 💪🏻 \n\n\nEdited to add things to look out for too: \n1) property tax \n2) HDB mortgage / SP services / S&amp;CC / Telco bills\n3) set aside a amount for grocery shopping/food \n4) hospital/doctor bills for your grandma (speak to medical social workers to see if they can help you on this)",
          "score": 7
        }
      ]
    },
    {
      "id": "t3_1r1pr5k",
      "subreddit": "askSingapore",
      "title": "To Ex Regulars, do you regret leaving?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r1pr5k/to_ex_regulars_do_you_regret_leaving/",
      "score": 177,
      "num_comments": 85,
      "created_at": "2026-02-11T14:20:00",
      "selftext": "I think this is often a question overlooked when people ask what made you sign and why did you leave? But hardly have we heard, \"did you regret leaving\". So lets here from the ex-reggies if they regretted leaving the force and why?\n\nPs: Keep it civil and adhere to OSA! :&gt;\n\nEdit 1: Thanks everyone for the comments thus far! Interesting to see the sentiments being almost (actually all la har) being no regrets and doing well in life! Also thanks for keeping it civil tho I think the uncivil ones are getting their comments deleted, keep the stories coming! :)",
      "comments": [
        {
          "text": "No regrets! That being said, signing on was the best decision I’ve made in my life. It gave me a sense of direction as to what I wanted to do with my life. After a while the job in the force got mundane, so I left to join a civil service organisation with a similar job scope, but with better salary and better progression. Signing on was sort of a stepping stone to greater things.",
          "score": 169
        },
        {
          "text": "No man, from air force to NTUC, it was downgrade but still now I am back at the prata place...$$$\n\nAlthough I am more cautious about group photos well if the food is good I am ok.",
          "score": 146
        },
        {
          "text": "No ragrats! \n\nI mean, I only signed on to save money and I was set on leaving the force anyway.",
          "score": 138
        },
        {
          "text": "Signing on was one of the best decisions of my life.\n\nResigning was another.",
          "score": 103
        },
        {
          "text": "Left a few years back. No regrets, but also no “perfect decision” feeling either.\n\nThe force gave me discipline, resilience, and some of the closest friendships I’ve ever had. Those things still help me every day.\n\nWhether someone regrets leaving usually depends less on the organisation and more on whether they moved on to something that suited their next phase of life.\n\n",
          "score": 51
        },
        {
          "text": "Served from ‘98 to ‘08. Thinking back that I’ve given 10yrs of my best, and at the point in time I’ve just reached 30yo. Told myself either I exit now or forever rest my case. Since then I’ve been in facilities management for 18yrs and moving. No regrets but I loved my days in the Army! “Swift &amp; Decisive; Always Ready” 🫡",
          "score": 37
        },
        {
          "text": "For those who left - any tips for an existing regular looking to leave? Job market seems tough for a transition into private sector at the moment",
          "score": 29
        },
        {
          "text": "No regrets… was quite a toxic environment tbh… proud to leave that done and dusted.",
          "score": 18
        },
        {
          "text": "Curious where do ex regulars end up going? I’ve always thought that transitioning to civilian life is challenging…",
          "score": 13
        },
        {
          "text": "I never ever hear ppl regret leaving the force ever.\n\nI only heard regret for staying and leaving too late before.\n\nOnly a few grateful. Those are the ones that stayed all the way.",
          "score": 10
        },
        {
          "text": "Those who regret leaving, often return to the SAF and the organization takes them back in. It's a small number but we do see them.",
          "score": 9
        },
        {
          "text": "No regrets. Living the happy life with better work life balance, progression and equivalent pay!",
          "score": 7
        }
      ]
    },
    {
      "id": "t3_1r26c1d",
      "subreddit": "askSingapore",
      "title": "How do you deal with burnout and does it ever really get better?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r26c1d/how_do_you_deal_with_burnout_and_does_it_ever/",
      "score": 127,
      "num_comments": 44,
      "created_at": "2026-02-12T03:04:04",
      "selftext": "Recently left a chinese owned SME where i was burnt out so many ways over. I've already served notice and have a short break of a month before I begin my new role. Speaking to my boss has given me lots of negative emotions (I hesitate to use the words toxic or trauma because we live in a time where these words get thrown around too harshly). \n\nHere's a list of some of the things boss would expect (just the top hits) :   \n\\- no complaints to work on weekends (no pay, no overtime)   \n\\- full responsibility for outcomes which she expects, while failing to communicate clearly   \n\\- for me to attend a meeting not even 2 hours after i had shared a loved one had passed on  \n\\- for me to travel to her home to personaly deliver tape for her to measure items in her new home   \n\\- for me to prepare a website for her son's university application based on work that I had done, but she had attributed to him as a \"co-founder\"   \n\\- given that i was the single hire to manage so much of the work, i had requested for a strongly worded letter of recommendation whcih i had drafted to which she had shared that many of the groundbreaking work which i had done (and indicated in the letter) were the skills of an entrepreneur which i clearly was not   \n\\- instead, she made it seem that i was \"very good at talking\", trying to diminish all the work i'd done to build the organisation in the past year and make it that i have the gift of the gab as i have chosen to shift to teaching. \n\nI feel like I am still reeling and hurt from these awful comments. \n\nDespite leaving such a place where i have had less than positive experiences, I'm really struggling to feel excited that it is over or that I no longer am affiliated with such an awful place, I am truly numb. I find myself unable to truly relax, or to be \"happy\" that I have left. Instead I still have some flashbacks of my time working at this organisation and I realise I do need to take some sort of a \"break\" before I commence my new role. For those of you that have been in such a similar position, how did you cope with this?",
      "comments": [
        {
          "text": "SME can really be a hellhole. What you experienced is not normal for the majority of bigger companies. Tbh just leaving and starting fresh at a bigger place or with a better work culture will help to put the negative past behind you.",
          "score": 80
        },
        {
          "text": "Negative emotions? Nah that sounds toxic af",
          "score": 54
        },
        {
          "text": "Print your boss' face on a dartboard and throw darts at it every day. 🎯🔫\n\nJust kidding, I channelled my frustration into activities that expend energy in a productive way e.g. exercise, chores, building something random like nanoblock, so that my brain stops replaying the negative experiences and I sleep better.",
          "score": 28
        },
        {
          "text": "Experienced something very similar many years ago. Took a while to recover from it. Felt depressed, withdrawn, ashamed that I had not caught on earlier that I was being exploited. I took on short term jobs, journalled, read, volunteered a lot and did ActiveSG classes for exercise, and regained my confidence and energy. It’s now history to me and I’m very happy where I am. OP, you will feel better one day. And when you are happy or at peace, it’s this path that will have led to it.",
          "score": 23
        },
        {
          "text": "There are localised MNC that behaves  like SME e.g local companies that got bought over by foreigners and fit the definition of MNC now but are run like SMEs.\n\nCulture is irrelevant to SME or MNC.\n\nSME gets a bad rep because majority of business in Singapore are SME buts let not forget they are also the ones giving Singaporean jobs.",
          "score": 8
        },
        {
          "text": "SMEs are the fast track for experience. I don't think anyone ever stays in a SME.  Very few are a good place to work in. However, if you want to really pad up your resume. SMEs are the place to go. You will get so much shit dumped on your head. Even just a year would give you a long list of contributions to put on your resume",
          "score": 7
        },
        {
          "text": "Pray that your next job doesnt treat you the same. Cross all fingers and toes and use up 7 generations of accumulated luck.",
          "score": 5
        },
        {
          "text": "are all SMEs like this or not? As in 1 person juggles multiple works, less benefit and/or salary, etc.?\n\nI was previously working in a company with over 400 headcount including myself, still i had to work every sat/sun by myself because of the workload. benefit and pay was great. i think this company is not considered SME due to the headcount number, but then also too much things to do.",
          "score": 5
        },
        {
          "text": "The boss and SME are toxic. Worked in a couple 20+ years ago. Seems like nothing changed. Don't need bother with those comments. Just shrug it off and move on. I wouldn't stay in that company either. ",
          "score": 3
        },
        {
          "text": "Me too, wanted to know how to recover from a burn out...\n\nEngineer here. So I had been working in a Japanese MNC who controls standing seating posture, hand position, hair length, monitor tilting angle etc etc etc etc... which drive me crazy and I still tank it for near 4 years there... Reaching a burn out stage 9 I estimated...\n\nResigned from first job. Took a month of break before starting second one. It's a US MNC this time being. But company would quantified  working hour to check employees efficiency and utilisation. We are required to prepare timesheets to report in how long we working on what project for what reason every single day. OT to 11pm is norm, I personally work from 9am until 4am for one whole week... office politics is another topic here...\n\nSo I burn out again. This time it kick in way faster and deeper. Reaching stage 11 in just about 4 months in...To a point where all my IG reel is about depression suicidal, chronic stress suicidal and I knew something must be done. So I throw again.\n\nYesterday was my last day. Currently lay on bed, I find no joy, no motivation, no energy to do any single thing. Felt lost for the past 1 year. I can't find the new directions I can headed into. \n\nCareer shift? Singapore is extremely harsh to career shifter if you realised; Study? Well I not even know what to study now. Which alot of people will tell me what is your interest? Well my job had kill my interest to a point that I wanted to quit Engineer...but still I dunno which direction to head into",
          "score": 3
        },
        {
          "text": "I quit a high paying job because I couldn’t deal with the toxicity anymore. \n\nMental health worth more.",
          "score": 2
        },
        {
          "text": "Having worked at both SMEs and MNCs (employee count over 10,000 in this country only), I can safely say that burnout and toxic culture can exist in both SMEs and MNCs. Yours sounds more like a direct reporting manager (and boss) specific problem rather than a problem with a class of companies.\n\nYou sound pretty much like an Executive Assistant and probably have learnt a lot with these kinds of working hours and range of tasks. You probably are versatile and very hardworking and most importantly, responsible. Although the letter of recommendation didn’t go as you planned, a good HR/interviewer will be able to see from your experience and interview that you would be a good addition to any team you join in the future.\n\nBut I hope you take a well-deserved break first if you can afford it - even four days off is great. But if I were you and had the income, I’d go away for two weeks to have a mental reset first.\n\nAll the best please take care OP.",
          "score": 2
        },
        {
          "text": "You're experiencing trauma, hence the negative feelings still linger on. What helped me was grounding and breathing techniques, meditation and having a life outside of work. Hobbies, etc. \n\nIt's the mentality shift as well. Currently you're experiencing ruminating thoughts. \n\nIf you are unable to manage the anxiety then I would suggest seeking help from a therapist.",
          "score": 2
        },
        {
          "text": "since you left, just delete the website",
          "score": 2
        },
        {
          "text": "1) job is for money. Recognise that.\n\n2) you don't have to burn yourself to go above and beyond. But manage your expectations too.\n\n3) as you get better, you do things more effectively. Less time spent.",
          "score": 2
        },
        {
          "text": "Hey OP I’m in the exact same position, except I just left a MNC and it was a contract role. The job was so toxic I didn’t even have the headspace to job hunt and tbh I still don’t feel like job hunting. \n\nI feel like any new job I find will just turn out as bad as my old one - that’s how badly I have been affected. \n\nAs to how to heal, I’ve been focusing on distancing myself from any ex-work talk, which is hard when I’m close friends with most of my ex-colleagues. I also am investing time in hobbies and myself, to remind me of who I was before the toxic job. Making little plans to get you excited about life again - that’s something I recommend.\n\nGood luck with your new job! Healing is never linear so don’t put time pressure on yourself.",
          "score": 1
        },
        {
          "text": "It's hard to solve a toxic environment, because you'll burn out sooner than you solve the problem at work. Don't be too good at your job at the next company you will be working for. Manage your expectations of everyone, especially when it comes to your future boss. On weekends or rest days, try to take a walk in the park to at least relax your mind.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r1q6uu",
      "subreddit": "askSingapore",
      "title": "NEA officers checking for mosquitoes",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r1q6uu/nea_officers_checking_for_mosquitoes/",
      "score": 110,
      "num_comments": 26,
      "created_at": "2026-02-11T14:45:00",
      "selftext": "An NEA officer knocked on my door and asked to check my kitchen and bathroom for stagnant water. I asked to see his badge (which he was wearing and displaying prominently on a lanyard) and then let him in. He was super friendly and talked about common mistakes like pails etc. nothing suspicious at all, he didn’t touch anything but I couldn’t have known that before I let him in. I realised that with the HSA kerfuffle a few years ago in the news maybe I should have been more thorough with my checks.\n\nMy question is:\n\n1. how do I check his badge properly? I mean I see his name etc but.. I can’t exactly google it or something\n\n(EDIT: thanks  u/notsiaoon   \\-  [ https://www.nea.gov.sg/validate-officer ](https://www.nea.gov.sg/validate-officer)  )\n\n1. if I deny him entry..? Does it stop there? Or what if I’m not at home, I happen to be at home today (weekday late morning) which is rare. Would he have just skipped my house.",
      "comments": [
        {
          "text": "I googled - https://www.nea.gov.sg/validate-officer",
          "score": 96
        },
        {
          "text": "Are you in a current dengue cluster?\n\nhttps://www.nea.gov.sg/dengue-zika/dengue/dengue-clusters\n\nThink they have to come back again if you're not home or leave a notice at your door to arrange for an appointment",
          "score": 46
        },
        {
          "text": "Most likely your home is in or near dengue cluster. If you deny him entry, he will have to come back again with an official order that mandates entry. They need to cover every household and will note which house is not checked, and they will come back again.\n\nHowever, I did encounter before last time when I wasn't home but my helper was home. I told her not to let him in because she wouldn't be able to verify. They will come back again another day or time to try when owners are home.",
          "score": 36
        },
        {
          "text": "What I did before I let them in:\n- snapped a pic of the NEA officer’s id card \n- rang the NEA hotline and got them to verify this person’s identity. Another commenter posted a link to verify NEA officers’ identities. \n\nThe NEA makcik just patiently waited while I was sorting out the checks.",
          "score": 31
        },
        {
          "text": "genuine civil servants will patiently wait for you to verify and even recommend the correct website if you request - nothing to hide, plus you wasting time on their behalf for them. \n\njust dont be rude or a cbkia like throw water at the poor person la, but don't ever let anyone into your home if you do not feel safe! the real ones will leave and come back with another person or even the police in the future if required.\n\nhow i know? I do home visit before!",
          "score": 30
        },
        {
          "text": "You deny entry but they will come again to check. A notice will be pasted on your door with the time and date of next check conducted.",
          "score": 27
        },
        {
          "text": "They probably have a kpi to hit like X out of Y units per block, and also do outreach and education.\n\nMost of the time unless your house is a mess and you leave water containers lying around should have no reason to not let them in. I have had generally pleasant encounters with them.",
          "score": 16
        },
        {
          "text": "Just don't take pic of authority card because by right not allow , u jus need the number under the face n validate.\n\nIf it is not a routine thn they will serve call letter thn still no response serve the break in letter but usually they will try to establish contact with owner as breaking in a lot protocol.(Like in dengue cluster or feedback targetted)\n\nIf routine , thn they jus move on.\n\nWell the check is very fast usually they just see toilet , kitchen full stop .",
          "score": 3
        },
        {
          "text": "At least yours checked properly. Mine just walked through my flat one round using only ‘eye power’ and left. If my neighbours have stagnant water and she also checked their unit this pattern, then ho sey liao.",
          "score": 3
        },
        {
          "text": "Just let them do their work on once they are verified",
          "score": 2
        },
        {
          "text": "[removed]",
          "score": 1
        },
        {
          "text": "I live alone and it’s annoying when they want to do inspections when I’m in my true natural potato form. Once I told them someone just made inspections a few days ago and they said ok and left.",
          "score": 1
        },
        {
          "text": "I don't know why but since my family moved in to our first high-floor HDB unit 2 years ago, we have gotten 3 inspection visits within a year. I found it quite unusual when we used to only get 1 NEA visit a year or two at our previous flat at 2nd floor. Both flats are in the same neighbourhood in the north, BTW. Just the block and level different, yet such difference in NEA inspection. 🤨",
          "score": 0
        },
        {
          "text": "depends if the checks are targeted or routine.\nif routine they will just move on.\n\nIf it's targeted, they will serve a notice to demand entry.\nthey will force entry with SPF if no respond from your end.\n\nIf you deny on the spot then they will get SPF involve to enter.",
          "score": -10
        },
        {
          "text": "I believe u r staying in landed. U need to covered or capped the hook hole/hook key for the manhole if is exposed (not sheltered) My friend got a fine for not capping it.",
          "score": -13
        },
        {
          "text": "You can choose to not open your door at all.",
          "score": -14
        }
      ]
    },
    {
      "id": "t3_1r1szh4",
      "subreddit": "askSingapore",
      "title": "Should i change my job now in this current economic environment?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r1szh4/should_i_change_my_job_now_in_this_current/",
      "score": 59,
      "num_comments": 36,
      "created_at": "2026-02-11T17:36:14",
      "selftext": "Dear pro redditors,\n\nI graduated about 2 years ago and have been a contract worker for a local bank for about 2 years. No chance to convert perm, at least for the next few years. The thing is, i have since built a strong rapport with my colleagues, managers and my contract tends to get extended on a rolling basis. Basic Pay however is below average.\n\nFast forward to today\n\nI have been offered another contract job by an established investment company, similar role but more towards the side of project mangement + data , but with basic pay about 20% higher. However i haven been told as a contract worker, one should not expect the contract to be renewed. \n\nAs of now, i dont have much financial liabilities and single. Should I risk my current job and jump over?",
      "comments": [
        {
          "text": "take the job with a better platform/trajectory. need to look forward not current",
          "score": 99
        },
        {
          "text": "100% jump. Current role has no upsides to stay honestly",
          "score": 62
        },
        {
          "text": "20% raise need to think so much ah",
          "score": 22
        },
        {
          "text": "Yes. Because if you can't get a perm job, you should at least show some growth and development. If you are doing very SOP type stuff (as is typical of contract jobs) for multiple years, it doesn't look so good. And of course, money. ",
          "score": 17
        },
        {
          "text": "If it's time to quit, quit. Only you have an idea of what's important for you in a job. This can be money or it can be colleagues and a good working environment.\n\nThe current economic environment is irrelevant because:  \n1. You've already secured another job offer.  \n2. If the economy is so terrible, you'd be one of the first on the chopping block as a contract worker regardless of company.",
          "score": 8
        },
        {
          "text": "Jump. Take risk when you are young.",
          "score": 8
        },
        {
          "text": "Take the newer job with better pay, since they are both contract jobs anyway.",
          "score": 5
        },
        {
          "text": "Of course jump and take the risk now. Youre young and have no dependants.",
          "score": 4
        },
        {
          "text": "what is the reason to no chance to convert to perm for these 2 contract roles?",
          "score": 1
        },
        {
          "text": "Jump. Use it as stepping stone.",
          "score": 1
        },
        {
          "text": "You do know local banks will start restructuring soon.. just see DBS CEO latest commentaries.",
          "score": 1
        },
        {
          "text": "Your age?\n\nYoung go.\n\nNot young no commitments go anyway.",
          "score": 1
        },
        {
          "text": "Thoughts:\n\nCompare annual package + benefits, basic is just a part of the full picture\n\nScope -Does it interest you, broaden your skillset?\n\nCurrent role -  2 years is a decent run, do you feel like you've maxed out your growth potential here?\n\nGood luck!",
          "score": 1
        },
        {
          "text": "[removed]",
          "score": 1
        },
        {
          "text": "Just jump. 2 years no convert means they will not convert you and just want to exploit you as a cheap contract worker. And there is no guarantee they will continue renew your contract when they can hire cheaper fresh graduate.",
          "score": 1
        },
        {
          "text": "JUMP.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r1rph8",
      "subreddit": "askSingapore",
      "title": "Do you think Singaporeans care too much about what others think?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r1rph8/do_you_think_singaporeans_care_too_much_about/",
      "score": 41,
      "num_comments": 40,
      "created_at": "2026-02-11T16:16:38",
      "selftext": "Do you think society will be better if people cared less about others opinions? What are certain things you think people shouldn’t seek outside opinions on so heavily? \n\n\nEdit: I don’t understand why people find this so offensive. I’m not saying anything is good or bad. I’m stating a question, not a fact. This is a Singapore sub, so I’m asking what people think within the culture because I’m curious. If you don’t care, then don’t answer. Reddit is meant for discussion. Nobody is forcing you to participate. ",
      "comments": [
        {
          "text": "There’s an irony in asking this question - you wouldn’t ask if you didn’t care",
          "score": 70
        },
        {
          "text": "yes and no.  \ntoo much of main-character syndrome (i just wanna watch my tiktok video, full blast, on the train, with no earphones)  \ntoo little civic-mindedness (too bad for u, sue me la)",
          "score": 16
        },
        {
          "text": "We like to compare just as our parents did to us with other kids",
          "score": 14
        },
        {
          "text": "When I hear \"other people\", I would always ask who those people are. Are they actively contributing to my life? No? Then they don't deserve any thought in my decision-making. We only have this 1 life, no idea if there's a re-do, no point worrying about these \"others\". It's time we move on as a society from this mindset.",
          "score": 9
        },
        {
          "text": "People care too much. But at the same time, caring a bit about what other people think helps us see our blind spots. Ultimately, you care but do you listen?\n\n\nThe problem with social media is that you care too much a lot strangers where you should be listening more to people around. It leads to people being lonely and looking to strangers for validation.",
          "score": 5
        },
        {
          "text": "Yes. People complain about the rat race but then follow the rat race down to the book.",
          "score": 5
        },
        {
          "text": "I think im ok with little things like eating alone and being more frugal. But im meeting resistance in terms of changing career and it was kind of unexpected as my family never pressured me to be outstanding and tell me happy can already. I havent officially announced that i intend to switch, just telling them i intend to make it a side hustle they already make noise. \n\nI know i should keep to myself and shut up until i manage to support myself but it does feel very lonely that even friends advise me to stay in my current industry but to switch jobs. \n\nSo it does feel like money talks, once i saved enough then i feel i have the right to do whatever i want. At least i can tell my family if you not happy i will move out. Dont feel comfortable moving out right now but if cannot tahan i might just do it this year",
          "score": 4
        },
        {
          "text": "They (or we) care too much about what people think, and they think their opinion is everything.",
          "score": 3
        },
        {
          "text": "people may say they don't care, but i guarantee you that everyone cares.\n\nwhen someone in their social circle upgrades their car, someone in their office has a lavish wedding, someone whose relative just moved out to a larger home - you do care. \n\nwe live in a society and it's natural to compare.",
          "score": 2
        },
        {
          "text": "No society in general would be far worse if people didn’t care about outside opinion. \n\nThere are nice people and then there are fake nice people who only do certain things because they care about the opinion of others. This helps improve society, because even if it’s fake, it’s still a net positive for society. \n\nAlso opinions are useful insights/info, it’s just how you interpret/use that info that matters",
          "score": 2
        },
        {
          "text": "Haha yes - I was one of them. Like I cared too much about what others thought about me, and I was never truly happy, always comparing myself to them, and worrying about whether people liked me. But then I realised I don't really care about what others have been thinking or even saying, the converse is true! Other people don't care about me. So why care? With this knowledge, I am much happier in life, and whenever someone makes a comment about how I should live my life I asked them \"eh this one my life or your life?\"",
          "score": 2
        },
        {
          "text": "This is going to be ugly. But true.\n\n**Most** Singaporeans are about the biggest \"carers of what other people think.\"\n\nThat's why they **often** dress the same way, look the same way, want the same things, aspire to the same goals. Car, condo, gym, travel, marriage, wedding, kids, BTO lottery, DCA in VWRA etc. Sheeple.\n\nAny diversity or straying from the path is **often** laughed at and looked down upon. Because they cannot bear the thought that what they're working so hard for, isn't lauded or deemed as worthy as they imagine it to be. They want others to be salty. That's why there's so much flexing. Sinkie pwn sinkie.\n\n**Most** Singaporeans' idea of success is to *be just like* everyone else in their attempts to *be better* than everyone else. Kiasu-ism at its best.\n\nI know I'm going to be downvoted to hell and back for this, but it'll be interesting to see how many, if any, agree.",
          "score": 2
        },
        {
          "text": "What do u think?",
          "score": 1
        },
        {
          "text": "I think it is the contrary. Singaporeans care too much about what they think, and everyone else should agree with what they think.",
          "score": 1
        },
        {
          "text": "[deleted]",
          "score": 1
        },
        {
          "text": "Thats the only thing keeping our economy going. If nobody cares, whats the point of trying.",
          "score": 1
        },
        {
          "text": "Yes. Definitely better if we cared less about other people's opinion. But being humans, that's almost impossible. Some people go to the extreme that they don't take in positive feedback. The other extreme end is care so much we second guess ourselves. I think an evaluation would be useful. Are we not taking actions because of other people's opinion? If yes, then perhaps reconsider and take the leap of faith despite other people's opinion.",
          "score": 1
        },
        {
          "text": "balance. everything is a balance. \n\n",
          "score": 1
        },
        {
          "text": "Depends on the opinion. If it's an opinion about an action that makes society worse off, then of course they should care. But if it's an opinion that doesn't really matter, then it would be better if people were less sensitive.\n\nCase in point. I would very much love for my opinion that smokers should not smoke in their house or at crossings or anywhere where it will affect me. But do you think they care? Would society be better off if they care?",
          "score": 1
        },
        {
          "text": "Yeah it’s like when I was living overseas, I don’t feel the pressure to have kids but now that I’m back and everyone talks about it (even when I go to trim my eyebrow lol wtf), ur brain just unknowingly think and process it.",
          "score": 1
        },
        {
          "text": "It depends on what issue, really.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r1nwfc",
      "subreddit": "askSingapore",
      "title": "For those who collect gold, where do you buy from?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r1nwfc/for_those_who_collect_gold_where_do_you_buy_from/",
      "score": 37,
      "num_comments": 47,
      "created_at": "2026-02-11T12:42:35",
      "selftext": "Genuinely wondering, where do you buy gold from? Bullion Star or jewelry shop like SK? Or other gold shops?\n\nI also know of people who buy gold ETF instead. What’s the diff? ",
      "comments": [
        {
          "text": "Bullion Star works for me.   Don't buy in jewellery shop as they have high markup over spot.",
          "score": 45
        },
        {
          "text": "If you buy for its value only, use bullion shops like Bullion Star or Indigo Precious Metals. Don't buy from jewellery shops.\n\nGold ETF tracks the price of gold, easier to buy and sell, can buy $100 every month, less fees over physical, won't get stolen. But downside is what you don't hold in your hand is not yours. If things go south in this world, it's possible that the market price of gold exceed the paper price, so you lugi. That hasn't happened yet. Also most gold ETF don't hold all of the gold, only Sprott Physical Gold Trust does (PHYS). So if buying ETF I'd rather buy PHYS over GLD, because PHYS is 100% allocated gold.",
          "score": 36
        },
        {
          "text": "You can buy from banks too. They generally have a lower spread: https://www.uobgroup.com/online-rates/gold-and-silver-prices.page",
          "score": 20
        },
        {
          "text": "Gold bullion is physical, you keep it and can sell it anytime at the rate the shop provides.\n\nGold ETF is a fund that follows gold prices. You do not own any physical gold, the fund manager would have to manage the ETF price to match that of gold. It has generally cheaper management fees and almost no spread.\n\nThere is a 3rd group called Paper gold. You buy paper gold which says that you own x amount of gold but do not get it physically. You could get it physically by paying some fees and normally this has yearly fees as well. The good part of this is that you can buy sell easily and don’t have to worry some burglar come steal your gold.",
          "score": 10
        },
        {
          "text": "Whatever you do, do NOT buy from Singapore Mint. Their prices are extreme chop carrot head.",
          "score": 7
        },
        {
          "text": "SK because I buy to wear",
          "score": 4
        },
        {
          "text": "Bullionstar has a lot more selection, and the process is easy. On normal days, you won't see that much crowd nor the minimum spend requirements. Have been buying from them for a while. With the recent gold/silver rush, premiums at Bullionstar are higher than the rest though.\n\nSilverBullion is another place and they are always out of stock. Service is quite shitty whether its over the counter or their online support. Have submitted query to them and more than a week, still no response. Calling in will just give you an endless loop of pressing \\*\n\nGoldSilver Central crowd control is really out of place. Online information and onsite information does not tally too. They have one small table counter serving all the crowd, and everyone's just standing around. Even though you have an appointment fixed, you must still wait behind all those who walk-in. So no point making appointment.\n\nUOB has a low spread like many shared, and probably one of the places to get your precious metal. Haven't really bought from there during this period so can't comment much.",
          "score": 3
        },
        {
          "text": "i only bought 1 time at silver bullion at millenia walk there.. after that gold price up then nvr buy liao. i feel ok leh price, can check online before going down, compare which place cheaper",
          "score": 3
        },
        {
          "text": "Go check the price of gold ETF vs physical gold, if you have to pay a premium for physical gold, I would rather go for ETF TBH. Don't need to scare the shop gives fake gold, or you sell for the same assuming spot price goes up by the mark up in the first place.",
          "score": 3
        },
        {
          "text": "Bullionstar now have a minimum transaction of $10k…which is 2x coins?",
          "score": 2
        },
        {
          "text": "I buy from taka/maxicash i see which has better price, I only started this year I get those 1 gram 999 gold during sale can get as low as $190",
          "score": 2
        },
        {
          "text": "Bullionstar, gold silver central",
          "score": 2
        },
        {
          "text": "I dig for it ... In my nose",
          "score": 1
        },
        {
          "text": "UOB over the counter. Now need make appointment. If u got Uob priv account, can go la kopi upstairs too.",
          "score": 1
        },
        {
          "text": "can buy from Valuemax as well. saw new bars there",
          "score": 1
        },
        {
          "text": "I bought from Silver Bullion. I talked to their staff at the Millennia Walk when it wasn't as bad as now, he was patient and explained a lot to a noob like me.\nAnyway, I did my homework and went with them. They state their premium clearly so you know what you are getting. I am also using their storage and other services so will stick with them for a while.",
          "score": 1
        },
        {
          "text": "1st Jewellery at Fu Lu Shou",
          "score": 1
        },
        {
          "text": "In some places the basic chain has no workmanship fees. If you're willing to pay a small premium, can buy and hold/wear/gift. But when the jewelry shops take back, must consider they might minus 18% from spot.",
          "score": 1
        },
        {
          "text": "UOB",
          "score": 1
        },
        {
          "text": "LPM was the cheapest retailer, last I’ve checked.",
          "score": 1
        },
        {
          "text": "Gold ETF or gold mining stocks are a promise. Physical gold is actual ownership",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1r1rmdp",
      "subreddit": "askSingapore",
      "title": "Are recycle bins just for show only?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r1rmdp/are_recycle_bins_just_for_show_only/",
      "score": 33,
      "num_comments": 20,
      "created_at": "2026-02-11T16:11:11",
      "selftext": "I’m referring to the small metal ones that separate for paper, plastic, cans and general waste (not the big blue container).\n\nRecently doing CNY spring cleaning and recycling alot of my parcel boxes and mail envelopes. But one day i saw that the cleaner simply dumped everything into one trash bag.\n\nJust wondering if anyone knows if those are only meant to let us practice categorising our recyclables?",
      "comments": [
        {
          "text": "My understanding is that Singapore recycling items all end up at the same place anyway to be sorted..and most of it already contaminated and have to be incinerated, which kind of defeats the purpose.  We aren't a very environmentally sustainable people alas.",
          "score": 62
        },
        {
          "text": "Majority of Singaporeans don't know how to properly recycle. So it's easier to just burn it all.",
          "score": 26
        },
        {
          "text": "100% because all the stuff inside our recycled bins are all contaminated already. its not at a stage where the recyclers can easily recycle it also. but it makes you/wife feel good about \"recycling\" when you throw your stuff in there so i guess thats all it is for ",
          "score": 23
        },
        {
          "text": "Recycling bins are not for show only. But whether those segregated recycling bins in public areas are for show only, that's a good question. As far as I know, Singapore does the segregation at the backend facility. If someone segregates beforehand, I've no idea if the collector will end up just dumping everything together then doing another round of segregating at the facility. ",
          "score": 6
        },
        {
          "text": "\n\ner, I think best to ask the cleaner in a nice way. so you can find out if the manager told them to dump it or what. \n\n\\*\\*\n\nok realised I typed an answer to a different question. \n\nit was a stupid idea to allow mix recycles as people start wish cycling and the mess just invites others to throw anything and everything inside. once a bin is contaminated, the whole bin is to be thrown. CNA did ask someone from NEA about it but they refused to change this mix recycle.  [https://www.channelnewsasia.com/watch/talking-point-2023-2024/where-do-my-recyclables-go-part-2-3707771](https://www.channelnewsasia.com/watch/talking-point-2023-2024/where-do-my-recyclables-go-part-2-3707771)\n\nalso, one time paper disposable are worst than one time plastic disposables in Singapore's context.\n\nand recycling is quite a scam - as it takes quite a lot of effort to recycle plastic especially. I think paper is easier, but the fact that Tay paper went bankrupt probably shows that the cost of recycling is really not there.\n\nsadly.\n\nthe earth will die soon anyway.",
          "score": 4
        },
        {
          "text": "Back when I was working in a mall, I consolidated all the plastics to throw in the recycle bin only to get scolded terribly by the mall cleaner said it all goes to the same main bin, saying that I’m only making his job more difficult by doing so.",
          "score": 2
        },
        {
          "text": "the big blue bins are placed outdoor in my neighbourhood and everything gets contaminated when it rains. another thing is the cleaners in my old neighbourhood told me to throw food waste into the blue bins. He said that it doesnt matter....",
          "score": 2
        },
        {
          "text": "Singapore is all about wayang only",
          "score": 2
        },
        {
          "text": "segregation does reduce contamination so that's a reason why",
          "score": 1
        },
        {
          "text": "Singapore currently does mixed stream recycling. It's the same truck coming around to collect from the blue bins, which are not segregated. The segregation happens by cheap manual labour at the recycling sorting plant. There aren't 3 trucks coming, or one truck with 3 separate compartments, so combining recyclables in one bag is fine (as long as it isn't mixed with trash).\n\nThe compartmentalized recycling bins in malls just acts as a deterrence to deter people from putting random trash into the recycling bin. Because if what you're holding doesn't fit any of the 3 bins, you're more likely to go find the trash bin. \n\nWhereas the non-segregated blue bins, you will always find all kinds of things in there that don't belong, like old furniture, old toys, decorations, styrofoam etc. ",
          "score": 1
        },
        {
          "text": "Yes",
          "score": 1
        },
        {
          "text": "recycle prolly jus means go into combustionnnnnnnn\n\nlet u feel gud niaaaaaaaa",
          "score": 1
        },
        {
          "text": "To quote Jason Statham (War, 2007) : This isn’t Japan",
          "score": 1
        },
        {
          "text": "Reduce \n\nReuse \n\nRecycle ♻️ \n\nThere is a reason why Recycle is last.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r2gfru",
      "subreddit": "askSingapore",
      "title": "Where can I stay for short term during HIP &amp; reno",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r2gfru/where_can_i_stay_for_short_term_during_hip_reno/",
      "score": 27,
      "num_comments": 17,
      "created_at": "2026-02-12T09:45:18",
      "selftext": "Hi all, my flat will be undergoing HIP followed by renovation, the whole process is estimated to take 2-3 months. During this period, what are some options for short term stay?\n\nAirbnb is not feasible since there are minimum stay durations for private/HDB apartments, and hotels are also expensive. ",
      "comments": [
        {
          "text": "I stayed Victoria Hotel, they have long stay promo for 7 or 14 days, 35% and 40% off respectively. I took the 14 days one. It was a pleasant stay and very near bras basah MRT with food options nearby :)",
          "score": 45
        },
        {
          "text": "Want cheap ? Then go.stay jb or continue to stay during the reno\n\nWant convenience or shiok ? Then go stay hotel or service apartment \n\nWant cheap and convenient ? Go stay with friends or family 🤣\n\nFyi.airbnb in sg is illegal",
          "score": 22
        },
        {
          "text": "I stayed at capsule hotel and Hotel 81 lol. But for 2 weeks only while HIP is going on",
          "score": 18
        },
        {
          "text": "Stay with relatives or have some of the household stay in a place with cheaper hotels like Malaysia/etc. \n\nSome hotels have cheaper rates for seniors, like Domitys Bangsar in KL, and if you have access to corporate rates, some hotels accept them for personal travel if you email them directly..\n\nThere's also house-sitting/pet sitting",
          "score": 12
        },
        {
          "text": "you can consider JB if not working, thats what my friend did",
          "score": 8
        },
        {
          "text": "2-3 months is the time taken for the entire cluster of blocks to go through HIP. When it's your block's time, it takes only around 10 working days. There are \"staycation\" packages specifically for people going through HIP.",
          "score": 6
        },
        {
          "text": "Try serviced apartments. Cheaper than a hotel usually if you are staying for a month or more, they give you discounts. Plus you can cook and do own laundry. My favourite part was how they had a cleaning service for the apartment so you don’t even need to clean the serviced apartment. Also had the perks of a gym, pool and free parking at their carpark.",
          "score": 5
        },
        {
          "text": "Go travel 1 week, the other week go to capsule hotel (read reviews some very hot). Singapore no cheap options for accomodations unless you go stay with relatives. Cheap I meant below $50. Hotel I think cheap ones around $150 \n\nThe whole process means other floors as well, me personally, I just rather used ear plugs when its not my house. Your own house I think its 10-12days. Will the reno be very messy also? If not hacking tbh I think stay at home should be ok.",
          "score": 2
        },
        {
          "text": "I remember that the orchid country club in Yishun had a promotion targeting HIP and renovations. Not sure if still there.",
          "score": 1
        },
        {
          "text": "I think can try asking YMCA? got some affordable short stay packages if I not wrong",
          "score": 1
        },
        {
          "text": "While the whole project might take up to 2 to 3 mth per estate, it only take 1 week per unit.\n\nSo I stayed in my house during this period and use the common toilet at the void deck",
          "score": 1
        },
        {
          "text": "you didn't consider the renovation time before embarking on it? \n\nHIP only adds about 7-10 days for your unit.. the bulk of the time seems to be for your personal renovation",
          "score": 1
        },
        {
          "text": "Check out property guru for 3 month rental. Under Singapore law, it is legal to rent 3 months consecutive stay in a private property like condo, apartment or landed property. \n\nhttps://www.ura.gov.sg/Corporate/Media-Room/Media-Releases/pr17-44",
          "score": 1
        },
        {
          "text": "YMCA?",
          "score": 1
        },
        {
          "text": "Nongsa is close to Tanah Merah in Batam",
          "score": 1
        },
        {
          "text": "Rent a condo bedroom for 3 months. Private apartments minimum rental duration is 3 months. Provided the landlord is willing to accept short rental tenure.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r1uyc0",
      "subreddit": "askSingapore",
      "title": "What's up with red line MRT...",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r1uyc0/whats_up_with_red_line_mrt/",
      "score": 24,
      "num_comments": 10,
      "created_at": "2026-02-11T19:31:12",
      "selftext": "Is it just me or for the last (2?) weeks or so but everytime I get onto NS line train I'm greeted by this STANK &amp; particularly bad on the evening train towards Marina Bay. I thought give it a week and it'll subside eventually but fat luck. ",
      "comments": [
        {
          "text": "Its a buildup of high humidity, overuse, old trains, crowded 24/7, lots of Construction workers uses it after work and espcially from Bishan onwards it all in the sun, meaning its just being baked... I just wear a mask and use a personal fan on the train, the Jisulife. It helps especially peak hours...",
          "score": 38
        },
        {
          "text": "From NS line towards jurong east, everytime i start catching whiffs of fart smell i know the train is at bishan alrd",
          "score": 27
        },
        {
          "text": "You’re the common denominator ….",
          "score": 21
        },
        {
          "text": "Ministers don't ride that line. So no one will bother to fix the stench. ",
          "score": 6
        },
        {
          "text": "Ride the first carriage in the direction you're going.",
          "score": 3
        },
        {
          "text": "The stench of public transport is real but luckily 99% of the time it's mostly attributed to the train or vehicle itself.",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1r1ukpe",
      "subreddit": "SingaporeRaw",
      "title": "Tiagong Chinatown CECA killer is working at Standard Chartered?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r1ukpe/tiagong_chinatown_ceca_killer_is_working_at/",
      "score": 166,
      "num_comments": 92,
      "created_at": "2026-02-11T19:10:11",
      "selftext": "Any redditor can confirm?",
      "comments": [
        {
          "text": "They usually work in big tech or high finance.. even if not SCB she's probably in Meta or Temasek. SG is really the only country where foreigners take majority of the top roles.",
          "score": 113
        },
        {
          "text": "Dunno how Standard Chartered will react if their customers know about this.",
          "score": 100
        },
        {
          "text": "Chennai Business Park.\n\nMumbai Bay Financial Centre.\n\nNo shit, even AI will link to our current location.",
          "score": 100
        },
        {
          "text": "So easy to change career? From Dental in UAE to stanchart? (Despite stanchart being infested)",
          "score": 99
        },
        {
          "text": "Sigh local banks really infested with ceca",
          "score": 97
        },
        {
          "text": "Her latest career is CECA Killer.",
          "score": 46
        },
        {
          "text": "There was a post started by someone who claims to be the driver’s frd and that the driver works in a clinic. \n\nSo not sure who is correct\n\n[https://www.reddit.com/r/SingaporeRaw/s/QhrPnVMaCk](https://www.reddit.com/r/SingaporeRaw/s/QhrPnVMaCk)",
          "score": 33
        },
        {
          "text": "They really saved melvin and gracey from further spotlight hahah",
          "score": 32
        },
        {
          "text": "[deleted]",
          "score": 18
        },
        {
          "text": "Are you telling me nobody knows her name or where she works? This is ridiculous everybody alr know the victims names",
          "score": 5
        }
      ]
    },
    {
      "id": "t3_1r1oeey",
      "subreddit": "SingaporeRaw",
      "title": "Bro you no need to put a Singapore flag in ur username bro😭",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r1oeey/bro_you_no_need_to_put_a_singapore_flag_in_ur/",
      "score": 154,
      "num_comments": 19,
      "created_at": "2026-02-11T13:07:50",
      "selftext": "Saw it from another subreddit",
      "comments": [
        {
          "text": "It’s an obvious joke cmon guys lol",
          "score": 53
        },
        {
          "text": "Hahaha oh dear",
          "score": 41
        },
        {
          "text": "[deleted]",
          "score": 38
        },
        {
          "text": "As expected no sgreans got the joke.",
          "score": 20
        },
        {
          "text": "Could it be dear jaspur here mixed up epstein and einstein?",
          "score": 20
        },
        {
          "text": "Nuoooo, not Jeffrey Einstein.",
          "score": 14
        },
        {
          "text": "What's wrong with this person?",
          "score": 4
        },
        {
          "text": "At least it’s the correct “you’re”",
          "score": 3
        },
        {
          "text": "They said one of the girls on the island/involved with Epstein operations is now head of something in UAE",
          "score": 1
        },
        {
          "text": "Damn they making new ones after the first one “died”",
          "score": 1
        },
        {
          "text": "Years of education, and he can’t differentiate between Einstein and Epstein.",
          "score": -1
        },
        {
          "text": "just an average sinkie, lol",
          "score": -3
        },
        {
          "text": "could be ceca lmao",
          "score": -4
        }
      ]
    },
    {
      "id": "t3_1r1rzin",
      "subreddit": "SingaporeRaw",
      "title": "Served NS and has OCI",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r1rzin/served_ns_and_has_oci/",
      "score": 134,
      "num_comments": 158,
      "created_at": "2026-02-11T16:34:03",
      "selftext": "https://www.reddit.com/r/PassportPorn/s/pO79HzNCep\n\nImagine those Indian nationals who doesn't need to serve NS, have SG citizenships and OCIs. Meaning that they are still PRs in India.",
      "comments": [
        {
          "text": "But. Dude serving NS. So, technically ok",
          "score": 244
        },
        {
          "text": "Wha piang op this guy born in singapore lah. He study here since young.The parents is ceca that why he hold india passport. I got read his thread dont anyhow stir shit. People even serve the army what you want from him. Go back india to a country he dont really have much assoicate with except his parents and passport?",
          "score": 168
        },
        {
          "text": "I also can pull off this photo with my CECA colleague. Add PRC, Malaysia, Indonesia, Philippine, Vietnam, Thai. No problem.",
          "score": 88
        },
        {
          "text": "Hmm iinm, OCI is for people who have Indian descent within 2 generations. So if your grandparent was Indian (by nationality), you are eligible for the OCI card. I don't think the generation after you can get it though assuming that your grandparent's generation was the last generation in your family to be Indian (by nationality). Spouses of Indian citizens can also get the OCI card, even if they themselves are not Indian.\n\nSo I guess getting an OCI within 2 generations can help facilitate visa free travel to meet family in India. \n\nTbh I don't see the problem in someone having served NS and then holding OCI. It could be that their parent/grandparent has migrated or even they themselves migrated but then are now Singaporean. \n\nWe're a country of immigrants after all. Only the Malays can truly say that they belong to Singapore. \n\nI do think that immigration policies can be looked at again and take locals' sentiment into account. But also, as long as immigrants are positively contributing, I really don't see the issue....",
          "score": 48
        },
        {
          "text": "What’s the problem? Many served NS move to other countries get PR? I also born here served NS, hold an OCI. OCI is not actual citizen of India, we don’t have voting rights or anything, it’s just a long term visa",
          "score": 45
        },
        {
          "text": "Essentially dual citizenship. Even the exDBS CEO have this arrangement. Singapore must have know this but chose not to say anything as usual.",
          "score": 40
        },
        {
          "text": "https://preview.redd.it/woxiuhf9wtig1.jpeg?width=760&amp;format=pjpg&amp;auto=webp&amp;s=7c9b0b461da4854a9958d3ccdab4ad87d9de80a8",
          "score": 37
        },
        {
          "text": "This is ridiculous. I too have both. My family moved to SG in 2001 when I was two years old. Of course I don’t have thinking capability of visa all that then. I served my NS too. My grandparents are/were in India. Visa cost to enter India grew exponentially and had to be paid and applied each time. OCI removes that restriction with a onetime application. Some of us just want to visit our grandparents or attend some wedding, heck even tourism or do business like purchase raw materials for export, and disallowing that is some mad thing. ",
          "score": 34
        },
        {
          "text": "Technically OCI doesn't allow the holders to vote in the Indian General or State Elections which is why I feel Singapore is quite too lax on this. Also on the other hand, I can't seem to comprehend why would they take up PR of their homeland when they themselves choose to leave.",
          "score": 32
        },
        {
          "text": "What nobody is mentioning, is that India isn’t the only country with this arrangement..\n\nFrance also has this option, where citizens born in France can give up their French citizenship to migrate to another country (eg. Singapore), but in the event they decide to return to France for good (give up their foreign citizenship), they’re welcome back to reclaim their French citizenship.",
          "score": 17
        },
        {
          "text": "yoo never expected my post to be posted here 😂\nanyways yes OCI is like a pr but why do so many ppl have a problem with it 🥹",
          "score": 13
        },
        {
          "text": "Do research. OCI is one kind of visa for them to go back\nand visit.",
          "score": 12
        },
        {
          "text": "I've been in Singapore since I was 4 years old. I have studied in Singapore, and went through all the processes. My parents pay taxes I have paid taxes. I went through 2 years of NS\n\nI've been broke in Singapore and I've been rich in Singapore. Ive voted 3 times and I've gotten all my licences in Singapore. \n\nWhy can't I get my OCI? ITS A VISA. Am I still considered CECA lol? Some of the comments here just point towards that. It's confounding me\n\nI fucking love Singapore and I love India as well. I don't get your point of contention here OP",
          "score": 12
        },
        {
          "text": "served NS= one of us. save your hate for others",
          "score": 12
        }
      ]
    },
    {
      "id": "t3_1r1rvv8",
      "subreddit": "SingaporeRaw",
      "title": "Budget tomorrow 1:30PM in parliament, looking forward to my chicken wing",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r1rvv8/budget_tomorrow_130pm_in_parliament_looking/",
      "score": 128,
      "num_comments": 56,
      "created_at": "2026-02-11T16:27:55",
      "selftext": "",
      "comments": [
        {
          "text": "Agree with him. When was the last time we see a full\nMinister in SMC?",
          "score": 49
        },
        {
          "text": "Wow based Calvin Cheng. Who had this on their 2026 bingo card?",
          "score": 34
        },
        {
          "text": "Ok to increase Minister's pay, BUT MUST BE PAID IN CDC VOUCHER ONLY. So they cannot use it to buy car n house.",
          "score": 18
        },
        {
          "text": "But they already announced saying chicken wing getting smaller 🥺",
          "score": 16
        },
        {
          "text": "Wow, the pro-establishment village idiot is coming to his senses. Give them the top dollar, but the top dollar demands the most capable people.",
          "score": 13
        },
        {
          "text": "oppo mps pls speak up against increase of mp salaries!👍❤️🌟",
          "score": 11
        },
        {
          "text": "Why is this asshole talking more n more sense all of a sudden lol",
          "score": 11
        },
        {
          "text": "He’s been butt hurt since the water melon tossers went at him. \n\nHe felt he was scapegoated. hurhur",
          "score": 8
        },
        {
          "text": "https://preview.redd.it/keor0icj7uig1.jpeg?width=735&amp;format=pjpg&amp;auto=webp&amp;s=fa8de0c82d459f179dd5e49dbbafa41f6df748b0",
          "score": 5
        },
        {
          "text": "1) just charge government corruption with death penalty. \n\n2)Who can sack ministers. They don’t cover each other SSS. Can Liao.\n\n3)but 65% still don’t learn their fking lesson ",
          "score": 4
        },
        {
          "text": "The whole issue is they don't get sacked. Why deal in hypotheticals?",
          "score": 3
        },
        {
          "text": "The issue here is not about salaries, don't fall for this red herring. \n\n\nIt's about the growth at all cost that will further strip the country of it's soul and turn us into a squatting ground for foreigners passing through to make a quick buck, while citizens shoulder the responsibility of NS and taxes. \n\n\nPegging minister's pay/bonus to GDP growth is the real issue here. \n\n\nCalvin Cheng wants to turn Singapore into a paradise for the rich, a hedonistic playground for the wealthy, powered by the sweat of citizens begging for scraps off their tables. \n\n\nWe will never get to \"fire\" the underperforming ministers. Constant gerrymandering and obstacles to the opposition will ensure they and their cronies will be u touchable by the electorate. \n\n\nNice try CC.",
          "score": 3
        },
        {
          "text": "Chicken wing? People voted against CDC vouchers. ",
          "score": 2
        },
        {
          "text": "Chicken wing now also v small size only",
          "score": 2
        },
        {
          "text": "Well they tried to run a future minister in jalan kayu smc what",
          "score": 2
        },
        {
          "text": "id love to see the likes of Jo Teo and Vivian run in SMCs  \n\nI felt conflicted when I saw CC making remarks that I agreed with, and then I reflected and realized why: in his past comments, he wasn't just stupid but he was actively offensive, whether that was purposeful ragebait to farm engagement, we won't know.  \n\nMethinks we should not be too quick to forgive his past behavior just because he has made some commonsense opinions in a direct manner. He really should still be \"politically-publicly\" exiled for his naked, unbridled partisanship.",
          "score": 2
        },
        {
          "text": "Also I think they should not be allowed to double hat , how is running a country a part time job?",
          "score": 2
        },
        {
          "text": "Gasp. I agree with CC again. I need to go flagellate myself.",
          "score": 2
        },
        {
          "text": "If they discuss own salary, it will be shameful act for them in a parliament",
          "score": 1
        },
        {
          "text": "chicken wing and maybe a bit of that meaty chicken ass",
          "score": 1
        },
        {
          "text": "He is right. But sadly PAP don’t sack their own unless is adultery. Incompetence they don’t sack and will just protect own kind yes-man.",
          "score": 1
        },
        {
          "text": "Calvin Cheng talk so much, got balls then join Oppo lah",
          "score": 1
        },
        {
          "text": "Ah gong more GST Voucher please (inb4 leads to increase in other areas of payment to regain the money lost from giving out these benefits)",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r28e17",
      "subreddit": "SingaporeRaw",
      "title": "Why sinkie dont make good shit like this anymore?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r28e17/why_sinkie_dont_make_good_shit_like_this_anymore/",
      "score": 115,
      "num_comments": 36,
      "created_at": "2026-02-12T04:19:42",
      "selftext": "",
      "comments": [
        {
          "text": "I remember reading or seeing somewhere that most writers from that era are or got Hong Kongers. \n\nIf you didn't notice, the vibes and direction really do feel similar to Hong Kong TV and movie production style. But when China open itself to the world, they all left to do tv in China.",
          "score": 75
        },
        {
          "text": "Man, the unbeatables was great .",
          "score": 33
        },
        {
          "text": "Budget, place. Last time sg got Tang dynasty (beside present day taman Jurong) for them to film 古代scenes. Now they have none. Young audience also tune in to web more than local show. Last time I watch mediacock is 2006",
          "score": 29
        },
        {
          "text": "Probably can't make unbeatables due to MBS/RWS opening...\n\nBack then, being a gambling king in coral island (Singapore) was just a fictional inspiration, now with 2 giant casino resort in sg, that can be a reality(?) so MDA probably will not allow Mediacorp to make it now.\n\nAlso  古装dramas not being made anymore is not just a Singapore thing.\n\nBoth hk tvb and taiwan seem to stop making those as well, presumably due to cost with only china seemingly able to afford them (but all china did are those shitty 仙侠and 宫斗 genre)",
          "score": 16
        },
        {
          "text": "Advertising dollars have dropped and budget too for shows. TV used to command the most dollars per ad and this meant prime time shows with big budgets eps during the 7pm and 9pm slots were huge earners. So they kept amping up the production values to bring in the audience and thus ad dollars. \n\nBut with cable tv and eventually internet came International competition and also ad dollars flowed to other places and MediaCorp revenues dipped. Modern shows are a lot cheaper to film compared to martial arts show. So the modern MediaCorp shows are now very slice of life and modern setting. \n\nWhen you chose a show to watch at 7pm it used to be just whatever channel 5 8 or U offered and that was the competition. Then you had cable TV boxes and then streaming and audience migrated to jdrama then kdrama and now cdrama. \n\nSo declining revenue and international competition along with their pivot to relying more on govt support for producing shows lead to the current local media landscape. ",
          "score": 13
        },
        {
          "text": "fann wong still my fav xiao long nu",
          "score": 6
        },
        {
          "text": "The Hong Kongers went back home.",
          "score": 3
        },
        {
          "text": "It'll get worse with AI where creativity is drained.",
          "score": 3
        },
        {
          "text": "All good writer and producer move to PRC. Only those good in local context remain here.",
          "score": 2
        },
        {
          "text": "MediaCorp doesn't have *cough cough* the budget\n\n\nArtistically though it makes me draft out and sometimes design some TV show ideas that I honestly don't think it will ever make it out there on live television. [Literally just Comms an artist to draw the main character]",
          "score": 1
        },
        {
          "text": "Stopped at Stepping Out.",
          "score": 1
        },
        {
          "text": "A combo of 2 factors\n\n\\- Market too small  \n\\- other markets catch up on the drama making skill\n\n\\-&gt; You need a large captive market (either internal or export driven) to be able to have a huge budget or even any budget to create compelling dramas. Talents unfortunately can be bought. It's the rare sleeper hits that are just talents waiting to up their prices sooner or later.\n\nyou can see Japanese drama was damn rave when i was a kid, then HK Drama took over, then at one time , Taiwanese Drama took over, then South Korea took over ... ... but China with its huge market is dwarfing the South Koreans as well.\n\nBut Hollywood will always be there.. because it is exporting to the whole as well as consumed by their own huge domesitc market.\n\nYou can trace the migration thru music as well.\n\nJpop, CantoPop, Taiwan Pop to KPOP then now mainly China pop",
          "score": 1
        },
        {
          "text": "Lousy scriptwriters and cutting cost. The dramas in the past have many outdoor scene shoots. Nowadays is probably just indoor studio shoots using recycled props since their scripts are similar themes.",
          "score": 1
        },
        {
          "text": "Money dried up. Also increasing censorship. I love these old shows from MediaCorp. Also great acting skills. Also the music!!! 💕♥️\n\nhttps://preview.redd.it/wgm65rs36zig1.jpeg?width=250&amp;format=pjpg&amp;auto=webp&amp;s=0edffd0c8cf1ea38d65d4f537bb0d216d9809cd4",
          "score": 1
        },
        {
          "text": "We need VRMan the return!",
          "score": 1
        },
        {
          "text": "I prefer the HK gambling drama \"Who Is The Winner\" over the unbeatable.Watched all 3 seasons when it was broadcast here.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r1t0f7",
      "subreddit": "SingaporeRaw",
      "title": "Man smeared luncheon meat along HDB common corridor in dispute over 'noisy' kids",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r1t0f7/man_smeared_luncheon_meat_along_hdb_common/",
      "score": 53,
      "num_comments": 28,
      "created_at": "2026-02-11T17:38:03",
      "selftext": "Wtf",
      "comments": [
        {
          "text": "14 weeks wtf. Those yalams kids cannot behave arh. Cb",
          "score": 32
        },
        {
          "text": "And name BIG BIG on front cover immediately",
          "score": 23
        },
        {
          "text": "Luncheon meat so expensive nowadays. Dude must be loaded",
          "score": 18
        },
        {
          "text": "waste of nice food",
          "score": 17
        },
        {
          "text": "wah i like the smell of luncheon meat leh\n\n",
          "score": 13
        },
        {
          "text": "And there was no consequences for those unruly kids? There is no justice here. \n\n\nThese inconsiderate neighbours who let their spawn run amok need to be dealt with. \n\n\nDisgusting family. Should name and shame them too. ",
          "score": 6
        },
        {
          "text": "&gt;His female neighbour, who was down the corridor from him, **shared a flat with her husband, three children, mother-in-law, sister and helper**\n\nJust report the helper accommodation might be an issue to MOM ask their enforcement team to visit her also better than smear food.",
          "score": 5
        },
        {
          "text": "posted before alr mods please do the needful",
          "score": 4
        },
        {
          "text": "Guy has a troubled life.",
          "score": 3
        },
        {
          "text": "Luncheon meat? Might as well go all out, may I suggest foie gras or caviar :D",
          "score": 3
        },
        {
          "text": "Where does he stay? So people know where not to shift house to.",
          "score": 2
        },
        {
          "text": "he shud smear it on meeeeee",
          "score": 2
        },
        {
          "text": "What if he threw meat from other animal then maybe won’t go jail?",
          "score": 1
        },
        {
          "text": "Now we wait how long that one gets for running over a child.",
          "score": 1
        },
        {
          "text": "Wa the judge also haram ah",
          "score": 1
        },
        {
          "text": "Uh oh, woke SJW Chinese girls (and even guys like Kagenlim) in shambles and screaming internally rn",
          "score": -8
        }
      ]
    },
    {
      "id": "t3_1r2hdiq",
      "subreddit": "SingaporeRaw",
      "title": "so quick to release name?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r2hdiq/so_quick_to_release_name/",
      "score": 51,
      "num_comments": 26,
      "created_at": "2026-02-12T10:27:50",
      "selftext": "https://mothership.sg/2026/02/motorcyclist-killed-changi-private-hire-red-light/?utm\\_source=tele&amp;utm\\_medium=referral&amp;utm\\_campaign=mothership",
      "comments": [
        {
          "text": "Quick? This happened last year and the driver was already convicted, then her name is released.\n\nCannot compare with the recent accident.",
          "score": 79
        },
        {
          "text": "“S’porean” there’s your answer",
          "score": 47
        },
        {
          "text": "Bcus not CeCA and not bootlicking modi govt",
          "score": 23
        },
        {
          "text": "I think it has to do with convictions? One convicted then names can be released? But the public is gonna dig and dig. Sooner or later will release.",
          "score": 10
        },
        {
          "text": "OP must be a jobless illiterate keyboard warrior to not even read the incident date before spamming.",
          "score": 8
        },
        {
          "text": "The Illiterate buffoons who populate this subreddit can't read the article which stated the incident happend in march 2024, but are gonna continue with their unhinged racist conspiracies",
          "score": 6
        },
        {
          "text": "Aiya this sub same also. \n\nAs soon as “Singaporean car” does something in Malaysia people will say new citizen or SPR with ZERO proof.",
          "score": 5
        },
        {
          "text": "this happened in 2024, maybe they need 2 years to find out the name",
          "score": 3
        },
        {
          "text": "CECA no.1, sinkies cannot compare",
          "score": 3
        },
        {
          "text": "Don’t be stupid this happened quite some time ago. Use your brain to think",
          "score": 2
        },
        {
          "text": "She don't have family and friends in high places mah",
          "score": 2
        },
        {
          "text": "Sinkie drivers kill as many people as CECA drivers! That is the message Mothershit wants to say. ",
          "score": 2
        },
        {
          "text": "2024 news.",
          "score": 1
        },
        {
          "text": "\"She was driving along Changi Road towards Geylang Road on the night on Mar. 26, 2024 at about 11:40pm.\"\n\nWriter CMI. Not clear reporting on court case about 2024 accident, not actual accident.",
          "score": 1
        },
        {
          "text": "Nothing to protect, just a true blue Singapore citizen. Phoreighner Action Party mandates this to keep attracting phoreighners to increase gdp",
          "score": -2
        },
        {
          "text": "Mothershit mandate is to gaslight the nation ",
          "score": -2
        },
        {
          "text": "Not so entertaining when its not Ceca 😏",
          "score": -3
        },
        {
          "text": "but tis one happened in 2024 lehhhhhhhhhhhh not same sameeeeeeeeeeeee",
          "score": -9
        }
      ]
    },
    {
      "id": "t3_1r1r4zw",
      "subreddit": "SingaporeRaw",
      "title": "If you have been eating BreadTalk 🍞 for the past years, you can take comfort tat your gut digestive immune system have been fortified 💪🏻 with all the added vitamins &amp; minerals from the soles of other pple's shoes 👟👟",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r1r4zw/if_you_have_been_eating_breadtalk_for_the_past/",
      "score": 47,
      "num_comments": 26,
      "created_at": "2026-02-11T15:41:18",
      "selftext": "",
      "comments": [
        {
          "text": "Stopped buying from them since the soy milk saga. Prefers Four Leaves, Yamazaki and the neighbourhood ones.",
          "score": 21
        },
        {
          "text": "I thought only tiong fnb are disgusting and unhygienic??? Now sinkie ones also?!",
          "score": 16
        },
        {
          "text": "Can only afford Swee Hee Bakery at evening time.",
          "score": 8
        },
        {
          "text": "https://preview.redd.it/oein3mbrltig1.jpeg?width=857&amp;format=pjpg&amp;auto=webp&amp;s=39ba1def060acd8609c317a9de6a4947b96754a4",
          "score": 6
        },
        {
          "text": "Some bakery strike it rich, some bakery have owner unalive themselves because of stress. The difference is not giving a fuck about the customer.",
          "score": 5
        },
        {
          "text": "Good thing my family don't buy any breadtalk products 😂 we support small neighborhood bakeries. 👍",
          "score": 4
        },
        {
          "text": "No wonder so many diseases people getting nowadays.",
          "score": 4
        },
        {
          "text": "Price drop quick! Den can buy cheaper bread!👍💓🌟",
          "score": 4
        },
        {
          "text": "i heard if u r exposed to more germs u become resistant so its a gud tinggggg",
          "score": 4
        },
        {
          "text": "U all pay 2k for cleaners what u want...",
          "score": 3
        },
        {
          "text": "Breadtalk has so many saga over the years. I'm not surprised by this, I'm more surprised Sinkies still buying from them. Oh wait sinkies also vote for PAP despite their regular screw ups and incompetence so.....",
          "score": 1
        },
        {
          "text": "![gif](giphy|13raYVIdU3Zu48)",
          "score": 1
        },
        {
          "text": "So they have been doing this for years and only got caught now?",
          "score": 1
        },
        {
          "text": "No head no tail?",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1r1ro66",
      "subreddit": "SingaporeRaw",
      "title": "Chinatown Accident | Fundraising Support for Sheyna's Family",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r1ro66/chinatown_accident_fundraising_support_for/",
      "score": 42,
      "num_comments": 5,
      "created_at": "2026-02-11T16:14:25",
      "selftext": "Some of you have been asking how you can support the family during this unimaginably difficult time. This fundraising effort is being coordinated by the University of Indonesia alumni community (both Raisha and Ashar are FIB UI 2013 graduates). **All donations go directly to Ashar’s personal bank account to help cover the family’s immediate needs following the accident.**\n\nIf you have the means and would like to help, any contribution would make a meaningful difference for them.\n\nIf you aren't able to donate, please consider sharing this post or keeping Raisha, Ashar, and their late daughter Sheyna in your thoughts and prayers.\n\n**Translation of the Instagram Post (**[**https://www.instagram.com/p/DUiRsePkh-p/**](https://www.instagram.com/p/DUiRsePkh-p/)**):**\n\n&gt;*We convey our condolences for the tragic accident that befell the family of our fellow alumni, Raisha Anindra (Chinese Literature, University of Indonesia 2013) and Ashar Ardianto (Javanese Literature, University of Indonesia 2013) in Singapore on Friday, February 6, 2026.*\n\n&gt;*As a result of this accident, their daughter, Sheyna Lashira, has passed away.*\n\n&gt;*Raisha Anindra is currently undergoing intensive care (ICU) at a hospital in Singapore due to her serious injuries.*\n\n&gt;*We ask for your prayers that the late Sheyna will find a better place by His side, and that the family she leaves behind will be given strength. We especially ask for Raisha's prayers for a speedy recovery and recovery.*\n\n&gt;*For those who would like to provide financial support to cover Raisha's medical expenses and family needs, donations can be made directly to her husband's account:*\n\n&gt;***BCA (Bank Central Asia) Bank Account No.: 2861546588 a.n. Ashar Ardianto***\n\n&gt;*We thank you for your prayers and concern.*",
      "comments": [
        {
          "text": "Done can tell them want eat char kway teow can find me also foc sg authentic",
          "score": 13
        },
        {
          "text": "Erm... I mean it's a tragic case but people die everyday. Are we gonna donate to everyone who died? Why not ask the CECA for compensation",
          "score": 2
        },
        {
          "text": "Who donating? ",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r2fecl",
      "subreddit": "SingaporeRaw",
      "title": "Genuine question - why construction workers are paid lowly? Seems high skill and high stake.",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r2fecl/genuine_question_why_construction_workers_are/",
      "score": 38,
      "num_comments": 81,
      "created_at": "2026-02-12T08:58:21",
      "selftext": "Whenever I stare at the rising building, big tunnels and connecting bridges in Singapore, I wonder how it is done.\n\nI live in Clementi where the new mrt is building. Every morning I saw indian/Bangladeshi workers carrying **Leica robotic optics** to measure this measure that. I thought it is not easy to do. I doubt all average Singaporean office workers can learn those engineering techniques fast and do it well. A lot of geometric knowledge, material science knowledge and experience involved.\n\nThe big huge machineries some other workers operate can be 1. Very expensive; and 2. Any mistake can be life costing. **It is like doctors, it matters for millions of dollars and lives, and the decision lasts for decades.**\n\nQuestion is, why are they paid so low and why Singaporeans don't want to do that job or look down at that job?",
      "comments": [
        {
          "text": "It's only in slave labour countries like Singapore and Dubai that does this. You go look at EU and AU reddit, their pay is high and there will be multiple posts on how expensive it is to call out an electrician or plumber for simple services.\n\nIt is fucking hard work and it's reflected in the pay in more civilised countries. If you willing to crawl through tight spaces, fix roof under the hot sun, or get your hands and face covered in literal faeces, you'll earn a comfortable amount of money in those countries.\n\nSG got image and class problem. Won't go away easily, and won't go away without someone kicking a big fuss. Just need to look at SBS and SMRT giving 10k bonus for SG/PR bus drivers, or that one bus company offering 5k for local bus drivers. So much complaints by the boomers and those office workers who think they are \"higher\" on some imaginary hierarchy they created in their mind. Cannot accept that a \"lower\" occupation job can earn more than them.",
          "score": 46
        },
        {
          "text": "Every job got high and low skilled.\n\n\nThe labour part is low skilled. \n\n\nHigh skilled are like crane operator, tilelayer, certain works esp on CII, etc. \n\n\nDoctors make medical decisions directly affect ppl. \n\n\n1 or 2 Building code violations dont often result in human accidents and can be rectified when identified during an audit. ",
          "score": 34
        },
        {
          "text": "Only in singapore. HK / Aus construction workers are highly paid.    \nWhy sgporeans don't want the labor work? It is a viscious circle with external factor like hot weather. It is no joke staying on site 8 hours with no aircon and surrounded by dust while wearing helmet, heavy safety boots etc.        \nThen you have capitalism maguls and government. One wants profits and another one have this \"lowest bid wins\" and \"three quotes\" stupid rules. Even private sectors follow their shitty rules.      \nThen competitions kick in. Contractors offer pathetic salary, no locals want to take the jobs. Government needs HDB to be built, let foreign labours in. Then developers think yes this works and continue to exploit the system.",
          "score": 19
        },
        {
          "text": "I could regurgitate labour economics to you but you wouldn't get it so I'll pander to you instead...\n\nSingapore bad! Boo....!",
          "score": 12
        },
        {
          "text": "Nothing has changed since the British Empire claimed SG as its crown colony/territory from 1819.\n\nExploitation of cheap labour with low wages, but a princely sum for the workers. while  maximising profits for the business owners,\n\n",
          "score": 7
        },
        {
          "text": "To some extent it’s also related to what HR calls Job Size. And there are multiple dimensions for measuring it. But broadly a general bricklayer whilst skilled does not have the need to ability to dictate changes in how the wall is to be built. He just follows an instruction according to a building code. As opposed to the architect who has to make larger decisions that have significantly more impact on the outcome. The architect too has to negotiate actively with many different bodies to get a job done. Thus the architects role has a larger job size.",
          "score": 6
        },
        {
          "text": "If our labour cost is so low, and our flat prices are still high, really makes you think why the hell are our flat prices so high to begin with.. and makes you think how much it SHOULD really cost if we pay our construction workers a fair wage",
          "score": 5
        },
        {
          "text": "Ahh you would be surprised most construction workers tao Kay are mother fucking rich. Alot of Undertable and jack up price. U just see how ID firm can jack up for your house renovation, now you think of CONSTRUCTION.. is a whole new level of jack up prices\n\nThose people underneath...They used to be high, like very high. Back in 70s or before construction workers are sort after by locals. Then come all the migrant workers to lower the pay.",
          "score": 4
        },
        {
          "text": "As others said here, you only need to look at places like Australia to see how blue collar workers are treated like human beings, paid extremely well and put on pedestals. It's most definitely a societal problem.",
          "score": 4
        },
        {
          "text": "Mechanic then is high skill. Still very low pay. Must know mechanics, electrical, hvac, software, hydraulics etc etc &amp; dangerous &amp; back breaking.",
          "score": 2
        },
        {
          "text": "Is demand skill, unlike tech.\n\nIs not high or low skill actually, is demand skill",
          "score": 2
        },
        {
          "text": "Because the decisions and the checking for mistakes/violations is not done by the workers. It's done by certified Professional Engineers. ",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1r1xzoq",
      "subreddit": "singaporefi",
      "title": "Is this a financial advisor recruitment programme disguised as an internship?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r1xzoq/is_this_a_financial_advisor_recruitment_programme/",
      "score": 62,
      "num_comments": 27,
      "created_at": "2026-02-11T21:54:21",
      "selftext": "Hey everyone, Im currently waiting for uni and came across an internship ad, applied and I want to check if this sounds like a legit internship or actually a financial advisor recruitment pipeline.\n\nI was contacted about a 2-month “financial consulting / summer internship” programme based at Alexandria Point. The person said they offer free certifications and personality assessments, and mentioned exposure to financial consulting and client work.  Apparently graduates with no experience in the sector are welcomed too\n\nHowever, before the second round interview, they asked me to fill in a Google Form requesting quite personal financial details, including:\n\n\t•\tmonthly income / allowance\n\n\t•\tmonthly expenses\n\n\t•\ttotal savings\n\n\t•\tinvestment portfolio details\n\n\t•\twhether I have insurance\n\n\t•\tCPF balances\n\nThey also mentioned:\n\n\t•\tcertifications sponsorship\n\n\t•\tpersonality profiling\n\n\t•\tface-to-face meetings\n\n\t•\tpossible overseas exposure\n\nIt’s under an individual campaign name (“Lei On Me”) by a financial advisor (name given: Shi Lei Ho), not directly through a big company HR portal.\n\nHas anyone encountered similar programmes? Is this typically FA/insurance agent recruitment rather than a standard internship? IMO it already sounds like a MLM, or just an FA recruitment trap, but i wanna get some opinions, who knows, i do want to broaden my opportunities, just not sure if this is the way to go.\n\nI don’t have the ad link i applied to, but just provided a few of the questions i was asked to fill out \n\nWould appreciate any experiences or advice — thank you.",
      "comments": [
        {
          "text": "Yes, a job interview would never request for such information",
          "score": 114
        },
        {
          "text": "Yes insurance. Run",
          "score": 76
        },
        {
          "text": "Your instincts are correct. You are far more street smart than I was at your age range.",
          "score": 42
        },
        {
          "text": "Your instinct is correct ",
          "score": 39
        },
        {
          "text": "Update: Thanks everyone for the replies, I appreciate the honesty. I had a feeling it might be more of an FA/insurance recruitment pipeline rather than a traditional internship, but I wanted to double-check. \n\n\nI know it may have seemed obvious to some, but I’m glad I asked and got clearer confirmation. I also found a few older posts describing very similar setups, which helped me connect the dots.\n\nWho doesn’t want a good internship offer these days, everyone trying to stack experience somehow. Glad I checked before committing though. Appreciate the reality check.",
          "score": 34
        },
        {
          "text": "This has been going on for so long lol, just FA baiting young ppl to join the industry",
          "score": 20
        },
        {
          "text": "Even my own mother don't know how much I have in my CPF, why should I tell this Sei Fei Lo or whatever their name is 😂",
          "score": 20
        },
        {
          "text": "This should be illegal",
          "score": 11
        },
        {
          "text": "More like they are recruiting you as a potential customer first",
          "score": 10
        },
        {
          "text": "cpf balances lmao. run.",
          "score": 8
        },
        {
          "text": "Friendly neighbourhood advisor here, I am a salaried advisor. \n\nIt is both a sales qualifying questionnaire and a recruitment questionnaire.",
          "score": 7
        },
        {
          "text": "Imagine having to declare all your financial assets before working as an intern..",
          "score": 4
        },
        {
          "text": "Confirm FA firm.\n\nFor clarity, there are other kind of jobs in insurance industry but for those jobs and internships, it will be directly with the insurer and not with an FA firm.",
          "score": 4
        },
        {
          "text": "Yes. Insurance… Trust your gut feeling. Don’t reveal your financials to freaking strangers on your first interview…",
          "score": 4
        },
        {
          "text": "Pretty Obvious, he will try to sell you something instead of you getting your certs for free. Pls stay away.",
          "score": 3
        },
        {
          "text": "Irregular. Run",
          "score": 2
        },
        {
          "text": "Personality test you already know the answer",
          "score": 2
        },
        {
          "text": "Yup. \n\nrun far far away from this",
          "score": 2
        },
        {
          "text": "This is a typical prospectus profiling from an FA angle, either you go in as “intern” or prospectus to the FA agent, whom might try to sell you products based off the survey information.",
          "score": 2
        },
        {
          "text": "They already tell you upfront it's \"financial consulting\" liao...",
          "score": 2
        },
        {
          "text": "Any company that asks for this info is major red flag. Why the hell does th company need to know how much I spend and my portfolio. No big or small company does that",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r1rx8i",
      "subreddit": "singaporefi",
      "title": "China’s future growth rate could drop to 2.5% without market reforms: economist",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r1rx8i/chinas_future_growth_rate_could_drop_to_25/",
      "score": 33,
      "num_comments": 30,
      "created_at": "2026-02-11T16:30:13",
      "selftext": "It's when FUD like this about the chinese economy comes out, that I know maybe it's time to slowly add more to my exisitjng positions in the chinese markets.\n\nIn general, I would say that we should do our best to ignore economic news headlines when deciding where to put our money. These headlines are designed to attract attention, and often miss out the more nuanced aspects of the situation.\n\nFor the chinese economy growth to stall at 2.5% per annum, is a huge claim to make without solid evidence and proper financial models. The chinese government has previously set a goal for gdp growth in 2026 to hit 5%,same as the previous year.\n\nWhat are your thoughts on the chinese economy? ",
      "comments": [
        {
          "text": "Your first mistake is thinking that the chinese government and economy works like a western one. When the chinese government announces a gdp growth target, it isn’t announcing a target, it is specification\n\nAll provinces will do whatever they need to to achieve this goal. It can be encouraging poor investments or unprofitable production, or even wastefully spending money to boost economic activity.\n\nYour second mistake is assuming chinese stock valuations work the same way as US stock. Chinese stocks will remain perpetually undervalued by conventional metrics due to the huge influence of the government on its pricing. Basically the same valuation and pricing principles used for the a free market stock doesn’t apply to chinese stocks.",
          "score": 13
        },
        {
          "text": "Doesn't sound like FUD. Rather, this economist has been tasked with laying the ground so that the 5-year plan that will be unveiled later will be highly accepted. \n\nAnyway, buy before CNY. It's like Santa Rally. Managed to dig up some (admittedly biased) stats on the CNY rally.\n\n[https://www.itiger.com/news/1139605104](https://www.itiger.com/news/1139605104)\n\n&gt;Statistics from DataBar show that from 2000 to 2025, measuring performance from T-9 days to T day (the last trading day before the holiday), the Shanghai Composite Index averaged a 1.9% gain, rising nearly 77% of the time.",
          "score": 10
        },
        {
          "text": "GDP growth may have little correlation with stock market returns. E.g. US GDP growth averaged 2.6% from 2015-2025. Yet its stock market has performed very well during this period. ",
          "score": 3
        },
        {
          "text": "FUD? What are you on about have you checked the source?\n\nThis Article is written by Luna Sun on South China Morning Post who is generally more sympathetic to China\n\nThe details within are also objectively from someone intimate with the matter within China.\n\nAnyway China isn’t Collapsing\n\nBut growth might be slowing.",
          "score": 3
        },
        {
          "text": "Because China's top priority isn't high growth at the moment.  It will never admit publicly but China is in a multi-facet race against the US.  \n\nBe it technology, supply chain, capital markets or military.  All resources are pooled to achieve superiority in these areas.  \n\nSo what we are seeing is domestic needs are being deprioritize for global competitiveness.  Unless citizens' pain reach a critical level (mass unrest), they not going to care.  While not widely announced, unemployment, especially youth unemployment are at record highs.\n\nIf you been to any of the T1 Chinese cities in the last 2-3 years, the empty malls is a very visible indication.",
          "score": 3
        },
        {
          "text": "China has entered terminal decline. Population falling and a brittle political system. Once Xi passes away the mess will show up and it won't be pretty.",
          "score": 2
        },
        {
          "text": "The provinces have already set their growth targets between 4.5% to 5%, so policymakers will do 'enough' to ensure that this growth target is hit, but additional \"bazooka\" stimulus is unlikely to be deployed again, in part to conserve \"firepower'\" given the current truce in the trade war.\n\nChina has been trying to shift toward a consumption-driven economy but this has been hampered by persistently poor animal spirits and (debatably) a lack of excess savings for consumption. A somewhat deflationary mindset is beginning to set in -- no 'urgency' to consume now since inflation remains very low, and intense competition plus over-production from excess capacity means prices continue falling over time. This is why some are cautioning that China may fall into a similar deflationary spiral like Japan in the 90s, if more is not done to reform the economy.\n\nThere are also signs that China is experiencing a \"liquidity trap\". 30-year bond yields are ~2.2%, but credit impulse has not picked up meaningfully. Cuts to the RRR (reserve req ratio) unleashing liquidity into the financial system have not been meaningfully stimulatory.\n\nStock market-wise, it is quite clear policymakers are trying to engineer a gradual market rally, whilst trying to boost household participation in stocks in hopes of spurring consumption through the wealth effect. The \"National Team\" has been selling stocks so far this year (they were big buyers in 2024 to support the market). For Hong Kong-listed equities, daily southbound net buying through the StockConnect has materially slowed, and certainly days are actually seeing outflows. More importantly, earnings have not materially grown y/y at the index level, so last year's rally was mostly driven by valuation multiple expansion.\n\nGiven current circumstances, it seems that a slow grind higher in Chinese stocks is the most likely outcome for this year, barring a trade war re-escalation. We may come to a point where \"bad is good\" -- poor data forces policymakers to rollout more stimulus, that should ultimately benefit the stock market. Also quite unlikely that Chinese stocks catch up to their East Asian breathren given the absence of the AI thematic (Korea/Taiwan) or broad fiscal stimulus (Japan).",
          "score": 1
        },
        {
          "text": "The western media has been prophesying China is in imminent economic collapse for the last 30 years.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r1ww6q",
      "subreddit": "singaporefi",
      "title": "private banking",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r1ww6q/private_banking/",
      "score": 17,
      "num_comments": 12,
      "created_at": "2026-02-11T21:07:19",
      "selftext": "Hi all, would appreciate some perspectives from people in finance / private banking.\n\nI’m trying to understand the long-term trajectory between:\n\n• Relationship Manager (RM) in Private Banking\n\n• Investment Advisor (IA)\n\n• Corporate / Business Management Analyst in a private bank (local bank context)\n\nSome local private banks offer “Wealth Management Analyst” programs for fresh grads. From what I understand, it seems relatively accessible at entry level compared to front-office roles — but I’m wondering if progression becomes difficult later on because eventually you need to build / inherit UHNW clients to really move up.\n\nQuestions I’m thinking about:\n\n\t1.\tIs RM actually the best long-term seat in private banking if you can survive the early years?\n\n\t2.\tHow realistic is it for a fresh grad to eventually build a meaningful UHNW book in a local bank?\n\n\t3.\tIs IA a better risk-reward balance compared to RM (less sales pressure, more product depth)?\n\n\t4.\tIs corporate/business management in a private bank a “safer” but capped trajectory?\n\n\t5.\tIn Singapore context, which path actually has the best upside over 10–15 years?\n\nNot just looking at starting salary, but:\n\n\t•\tincome ceiling\n\n\t•\tjob stability\n\n\t•\tmobility across banks\n\n\t•\tskill transferability outside private banking\n\n\t•\thow hard it is to progress\n\nWould appreciate candid views from those in the industry.\n\nalso in this industry specifically i see people stagnating for very long or exiting quick.",
      "comments": [
        {
          "text": "All 3 have progression paths (depending on your performance and opportunities that arise), mainly through promotion as your scope and responsibilities grow with your rank/title. Depending on banks, IA may have shadow targets (amount of revenue earned from deals closed) with the RMs.  Business management has a wide job scope, dealing with governance, internal stakeholder coordination, implementing policies and projects (system enhancements or new product set up etc) , therefore your KPI is different from RMs, not numbers and target-based in that sense. \n\n10-15 years horizon: the industry evolves constantly, I can’t tell which role has the most upside. But have a think abt the digitization of services and the growing buzzworld of AI (artificial intelligence)\n\nA junior private banker normally helps the senior banker to manage his/her clients. Over time, the junior may be given some to manage on his/her own. Differs from bank to bank, some MDs run a target as a team, some run individually. A lot of the work is advisory  ( bringing in the right teams to advise clients  on product and market views), governance ( compliance and paperwork) and building a strong working relationship with the clients ( support their investment and financial plans). \n\nInvestment advisors normally are more up to date with the financial markets, range of product offerings and services. They work with the RMs to service clients and give sales pitches. \n\nHope this helps",
          "score": 9
        },
        {
          "text": "I don’t think you can jump to be RM in PB straight away unless you have rich family background and connections. Usually start with ARM. I think this answers yr qn 2.",
          "score": 6
        },
        {
          "text": "Success rate for a ARM to be A RM, it’s about 5%. A lot has tried and failed. But a mainstay RM is usually quite secure.",
          "score": 3
        },
        {
          "text": "Generally I notice people selected for those programs for the IC/RM are usually more affluent. \n\nThen your CA/BMA are those generally the \"doer'/execution type.\n\nAnd getting into these programs is one thing, trying to find placement after the programs is tough, i.e. after 2 years, you will be booted out. Then you have to hunt/beg if there's head count, whether people think you are useful/helpful/value add?",
          "score": 1
        },
        {
          "text": "If you make it as an RM, your income and security is the highest. Client acquisition is key. It takes time to build relationships with prospects and then to offer enough value that these prospects become clients. Banks may not give you that time, given the high salaries. \n\nBuilding a solid book can take easily 10-15 years. I would say a solid book is 300m at a minimum, so that is acquiring 30m a year. \n\nIA/IC income/stability is dependent on the bankers that you work with. Some banks allow any banker to work with any IA. Some banks will fixed you to a team. It’s easier to get secure as an IA/IC than it is as an RM.",
          "score": 1
        },
        {
          "text": "I’m going to give you a blunt read. Most are under pressure because of KPIs and because of that , the RMs over churn their clients and most of their clients will get burnt. That’s why the turnover rate is very high. Only a few make it, like in most industries. But, you start off quite well, but staying a very long time and flying high your entire career is difficult (but possible) and definitely stressful.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r1r80y",
      "subreddit": "singaporefi",
      "title": "Questions regarding CPF and BRS",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r1r80y/questions_regarding_cpf_and_brs/",
      "score": 12,
      "num_comments": 14,
      "created_at": "2026-02-11T15:46:31",
      "selftext": "My dad is 70 this year and is considering converting to CPF Life. However his RA account has ~$90k currently, lower than the BRS of $110k. From what I understand, this means his monthly payout will be lower. I read the CPF website but have still some questions, if anyone can help:\n\n- Is it advisable to convert to CPF Life for his case?\n- Is there any significant difference to his payout if he hits BRS before switching/after switching to BRS?\n- Should he move any existing amount from OA to RA to git BRS?\n\nI can top up his CPF with the difference for him to reach BRS if there is a significant difference to his payout. Just wondering if it's worth to sell some etfs for it",
      "comments": [
        {
          "text": "Best to check and confirm with CPF board, but from what I understand. \n\nLong lifespan - yes, CPF life good, longer payout\nShort lifespan - no, monthly payouts might be lesser if switching to CPF life \n\nTheres also the matched retirement savings thing of $2k per year (dollar for dollar additional $2k grant) top up into their RA. Good deal",
          "score": 9
        },
        {
          "text": "Is your dad on the old scheme? For old scheme, the RA account will be depleted at a certain age whereas the CPF Life is an annuity that covers for life. This means you sort of \"benefit\" the longer you live. There's no straight answer for this... You will have to evaluate the pros and cons. But generally the payout amount is proportional to the amount of premium you pay. You can use the payout calculator or ask CPF about the payouts.",
          "score": 5
        },
        {
          "text": "If 90k join CPF Life at age 70... the monthly maybe ard 300. He born 1956.. shd be under old RSS scheme.. his monthly should be the minimum payout of $350.\n\nThese figures are just rough estimates and need appt with CPF to get exact figures. \n\nThere is no model answer what to do unless you know the exact death age. Default govt recomendation is to join.. but may suffer lower monthly payouts nw. \n\nOA shd move to RA since cant withdraw anyway.",
          "score": 5
        },
        {
          "text": "I think he just needs $60K in RA to join CPF LIFE but don't take my word for it, go CPF service centre by making an appt for him and ask. \n\nThat was what I was told recently at cpf service centre. My dad doesn't have enough for CPF LIFE yet.",
          "score": 2
        },
        {
          "text": "Since your dad is still 70 years old, still can join CPF life. The cut off age to join CPF life is 1 month before 80 years old. However, his payouts will be lesser if he were to join CPF life, when compared to his current RSS payout. Can use the monthly payout estimator at CPF website. Not necessary to top up unless wanted to get his desired CPF life payout. Hope this helps!",
          "score": 2
        },
        {
          "text": "Topping up his CPF with your money may be a good idea. You get full tax relief topping up his CPF if his CPF is below FRS, up to $8k per year.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r2geyd",
      "subreddit": "singaporefi",
      "title": "FX rate - Youtrip vs Mari Credit Card",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r2geyd/fx_rate_youtrip_vs_mari_credit_card/",
      "score": 11,
      "num_comments": 33,
      "created_at": "2026-02-12T09:44:12",
      "selftext": "Hi.. would like to get some advice. I did a transaction about the same time SGD to RM on mari credit card and youtrip.\n\nSeems that youtrip had a worse off conversion rate than mari card (without any additional cashback, cos its an ewallet top up)\n\nWhile reading the threads here, always had the impression youtrip is best (excluding any additional casback by the other cards)\n\nBased on this youtrip may not always be the best option? Or is it because transactions still pending, i should wait for it to finalise then compare the rates again?\n\nThanks in advance",
      "comments": [
        {
          "text": "My 2 cents is if you need to worry about this, you got much bigger things to worry about",
          "score": 124
        },
        {
          "text": "lmao come on, are you spending thousands for that to even matter? If you spend $3,000 SGD the difference between those two rates would only be $6 and $10,000 SGD is a $21 difference.",
          "score": 71
        },
        {
          "text": "nothing special abt Youtrip but seems to be promoted by many influencers for being the \"best\". Trust or Mari credit card would be better since have cashback.",
          "score": 20
        },
        {
          "text": "Splitting hairs wouldn’t you say?",
          "score": 8
        },
        {
          "text": "market always fluctuates, my young padawan. if you really want to, you can compare rates   \n[https://www.mastercard.com/content/mastercardcom/global/en/personal/get-support/convert-currency.html](https://www.mastercard.com/content/mastercardcom/global/en/personal/get-support/convert-currency.html)  \nmastecard for youtrip",
          "score": 7
        },
        {
          "text": "To be fair mari's rate is better now because of the 0 FX fees promo, hence why I mostly use Mari now over Youtrip.\n\nBut honestly the difference is pretty much nil unless you are spending thousands.",
          "score": 4
        },
        {
          "text": "0.06% by the way. That’s 0.0006 difference",
          "score": 2
        },
        {
          "text": "It could go the other way as well when you shop at JB next week when you use the Mari card. FX and the banks’ rates always fluctuate",
          "score": 2
        },
        {
          "text": "OP wouldn’t buy something for $100 but would get wet for a $99 product",
          "score": 1
        },
        {
          "text": "no need to min max everything lol",
          "score": 1
        },
        {
          "text": "Haha not worried. But just curious for my knowledge.\n\nI thought youtrip is cheaper cos it uses its own rates.",
          "score": 0
        },
        {
          "text": "Saw this in another thread, hence was wondering if this is true\n\n[https://www.reddit.com/r/singaporefi/s/zE4qzRsTQM](https://www.reddit.com/r/singaporefi/s/zE4qzRsTQM)",
          "score": 0
        },
        {
          "text": "YouTrip more reliable, MariBank is just an Enshittification entity like Shopee. Please Don't support",
          "score": -1
        }
      ]
    },
    {
      "id": "t3_1r2fsd7",
      "subreddit": "singaporefi",
      "title": "Anyone here net worth mostly in USD",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r2fsd7/anyone_here_net_worth_mostly_in_usd/",
      "score": 7,
      "num_comments": 37,
      "created_at": "2026-02-12T09:15:49",
      "selftext": "How you feeling when USD so unstable and keep dropping again SGD? If have choice to earn around 8% interest savings to stay in USD or convert back to SGD.. which one will you choose?",
      "comments": [
        {
          "text": "It doesn't matter if it's held in stocks/ETFs. 1 share of Apple is worth what 1 share of Apple is worth. You just have to be aware that when Apple stock goes up 10% in USD, your real gain is a bit less than that if the USD depreciated in that time. \n\nSo rather than think of losing money in USD, think of it as gains in USD are over-stated. If you want to own those US stocks, you can't avoid the situation (ok, you can if you try to do hedging yourself, but you can easily get it wrong). \n\nIt's like that other thread from last night. You might think that owning an SGD-denominated S&amp;P500 like Amundi Prime USA helps, but actually it doesn't. You will see lower gains in SGD. \n\n[https://www.reddit.com/r/singaporefi/comments/1r1yymd/discrepancy\\_return\\_between\\_amundi\\_prime\\_usa\\_and/](https://www.reddit.com/r/singaporefi/comments/1r1yymd/discrepancy_return_between_amundi_prime_usa_and/)",
          "score": 33
        },
        {
          "text": "Suck it up.  Fx is the price you pay to own any non SGD asset.\n\nYou either pay in hedging cost or fx loss when it goes against you.",
          "score": 7
        },
        {
          "text": "Working in the U.S. so mostly in USD. LOL. but thankfully stocks went up so....",
          "score": 5
        },
        {
          "text": "its nothing compared to the gains and loss in trading lol",
          "score": 4
        },
        {
          "text": "yes. &gt; 60% of my investment portfolio is in USD. But the gains outweigh the depreciation.  Even if you compared to what would have been if you put in STI ETF.",
          "score": 4
        },
        {
          "text": "A quarter of my networth is in usd, or half of my liquid portfolio. Like others have mentioned, the gains far outperform the fx losses. Plus I'm holding it long term anyway, so I'm not worried.",
          "score": 4
        },
        {
          "text": "Are people really that concerned USD will be trashed or remain low forever? USD has fluctuate much more than this over time and I don't see as much panic as now.\n\nOf course the US is a different entity from what they were. But I don't know if it still warrants such worry at least for now.",
          "score": 3
        },
        {
          "text": "Unless you are holding short term bills, interest rate risk and/or equity risk are much bigger drivers of return.",
          "score": 2
        },
        {
          "text": "If you want to hedge, note that it will cost you about 1-2% a year, based on current FX forward rates.",
          "score": 2
        },
        {
          "text": "I maintain a 60% US stocks to 40% SG stocks ratio in my portfolio. If you look at the top 10 stocks in the STI ETF, like DBS, the yield is quite decent. \n\nYou’re only regretting the opportunity cost of putting the money in other markets’ funds because you assume US companies’ growth will always be this good in the future but that might not be true too. \n\nWeigh you options and balance accordingly to your risk appetite",
          "score": 1
        },
        {
          "text": "I've seen my portfolio halved in days... several times.  \nThis is nothing.",
          "score": 1
        },
        {
          "text": "DXY will be king again in 2027-2030 time frame\n\nWe are talking about , DXY to 120 🔥\n\nFor now, DXY must tank so that all of our bags can pump 😂",
          "score": 1
        },
        {
          "text": "I currently live and work in the US so I’m primarily in USD.",
          "score": 1
        },
        {
          "text": "i have 40+% of my portfolio in USD and I'm not worried, neither do I think the FX losses will be an issue. With a weaker USD, the US market look more attractive and I trust that the gains will more than compensate for FX losses. Plus this is a very personal choice, if one feels that oversea exposure is too risky, one can always stick to the local market.\n\nI never understood the point of hedging. Either you are exposed or you are not. And exposure is more easily controlled than hedging an overexposed position. Hedging gives a false sense of security and stability which ok, I concede has some psychological value. but it is not free, and net-net, hedging remains a cost that eats into returns.",
          "score": 1
        },
        {
          "text": "Half invested in sgd assets. Half invested in usd denominated assets",
          "score": 1
        },
        {
          "text": "Most net worth in USD. I think the instability is mostly politically driven. And the tide changes every 4 years so just got to hold and see. US still have the largest companies and economies so don’t think I’ll move away from US investments.",
          "score": 1
        },
        {
          "text": "Nowhere near, flat is in SG. Without property, about 30% in USD.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r2cbr3",
      "subreddit": "singaporefi",
      "title": "Diy insurance or find another agent?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r2cbr3/diy_insurance_or_find_another_agent/",
      "score": 2,
      "num_comments": 6,
      "created_at": "2026-02-12T06:49:17",
      "selftext": "Hi, i'm in the process of cutting ties with a FA i've been with for many years due to incompetence and trust issues. I do have several insurance policies with him, whole life, isp, ci, pa etc. My questions are:\n\n- if i make sure i am knowledgeable about my policies (as far as a non-fin trained/savvy layperson can be), is there still any need or pros to getting another FA to manage my insurance for me? \n\n- Would there be any FA that would even agree to help me without asking me to change my policies unnecessarily?\n\n- Does anyone have experience handling your own insurance and claims fully by yourself? How is it like?\n\nThanks in advance.",
      "comments": [
        {
          "text": "I have quite a competent FA that leaves me alone most of the times other than the occasional “happy cny” messages. I haven’t *touch wood* needed to claim my insurance other than hospitalisation, and I usually do it myself via the portal. But my FA helps to answer my questions like “this one can claim?” / “how come like this” (Simplifying my extensive questions) that I have before or after I claim. Sometimes I put my claims through chatgpt to try figure it out before asking her so I don’t annoy her and get the same answers. She’s great when it’s an emergency and I don’t have time to figure it out with chat. So I think you can do it on your own if you want if you’re reasonably knowledgeable. Straight forward claims are done quite easily. \n\nAs for whether there are FAs that will maintain your policies without selling you things, I think so? But they’ll probably recommend you change this or that if they think it isn’t great since every FA also has their own style. I’ve got two FAs since I started buying insurance, not sure if it’s my luck but both were chill and usually I’m the one approaching them to ask to buy stuff rather than the other way round.",
          "score": 2
        },
        {
          "text": "Better to get someone you trust\n\nAnd agree on not changing unnecessarily \n\nIn theory it’s possible to claim/appeal/etc yourself - but I am assure you if you’re on a hospital bed in pain, it’s not something you want to bother with",
          "score": 1
        },
        {
          "text": "I think the hospital staff are more knowledgeable and competent on what your policy covers so I have never seen a need to have a FA",
          "score": 1
        },
        {
          "text": "Friendly neighbourhood advisor here, I am a salaried advisor. \n\nI’ll not answer the last one because then this will be like an audition. \n\nI think aside from knowing the products, and easier and better foundation would be to understand your own coverage needs properly. \n\nThat’ll help you decide if the existing or new product is going to make sense to you or not. \n\nAssuming both FA and yourself build the trust sufficiently, no harm to have one around to help you out honestly, usually costs you nothing. \n\nWhen getting a new FA around, usually needs a bit of a reset, end of the day it is a new relationship, so there’ll definitely be some intend to sell but look at it with an open mind though. \n\nConsider that you’ve been with an incompetent agent for a few years, your policies to a huge extend will reflect this incompetency + your situation changes throughout the years that is not necessarily thought of before nor your plans. I am of course assuming initially not much research on your part that improved over the years. \n\n\nGood luck to your inbox though :)",
          "score": 1
        },
        {
          "text": "Good to have a FA that is knowledgeable to serve you, some claims processes change over time and FA will be in a good position to advise accordingly",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r1ytrt",
      "subreddit": "singaporefi",
      "title": "Thoughts on Singlife?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r1ytrt/thoughts_on_singlife/",
      "score": 2,
      "num_comments": 4,
      "created_at": "2026-02-11T22:28:26",
      "selftext": "What does everyone think of Singlife savings account? \n\n  \nI've been using it for 3 years as a separate savings account because their interest rates are better than my UOB account, and it helps me not overspend. I have about 15K in it. \n\n  \nWanted to hear if anyone else has a better alternative for higher savings account.",
      "comments": [
        {
          "text": "[removed]",
          "score": -1
        }
      ]
    },
    {
      "id": "t3_1r27zz9",
      "subreddit": "singaporefi",
      "title": "Nonprofit / Philanthropy Career Growth",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r27zz9/nonprofit_philanthropy_career_growth/",
      "score": 0,
      "num_comments": 1,
      "created_at": "2026-02-12T04:05:01",
      "selftext": "Hi all,\n\nI’ve spent the past few years in the philanthropy / social impact space — building programs from the ground up, and managing partnerships, but I am looking to increase my total annual compensation. \n\nI’m deeply committed to staying in the impact sector long term. That said, I’m starting to think more intentionally about long-term compensation and career resilience — especially given how volatile parts of the nonprofit world can be.\n\nFor those further along in philanthropy / foundations / impact space:\n\n* Is it better to double down on strategic program leadership (grantmaking, partnerships, portfolio management)?\n* Or is there more long-term upside in building more “technical” capabilities (impact measurement, data/AI for social good, evaluation, capital structuring, innovative finance, etc.)?\n\n",
      "comments": [
        {
          "text": "Hi I'm in the same sector. Can you share more info like your age, years of work experience, current compensation, so I know what is your \"more\"?\n\nI'm early 30s, 10 years work experience all in this sector, doing program management and annual compensation just above 100k\n\nIf there's a particular skillset or area that you are interested in doing, you can still continue but look to expand your scale - moving to regional or global work\n\nFor me I am more of a generalist (program management) and want to develop my impact measurement and impact comms skills so I can move to CSR. And I think your first bucket of skills is more versatile and easier to move around compared to the second technical bucket but just based on my personal experience and preference. (I would think impact measurement is more general and part of grant management, portfolio management. M&amp;E would be technical)",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1r1nyyl",
      "subreddit": "singaporefi",
      "title": "What are some sales role within the financial industry?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r1nyyl/what_are_some_sales_role_within_the_financial/",
      "score": 1,
      "num_comments": 40,
      "created_at": "2026-02-11T12:46:09",
      "selftext": "Background: 33M in risk management role looking to start from the bottom doing sales, I may not have the necessary experience but I am confident in my glib tongue. It’s been tiring working in a silo at my role, kinda want to explore jobs where I can bounce off energy with people.\n\n  \n\nWhat are the sales related role in a financial industry? Assuming I have a good financial knowledge both within the industry and the macro economy.\n\n  \n\nTrying to stay away from property and insurance roles",
      "comments": [
        {
          "text": "like bro ... is this a serious question when the hall is full of FAs and RMs?",
          "score": 31
        },
        {
          "text": "Besides the client sales role mentioned, there are a lot of financial service providers, like Bloomberg, MSCI, S&amp;P, etc, that have B2B sales office based in Singapore. I don't know if they would consider experienced lateral hires for entry level roles, but you might have an inroad with your risk experience for their risk products.",
          "score": 24
        },
        {
          "text": "Having a ‘glib’ tongue is not enough to excel in sales, my friend. There’s more to it than simply ‘seducing’ prospects into buying your product. You need strong territory planning skills, time management, dealing with client escalations, knowing how to multi-thread, identifying right persona, adopting MEDPPIC and to some extent, be ruthless enough to ‘sell the dream’.\n\nMore importantly, be mentally prepared that the PIP conversation will never leave once you enter corporate sales. The money may be lucrative but it is absolutely not worth your mental health. There’s a reason why sales have a high turnover rate. \n\nRemember that your best performance is only as great as the last quarter.",
          "score": 24
        },
        {
          "text": "Retail RM : do bank insurance, doing structured deposits, and other ILP.\nPriority RM: above plus equity trades\nPB RM: full investment suites, UL, Trust\nCorporate RM: loans, loans, loans \n\nPaywise PB RM is top tier, follow with priority, retail then corporate. Corporate RM has job stability",
          "score": 5
        },
        {
          "text": "If US investment banks\nElectronic trading sales\nMacro-rates sales (which covers vanilla FX)\nDerivatives sales\nQDS sales\nStructured product sales\n\nAlso at the institution level doesn’t matter if you got glib tongue. Since you’re salesperson, you’re taking the price quoted by your trading desks. If your trader doesn’t have the appetite or directional views you wouldn’t get a good price.\n\nSo you either earn soft credits or hard credits base on the price you shown to your client.\n\nI have never seem a sales person that good to overcome a 25bps or more pricing gap at the financial institutional level. Because there is the best execution policies involvement\n\nIf it’s a few bps point off the best, you may still get the look. On the basis of building relationships. But that’s just one-off. So just purely glib tongue ain’t gonna cut it, sad to say.",
          "score": 4
        },
        {
          "text": "You'll be in for a shock. Sales will humble you my friend. Good luck!",
          "score": 4
        },
        {
          "text": "are you in market risk? actually is there a reason why you wanna leave risk management?",
          "score": 3
        },
        {
          "text": "Lol good luck avoiding insurance products or some insurance-hybrid products when it comes to financial sales…\n\nData on principal sizes shows that big money like certainty. Which also explains why the fixed income markets are multiple times larger than equity markets.\n\nInsurers all have affluent-segment departments and products that dedicate themselves to the HNW market precisely because they do well with big money.\n\nRegardless if you are FA, banker, agent or broker targeting retail, mass-affluent or HNW, insurance will continue to play a significant role in your products.",
          "score": 3
        },
        {
          "text": "Institutional Sales or Distribution Sales in AMs",
          "score": 2
        },
        {
          "text": "How about selling physical commodities? Alot of it is still relationship building",
          "score": 1
        }
      ]
    }
  ]
}