{
  "schema_version": "raw_scrape_v1",
  "report_id": "2026-02-27",
  "scraped_at": "2026-02-27T11:38:48.388777",
  "subreddits": [
    "singapore",
    "askSingapore",
    "SingaporeRaw",
    "singaporefi"
  ],
  "total_posts": 36,
  "total_comments": 478,
  "posts": [
    {
      "id": "t3_1rf09ev",
      "subreddit": "singapore",
      "title": "Even the God of Fortune needs some luck",
      "url": "https://old.reddit.com/r/singapore/comments/1rf09ev/even_the_god_of_fortune_needs_some_luck/",
      "score": 1107,
      "num_comments": 40,
      "created_at": "2026-02-26T12:15:20",
      "selftext": "",
      "comments": [
        {
          "text": "You know you're cooked when the God of Fortune himself is gambling",
          "score": 169
        },
        {
          "text": "12mil, who dowwan",
          "score": 91
        },
        {
          "text": "Insider trading..",
          "score": 53
        },
        {
          "text": "ha! does not work...    \n\n\n\nbecause it is the same rule as genie: you can't make wishes on yourself.    \n\n\n\n\nlikewise god of fortune can only bestow wealth on others but not himself.",
          "score": 33
        },
        {
          "text": "HAHA cai shen ye doing insider trading ah? 😭😂",
          "score": 25
        },
        {
          "text": "Wdym GoF is simply withdrawing from his personal atm",
          "score": 17
        },
        {
          "text": "even the God of Fortune is no match for the Minister of Finance 😂",
          "score": 15
        },
        {
          "text": "Inflation is hitting everyone hard this year. Even the heavens need a side hustle.",
          "score": 13
        },
        {
          "text": "Isn't that cheating?",
          "score": 12
        },
        {
          "text": "Speed run any$",
          "score": 8
        },
        {
          "text": "![gif](giphy|p6liJnMLlpaFXMe7mp)",
          "score": 6
        },
        {
          "text": "Old pic, every cny recycle for karma farm",
          "score": 6
        },
        {
          "text": "Haha that’s a good one!!",
          "score": 5
        },
        {
          "text": "If he can't win, what chance do we have?",
          "score": 5
        },
        {
          "text": "If he also need to buy, what does it leave us with?",
          "score": 5
        },
        {
          "text": "This is how Cai shen ye give money, by earning money",
          "score": 3
        },
        {
          "text": "knn spoil market liddat how win 12 million.",
          "score": 3
        },
        {
          "text": "Running out of luck.",
          "score": 3
        },
        {
          "text": "Time is bad",
          "score": 3
        },
        {
          "text": "![gif](giphy|1GVEw0MYlCAXW4N8rE)",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1rfqh4z",
      "subreddit": "singapore",
      "title": "Singaporeans don't want a Nordic model. We want to keep winning.",
      "url": "https://old.reddit.com/r/singapore/comments/1rfqh4z/singaporeans_dont_want_a_nordic_model_we_want_to/",
      "score": 949,
      "num_comments": 158,
      "created_at": "2026-02-27T07:41:55",
      "selftext": "In December, a former student of an elite Singapore primary school posted a video recalling how her classmates were genuinely shocked to discover - from a textbook - that most Singaporeans live in HDB flats. They weren't being cruel. They simply didn't know. She could name only one classmate who lived in public housing.\n\nTwo months later, the Ministry of Finance published its first-ever measure of wealth inequality. The wealth Gini coefficient stands at 0.55 - significantly higher than the income Gini of 0.38. The top one per cent of households holds fourteen per cent of total wealth. The top five per cent holds a third. And the ministry's own paper concedes these figures are \"likely to be underestimated,\" because tracking the assets of the wealthy in a global financial hub built on confidentiality is, to put it gently, structurally difficult.\n\nThe elite school children and the wealth data describe the same country. A place where parallel tracks run so cleanly that the people designing the system and the people living under it can occupy the same island without ever seeing each other's Singapore.\n\n\n\nThe conventional explanation for Singapore's welfare architecture is pragmatism. A small, resource-scarce nation chose self-reliance over dependency. CPF forces citizens to save for their own retirement. HDB subsidies help them own homes. Workfare supplements low wages. MediShield Life covers catastrophic healthcare costs. The system works, or at least, it has worked, and the philosophy behind it is coherent: help people help themselves.\n\nBut here is what the philosophy actually produces. CPF is not a pension. It is a forced-savings vehicle that transfers retirement risk entirely to the individual, which only works if every individual earns enough to save enough. Those who don't aren't covered by the philosophy. They are contradicted by it. HDB is not social housing. It is a property market with subsidised entry, designed to appreciate, which means housing wealth accrues to those who bought early and cheaply, and becomes less accessible to each successive generation. Workfare is not welfare. It is a wage supplement conditional on employment, which vanishes the moment you lose your job.\n\nSingapore already redistributes. It subsidises, supplements, and co-pays. It simply refuses to call any of it welfare, because the ideology of self-reliance demands that every transfer look like an earned benefit rather than a social entitlement. At what point does \"self-reliance\" become a branding exercise for a welfare state that won't name itself?\n\nThe resistance to calling it what it is runs deeper than fiscal conservatism. It is ideological. And the ideology is most visible not in what the state does - it already redistributes - but in the language it uses to disguise the fact. Every mechanism is named so that it sounds like your effort rather than their provision. The grammar of self-reliance must never be broken.\n\nConsider the architecture of political compensation. Ministerial salaries are benchmarked to the median income of the top one thousand Singapore citizen earners - the very group whose wealth the MOF paper says is probably underreported - with a forty per cent discount framed as sacrifice. The entry-level minister's norm salary is 1.1 million dollars. The review committee convened in January to reassess this framework will update the benchmark. Nobody has proposed updating the data.\n\nOr consider Ridout Road, where two cabinet ministers rented state-owned colonial bungalows - one at twenty-six thousand five hundred dollars a month, the other spending over two hundred thousand on renovations - and were cleared of wrongdoing by an investigation led by a cabinet colleague. The Prime Minister said he \"cannot outsource\" the determination of what is proper. He was right, technically. The system investigated itself and found nothing wrong. That is precisely the problem.\n\nThis is not corruption in the classical sense. It is something more durable: a governing class so insulated from median life that the distance has become invisible, to them.\n\n\n\nDenmark made a different choice. Not a more generous choice, a structurally different one.\n\nThe Danish model of flexicurity combines some of the easiest hiring-and-firing rules in Europe with generous unemployment benefits and aggressive state-funded retraining. You can be let go on short notice. But when you are, the state catches you with up to ninety per cent of your previous salary for up to two years, on the condition that you actively retrain for new work. The result is a labour market that is simultaneously more fluid than Singapore's and more secure.\n\nThis is counterintuitive, and that is the point. Denmark's system does not punish risk. It absorbs it collectively, which means workers accept industrial change instead of fearing it, and employers restructure without the social cost that Singapore outsources to individuals. Denmark spends roughly twenty-eight per cent of GDP on social protection. Singapore spends approximately nine. That nineteen-point gap is not a spending difference. It is a trust difference. The Nordic model trusts citizens and taxes them heavily. Singapore's model distrusts citizens and taxes them lightly, then charges them heavily for services. Whether the state exists to protect citizens from market failure, or to ensure they face it alone, is not a fiscal question. It is a political one.\n\n\n\nBut distrust, sustained long enough, becomes self-fulfilling. Design a system where every citizen's retirement depends on individual savings, where housing is an appreciating asset rather than a social good, where support vanishes the moment employment does, and within a generation you will have produced citizens who behave exactly as the system assumed they would. The ideology didn't just shape policy. It shaped the people. And now the people sustain the ideology voluntarily, which is the most effective form of political control there is: one that no longer requires enforcement.\n\nSo here is the part that neither the government nor the opposition will say plainly.\n\nThe obstacle to a Nordic-style social contract in Singapore is not the People's Action Party. It is the Singaporeans the system produced.\n\nThree days after the MOF paper documented rising wealth inequality and declining social mobility, Budget 2026 arrived. The fiscal surplus for the previous year was fifteen point one billion dollars, more than double the initial estimate. The government's response: two hundred to four hundred dollars in cash handouts, CDC vouchers, and U-Save rebates. Even a PAP backbencher, Shawn Loh, stood up in Parliament to propose returning surpluses above two per cent of GDP directly to citizens and called for progressive stamp duties on inherited property. Workers' Party MP Louis Chua went further, calling wealth inequality Singapore's \"deepest division\" and urging the reinstatement of estate duty, abolished in 2008. The government's reply, via Acting Transport Minister Jeffrey Siow: \"We have no plans at this point to seek additional legislative or administrative powers to require more granular asset disclosure solely for inequality measurement.\"\n\nThey will not even sharpen the tools to measure the problem, let alone fix it. Even the reforms now being floated - higher property taxes, progressive stamp duties - trim the top without lifting the floor. They generate revenue, not entitlements. And in a country that actively recruits ultra-high-net-worth residents as policy, the top replenishes itself faster than any tax can trim it. Singapore does not have a wealth inequality problem despite its economic strategy. It has one because of it.\n\nAnd yet. Before we reach for outrage at the government, a more uncomfortable question: would Singaporeans actually vote for what a Nordic model requires?\n\nNot higher taxes. That is the easy, tired version of the question. The real one cuts closer.\n\nThe Nordic social contract requires treating housing as shelter, not as an investment vehicle. Over half of average household wealth across every income quintile in Singapore is held in home equity. When you check your HDB resale value - and you do - you are not merely a homeowner. You are a stakeholder in a system that requires property prices to keep rising, which is structurally incompatible with treating housing as a universal social good. A Danish-style housing model would stabilise your home's value. In Singapore, that is not policy. That is a threat.\n\nIt requires treating education as levelling, not sorting. Finland has no elite schools. Every school is designed to produce roughly equivalent outcomes. Would Singaporean parents accept that? The influencer Nicole Chen, responding to the viral video, said she would still enrol her children in her elite alma mater - for the opportunities, the co-curriculars, the overseas trips. She is not wrong to want these things for her children. She is describing exactly why the system cannot change.\n\nIt requires a culture that discourages status comparison. The Danes have a name for it - Janteloven - the social norm that no one should consider themselves above others. Singapore's entire social engine runs on the opposite principle: visible markers of success, relentless ranking, the quiet tracking of who upgraded from BTO to resale to condo. The Nordic model doesn't just redistribute money. It requires a society that stops keeping score the way we do.\n\n\n\nThe MOF paper diagnosed the disease. Budget 2026 prescribed paracetamol. But the deeper question is not what the government is willing to do. It is what we are willing to give up - and whether we can still tell the difference between what we genuinely value and what the system trained us to want.\n\nThe question is not whether Singapore will adopt the Nordic model. It won't. The question is whether Singaporeans would vote for a society where nobody keeps score, and whether we would even recognise ourselves in it.",
      "comments": [
        {
          "text": "Solid piece and i agree with the conclusion.\n\nI always feel like one of the greatest advantages for modern singaporeans is the ability to travel/relocate, and the answer for those who don’t get with the programme here is to explore beyond our borders",
          "score": 226
        },
        {
          "text": "Housing really needs to be seen as a social good valued solely for the utility of having shelter over your head. It should NOT be seen as a way for capital gains and building a nest egg. All that ever increasing price does is to make it harder for the next generation to setup their own family unit, then the govt laments about low birth rates and resorting to aggressive immigration to pad the population numbers.\n\nI know we’re all used to the policy of ‘get married first, then get your house’ cause of how BTO policies are structured. But honestly, the ease of dating significantly increases once you have your own place and people are more likely to think about having children if the cost of having an additional room wasn’t so darn prohibitive.",
          "score": 142
        },
        {
          "text": "To answer your last paragraph: the Asian (particularly Chinese) mentality of always wanting to upgrade and one-up your peer will make any attempt to shift away from a \"keeping score\" system impossible lmao",
          "score": 126
        },
        {
          "text": "40+ uncle. Did really badly for my GP in JC that I had to attend \"GP clinics\" weekly. Now everyone handles it like sipping bubble tea. On Reddit. Impressive.",
          "score": 57
        },
        {
          "text": "What you are essentially saying is Singaporeans should ‘chill out’, maybe not aim to min-max in life in the hopes that your fellow Singaporeans will do the same lol.\n\nAny policy or initiative that wants to change human behaviour has to make said option or path the most logical. Not talk about some greater good and passing that responsibility back to the crowd which our govt does all the time.",
          "score": 56
        },
        {
          "text": "I think you hit the mark in the middle, when you mention that the system shapes the people. Then you pivot to saying that for the system to change, the people must want to change the system. \n\nBoth are true, but it disregards the embedded mindset and societal culture that we Singaporeans have built over time to accept the system. Which is unlikely to change sans any external impetus. \n\nIt’s a bit like saying the Russian/North Korean system and culture created a subservient population, then saying the system can only change if the population want to change. \n\nIsn’t that placing too much blame/burden on the people, who not just accept the system (and are contented / satisfied with it), but cannot envision a feasible reasonable alternative from decades of living in the system.",
          "score": 48
        },
        {
          "text": "&gt; The government's reply, via Acting Transport Minister Jeffrey Siow\n\nOf course it had to be this idiot. PAP hasn't seen a bootlicker this enthusiastic for a long time.",
          "score": 25
        },
        {
          "text": "Great write up! Used to date Dane once and she told me her father was a millionaire but got like 60 percent taxes but when her dad got ill the state paid one hundred percent of it. Generally, most people in Singapore won't agree to this (I assume). My point is the predominant culture in Singapore is different from the Danish/Nordic ones where welfare plays a big part while the ancestry of most Singaporeans are culturally distinct from them. \n\nSimply said, different cultures produces different systems.",
          "score": 22
        },
        {
          "text": "Good stuff!\n\n\nThe housing model is so unsustainable here. You'd think that in a country as land-scarce as we are, owning more than one property should be treated as treason.\n\n\nOne tradeoff of the Nordic system that I think you missed out is that not working is basically a no-go. Early retirement is taboo. There is a cultural expectation that you work as long as you are able, because then your taxes fund the social system that you benefit from. Even being a stay-at-home-mom is culturally looked down upon. The maternity benefits are generous, but once you use them up, it's back to work for you. As you rightly point out, all those work together as a system. Their system makes it easy to work; the expectation is that you keep working. If a bunch of rich people move to Denmark with existing wealth and leech off their welfare systems, it would probably break the country.\n\n\nWould Singaporean go for such a system? Great question! I can't even imagine how we could even transition into such a system. So many policies support each other in making the system work. It's a kind of local-optimisation problem. I also can't imagine the average Singaporean, having worked themselves to death in the current system to accumulate wealth and safeguard our own retirement, to then turn around and move into a system where we can't use that wealth to retire early.",
          "score": 22
        },
        {
          "text": "I think as other commentators have said, this is a beautifully argued piece that runs into the wall of nature and culture. Which Asian society is egalitarian like the Danes? To become like Denmark, you would have to embark on a societal brainwashing that would be ten times more intensive than anything we have ever tried and I don't think even the most liberal of Singaporeans can stomach this. I say let's start small. Given our constraints and context, we have done quite well. And for the Singaporeans who don't do as well, the government does help. Maybe the first step is to see how we can promote greater dignity and respect for all, regardless of station in life. That would be feasible and would improve our society tremendously - the idea that the bus driver is treated no less than the CEO. This welfare vision of OP is laudable and will come perhaps a generation later.",
          "score": 15
        },
        {
          "text": "Jackpot.",
          "score": 10
        }
      ]
    },
    {
      "id": "t3_1rf5m5c",
      "subreddit": "singapore",
      "title": "Singapore’s total fertility rate drops to historic low of 0.87 in 2025",
      "url": "https://old.reddit.com/r/singapore/comments/1rf5m5c/singapores_total_fertility_rate_drops_to_historic/",
      "score": 899,
      "num_comments": 579,
      "created_at": "2026-02-26T17:21:15",
      "selftext": "",
      "comments": [
        {
          "text": "Wild reading this the day we're doing IVF lol\n\nPray for us..!",
          "score": 911
        },
        {
          "text": "that’s with the Malays hard carrying that number too",
          "score": 776
        },
        {
          "text": "Government: Please have 3 kids.   \n  \nAlso Government: 'Your 4-room BTO in Tengah will be ready in 2031, costs $650k, and you have to outbid 12 other couples just to get a queue number",
          "score": 487
        },
        {
          "text": "Late stage hyper capitalist societies are toxic to humanity, physically and mentally. \n\nWhy bring another life into this mess and grind.",
          "score": 323
        },
        {
          "text": "Pro Business and boosting fertility rate being in the same sentence is an oxymoron.",
          "score": 281
        },
        {
          "text": "Looks like SG60 babies campaign has not been effective.. not surprising as every other day we see a post on high cost of living and work burnout.. government should recognize this and address the root cause.. however it seems they are more interested in importing foreigners it is obvious from my condo residency mix these days",
          "score": 270
        },
        {
          "text": "Hoarding reserves for what now!? No Singaporeans or future generation left for you to shelter. If reserves are meant for national crisis, this is your population crisis. Time to spend your reserves.",
          "score": 173
        },
        {
          "text": "As someone who wants kids, a house and to care for elderly parents in the near future… It does feel like a trilemma",
          "score": 145
        },
        {
          "text": "I like the idea by Shawn Loh - free infantcare and childcare. We can afford this as a nation.",
          "score": 145
        },
        {
          "text": "in the article, the only immediately solution is to increase PR approval to 40K per year instead of current 35K, which i disagree on as this makes a mockery of Singaporean males having to serve NSF.\n\nAlso Indranee has proven herself to be useless at improving TFR for years already so why the hell is she still in charge of it?",
          "score": 129
        },
        {
          "text": "Lip service is calling the situation dire and grave and not taking bold enough action to remedy the situation even when the trend has been going on for decades.\n\nThe fact that our ministers are sharing their concerns about our TFR rather than changing course from toeing the same neoliberal lines as governments around the world in enabling corporations and billionaires to price gouge us and enshittify everything, sucking the joy out of living in the present and making the future bleak; speaks volumes.\n\nEvery policy has been squeezing the life out of the middle class and people don't want to bring children into this modern dystopia and they turn surprised Pikachu?",
          "score": 84
        },
        {
          "text": "Government doesn't care.\n\nLoads of people are willing to migrate here.\n\nYou aren't that special.\n\nYou are totally replaceable.",
          "score": 68
        },
        {
          "text": "What's the play here guys?\n\n\"The government will form a new workgroup with the relevant agencies to look into these issues holistically and engage widely with members of the public, businesses and the people sector, she added.\"\n\nLiterally the definition of insanity: doing the same thing over and over again and expecting different results.",
          "score": 63
        }
      ]
    },
    {
      "id": "t3_1rf1yqe",
      "subreddit": "singapore",
      "title": "About 90% drop in fresh grads applying for Singapore industry traineeships",
      "url": "https://old.reddit.com/r/singapore/comments/1rf1yqe/about_90_drop_in_fresh_grads_applying_for/",
      "score": 434,
      "num_comments": 104,
      "created_at": "2026-02-26T13:43:03",
      "selftext": "",
      "comments": [
        {
          "text": "The pay offered is too low with no certainty of conversion. Many companies just offer traineeship because it is so cheap. $2.4k - 70% covered = maybe $700 cost to them, cheaper than an intern, which is like $1k at least. After 1 year when the subsidies are over, how many will actually want to convert them and will the trainee get converted at a fair market rate, or will it just be $2.5k?\n\nThe only beneficiary of the whole scheme is cheapskate companies who are looking for cheap labour.",
          "score": 555
        },
        {
          "text": "Who will want to apply for this stupidly thought out programme. Waste of time and a big middle finger by the govt to our young citizens",
          "score": 368
        },
        {
          "text": "\"A significant number of applicants had declined traineeship offers as they had found full-time employment or decided to pursue other opportunities, said Manpower Minister Tan See Leng\"\n\n  \nThe hell is a \"significant\" number? What about other reasons given for the low take up?",
          "score": 238
        },
        {
          "text": "Do you guys know that during Covid, the SGUnited traineeships were paying 2.5k?\n\nSo after 2-3 years (2022-2024) of high inflation, the current traineeship did not increase in allowance to account for inflation, but had decreased instead to 1.8k to 2.4k.\n\nTell me again why the traineeships are unpopular? Surely it's because the job market is improving?",
          "score": 222
        },
        {
          "text": "“As part of the programme, the trainees receive a monthly allowance ranging from $1,800 to $2,400. The Government co-funds 70 per cent of the traineeship allowance while host organisations will fund the remaining 30 per cent.”\n\nCan’t imagine why fresh grads would not sign up to this when the median starting monthly salary is…S$4,500. LOL!",
          "score": 165
        },
        {
          "text": "No shit, grads can smell from far away the govt sectors just want cheap labour.",
          "score": 62
        },
        {
          "text": "I applied for one of these traineeships while job hunting, and was told I was shortlisted. As part of it, I was given a take home assignment to do and took a lot of effort and time with a quick turnaround time\n\nI wasn't given a feedback or response whether I was rejected or accepted. Soon after I got a full time offer elsewhere (and getting called up for interviews for full time roles)\n\nWas at one of the big local company that everyone knows (and uses) whose stock has been doing v well for the past few years. Up to you to guess...",
          "score": 55
        },
        {
          "text": "Glad to see that they know their worth and refuse to get taken advantage of",
          "score": 51
        },
        {
          "text": "Gov: \n\nGreat! From this statistic we can concur that fresh grads are able to find stable jobs! \n\nNo need for additional aid.\n\nLooking forward to your CPF contributions 😬\n\nThank You NUS/NTU/SMU for producing desirable employees!",
          "score": 50
        },
        {
          "text": "Who wants shit pay?",
          "score": 47
        },
        {
          "text": "Wage suppression at its finest.\n\nThere's no better exposure to this practice, right after you graduate from university.\n\nA practice like this can only be accomplished by two parties.",
          "score": 36
        },
        {
          "text": "&gt;Measly 800 positions for fresh grads. 800, a drop in the bucket for an entire cohort of students.\n\n&gt;Insultingly low wages that you can't survive upon. \n\n&gt;No guarantee that you'd get a full time position after going through this \"\"\"traineeship\"\"\".\n\n&gt;It's no secret that SMEs go through interns as a way to milk labour while keeping cost down. This is literally the same thing but endorsed by the goverment.\n\nIs it any wonder why nobody wants to apply for it?\n\nBut I'm sure some scholar that never had to worry about the job market is patting themselves on the back on a job well done and how they tried the best but the young people are just lazy or whatever narrative they want to paint.",
          "score": 32
        },
        {
          "text": "One of the stupidest schemes ever invented with zero common sense about market forces. This literally penalises good employers who want to pay more, rewards employers who want to lowball and be stingy. A smarter way would have been to just pay employers than genuinely hire Singaporeans $1000/month for 6 months or something, instead of this stupid scheme that literally spoils the market and costs more, so that locals with CPF are cheaper to employers than foreigners or PRs. ",
          "score": 30
        }
      ]
    },
    {
      "id": "t3_1rfdvia",
      "subreddit": "singapore",
      "title": "Body found in Kallang River near where boy went missing",
      "url": "https://old.reddit.com/r/singapore/comments/1rfdvia/body_found_in_kallang_river_near_where_boy_went/",
      "score": 411,
      "num_comments": 43,
      "created_at": "2026-02-26T23:56:06",
      "selftext": "",
      "comments": [
        {
          "text": "An expected outcome but that doesn't make it any less sad. Condolences to the family. And thank you to everyone who helped tirelessly in the search efforts. \n\nRest well, young one. As the nation prays with hope yesterday night, we now mourn for you tonight.",
          "score": 268
        },
        {
          "text": "Aye. What a horrible outcome this is turning out to be.",
          "score": 215
        },
        {
          "text": "https://www.channelnewsasia.com/singapore/boy-drowning-kallang-river-scdf-search-family-5954456\n\nUpdate from CNA, it is the boy’s body. Unfortunate. RIP.\n\n\n&gt; The body of the missing 13-year-old male teenager who is suspected to have drowned in the Kallang River has been retrieved from the waters, said the Singapore Police Force (SPF) on Thursday night.\n\n&gt; \"He was pronounced dead at scene by an SCDF paramedic,\" SPF said.",
          "score": 176
        },
        {
          "text": "Absolutely heartbreaking. No mother should have to go through that",
          "score": 165
        },
        {
          "text": "They found his body. Poor kid. May he rest in peace",
          "score": 139
        },
        {
          "text": "RIP...during Ramadan somemore :(",
          "score": 112
        },
        {
          "text": "Another young life gone. RIP.",
          "score": 42
        },
        {
          "text": "RIP. Too young to go. :(",
          "score": 30
        },
        {
          "text": "RIP",
          "score": 16
        },
        {
          "text": "RIP little one 🕊️",
          "score": 14
        },
        {
          "text": "RIP",
          "score": 8
        },
        {
          "text": "RIP",
          "score": 8
        },
        {
          "text": "☹️",
          "score": 7
        },
        {
          "text": "RIP",
          "score": 7
        },
        {
          "text": "RIP",
          "score": 7
        },
        {
          "text": "RIP",
          "score": 6
        },
        {
          "text": "Rest in peace, young one.",
          "score": 5
        },
        {
          "text": "it seems that his body is just very nearby where he fell into?",
          "score": 5
        },
        {
          "text": "RIP",
          "score": 4
        },
        {
          "text": "RIP",
          "score": 4
        },
        {
          "text": "Heartbreaking to see this",
          "score": 4
        }
      ]
    },
    {
      "id": "t3_1rf6png",
      "subreddit": "singapore",
      "title": "S’pore needs to reset views on marriage, parenthood; new work group to study issues: Indranee",
      "url": "https://old.reddit.com/r/singapore/comments/1rf6png/spore_needs_to_reset_views_on_marriage_parenthood/",
      "score": 409,
      "num_comments": 342,
      "created_at": "2026-02-26T18:29:26",
      "selftext": "",
      "comments": [
        {
          "text": "😂 this conversation u want to have how many times? Brilliant tax payer spending\n\nHow many times we need to reset/reimagine/redefine our views and in such close intervals?  Truly is it the citizens problem or the government inability to understand how we think n feel? \n\nPeople tell u house too small u said it is getting increasingly acceptable to live in smaller house\n\nPeople tell u SPL for first year doesn’t solve the subsequent leave burden because kids get sick often u refused to increase CCL\n\nPeople tell u 6 days ccl not enough because one hfmd is &gt; 5 days but no sis, u want 2 or more kids to use the same number of ccl \n\nPeople tell u FWA would help u say orh, here’s the guideline but not mandatory. No rights to switch off after work hours like France. \n\nPeople tell u working hours long, v stress u said later companies don’t want to come, we not hungry enough. \n\nSo reset what views? Who reset? Citizens again ah? \n\n\nExample of consultations:\nEmerging Stronger Conversations on “Building a Singapore that is Made For Families” (2020)\n\nhttps://www.population.gov.sg/media-centre/parliamentary-replies/parliamentary-reply-by-minister-indranee-rajah-on-promoting-childbirth/\n\n\ngovernment had already started the “reimagination process” in the form of Forward SG - an effort launched in 2022 to seek feedback on refreshing Singapore's social compact.\n\nhttps://www.channelnewsasia.com/singapore/indranee-leong-mun-wai-parliament-total-fertility-rate-4919131",
          "score": 878
        },
        {
          "text": "&gt; A new workgroup, chaired by **Ms Indranee Rajah**, will address marriage and parenthood, urging a \"society-wide reset\" and commitment to changing the trajectory.\n\nYou got **the only minister who is single** to chair this workgroup addressing marriage and parenthood? Tell me they are not being serious.",
          "score": 654
        },
        {
          "text": "Indranee says we need to 'reset' our views on marriage and parenthood, but my bank account is currently telling me I can barely afford to 'reset' my lunch options.   \n  \nIt’s hard to have a mindset shift when your baseline reality is just trying to survive the 9-to-6 grind without having a mental breakdown in a mall toilet",
          "score": 611
        },
        {
          "text": "I honestly won't be able to tell if this headline was published in 2026, 2025, 2024 or heck even 2023",
          "score": 133
        },
        {
          "text": "Reduce working hours to 35-38 a week lah. Let everyone go home early enough to eat with their family and friends, meet people and do something fun. Maybe life will have more meaning and people will want to partner up and raise kids. Every other day there is another post about another burnt out person 4-8 years in the workforce, terrified to quit but losing all joy and hope in life. Isn’t this exactly the demographic that would be marrying and having kids if they could have a better balance of work an life?\n\nAll the productivity improvements since the manual typewriters and physical delivery of paperwork in 80s and our workweek cannot be reduced to the same as all other developed countries?",
          "score": 84
        },
        {
          "text": "Just goes to show you how fucking out of touch these people at the top are",
          "score": 78
        },
        {
          "text": "Not sure who she means when she says “Singapore”. I think she should have said PAP instead. \n\nPeople have been giving feedback for so long, the opposition as well. I don’t think much of the feedback was taken seriously. So now we have another task force.",
          "score": 57
        },
        {
          "text": "Tbh I’m quite sure they know what needs to be done, they just don’t want to do it. Honestly it’s so tiring that they just keep doing the same thing over and over again and expect us to believe that things will change. But then again they did get a clear “mandate” during the last elections so who am I to say anything.",
          "score": 54
        },
        {
          "text": "Your SG60 baby pack wasn’t memorable enough?",
          "score": 52
        },
        {
          "text": "So the challenges that are known are not real?",
          "score": 42
        },
        {
          "text": "Eh….indranee should know very well , much more than others about issues on marriage and parenthood.. it’s like asking a blind man to call out colours.",
          "score": 36
        },
        {
          "text": "this is the natural outcome of years of open leg policy and pap just wants to double down on immigration. \n\nlocals don't feel secure in their jobs, housing and car is expensive, parental leave only just started getting improvements.... where's the time, space and money to have kids coming from?",
          "score": 32
        }
      ]
    },
    {
      "id": "t3_1rf1lsf",
      "subreddit": "singapore",
      "title": "‘Why would he go? He has no experience fishing’: Mother of boy missing at Kallang River",
      "url": "https://old.reddit.com/r/singapore/comments/1rf1lsf/why_would_he_go_he_has_no_experience_fishing/",
      "score": 238,
      "num_comments": 77,
      "created_at": "2026-02-26T13:23:43",
      "selftext": "",
      "comments": [
        {
          "text": "Feels bad for the mother. It's not easy raising 3 children entering the teen phase. Even made harder that she's a foreigner and her husband is in prison. She's trying her best juggling running a food stall and taking care of the kids.\n\nOn a side note, it's sad that in a country where swimming pools are so readily available, some children are not equipped with the skills to swim. And most of these children are from low income families where monthly $100 swimming lessons is a huge financial burden for the family. Perhaps we could start a non profit that invites volunteers to teach swimming to these kids for free at public pools. No need for syllabus or examination. Just drop in and be equipped with skills that can allow you to exercise and save yourself in a drowning situation.",
          "score": 263
        },
        {
          "text": "I live around the area (closer to Boon Keng side). When walking or jogging along the park connector, frequently see youths and kids climb over the railings and standing at the thin grass strips fishing in the river. Didn’t think it would be this dangerous",
          "score": 80
        },
        {
          "text": "Honestly given that it was raining, the banks are sure to be slippery, going in with a storm surge also is a recipe for disaster",
          "score": 53
        },
        {
          "text": "Life Jackets, helmets and seatbelts are all important  \nEasier and faster to teach kids to respect PPEs\n\nBut sadly, even after the fatal Yishun taxi collision incident being on headline news, still I know many adults who don't use seatbelts   \nEducation and real world examples can only go so far  \nIf adults take public safety for granted, kids will follow suite  \nI feel it is a collective culture thing, singaporeans having low regard for public safety  \n(Kallang Kayakers all wear life jackets, mainly because of organisational public liability. Will they do the same if on their own personal accord?)",
          "score": 31
        },
        {
          "text": "It was raining pretty hard yesterday, and the day before. I assume that it not only made the place hella more slippery, but raised water levels as well as the speed of the currents.\n\nAll bad combinations vs someone who doesn't even know how to swim.",
          "score": 16
        }
      ]
    },
    {
      "id": "t3_1rfch3w",
      "subreddit": "singapore",
      "title": "Trading card packs to be regulated in Singapore to manage gambling risks: MHA",
      "url": "https://old.reddit.com/r/singapore/comments/1rfch3w/trading_card_packs_to_be_regulated_in_singapore/",
      "score": 201,
      "num_comments": 69,
      "created_at": "2026-02-26T23:03:23",
      "selftext": "",
      "comments": [
        {
          "text": "still dont understand how cards can command such high prices",
          "score": 104
        },
        {
          "text": "If only overworking is as swiftly regulated as vape and trading cards. \n\n“Overworking harms yourself and your family”\n“Overworking causes health problems”\n“Overworking: less time did family”",
          "score": 92
        },
        {
          "text": "Govt just annoyed that so many ppl burn their CDC voucher on pokemon cards lol.",
          "score": 27
        },
        {
          "text": "So much obsession over regulating gambling, porn and drugs. These things dont ruin my life, working more than 7 hours a day fucking kills me :)",
          "score": 17
        },
        {
          "text": "Poker cards need to be regulated too as it promotes gambling, mahjong set too, monopoly board game, aeroplane chess too",
          "score": 12
        },
        {
          "text": "Reminds me of the time back in 2010s when I would buy packs of match attax searching for the 101-101 attack defence 100 club card. Signed cards were another rarest of rare item. It was $1.50 a pack back then, 16 years ago.",
          "score": 10
        },
        {
          "text": "Didn't some guy named Post pay $1.5m for a card?\n\nKinda reminds me of Bearbrick which you will see in the house of every money launderer's house featured in the news 😆",
          "score": 9
        },
        {
          "text": "as long as there is the demand for goods with manufactured scarcity &amp; buyers willing to pay high prices for it, there will always be scalpers &amp; people artificially driving up the demand.\n\nfor tcg, maybe they will follow gacha-games market where they regulate with guidelines (all these supposingly occurred after granblue fantasy's monkeygate incident that introduced declared rates, pity system etc,), with displayed card rates &amp; a guaranteed amount of rare cards, which i heard Japanese tcg boxes have.",
          "score": 5
        },
        {
          "text": "I remember in primary school, late 90s, my school wanted to ban the country flag erasers because it promoted gambling 😂\n\nBecause like trading cards, some flags are more valuable than others. But i think it was because some kid stole another kid's erasers.",
          "score": 5
        },
        {
          "text": "Need to go to Singapore Pools to buy the packs?",
          "score": 4
        }
      ]
    },
    {
      "id": "t3_1rf5erj",
      "subreddit": "singapore",
      "title": "Apple to block underage users in Singapore from 18+ apps",
      "url": "https://old.reddit.com/r/singapore/comments/1rf5erj/apple_to_block_underage_users_in_singapore_from/",
      "score": 187,
      "num_comments": 41,
      "created_at": "2026-02-26T17:07:51",
      "selftext": "",
      "comments": [
        {
          "text": "IMDA and Apple just accidentally launched the most effective tech upskilling in sg history.   \n  \nThey are about to create an entire generation of 12-year-old cybersecurity experts who know how to configure a decentralized VPN and provision an offshore US Apple ID overnight",
          "score": 154
        },
        {
          "text": "There's 18+app from AppStore?",
          "score": 123
        },
        {
          "text": "App Store Age Ratings used to be 4+, 9+, 12+, 17+. Browsers including Safari were rated 17+ for “Unrestricted Web Access”\n\nThe Age Ratings were updated to 4+, 9+, 13+, 16+, 18+ in the various -OS 26 (and browsers were lowered to 16+; would have been hilarious if “underage users” couldn’t use any browsers at all)",
          "score": 15
        },
        {
          "text": "Damn, what do I do now 👀",
          "score": 9
        },
        {
          "text": "Can parents over-ride? I already had to over-ride  a bunch of younger age ratings, including Chrome, and simple games that have zero reason the be rated high (e.g. Aquapark io) for my lower Sec kids. \n\nI already have it set to needing parental permission to download any app, then they add these other restrictions on top, it’s really quite annoying.",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1rf89lz",
      "subreddit": "singapore",
      "title": "Long John Silver's outlet at Tampines Mall to close in March",
      "url": "https://old.reddit.com/r/singapore/comments/1rf89lz/long_john_silvers_outlet_at_tampines_mall_to/",
      "score": 153,
      "num_comments": 75,
      "created_at": "2026-02-26T19:58:31",
      "selftext": "",
      "comments": [
        {
          "text": "please god don't let anything happen to LJS.... It's not Michelin food but the breakfast sandwiches are very decent for their prices.",
          "score": 137
        },
        {
          "text": "First they came for McDonald’s and I did not speak out",
          "score": 134
        },
        {
          "text": "Hougang mall. Now Tampines mall. Soon all of them will be gone. Where will I get my guilty pleasure fried food and clam chowder then? ;-;",
          "score": 87
        },
        {
          "text": "Sad they really did a 360 positive turning point and their food quality bucked up by alot (albeit the pieces were smaller but eh what is not going thru shrinkflation nowadays?) \n\nLuckily suntec (around my work area) has one.\n\nHope I don't jinx it",
          "score": 41
        },
        {
          "text": "There will never be a need to reset view on rental because it was never an issue here as said by someone.",
          "score": 39
        },
        {
          "text": "in b4 someone asks which mala chain will open in it's place",
          "score": 30
        },
        {
          "text": "Hope this isn't the beginning of the end. I like LJS, to me it's the most bang for buck out of all the major fast food chains.",
          "score": 28
        },
        {
          "text": "Tampines Mall lost McDonalds , Mos Burger , Burger King and now Long John Silver\n\nAnymore fast food chains left in Tampines Mall ?",
          "score": 24
        },
        {
          "text": "Either the rent is getting out of hand or there is a change of focus from the landlord!!!",
          "score": 20
        },
        {
          "text": "Never thought I'll say Simei East Point Mall is looking more interesting than Tampines Mall.",
          "score": 15
        },
        {
          "text": "No more mcdonald's, no more mos burger, no more burger king, no more long john silver, no more starbucks. Interesting mall.",
          "score": 12
        },
        {
          "text": "First McDonalds Tampines Mall closes and now Long John Silver. If I didnt know any better, I would say they are planning to renovate the entire Tampines Mall or something.",
          "score": 7
        }
      ]
    },
    {
      "id": "t3_1rf93at",
      "subreddit": "askSingapore",
      "title": "Grab $5 waiting fee… driver intentionally stalling and scamming",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rf93at/grab_5_waiting_fee_driver_intentionally_stalling/",
      "score": 245,
      "num_comments": 55,
      "created_at": "2026-02-26T20:39:52",
      "selftext": "Has anyone else experienced grab drivers intentionally stalling to claim $5 waiting fee? Today my driver parked at the carpark entrance, not bothering to come all the way to the pick up point until the 2 min grace period was up.. then I’m charged the waiting fee despite communicating in the app that he had in fact not arrived at the pick up location. I asked him to take back the charge at which point he because angry and argumentative. \n\nI booked premium grab as I travel with a stroller pram and my baby. On top of this he proceeds to text and drive dangerously (I took a video of this). Is it worth bringing up a complaint to grab? Anyone else’s complaints like this result in refund? ",
      "comments": [
        {
          "text": "1. Whenever you observe the driver doing this, take a screenshot showing that the driver has \"arrived\" but is not at the location.\n\n2. Do not argue with the driver. After the ride ends, do NOT rate the driver. Immediately file a complaint (the ride &gt; report an issue &gt; fill in the details, describe what happened, attach your screenshot)\n\n3. Grab will usually refund you in a few days' time - your case is made stronger with the screenshot. If all else fails, export your conversation history with the Grab support, and file a chargeback on your credit card.\n\n4. Always, always, always file a complaint with Grab, even if it takes you a few minutes, even if the outcome is uncertain. If you let such behaviour slide, they're going to become entrenched in the private hire ecosystem. You don't want this to happen.",
          "score": 236
        },
        {
          "text": "yup just complain and they will give voucher (no refund sadly) but the voucher abit scam cause you can only apply 1 voucher so you miss out on another",
          "score": 151
        },
        {
          "text": "Driving dangerously endangers your life and the lives of other road users. You should definitely report. ",
          "score": 51
        },
        {
          "text": "There was a driver who stopped across the road instead of where the pick up point was. I just took a screenshot, cancelled the trip, and disputed the cancellation charge - Was refunded in full back into my card.\n\nThe annoying part was getting passed the chatbot in the app and getting through to chat with an actual human customer service agent. Just make it clear that you are looking for a refund, not just to raise a complaint.",
          "score": 38
        },
        {
          "text": "Grab driver cant do anything (i think), i never bother talking to them (for safety reasons too) and dispute with Grab directly. Usually I take a picture of the waiting point where there's no car, and then screenshot the \"Details\" of the photo where there's a timestamp. Ive always got my refund.",
          "score": 26
        },
        {
          "text": "Yes complain to grab please. And secondly don't argue over waiting charges with driver, just take screenshot and pic and tell grab support. Cos an angry driver is a dangerous person.",
          "score": 22
        },
        {
          "text": "Never argue with the driver. You will never win. “Argue with a stupid man they will bring you to their level and beat you with experience”\n\nJust directly speak to customer service. \n\nSounds bad when you say it, but there’s a reason why they are grab drivers. Nothing wrong with the job, but when you meet enough of such pattern, just like taxi drivers who like to chut alot pattern before grab came about",
          "score": 21
        },
        {
          "text": "Two occasions:\n\n1. I was a running late to meet the Grab (the lifts stopped at nearly every floor). Sprinted towards the pickup point. He saw me coming and slowly began to drive away so I couldn't get in. The three minutes of grace ran out the moment he cleared the roundabout. he cancelled my ride, pocketed the fee, and drove off. My hypothesis was that my ride quantum wasn't very high (about $9) so he felt taking the fee and ditching was more profit-efficient for him. \n\n\n\n2. My wife and I booked a Grab to go to the airport. We were at the pickup point on time and the driver disembarked and came around to the boot. I was already loading in our suitcases. **They would have all fit the way I stacked them**. He fussed over them, unloading, reloading, pushing, and sliding, making small talk all the while. He's finally happy and we're off to the airport. It was only while we were checking in that I realised I had been hit with a waiting charge. The driver hadn't started the ride when we arrived but only after we had fully loaded up after all his fussing and chatting. Till today I don't know whether he did this intentionally but I'm leaning towards 'yes'.",
          "score": 18
        },
        {
          "text": "Yes I kena also he parked at the main road before a traffic light which is about 5mins away from my pick up and I already waited 15mins for him.\n\nLate already so just ran all the way there which is how I know he wasn't just stuck at a broken traffic light.\n\nHad the cheek to ask if I ate yet and tried making small talk while I was panting from the run. Mr. POS got a 1 star(0 if possible) and a complaint.",
          "score": 15
        },
        {
          "text": "I had one wait 5 mins and then mark the ride as complete instead of cancelling. Charge me $30+ and grab support never understand the problem and refund me $5. My grab expense this month dropped from $600 to $0.",
          "score": 14
        },
        {
          "text": "This is getting quite common actually. First of all, the Driver arrived happens 1-2 min early and people blame system. Then we enter the baggage etc may take 1-2 min and by the time the driver \"press\" the button it will be over 5 min and I got charged. Luckily I took screenshots of the car location and the status it arrived with timestamp and complained. ",
          "score": 11
        },
        {
          "text": "I experience something similiar before..\nI am already waiting at the pick up point..\nOn the Grab app, it shows the driver is here but the car is not at the pick up point..\nAbout 1 min later, then the car arrives..",
          "score": 10
        },
        {
          "text": "Yes, can complain if you have proof. Like if the driver has marked that they arrived, but then your chat log shows you asking where they are and asking them to drive in, then you story makes sense. Send to customer service alongside video of the driver texting.\n\nAs for incidents, not mine but a friend of mine arrived at the airport from a business trip, and she has two large suitcases with her. She booked Grab but when the driver arrived, his car boot was completely full. So he had to unload all the stuff from there into his passenger seat to make space for the suitcases. And by the time they finally loaded up her luggage and left, she got charged a waiting fee, even though it was 100% not her fault at all. Like who shows up for an ***airport*** pickup with a full boot?!\n\nSo she disputed and explained what happened, and they refunded her.",
          "score": 10
        },
        {
          "text": "Must complain",
          "score": 8
        },
        {
          "text": "Yes very common..sg drivers are very entitled and naughty",
          "score": 8
        },
        {
          "text": "Yes do it",
          "score": 7
        },
        {
          "text": "Annoying you have to complain about dishonesty.  There should be stricter rule so it doesn’t happen.  Imagine the amount of people that got away with it.",
          "score": 7
        }
      ]
    },
    {
      "id": "t3_1rf5r7i",
      "subreddit": "askSingapore",
      "title": "Singaporeans, how do you handle problematic siblings?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rf5r7i/singaporeans_how_do_you_handle_problematic/",
      "score": 158,
      "num_comments": 104,
      "created_at": "2026-02-26T17:30:27",
      "selftext": "My (24F) brother (20M) has always been a normal kid until he went to secondary school. It definitely changed him, and he started becoming rude to me and our parents. Told him off for his behaviour and it mellowed a lot so it was fine from then until Y2 of poly.\n\nHe often comes back at 3-4am doing God knows what and he became aggressive towards my mother, me, and my youngest brother (12M). Note that he's never showed this side to my father because he fears him. \n\nWhat happened yesterday was the last straw for me. He was already in a bad mood when he came home in the evening yesterday. My youngest brother accidentally took his phone thinking it was his and my brother literally hit him on his back twice. He hit so hard that a handprint is left on my youngest brother's back. My brother then tearfully said it was because he mistook my brother's phone as his. Naturally, my mom was pissed and scolded him but he argued back saying it's because he took his phone. I also chided him for being rude and he called me a chibai and to stfu. At one point I put my hand on his shoulder and he shoved me and shouted to not touch him. He then came up to me gangster-like, pointed in my face and said \"I'm warning you ah, don't fucking touch me\". So my mother scolded him again.\n\nAn argument between him and my mother ensued. He kept playing the victim and said that \"everyone mistreats him\" and it's crazy because everything has always been handed to you.. You want a new bed, parents buy for you. You want a Nike duffel bag, parents buy for you. You want new clothes, parents buy for you. You want a Carhartt bag, parents buy for you. You want to learn driving, parents pay for you. Even I had to work for things that I want. I digress, my mother then declared that since he claims everyone mistreats him, she will not pay for anything for him anymore and will not support him. \n\nLater that night as I was doing my work, he came to me, pointed a finger in my face and said the same warning about touching him. It's funny because I know very well that he doesn't dare to act like this outside. He always keeps his head down when he sees people his age. \n\nMy brother has always been a normal kid but I have no idea what type of people he's mixing with to turn out like this. He outrights challenges my mother and threatened to \"whack me\" in front of her. Apologies for the long post, has anyone had similar experiences and/or tips on what to do with him?",
      "comments": [
        {
          "text": "It actually sounds like he’s being bullied outside. Bro needs therapy",
          "score": 149
        },
        {
          "text": "He sounds like he has issues. Anger management etc. Maybe he should see a counsellor?",
          "score": 69
        },
        {
          "text": "If ur brother is afraid of your father, and only does not act out in front of him, I’m afraid such behaviour may have been normalised starting from home and reinforced outside. That the fierciest, loudest, strongest and most powerful (money or physically) has the final say. He doesn’t know how to bring his feelings and points out the right way probably because he never had good role models to show him how to handle feelings and raise points in a non-confrontational way. Hard meet hard will usually not have good outcomes. Seek to understand and maybe there’s some chance. Easier said that done obviously, if that’s not how the family has been from the beginning.",
          "score": 51
        },
        {
          "text": "Apologies if it is all over the place, but I'm concerned about this behaviour and want to know how my parents and me can stop this behaviour before he carries it into adulthood",
          "score": 21
        },
        {
          "text": "What happened outside? Was he bullied in school? \n\nWhat kind of friends does he have? Anything happened at home? Was he disciplined a lot at home?",
          "score": 13
        },
        {
          "text": "I read through the comments and damn your parents are shit af lol, both to your brother and you. They're out here trying to parentify you while not being repentent of their abuse to yall from years back\n\nSounds like your brother has reached a point where the entire family pisses him off and triggers him which is why he barely makes contact with any of you the moment he gets home and also stays out late to continue avoiding yall. Your bro also has unresolved trauma and maybe he's also going through a phase where he's finally coming to terms with all the abuse he went through that's why he's being more extreme as a push back (I know I went through the same when I was in my early 20s lol)\n\nIf you really wanna get involved you have to approach it as someone on his side, don't immediately take the side of who's \"right\" because his mindset and view is clearly very narrowed right now. Try and understand where he's coming from, ask him why he feels the way he does, ask him if there's anything you can do to make the situation better (within reasonable means). This is to help process emotions and understand them too\n\nI grew up with emotionally abusive and poor parenting too with my sis being the problem child (hello autism) but we remain close to this day cause I listened to my sis and we communicate our thoughts and feelings to each other. We also have each others' back when our mum is being abusive so it helped strengthen the bond and understanding, and I use that to convey reasoning across to my sis when I think they're doing wrong\n\nBtw material wealth is not a stand in fix for childhood trauma lol, ask me how I know\n\nIf he actually gets violent you have to call the police to deescalate the situation",
          "score": 10
        },
        {
          "text": "Therapy sounds about right. \n\nHis behaviour is kinda inconsistent. It's either some form of mental illness, or he simply is blind to his own issues and seriously needs to wake up his idea. \n\nWithout knowing the full picture, it feels like some serious mental issue - like maybe unable to process some internal feelings or conflicts. Being oppressed outside and only being able to vent his emotions at home. And it comes out all wrong and violent.",
          "score": 7
        },
        {
          "text": "Hi OP. It must be hard for you.\nFirst of all, he clearly needs therapy. But whether he wants to do it or not, it’s gonna be a whole lot another problem.\nMy brother was the problem in my nuclear family too. I was the younger sister and we both have big sister. My big sister was like you, tried to talk to him and always ended up fighting, and he abused me and bullied me a lot when we were in our teens. (I’m in my forties now so this was 30 years ago and no therapy back then.)\nLong story short… he continued to mix up with the wrong crowd, gangster and stuff, and died young.\nWe never got to understand why he behaved that way. Me and my sister drifted apart, basically the family was kinda brokenhearted. My Dad followed him in the same year.\nWhat I’m trying to say is… you still have time to talk to him and help him. I truly believe my brother needed help, but it was easier for us to antagonise him and label him as the troublemaker in the family.\nI was still so young, and it still haunts me in my nightmares sometimes.\nI feel your worry and your concern and I pat you on your back that you have it in you to look for help.\nJia you! Good luck! :)",
          "score": 6
        },
        {
          "text": "Try to talk to him when he is not in a heightened emotional state. When he is, try to de-escalate, by being the calmer one, and not matching or escalating the volume of your voice or any harsh words. There is no point in trying to tell him what is wrong with his actions when he is not a state to receive this. Give him time and space to calm down. You can tell him that you want to give him time and space to calm down but you would like to talk to him when he is in a better head space.\n\nWhen he is calmer, then talk to him. Instead of accusing him and finger pointing and telling him what you think of his behaviour, try to ask why questions first. Why is he acting this way? Why does he feel like he is the victim? Even if you disagree with his reasons, just let him talk first and vent his POV. Ask more questions than giving statements. The point is, you want to try to understand why he thinks the way he does, and why it is so different from the viewpoint that you have.\n\nIf he is receptive, then give your POV and the reasons why you think his behaviour is unacceptable. Try to do this in a calm, non-accusatory way but to explain what you perceive as unacceptable consequences of his behaviour. Example, when you say ABC, you make the family feel XYZ.\n\nIf you feel the conversation starting to become heated, or he is starting to shut down or close off, end it for now and let him know you both can continue the conversation when you’re both in a better headspace. It may not be easy and make several tries.\n\nThe key point here is to be able to get him to talk openly and honestly and calmly, and to bridge the communication and POV gap. Shutting down communication doesn’t help anyone. It may lead to him feeling even more misunderstood and you never learn why and you can’t help him if you don’t understand him.\n\nGood luck, OP.",
          "score": 5
        },
        {
          "text": "He was terrified of your dad cos your dad hit him. Now that he's older, he has learned that he doesn't have to be afraid of everyone else. That he can behave normally when others are around shows he knows what he's doing is wrong. He hit your brother, he's calling you vulgarities, it's only a matter of time before he hits you too.\n\n\nHe is basically progressively becoming an aggressive person and likes the power trip that comes with it. \n\n\nHe definitely needs therapy. Unless he decides to make the change himself, there's nothing you can do. You can sit down with him when he's in a calmer mood to talk to him but he'll prob only listen to someone whom he respects. Is there an uncle or an older person he listens to?\n\n\nI know someone who went down this path. It ended up with him beating up his sister, and the family cut off ties with him. ",
          "score": 5
        },
        {
          "text": "Your brother has some hidden serious anger management issues and may need counselling therapy before he blows up one day to the wrong person and learn painfully, his actions have a price!\n\nProblem is he is the only one that needs to acknowledge these anger management issues and seek help.  It is unlikely that your mom or you can persuade him to seek help. Does he have a good friend that he would listen to? I would speak to this good friend and ask him to help talk to your brother to get help.  Whatever is bottled up inside him will do him more harm than good.\n\nIf you love him enough, please try to help him.  On the other hand if he has gone off the reservation...then maybe the only way to help him is to have dad have a serious talk with him and give him a rude awakening for his own good.  If he has this stick to bear and starts behaving like this with other people, it won't be long before he might find himself beaten to a pulp lying unconscious in a ditch some dark rainy night!",
          "score": 3
        },
        {
          "text": "from my own experience with a toxic sibling, situations like this can get VVV serious if they aren’t addressed properly. in our case, it eventually got to the point where they needed inpatient treatment at IMH and were put on mood stabilizers. sometimes families try to manage it themselves for a long time, but there are times when professional help is damn necessary.\n\nif he ever threatens to hurt you or becomes violent, please call the police. i know it can feel extreme since it’s a family member, but your safety comes first. sometimes that’s the only way to get someone the serious intervention they need and to keep everyone safe. they will escort him to imh.\n\nalso, it’s not fair for the rest of the family to keep going through this kind of stress or abuse. no one should have to live in fear in their own home. it’s okay to prioritise your safety and wellbeing.",
          "score": 3
        },
        {
          "text": "As long as he sustain certain level of results and not resorting to anything illegal then.. its just part of parcel of life.",
          "score": 3
        },
        {
          "text": "I’m in my 30s, and during my teenager years, I had the same experience with my sister. That’s the result of her going into secondary school and become an ‘ah lian’. Maybe in the past that’s what people label this kind of behaviour. \n\nAfter a few years, the behaviour escalated. My parents also got her whatever she wants material wise, she never really has to work for anything and soon believe everything has to be handled to her. \n\nShe also been to therapy recommended by family center back then weekly and things don’t improve. We also attended family therapy. \n\nThings got worse when she graduated from ITE with bad results and can’t go anywhere else from there. Then turned to doing illegal stuff for money, drugs. \n\nMy parents kept supplementing her with cash because they were afraid she might get into more trouble taking/selling drugs for money and shoplifting. Which wasn’t a solution now that we learn. \n\nShe eventually got pregnant with twins and the children are now 14yo and has been taking care of by my parents since birth while she was out partying and such. \n\nFinally got put to jail in her late 20s, came out, got back again. Now staying with my parents working retail, barely home, and out running with different boyfriends. \n\nI can’t give you any advice because obviously we have a failed case on hand. I can only tell you about my own family’s consequences.",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1rf30te",
      "subreddit": "askSingapore",
      "title": "Do you ever think of death in Singapore?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rf30te/do_you_ever_think_of_death_in_singapore/",
      "score": 142,
      "num_comments": 78,
      "created_at": "2026-02-26T14:42:26",
      "selftext": "Do you often think about dying in Singapore? As I grow older, I noticed that I am attending more funerals. All funerals eventually lead to mandai crematorium and whenever I pass by that area, I really wonder what is death like after. \n\nImagine 60 years from now, most of us would have our bodies lying there in the 6 cremation halls waiting to get cremated. How do you feel about death in Singapore?",
      "comments": [
        {
          "text": "When young, attend birthday parties.\n\nWhen adult, attend wedding dinners.\n\nWhen old, attend funerals.\n\nLast time 1 year attend 3 or 4 wedding dinners. Now is start to go void decks or funeral parlors. We know to search wedding angbao rates, next time TSL or sgag or whatever will need to post pehkim rates.",
          "score": 207
        },
        {
          "text": "just sent my 93yo ahgong off yesterday\n\nhe lost his quality of life few years back after a mild stroke, he has always been very healthy and strong even up to his 80s but 1 mild stroke changed his life\n\ngetting weaker and weaker each day, everyday is just stay home watch tv and eat\n\nhe also was the ahgong who watched me grew up, fetching me from school while my ahma prepared meals for me and for the longest time i dreaded his death\n\nhe passed due to pneumonia, saw him struggle catching his breath, on the day he passed i definitely felt sad but relieved because he did not need struggle and feel pain anymore…\n\nif i have the choice, the moment i lose my quality of life is also the moment i dont wanna live anymore cause i dont plan to have kids but too bad we cant put ourselves to sleep like pets, and if given the choice sleeping to death is my preferred choice",
          "score": 165
        },
        {
          "text": "I'm in my 40s now.\n\nI've lost school friends. A couple to cancer, a couple to bad hearts, a bunch to accidents - which is also why I don't ride a motorbike anymore. A few suicides, a scuba accident. One guy stroked out. He wasn't even overweight. \n\nMy aunts, uncles, and older cousins are beginning to shuffle off this mortal coil. My dad's also off exploring the afterlife. \"Heaven for the weather, hell for the company,\" he used to say. We still burn paper money for him every year just in case that stuff actually works.\n\nI've sent off three of my ex-teachers. It was sobering seeing the buff PE teacher / rugby coach reduced to skin and bones as cancer ate him from the inside out.\n\nThe body count just rises as we get older. Ten years ago I was attending a ton of weddings. Then came the baby showers. Now I'm attending my friends' parents' wakes. \"Goodbye, uncle / auntie. Thanks for looking after me last time.\"\n\nAt least the chance of sudden, violent death is relatively low in Singapore. It's much more likely that we grow old, accumulate a bunch of 'first world diseases', and slowly fade away from there. I wish we pushed pre-emptive screening harder and I wish we had a legal euthanasia programme. Colorectal cancer is the most common across both genders here and we should really be going for colonoscopies earlier, in our 40s.\n\nAnyway, to me dying isn't the hard part. On a long enough timeline, the survival rate drops to zero, yeah? It's making sure I die well that's the problem. Oh, and get your wills done and out all your bank accounts / insurance policies / logins+passwords in one place for your loved ones to find, people.",
          "score": 66
        },
        {
          "text": "die , die lor , what do?",
          "score": 34
        },
        {
          "text": "I think of death everyday. I’m prepared to die without regrets. The thought has calmed me more than it has terrified me. 🫶 I do things more deliberately now as I know it can disappear any time.",
          "score": 28
        },
        {
          "text": "Don’t think of what will happen after death. Think about what you can do with your life now. Pointless to think about something you can’t control or have any say in after.",
          "score": 19
        },
        {
          "text": "More scary part is how would u die…\n\nMy father passed away from cancer and the last few days are really haunting.. I shudder to think that one day I may follow his path and lost my life to cancer. It’s such a shitty way to die, especially when he was a legit good person which everyone who came to his funeral mentioned.",
          "score": 19
        },
        {
          "text": "\n\nAt the end of the game, the king and the pawn go back into the same box",
          "score": 18
        },
        {
          "text": "As much as it sounds cliché as fuck, I try not to think about it if I can. Aside from being a very morbid topic, it's also inevitable. Everybody dies, it's just a matter of when and how.\n\nWorrying about it imo is not productive, when that same energy could be better used to improve your chances of a long life (healthy life choices) and doing your best to make the most of the time that we have on earth right now.",
          "score": 15
        },
        {
          "text": "My plan is to save up enough for legal euthanasia in NZ or Switzerland. One of my friends has already set aside 20K for it",
          "score": 15
        },
        {
          "text": "Dead is like eternal emptiness. Hmm i dont think we can comprehend that.",
          "score": 14
        },
        {
          "text": "It may not even be 60 yrs from now. Someone i know - did sports, no medical issues, passed away in her sleep in her 30s. Left behind young daughters aged 2 and 4. \n\nSince then, i viewed life through new lens. Yes work and money still important but these take a back seat. Forever chasing work KPIs for what. I rather treasure the moments with my young ones while i can.",
          "score": 14
        },
        {
          "text": "I'm already half dead from work every day. Too tired to think of death",
          "score": 11
        },
        {
          "text": "I’m pretty sure I’ll die alone in my hdb and no one will know until my corpse stinks.\n\nSomehow I am at peace with that",
          "score": 8
        },
        {
          "text": "i think about death everyday. in fact every minute. I'm a hypochondriac.",
          "score": 8
        },
        {
          "text": "it would be cool if someone comes back and tells us what's after life.",
          "score": 7
        },
        {
          "text": "I think of it a lot, I think having older parents makes me more aware of it. When we age we also don't fully  see that our parents are aging with us. While we can't stop death I'm embracing that we are lucky to have the time we have and to do what we can such that during the funeral we have lesser regrets than we would have otherwise. \n\nIt's human to be afraid of the one domain we won't know about fully, that is what truly is after death. But I feel it calls us to then be grateful for what we have when we still have it.",
          "score": 6
        }
      ]
    },
    {
      "id": "t3_1rfgej1",
      "subreddit": "askSingapore",
      "title": "People who left high stress jobs which pays well to low stress jobs which... pays not that well. Let's talk about it.",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rfgej1/people_who_left_high_stress_jobs_which_pays_well/",
      "score": 140,
      "num_comments": 75,
      "created_at": "2026-02-27T01:26:36",
      "selftext": "currently in a high stress position with aggressively mid pay. great bosses, okay subordinates, great power, great responsibilities.\n\nin project/portfolio/client management, 29YO, private diploma, 7.5k.\n\nif i leave the department (profit centre) probably collapses. i dont wanna leave my team in the lurch and i dont wanna leave my boss in the lurch.\n\nbut i wake up with a sinking feeling in my stomach every morning and get mild anxiety when my phone rings.\n\nedit: thanks for the responses and feedback on the \"indispensable\" part. it's making it easier to just get up and go. \n\nedit 2: would like to add that i've been running the department and all it's clients and functions for the last 5 years. it's a new department so no one including my boss (my direct reporting is the founder) knows what is going on e.g what clients and what we do exactly (it's a flaw in the SME system) hence if i just up and leave it's gonna be quite chaotic. but i do agree it's not my problem and they can find a way to replace me!",
      "comments": [
        {
          "text": "You mostly do great work, but don’t delude yourself, they will continue to find a way to survive without you. Everyone is replaceable",
          "score": 513
        },
        {
          "text": "One thing I learned is no one is indispensable. I don’t mean it in a malicious way, but sometimes we think too highly of ourselves, thinking that this will collapse because we’re not there. No it will not. The world will still spin and they will find someone to replace you with. Do what’s best for you. For me I’m in a really stressful job with classic burn out signs but I’m hanging on because the market is bad and I don’t want an employment gap. But if a decent job opens up you bet I’m gonna take it. Or if I strike lottery you bet I’m gonna quit on the spot (and I’m someone who likes to work, but recently it’s been too much)",
          "score": 179
        },
        {
          "text": "Lol. The department won’t collapse without u. Dont think too much.",
          "score": 125
        },
        {
          "text": "If George Yeo can be replaced as Minister of Foreign Affairs, you also can be replaced. \n\nIt’s not a problem to move to a lower paying job if you are still able to pay your bills. The question is if you will be comfortable giving up some creature comforts like maybe not taking Grab as and when you like, no bubble tea, less buying of clothes/ makeup/ shoes etc. Some people can do it some people can’t. You just need to know which category of people you belong to.",
          "score": 78
        },
        {
          "text": "I know someone who really regretted leaving a high paying job. The financial stress become worse than the work stress for him.\n\nIt was bad timing. He left his role during the post covid tech downturn. He was doing very well in a tech company but decided to go to a pretty middle of the road non tech govt job. Took a more than 50% pay cut got married, got a kid since then. He said to me, no chance he could have a kid while doing the tech job. But when I spoke to him recently, he told me he was trying to get back to tech. With the mortgage, kid cost and a 2nd kid potentially on the way, his wife also got laid off. The financial stress got more and more. He is having great WLB now, easy low stress job. But that doesn't solve everything her ein Singapore. He used to be the. Well no need to be so ambitious, good enough is enough kind of person. But I guess that is not really enough.\n\nFinancial stress can be really a breaking point. So take that into consideration.",
          "score": 66
        },
        {
          "text": "You grossly overestimate your own worth at the company. Even if it takes them 6 months, somebody will replace you and they will forget about you eventually. There are 5 mil ppl in Singapore. You arent that unique star. Unless you are telling me you invented something or you are Steve Job or Bill Gates.",
          "score": 45
        },
        {
          "text": "If you leave, the most is company will struggle for about a month. Then they will forget you were there.",
          "score": 39
        },
        {
          "text": "If you leave the whole company collapse you should be paid half mill per year",
          "score": 31
        },
        {
          "text": "I was like you, every morning waking up with a feeling of dread.\n\nI left a $12k job in an MNC to go back to school for my masters. I now draw about 9k per month but with a lot more flexibility and less stress.",
          "score": 20
        },
        {
          "text": "Tell you something as what others said. Everyone is replaceable. You are not shareholder of company, you do not need to worry yourself on survival of the company.\n\nMy ex company was acquired by a mnc. Promised no change to personnel etc for 1 year. All sales person in my ex company was terminated with immediate notice (paid notice) within 1 month as the MNC has their own sales team.",
          "score": 16
        },
        {
          "text": "I wish I was you, man. 29 also. I work two jobs and I earn half of what you do. \n\nYour place hiring? 🥹",
          "score": 11
        },
        {
          "text": "If you wanna leave, just leave. You'll open up an opportunity for one of your subordinates to get a promotion.",
          "score": 11
        },
        {
          "text": "I have my two cents to chip in! I left a “high” stress pay well job but not like very very well but it’s on the higher side to another job that pays okok but “lesser” stress. I took a year break in between to regain myself due to burnt out. And I realised while there are indeed jobs that stay on your mind longer with blurred boundaries because of the nature of the job, how “stressed” you are about it really can be controlled. It’s really up to u to think whether the job stress or not - at least to some extent. Idk if I can go back to my previous job with the same mindset because like I’ve said, certain jobs are like this, the nature of it makes it stays in your mind more, blur the boundaries more, but when I first started in my new job, I also felt stressed (lol) so I realised it’s a me problem and I work on that so I don’t keep thinking about work and stressing myself out. I just purposely don’t think and purposely output 85% and I realise eh still ok leh. Everything is still fine. I didn’t need to like pull my hair out for the day to finish nicely soooooooo jiayou jiayou!!",
          "score": 11
        },
        {
          "text": "Take care of that sinking feeling. For me that ‘feeling’ eventually became heart attacks. I had multiple heart attacks but I just ignored it and pushed through. I didn’t know they were heart attacks. Just felt strange pressure in my chest every now and then. Till I went for checkup and was rushed for emergency heart surgery, 4 stents, 40k. \n\nI left my job soon after (during covid).\n\nYes, I now work in a job with no stress and much lower pay. Happier with life. But need to adjust lifestyle a bit.",
          "score": 9
        },
        {
          "text": "George Yeo was booted out of his foreigner minister role after losing 2011 GE. \n\nOur foreign ministry didn't collapse.",
          "score": 5
        },
        {
          "text": " You can leave if you feel you have to. They can always find someone. I am responsible for the entire revenue chain in my company but even I can be replaced. They may have to fill 2 separate roles for it but they can do it.\n\nDon’t worry about the company. It’s not your company and you have no stake in it. Just remember that when times are tough, employees are fired. There is no loyalty.",
          "score": 5
        },
        {
          "text": "Ig it depends on what matters more to you, mental health or money? \n\nIk people will say money you can always earn it back, but also think financially, will you be comfortable with not earning the same amount in the event you leave the job? Do you have savings or do you live a lavish lifestyle with little savings? \n\nIf you can find a new job within weeks or a month, then good for you. But also are you prepared to be unemployed for months if you can’t?\n\nIf mental health matters more, go ahead and leave that job, take a break, start over.",
          "score": 5
        }
      ]
    },
    {
      "id": "t3_1rf4hu9",
      "subreddit": "askSingapore",
      "title": "Do you speak Singlish during job interviews?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rf4hu9/do_you_speak_singlish_during_job_interviews/",
      "score": 119,
      "num_comments": 219,
      "created_at": "2026-02-26T16:10:13",
      "selftext": "Genuine question for Singaporeans here.\n\nWhen you go for job interviews, especially for senior or international roles, do you consciously switch to professional English, or do you just speak with Singlish?\n\nI recently interviewed three candidates for a senior position with international scope. One had 20+ years of international experience, one came from an agency background, and another from an international MNC with about 8 years of experience.\n\nTo my surprise, all three spoke quite a bit of Singlish during the interview. Even during simple opening small talk:\n\nMe: “Did you come from your workplace? Did you take time off to attend the interview?”\n\nCandidate: “Ya ya ya, I came from my work.”\n\nIt wasn’t just one off moments. Throughout the interview, every other sentence had a “lor” or “lah”, and it sounded rather unprofessional.\n\nCurious to hear Singaporeans’ perspectives on whether they think this is okay or not, and whether people are self aware of how they present themselves at interviews.",
      "comments": [
        {
          "text": "Okay hot take - yes I do, if the interviewer is singaporean and speaks slightly in singlish himself. I wont go full on ahbeng for sure, but my intention is to let the interviewer feel comfortable communicating with me and naturally like me more. It has actually worked wonders. Interviewing is not about acting professional trying to be who you are not - people can sniff straight through that - but its rather having a conversation and trying to convey your value proposition. Interviewers arent only looking at your CV, they want to hire a likeable person that they will enjoy working with in the long term. Speaking slightly in singlish helps the interviewer lower their guard and have a proper casual conversation with you.\n\nIf your interviewer is NOT singaporean, then ofcourse singlish doesnt make sense. not because its unprofessional, but its just not their comfort language. read your interviewer and understand whats the best way to communicate with them.",
          "score": 294
        },
        {
          "text": "I think it depends on the interviewer. I have interviewed a few times here since returning from the US and I would only use Singlish if the person interviewing me uses it first. ",
          "score": 146
        },
        {
          "text": "“Ya ya ya, I came from my work” just sounds to me like “yeah, I came from work” (?) and that didn’t sound Singlish to me? \n\nThat aside, I think it’s okay so long it’s not overly used (by that, I mean not substituting “good-looking females” as “chiobu”or “frustration” as “pekcek”) \n\nsometimes the “lah” “lor” “leh” just comes out naturally…. I think that is okay. But anything more than that in an interview, I’d say no.",
          "score": 90
        },
        {
          "text": "My predicament: \nI speak proper English with zero accent, I get asked \"oh you from India ah?\" Or \"how long you have been in Singapore?\"\nI speak Singlish, I sound unprofessional. \n\nNB lah, how to win like that 🙁",
          "score": 86
        },
        {
          "text": "Singlish is our language.\n\nJust by using Singlish, you find it unprofessional shows that you don't understand what languages are.\n\nWould you call someone with an Australian accent unprofessional?\n\nOr an American accent?\n\nIf no, why Singlish?\n\nIn the end language's main purpose is communication. To get your idea across.\n\nIf the focus is on the right word as opposed to the right meaning of the word, then it's putting the cart before the horse. La.",
          "score": 29
        },
        {
          "text": "I guess everyone knows not to, just when you are stressed, it probably comes out more, especially filler words. the filler words for Singaporeans tend to be lah. ",
          "score": 17
        },
        {
          "text": "Always professional english. Accent imo is always ok as long as enunciation is clear and accurate, but if the use of language is incorrect or too casual, that is not very acceptable for upper management",
          "score": 15
        },
        {
          "text": "A tiny sprinkle of Singlish between Singaporeans in the workplace, and professionalism, are not mutually exclusive. In fact, if Singlish is completely not tolerated in an interview with a Singaporean interviewer, then it's way too uptight for me and suggests to me that the culture in that workplace might not be for me. A bit of a red flag if you will.",
          "score": 13
        },
        {
          "text": "To me it depends on the interviewer.  I would code switch between singlish and proper English depending on who I speak with.\n\nI used to work for an american MNC and my boss was american. One day outside his room I was talking to his secretary who was Singaporean and we conversed in singlish.  He gestured to me to come into his room and we started to converse.  I saw his expression changed. I stopped and asked him what was wrong in perfect English and he smiled and said, he was astonished that I could speak English fluently in an instant when we were talking and just a few seconds ago, he could not understand what I was saying to his secretary in English.  I explained I was speaking singlish then. He found that amusing and he asked me what was it I was saying to his secretary earlier just before he called me into his room. I was puzzled and as I could not recall.  Then he said it had something to do with time.  Then I remembered and I told her I asked her for the time?  He said No...that was not it as he could not understand what i said.  Then I recalled.  I had asked his secretary. \"What time now?\"  And we both burst out laughing.",
          "score": 11
        },
        {
          "text": "Sorry you’re getting so many downvotes OP. I think alot of Singaporeans don’t even know they are speaking Singlish. “I came from my work” is a very unnatural sentence grammatically. It should be “i came from work” or “i came from my workplace”. That’s why it feels unprofessional.",
          "score": 9
        },
        {
          "text": "I've interviewed hundreds of candidates because I'm in the MA programs. I don't care if you speak tiny bit of singlish, as an interviewer, I'm trying to find people who can match and vibe with the company values and the people.\nOf course the singlish should not be ah beng levels, but if you're gonna come in all pretentious, then it's also a no go. Interviews are a 2 way street. Candidates need to feel comfortable and feel empowered to work with us, and I need to feel confident in the hire, not because he speaks full \"professional\" English. We are in Singapore anyway. Singlish is our culture and a little is fine",
          "score": 9
        },
        {
          "text": "Truth be told, many Singaporeans do not have a strong grasp of English, so it could very well be the case that they believe they are speaking proper English, but they are making so many grammatical errors that people think they are speaking Singlish.",
          "score": 9
        },
        {
          "text": "Maybe they are trying to build a connection… but I will only use it if the interviewer starts so. \n\nYa la lor are just filler words, which I’m sure people using proper English also have just different words. Personally don’t see a big issue. Singlish however is also categorized by broken, more “efficient” sentence structures. That will be a bigger problem",
          "score": 8
        },
        {
          "text": "Nope, that would be unprofessional. If you're playing at the global level it's best to present yourself accordingly. \n\nBut I don't have to consciously remind myself not to because my grandparents hammered that weird LKY-like English into my head growing up. \n\nSo I speak normal English but when I'm speaking Mandarin the laaa and meh sometimes come up when I'm talking to friends. I call it Market Mandarin. For Chinese interviews I gotta pinch myself to remember to speak properly haha.",
          "score": 7
        },
        {
          "text": "The use of \"la, leh, lor\" I can agree its not very suitable for senior roles. \n\nBut \"ya ya ya, I came from work\", sounds pretty alright. Unless you have an issue with the accent or the tonation that is being used. \n\nIn a Singaporean accent, it may sound cheap and low-class to you.",
          "score": 6
        },
        {
          "text": "I’m curious what is considered as professional to you and till what extent is Singlish used to be considered as unprofessional. For example, in meetings, if your team member uses Singlish like leh la lor, is that unprofessional? And if in lunch setting w team and they use that, is that okay or not with you? \n\nI went through your comments to see that you moved out of Singapore which perhaps could explain why you had the opportunity to be forced to not be speaking (1) in Singaporean accent, and (2) not use singlish.  \n\nI find it amazing how you classify speaking in British / American / Australian accent to be considered as professional. That’s quite a bit of colonialism being ingrained into you, isn’t it? I wonder if you know accent and grammatical rules are two different things &amp; wonder if you’ve ever encountered Americans who can’t even do grammar rules properly while speaking in their accent? \n\nAnd you said Singaporeans use a lot of filler words such as “like”. You’ll be surprised filler words are often used by the Americans and British too. But does that annoy you less when someone with your preferred accent speaks w filler words? \n\nPerhaps it’s also time for you to understand why Singlish annoys you. \n\nAlso were you the only one within the panel who feels annoyed by the Singlish used?",
          "score": 5
        },
        {
          "text": "[removed]",
          "score": 5
        },
        {
          "text": "I let the interviewer set the tone. \n\nIf they Singlish. I’ll also use Singlish but like professional Singlish. \n\nIf they very formal or if I’m interviewed by foreigner the I’ll keep it clean",
          "score": 5
        },
        {
          "text": "I hired 3 Singaporeans as an American. They all spoke perfect English to me, but when they speak to each other sometimes I have trouble following.",
          "score": 5
        }
      ]
    },
    {
      "id": "t3_1rf61hf",
      "subreddit": "askSingapore",
      "title": "Sales folks of SG, how much is your base + Comms?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rf61hf/sales_folks_of_sg_how_much_is_your_base_comms/",
      "score": 85,
      "num_comments": 62,
      "created_at": "2026-02-26T17:48:34",
      "selftext": "Curious how much sales folks in SG are getting! According to the tech bros it should be 6 digit a year lol (and sadly I'm not one of them)\n\n- What's your base?\n- What's your commission/earning potential?\n- Realistically, how much are you making after comms?\n- Industry/market, average deal size &amp; YOE\n\nI'll go first:\n- $4k base\n- Commission supposed to be up to $30k annual (or OTE $68k)\n- BUT my actual earning is way off - average pay with comms is $5k ($4k base + $1k commission)\n- Software sales (contract value $10-20k each, local market, 2 yoe)",
      "comments": [
        {
          "text": "Circle jerking here we go",
          "score": 48
        },
        {
          "text": "As a blue collar can anyone explain all the jargons. OTE YOE AE SMB",
          "score": 38
        },
        {
          "text": "Ok really well done on the switch. It’s rare and not so easy nowadays. Smb sales should be around 100-120k ote, 50/50. Quota 500-700k usd.\n\nNot sure where you get the impression tech sales is less stress lol. Many of my peers either live in fear of getting laid off, or have anxiety they cannot hit quota and will be cut. Large enterprise sales especially is stressful AF. We close 1-2 deals a year that can help us hit 1 million quota, or even close 0, ending at zero for the year.",
          "score": 36
        },
        {
          "text": "Enterprise AE (big SaaS), 10 YOE total, 420K OTE. 50:50, Clocked 1M in 2025. Burnt out until wanna die.",
          "score": 30
        },
        {
          "text": "Base 18 excluding allowances with OTE will be 450. 10 years in IT started as an engineer. As mentioned by someone in the thread, yes my accounts are all in the millions at this pay scale.",
          "score": 9
        },
        {
          "text": "I think SMB AE roles would usually be $100k OTE and above? $60-$70k range seems more in line with what an SDR/BDR would be getting with minimal experience.\n\nIt goes up slowly at first but once you hit enterprise / strategics the OTE becomes really comfortable. At bove $400k OTE you have a very good chance of making above $1m in a good year. Just need a few such years and you’re set. \n\nRegardless of how good you are, you can be laid off any time though, so you really need to have a certain mindset to thrive this field.",
          "score": 7
        },
        {
          "text": "I was in sales up till 5 years ago.\n\nBase: 78k\n\nComms: 2% for every 500K euros\n\nSports industry, typically close 2.5 m euros a year.",
          "score": 6
        },
        {
          "text": "As a non-sales guy, you all make me feel bad about my salary (78k with 3 YoE). But then again I suck at selling.",
          "score": 6
        },
        {
          "text": "you must be working for an SME..$68K OTE, sorry to say, but is way below average. What is your annual quota?",
          "score": 5
        },
        {
          "text": "i’m an sdr in a small saas company - 58k base, 83k ote. \ni was previously in a role paying 62k ote.\n\nhave &lt;1 yoe",
          "score": 5
        },
        {
          "text": "Basically speaking at the end of 20s, my basic is around almost to 2.9. With comm would be around 3.3-3.6 depends. Hang on there OP!",
          "score": 3
        },
        {
          "text": "Strategic Enterprise AE (Hyperscaler)\n\nAPAC coverage\n\nYOE: 15\n\n525k OTE\n\n60:40",
          "score": 3
        },
        {
          "text": "im in bank, yoe:2/3, 4k base, about 4-5k monthly comms.",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1rft2lu",
      "subreddit": "askSingapore",
      "title": "Just curious, why would you queue for Yakun or Toastbox instead of going to a normal coffeeshop for your morning coffee or toast fix?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rft2lu/just_curious_why_would_you_queue_for_yakun_or/",
      "score": 78,
      "num_comments": 128,
      "created_at": "2026-02-27T09:32:27",
      "selftext": "Everyday when I am going to work, I see people queuing for Yakun or Toastbox, even though now a set can go up to $6 or $7 per purchase. \n\nIs this not too expensive for some bread and coffee? why would you choose to buy this still, and esepcially those buying on a daily basis?",
      "comments": [
        {
          "text": "Depend on the kopitiam, sometimes their bread feels very anemic. Like they sprinkle a little bit of kaya and butter onto the thinnest slice of bread you have ever seen. Then charge you full price",
          "score": 118
        },
        {
          "text": "Ya Kun kaya toast is perfectly done with better quality butter and bread",
          "score": 88
        },
        {
          "text": "Ya Kun &amp; Toastbox tend to have better quality control with their toast bread, runny eggs, and coffee &amp; tea. Sometimes, their branches are also strategically located near workplaces that do not have coffee shops in the vicinity",
          "score": 81
        },
        {
          "text": "The quality is consistently there. \n\nIf you buy kopitiam, you will be randoming the taste at a discount of roughly 1.5\n\nI rather pay extra 1.5 for a nice happy breakfast.\n\n1.5 does not hurt your bank account.",
          "score": 51
        },
        {
          "text": "Consistency. If I'm in a coffeeshop that I have never been to, I do not know their quality of toast, and if it's to my liking.\n\nYakun and Toastbox are a franchise. So you can be sure that their food will taste more or less the same, regardless of which branch you're visiting.",
          "score": 44
        },
        {
          "text": "Ya kun’s eggs are always perfect and their yolks are huge and yummy. The toast is also perfect- the slices are thin, crisp and well toasted. The butter tastes good and is lightly salted. You can find good kopi and tea in kopitiams but for eggs and toast it’s hard to live up to Ya Kun’s standards.",
          "score": 20
        },
        {
          "text": "Tastes better. I dont mind paying more for good food. Food is one of the areas i will not skimp on quality to save money.",
          "score": 13
        },
        {
          "text": "Ya kun's toasts and eggs are the definition of perfection.",
          "score": 13
        },
        {
          "text": "toastbox is trash",
          "score": 13
        },
        {
          "text": "Aircon? Random coffeeshop isnt inside a mall as well. Sure you can go food court, but often can be worse for same price",
          "score": 10
        },
        {
          "text": "cause their drinks r consistent, kopitiams depends where u buy...taste varies. I had kopi/tea/milo so chui that i have to throw away lol",
          "score": 9
        },
        {
          "text": "having gone from working at city hall to ubi ‘tech park’ , my daily coffee go to has changed drastically and it’s one of the many reasons i’ve had trouble adjusting at my new work place. it’s cheaper, which is better than paying $4~ for a cup of iced coffee… or so i thought. i don’t even buy starbucks while at city hall. my most expensive is probably old tea hut with the occasional kenangan coffee or tag espresso. however i honestly i don’t think it’s worth it paying $1.70 for coffee that’s inconsistent. i rather pay more for better quality that’s consistent.",
          "score": 8
        },
        {
          "text": "Ya Kun for the toast, Toast Box for the kopi. Lol",
          "score": 8
        },
        {
          "text": "cos we work in the CBD and sometimes the nearest coffeeshop is at god knows where. or like 500m away but across an overhead bridge + navigate within the maze of shophouses \n\nwhereas your chain franchise of yakun/toastbox is easily accessible within walking distance from MRT, or for some even within the mall with strong AC blasting at you\n\nand the queuing experience at coffee shops can get hot af sometimes. you'll be sweaty and sticky just after buying your breakfast kopi set",
          "score": 5
        },
        {
          "text": "if yall in CBD, I guess you will be going for coffees from CoffeeBreak or MadRoaster. Do list your favorite around!",
          "score": 3
        },
        {
          "text": "Early in the morning, the brain is on autopilot. Ya kun and toastbox are usually located more conveniently than say a Kopitiam or Koufu or others",
          "score": 3
        },
        {
          "text": "if you think $6 is expensive you have bigger problems to worry about",
          "score": 3
        },
        {
          "text": "For daily purchases, convenience and comfort is the main factor. Yakun or toastbox in a mall connected to MRT with aircon will be the #1 choice for 95% of consumer over any coffeeshop or hawker stall. Those that go to coffeeshop or hawker stall usually its because it's below their block or on the route they need to walk. Foodcourt usually inconveniently located (top floor, far from mrt exit) as it is meant to be a traffic generator for in between floors.\n\nFor people with time like retirees they will seek out the best coffee shop or hawker stall for better value, but they're only 5% of customers.",
          "score": 2
        },
        {
          "text": "Yakun’s quality is more or less consistent. I always order their steam bread set (IMO, better than the toasted bread)",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1rf2s6m",
      "subreddit": "askSingapore",
      "title": "Torn between internal progression and a better-paying external offer",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rf2s6m/torn_between_internal_progression_and_a/",
      "score": 73,
      "num_comments": 54,
      "created_at": "2026-02-26T14:28:30",
      "selftext": "I have been in my current job for about 3 years. My salary is in the low 4k range, and I am starting to feel bored with the work. I believe I perform well and can usually complete most of my tasks within half a day. I was promoted last year and also received an award this year.\n\nI previously spoke to my manager about exploring new areas, but as I am in an admin role, there is limited progression. I have been actively searching for other jobs over the past year, but nothing worked out.\n\nYesterday, I finally received a job offer. I was excited and was about to start preparing my resignation when my Teams notification came in. My director called my manager, another colleague, and me for a short meeting.\n\nDuring the meeting, I learned that the organisation is setting up a new branch. My manager will be leading it, and they would like my colleague and me to take on new roles as part of the team. The new role does not come with an immediate salary increase, aside from the standard 5 percent annual increment. The job scope has not been finalised, and the role will only start in about 4 months. However, they are able to provide written confirmation, and there is long-term career progression up to senior leadership if I choose to pursue it.\n\nWhat a timing, right ?? !! \n\nThe external job offer pays $600 more and starts in about 2 months. It also has a clear career progression path.\n\nHowever, the new job requires a longer commute of about 1 hour, compared to my current 20 minutes. It has fixed office hours, no work from home option, and fewer annual leave days (18 versus 21).\n\nFrom a purely financial perspective, the new offer is clearly better. That said, my current role offers more flexibility, especially when my child is unwell, and it is much closer to home. Most importantly, the management here genuinely recognises my work and contributions, as shown through the promotion, award, and their awareness of my interests and goals.",
      "comments": [
        {
          "text": "My own opinion. Stay.\n\nBecause to me a few factors.\n\nFor the new internal role, how much trust you have in the information communicated to you? Do you think the management might oversell it to you? If you have a high degree of trust and faith in this new role, then stay.\n\nThe new job offer, to me $600 is not to die for when you're 4.2k\\~. Plus the possibility of the negatives you mentioned. But it depend on how much you really need this + 600.\n\nElse, if you are balls enough, use the new role offer to nego your current.",
          "score": 123
        },
        {
          "text": "The 1 hr commute will eat at you. Daily. Every morning you wake up earlier and sleep later. U will pay this new coy $600 just to wake up later and sleep earlier.\n\nYour kid fall sick, u will damn shag. Cannot wfh somemore.\nEven without the current job changing scopes, i wont do it.\n\nStay.",
          "score": 75
        },
        {
          "text": "If you like the people you are working with and can see a future of remaining colleagues with management, stay. \n\nMost work hell issues (situations that become mentally and physically unbearable) are not over pay.",
          "score": 49
        },
        {
          "text": "I was heavily leaning towards the external offer until you said it's just $600 more, while sacrificing 3 AL, tripling your one-way commute duration while totally losing FWA / WFH. \n\n\nIgnoring your management drawing large biscuits 画大饼 / feeding you potentially empty promises, I'll be inclined to stay if I were u, the jump just isn't enough of an incentive.",
          "score": 34
        },
        {
          "text": "600 more is not worth it for all the hassle. Honestly i would stay. First of all, just wfh and flexibility is worth at least that much, what more the increased commute and the reduced AL. \n\nWhat more your main concern is low pay, no challenge and progression. Additional 600 is not as much when u take into account the increased expense from longer commute and no WFH, and ultimately, 3 lesser AL. In fact you’re losing in term of total compensation. \n\nUnless the new co gives more increment and bonuses, else, with the upcoming challenges u will face in ur current jobs provided it comes to fruition, it’s stupid to even leave.",
          "score": 21
        },
        {
          "text": "I would lean towards staying.\n\nCurrent job: \n-Sees your potential\n-Helps you to take on new role, carving a career direction for you\n-Decent increment \n-Decent culture / relationships / WFH / distance from office\n\nNew job:\n-600 more in salary\n-No WFH\n-Almost 1.5hrs commute extra everyday\n-Fewer leaves\n-Unknown colleagues / culture \n\nI would say that your career growth in a “known” environment will reduce stress compared to jumping for a slightly higher salary now. The loss of benefits is also a huge factor which i think is pretty significant, which i wouldn’t sacrifice for just a 600 dollar pay bump\n\nIntangibles: might not receive increment or bonus in new job until you start to shine. Meanwhile, you’re already in the sights of management in the current place. Don’t lose sight of the big picture for the 600",
          "score": 16
        },
        {
          "text": "the pay increase is not enough to justify a 3x longer commute imo, 120min vs 40min both ways. this is not even factoring the current WFH days and 3 days of AL. $600 is not even 20%.",
          "score": 6
        },
        {
          "text": "Everyone has already given good reasons on why to stay, so I will just add on regarding the no WFH policy for the external offer + lesser ALs. WFH/flexibility beats the $600 increase any day. Plus now you have to factor in 1-hour commute, which I’m assuming is one-way? That’s 2 hours a day, 5 days a week.\n\nI went from a 3-day work week to full work in office last year and I can tell you it’s brutal. I’d do anything to go back to a hybrid structure again lol\n\nAL is also very important, 3 days extra of AL is actually quite substantial, I really don’t think the extra $600 is worth a jump, there will be opportunities in future for better salary increases\n\nStay in your current company, lead the new branch, then jump after gaining experience with this new internal role",
          "score": 4
        },
        {
          "text": "If its not offered here and now, just quit and join the new company. You never know if what your current company's offer will come true, whereas your new offer is here and of higher pay.",
          "score": 3
        },
        {
          "text": "Ok this is also dependent on your age. If you still in 20s can consider your current company offer. If its me in the position, i will stay in my current role assuming there is a clear potential to climb higher upwards, and assuming they r setting up the new branch within the next 1 year, and assuming the new job scope are something thats totally non - admin related which will be good because it puts you in a much better position to exposure yourself and then lead a team in the near future.",
          "score": 3
        },
        {
          "text": "Jump. A current immediate offer is immediately realized. Companies can promise you the moon, then turn around and say \"circumstances changed\" and the offer is no longer valid. Or restructuring. Or shift in priority. Never trust a promise of benefits in the future. Companies only look out for themselves, and you need to do the same for yourself.\n\nEven with written confirmation, they can claim market shifts and company profitability has made the offer untenable. 5% annual increase is $210 per month, a third of $600 for the new offer. Either negotiate an immediate salary increase in line with the promised future role, or switch jobs.\n\nAlso, for Singaporean companies they love asking last drawn salary to peg their offer to that. I changed jobs more frequently than my spouse, and now I'm drawing a higher salary even when she has worked longer than me due to NS.\n\nLink to another of my comments with actual numbers to illustrate opportunity costs:\nhttps://www.reddit.com/r/askSingapore/comments/1rf2s6m/comment/o7he2o1/?context=3",
          "score": 3
        },
        {
          "text": "Typically, unless there is a push factor at your current job, a new job would need to offer a 20% to be a pull. In this case, the new role is clearly not worth it.",
          "score": 2
        },
        {
          "text": "1. If you are still young (20s to early 30s)\n\n2. Income is important factor\n\nPlease jump... my mantra is always to take the black and white offer over promises that may not come\n\nin my early thirties, i was only earning mid $4k, where my bosses promised me a career progression. \n\nhowever i still jumped and now in my late thirties, my pay has reached &gt;$10k after jumping a few more times after.\n\nI do not believe i will have this pay if i stayed at this company because my ex colleagues there is living proof\n\nCircumstances are different for everyone, and i have suffered hell in some jobs, so it really depends on your priority - if kid/wfh is more important, then just stay... because you will never know if your next job is hell until you join them",
          "score": 2
        },
        {
          "text": "After 3 years, low 4k, got award somemore. Are you in the social services? \nI would take the $600. At this stage of your career it is important to have a good pay packet so you can keep negotiating your way up. \n\nI mean come on, you have already spoken to your boss about job scope etc and there has been little headway. Now they are setting up a new department and they can't even incentivise you to do way more work? Setting something up is really difficult -ive spoke to a few who were back of pioneering teams. \n\n\nWhat do you want? You want learn more exposure? Don't mind working like dog but learn many things? I would say if you want that, then stay - it's a good to learn these things early too. \n\nIf you want more money leave. \n\nBoth are good decisions, what are your needs?",
          "score": 2
        },
        {
          "text": "Only if you are being promoted to managerial level. Else take the external offer",
          "score": 1
        },
        {
          "text": "If you have a passion, use the commute as learning time if possible. I don't think they extra 600 is worth is as you'll be spending extra time smelling armpits. 😆",
          "score": 1
        },
        {
          "text": "I would never take the external offer in a million years. No WFH is fine, but office days being a 1 hour commute x 5 days is just way too much. \n\nThat said, I would at least try to feign some dilemma and negotiate a bump (of course depending if the new role is a broadened scope). But even if can't get I'll still stay personally.",
          "score": 1
        },
        {
          "text": "OP, if WLB is your thing, try calculating your pay by hours you actually work. Compare current and new job. That should help you answer if the additional $600 pay increment is worth it. Assume you have to work at least 8 hrs for the new job.\n\nBut IMO, I will stay, learn and get experience for the new project, then update your CV with this new experience and role. Even if it's a title change with no pay increment. You will likely find something that will pay you more than $600.",
          "score": 1
        },
        {
          "text": "Stay,,, dont rock the boat if things are working well so far",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rfamht",
      "subreddit": "askSingapore",
      "title": "What’s the average pay increase?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rfamht/whats_the_average_pay_increase/",
      "score": 48,
      "num_comments": 113,
      "created_at": "2026-02-26T21:48:40",
      "selftext": "How much pay increase % do you get per year? State your role / industry and if you have performance bonus/ AWS.\n\nFor reference, mine last year was \\~10% increment, Marketing Specialist in Entertainment/ Games industry, AWS, no perf bonus\n\nAlso, why SG redditors so stingy\n\n(Dont come at me cuz facts)\n\n2nd edit - P.S. my post is just for benchmark, im not asking to consider if shd stay/ leave. &amp; thanks for the data input :3",
      "comments": [
        {
          "text": "0% increment\n\nNo joke\n\nHave worked for more than 5 years, first time hear no increment\n\nWas told to get contented",
          "score": 120
        },
        {
          "text": "I got increment from 3100 to 3136 after 1 year. Then I apply jobs outside, gotten offer 4000. I left the company, boss and HR wish me well. Months later, call me back and offer 4000. I say don't want. Like wtf? If you have given me a proper increment like about 3600 to 3800 I wouldn't even think of leaving. Now you want to spend more to get the same person back or take a bet on a new hire? Ok lor....",
          "score": 118
        },
        {
          "text": "Guys dont feel bad about 0 percent increment ok. Our minister pay has not been adjusted since 2012. They together in the same boat as u all. Stay strong guys",
          "score": 67
        },
        {
          "text": "8 yrs in same company. 3% most years. 7% once was an anomaly. 10% when I changed dept. This year 4% as top performer. Sad. Should jump ship soon.",
          "score": 36
        },
        {
          "text": "10 dollars per year. Not joking.",
          "score": 21
        },
        {
          "text": "Hey you can't take without giving, maybe start by giving?",
          "score": 20
        },
        {
          "text": "0% for the last three years. Various reasons (company not doing good; economy bad; my own performance/team performance/comapny performance is average)",
          "score": 16
        },
        {
          "text": "idk but last year i didnt get any increment",
          "score": 8
        },
        {
          "text": "semicon, was told when i first joined that the industry standard was 5%. \nwhen i joined 10 years ago, my then director could not meet my expected salary. he was very nice though, he gave me the maximum increment of 5% yearly without\npromotion, while my seniors get only 2-3%. \nhe left and somehow his successors all maintained the 5% increment until last year when we had to tighten our spending. that was the lowest at 3% and my seniors told me they get only 1%. \n\nhowever i had colleagues who got 10% increment during their promotion but i got only 7% because i suay, got promoted during COVID.\n\nedit: i have aws and performance bonus too. maybe estimate 3 months",
          "score": 7
        },
        {
          "text": "Happy stay, not happy find a new one and leave. Sometimes it isn't about the money. \n\nIf you find you are underpaid, check the stats online for your role + position. \n\nI stayed because is full remote job though I am 30% underpaid compared to market.  ",
          "score": 7
        },
        {
          "text": "Usually 3% for back office I find.\n\nJumping gives 10-20% so I chose to move more often to adjust my salary instead.",
          "score": 5
        },
        {
          "text": "10% last year. From a low base of 3900",
          "score": 5
        },
        {
          "text": "Why every week got different Redditor ask exactly same question and make me cry repeatedly for having 0% increment every year? You all so cruel to me 😭😭😭😭",
          "score": 4
        },
        {
          "text": "15 years in same company. Increment ranges from 1% to 3%.\n\nNo aws but has bonus ranging from 2 months for bad years to 7 months for good years.",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1rf7257",
      "subreddit": "askSingapore",
      "title": "Would non smoking housing estates be feasible in Singapore?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rf7257/would_non_smoking_housing_estates_be_feasible_in/",
      "score": 47,
      "num_comments": 74,
      "created_at": "2026-02-26T18:50:22",
      "selftext": "Just some random thoughts as I walked home while being annoyed by void deck smokers.\n\nAs per the title, be it private or public housing. Maybe it would make less sense for private housing since the resulting customer pool is smaller, but at the same time would people be willing to pay slightly higher prices for the assurance of a smoke free neighbourhood?\n\nAnd of course, stricter rules, stricter penalties if caught smoking within the neighbourhood but always with the caveats of whether rules will ever be enforced properly.\n\nTo the considerate smokers, no offence, i just much prefer breathing clean air. To the inconsiderate smokers, please be considerate and think about other people’s lungs.",
      "comments": [
        {
          "text": "Why is it that non smokers need to be penalised just because of smokers?\n\nI see no reason non-smokers need to pay a premium for a smoke free neighbourhood. This should be a norm.\n\nIf anything, smokers need to pay the premium to buy ulu flats if they want to carry on smoking.",
          "score": 87
        },
        {
          "text": "I've stayed in non-smoking condos in Canada, it works for the most part, but those who dgaf about others will smoke regardless. \n\nSmoker apologists will downvote me, but we should just outright ban smoking like vaping. It's a vice with no benefits, that directly harm other's health. Innocent bystanders suffer for the selfish smokers enjoyment.",
          "score": 78
        },
        {
          "text": "id rather just have a smoking booth (those enclosed ones at airport) at void deck and anyone caught smoking less than 30m from hbd will get caught by cctv and -10000 social credit (aka fine $500 sent to their doorstep)",
          "score": 22
        },
        {
          "text": "Just ban smoking. Maybe sponsor some free rehab for the smokers who think they can’t quit after the ban.",
          "score": 14
        },
        {
          "text": "Just make it like hotel. Make a small smoking corner downstairs and implement non smoking throughout. Imagine all the buggers smoke until the whole house contaminated then wait 5 year MOP flip to some poor couple with a young kid? \n\nAs a social smoker myself I say all smokers are fucking pricks. Smoke at bus stop at carpark then litter in their own neighbourhoods. Absolute trash behaviour. Find a bin and clear up your own mess and never ever inconvenience others.",
          "score": 11
        },
        {
          "text": "Not a smoker myself, but I feel the tobacco tax increment of 20% more than the current retail price is the ‘penalty’\n\nThis pretty much is a very strong move from the government to discourage smoking\n\nThey wouldn’t want to spend money to have a task force to enforce the penalties, or the whole mountainload of admin to get HDB to set up this task force. Confirm taichi to town council or taichi to some other government enforcement group. \n\nI mean I get what you mean, but this country is super pragmatic…. Unfortunately or fortunately.",
          "score": 8
        },
        {
          "text": "Void deck smoking is illegal btw.\n\nFuck those loser addicts",
          "score": 4
        },
        {
          "text": "Idea. Keep the smokers in Tengah or Jurong island lol",
          "score": 3
        },
        {
          "text": "Non smoker here but smokers are gonna smoke no matter what you try to do unless you ban it. Even if they tax 200% instead of 20%.  In light of this, I think to minimise impact on the rest of us, they should just create spaces dedicated for smoking away from more communal areas. I just dont want to see these people or smell their disgusting cigarettes, but everytime I've confronted a smoker under my window, they get angry and defensive at me. ",
          "score": 2
        },
        {
          "text": "If the smoker population is 10% as the statistics I found claim, then surely it is feasible. And since it is a non-smoking estate, surely they cannot give lousy excuses like it's smoker's right to smoke inside their house.\n\nNobody has the right to pollute the air.",
          "score": 2
        },
        {
          "text": "You’re describing condominium complexes",
          "score": 2
        },
        {
          "text": "It is unlikely. My block has seen an increase in rental tenants from other countries of late. The habits they bring include smoking at their windows. You can't change these mindsets easily from their practices in their home countries.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rf8z8g",
      "subreddit": "SingaporeRaw",
      "title": "Sinkie men lowest life form",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rf8z8g/sinkie_men_lowest_life_form/",
      "score": 380,
      "num_comments": 94,
      "created_at": "2026-02-26T20:34:21",
      "selftext": "Sinkie guys spend close to 2 years in green, tekan under sun, put studies and career on hold, miss internships, delay graduation, lose earning power during the most critical compounding years of our lives.\n\nAfter that? Still got ICT every year, IPPT, call-ups that mess with work schedules, reservist cycles that drag on for a decade or more.\n\nMeanwhile, recently i came across a young Msian chinese couple who got their Singapore citizenship. Both working here and got their BTO. They openly talked about how they plan to maximise the system here and cash out in future and potentially retire back in Malaysia.\n\nThe guy never served NS.\n\nEnjoying the same passport. Same stability. Same benefits. Same safety we literally helped defend.\n\nBuilt partly on the backs of the guys who had no choice but to serve.\n\nAnd before anyone says “don’t blame them” — I’m not blaming them . If the system allows it, obviously people will optimise. Anyone would.\n\nBut tell me honestly — are Singaporean men not supposed to feel salty?\n\nFYI, i don’t belong to the 65%",
      "comments": [
        {
          "text": "How come Korean men are praised for their military service, even coming across as sexy?\n\nMaybe change the conversation around this to benefit ourselves",
          "score": 110
        },
        {
          "text": "Both singapore citizenship?",
          "score": 46
        },
        {
          "text": "Spend so much on Military. Malaysia just want to come earn SGD and go home. Malaysia no reason to bomb SG",
          "score": 41
        },
        {
          "text": "Training to be soldiers\nFight for 1%\nOnce in our life\nTwo years of our time\nHave you ever wondered\nWhy must we serve\nBecause pap love ft\nAnd you can all go eat shit go eat shit, AH",
          "score": 40
        },
        {
          "text": "Every month sure got one post on this.",
          "score": 30
        },
        {
          "text": "Someone just verbalised my feelings. Thanks OP",
          "score": 28
        },
        {
          "text": "this is the uncomfortable truth evryone (except sg males) refuse to acknowledge. because the colourful lie of national pride is much easier to digest",
          "score": 15
        },
        {
          "text": "Hey, don't talk so much.  according to the 65%,  foreigners who serve two weeks in the volunteer corpse is the equivalent to u serving two years in NS hor!",
          "score": 12
        },
        {
          "text": "Because the minute we SG men are born on this island, Mindef stomp through the baby viewing room and stamp one big stamp on your forehead saying \"Property of Mindef\" with a disclaimer in red fine print saying *Unwrap at age 18 for NS!*",
          "score": 10
        },
        {
          "text": "That’s why sinkie men need to faster bto, rent out, then buy house/rent in JB and song song gao Austin. \n\nMake friends with JHKs to get lobangs instead of constantly shitting on them u dumb fucks. \n\nLife’s good.",
          "score": 10
        },
        {
          "text": "then never do ippt kena charge. haiya tired",
          "score": 8
        },
        {
          "text": "In all honesty though, as much as I hate that 2 years NS. Being in SCDF helps me out with work due to me understanding Fire Science, Fire Engineering and how SCDF system works as a whole. To each their own though. Still hate the mandatory 2 years.",
          "score": 7
        }
      ]
    },
    {
      "id": "t3_1rf85l4",
      "subreddit": "SingaporeRaw",
      "title": "PAP to punish Singaporeans with more foreign imports due to record low 0.87 TFR",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rf85l4/pap_to_punish_singaporeans_with_more_foreign/",
      "score": 326,
      "num_comments": 140,
      "created_at": "2026-02-26T19:52:25",
      "selftext": "PAP essentially saying that low TFR is Singaporeans' fault, not due to their failed policies. But even PM himself also no kid, didn't contribute to TFR, maybe salary not high enough, need to pay all ministers $1M more a year then maybe they will consider having kids.",
      "comments": [
        {
          "text": "Then watch how these new citizens vote for the PAP, cementing their majority hold and allowing them to ram through policies that don’t benefit the average Singaporeans.",
          "score": 262
        },
        {
          "text": "30k new citizens per year &gt; number of sinkies born each year. \n\n**Question:** Why bother to defend and die for a country that actively replaces natives with foreign imports? What are you defending in the first place?",
          "score": 124
        },
        {
          "text": "I wldnt mind if they gave it to the right people. But I know COUNTLESS, and I mean really I know personally, at least 50\\~ people(men), served NS, born and lived here all their life as PR, but denied citizenship, even post NS, in uni, or working. Theory stands, most of these people ik are from more \"undesirable\" countries. Ridiculous",
          "score": 111
        },
        {
          "text": "Telling u from parliament this is coming sinkie. U suck thumb and accept",
          "score": 99
        },
        {
          "text": "https://preview.redd.it/yvyczvnlvtlg1.jpeg?width=846&amp;format=pjpg&amp;auto=webp&amp;s=f4b8483d0083b350a0e5262faf0baef61048239b",
          "score": 85
        },
        {
          "text": "Big slap in the face for our NSFs.",
          "score": 71
        },
        {
          "text": "NS FOR SINKIES, JOBS AND PRIORITIES FOR FOREIGNERS AND NEW CITIZENS",
          "score": 57
        },
        {
          "text": "Get out while you can. Writing has been on the wall for a long time liao.",
          "score": 57
        },
        {
          "text": "Overcrowding is the main reason for low TFR, so this is just exacerbating the issue.",
          "score": 34
        },
        {
          "text": "Such a bs excuse. They are importing 30k pmets, not importing 30k kids. These pmets does nothing to improve our tfr, but only serve to compete with locals. ",
          "score": 28
        },
        {
          "text": "https://preview.redd.it/4m4e8b8h8ulg1.jpeg?width=750&amp;format=pjpg&amp;auto=webp&amp;s=dc5f908241c91270c5af5bc5f28a438e219f825d",
          "score": 28
        },
        {
          "text": "They know they losing true blue Singaporeans vote. Damn disgusting",
          "score": 27
        },
        {
          "text": "Letting us die out in army during war while you flee the country with your elites",
          "score": 24
        },
        {
          "text": "It doesn't take a genius to realize that importing new citizens is what drove Singaporeans low TFF even lower.\n\nOnce again, the majority of our government proved themselves to be incompetent.",
          "score": 22
        },
        {
          "text": "Guess what? All national service exempted",
          "score": 14
        },
        {
          "text": "I kinda had it with people to be honest. This is not a new thing, this is not a new policy or something. Yet people continue to vote for this. Jayaretnam is spot on about politics here.\n\nPeople only get concerned when the iPhone 17 pro max 2tb, labubu etc is out of stock. The level of apathy Esp political apathy is shocking.",
          "score": 14
        },
        {
          "text": "https://preview.redd.it/idaowjclhulg1.png?width=1080&amp;format=png&amp;auto=webp&amp;s=2e38bd5a4ea290e9069ee8428fa6cb0e9c945c25\n\nyou look at this graph of population increase and place it next to the graph of declining TFR and you know that immigration does not solve the problem, increasing population did not increase TFR at all. what will happen is that you'll have a massive ageing population problem down the road and a massive ageing population to support. then you will say that healthcare cost are increasing and need to raise taxes again.\n\nif you superimpose the graph of rising property prices, cost of living with the TFR you will see some correlation.\n\nby running the country like a spreadsheet or a corporation, they have essentially screwed our future, we will have a massive ageing population, crowded infrastructure, long waits for healthcare and depending on handouts.",
          "score": 14
        },
        {
          "text": "If Singapore go to war, its on its own",
          "score": 13
        },
        {
          "text": "SG COOLIES REALLY SECOND CLASS CITIZENS",
          "score": 10
        },
        {
          "text": "That is 600 per week",
          "score": 10
        }
      ]
    },
    {
      "id": "t3_1rfezc5",
      "subreddit": "SingaporeRaw",
      "title": "Should you be so comfortable in public?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rfezc5/should_you_be_so_comfortable_in_public/",
      "score": 320,
      "num_comments": 137,
      "created_at": "2026-02-27T00:35:33",
      "selftext": "This is vivo city, not your house. If you want to behave like this, you should go home. All the way home. Where you can act however, whenever, wherever.",
      "comments": [
        {
          "text": "Import the third world, become the third world.",
          "score": 336
        },
        {
          "text": "Side topic but I think there's less and less seating places in malls nowadays",
          "score": 204
        },
        {
          "text": "Try to post that in r/singapore 🤣🤣🤣",
          "score": 117
        },
        {
          "text": "This is the kind of behaviour pap wants you and me to integrate with and then says WE COOLIES singaporeans are uncivilised and that WE commit more crimes",
          "score": 103
        },
        {
          "text": "https://preview.redd.it/9qzfarndbvlg1.jpeg?width=760&amp;format=pjpg&amp;auto=webp&amp;s=b69d3b39caa98cc240a91915482c01f60937b64a",
          "score": 89
        },
        {
          "text": "Singh Apoor",
          "score": 86
        },
        {
          "text": "Nobody dares say anything lest it be deemed “racist” for calling them out. \n\nCoupled with the fact SG is pro-foreigner and the system has been set up in such a way to social engineer the local masses to be “tolerant” (more like keep your mouth shut, or else) of such uncivilized behaviour. \n\nThe rise of the global woke movement isn’t helping either.\n\nSinkies are truly cucked to the core, both by foreigners and its own government (and people).",
          "score": 68
        },
        {
          "text": "Can not say anything, if said something must kena racist",
          "score": 43
        },
        {
          "text": "At least the shoes stayed on 🤮",
          "score": 31
        },
        {
          "text": "Guessed correctly ",
          "score": 23
        },
        {
          "text": "![gif](giphy|Ldtx0KB7YavfZAfwpB)",
          "score": 21
        },
        {
          "text": "Whenever you want to buy Coach brand, show them this image. You'll get discount.",
          "score": 21
        },
        {
          "text": "![gif](giphy|FXf1lYQ2tFouxeLb1B|downsized)",
          "score": 21
        },
        {
          "text": "Smell the armpit fragrance PAP favourite",
          "score": 13
        },
        {
          "text": "PAP importing more of then to give them citizenship",
          "score": 8
        },
        {
          "text": "It’s their country now",
          "score": 8
        },
        {
          "text": "Ceca burger buy 1 get 1 free.. Available in Upsize too",
          "score": 6
        }
      ]
    },
    {
      "id": "t3_1rf3jb0",
      "subreddit": "SingaporeRaw",
      "title": "\"wE PrIorItiZe LoCals FirSt\", \"No ViSA SpOnSorShiP ReQuIREd\"",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rf3jb0/we_prioritize_locals_first_no_visa_sponsorship/",
      "score": 322,
      "num_comments": 82,
      "created_at": "2026-02-26T15:11:56",
      "selftext": "",
      "comments": [
        {
          "text": "Try to post that in r/Singapore 😆 🤣 😂",
          "score": 108
        },
        {
          "text": "Sad to say but this is true. Went so many interviews and no follow up from recruiters anymore. After a while I  understand their pattern. HR is forever posting “ghost” jobs on mycareersfuture or other sites just to look like they are supporting the govt initiative of “hiring” locals. In fact, they already have someone in mind from “that” particular country.",
          "score": 75
        },
        {
          "text": "[removed]",
          "score": 26
        },
        {
          "text": "![gif](giphy|Ldtx0KB7YavfZAfwpB)",
          "score": 25
        },
        {
          "text": "NS for sinkies, jobs for?",
          "score": 19
        },
        {
          "text": "![gif](giphy|SZkgv3dkxUAqbLHIuJ)",
          "score": 17
        },
        {
          "text": "Every unemployed Singaporean when voicing out concerns.. gov always repeat like a bloody parrot...\n\nhttps://preview.redd.it/8hrkl5d2wtlg1.jpeg?width=640&amp;format=pjpg&amp;auto=webp&amp;s=799856a5c32562770713b92f441eb04b054301b1",
          "score": 13
        },
        {
          "text": "Nice memes. Totally agreed",
          "score": 9
        },
        {
          "text": "It has been 20 days since the chinatown accident. Has anyone heard any news?",
          "score": 8
        },
        {
          "text": "MOM knows all about this too. But they do nothing.",
          "score": 6
        },
        {
          "text": "Legit tho. I apply for a company in Sg that deals with students from China. They call me in Chinese and ask a bunch of questions. I replied in Chinese. Things were going smoothly, they are asking when I can start, why I left my old job, whats my current pay and expected pay, tell me they might not be able to pay as much but will, job expectations. Then suddenly it took a nosedive with “啊，不好意思，我这里看你是本地人啊。没关系现在也不急我们等新年后再安排面试看吧”",
          "score": 6
        }
      ]
    },
    {
      "id": "t3_1rfpydu",
      "subreddit": "SingaporeRaw",
      "title": "How am I to feel patriotic defending a Singapore that is not Singaporean?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rfpydu/how_am_i_to_feel_patriotic_defending_a_singapore/",
      "score": 217,
      "num_comments": 81,
      "created_at": "2026-02-27T07:20:39",
      "selftext": "\"Singapore expects to take in between 25,000 and 30,000 new citizens a year over the next 5 years,\" said Deputy Prime Minister Gan Kim Yong.\n\nIf the people around me don't share my roots or my sacrifice, what exactly am I defending? How am I to feel patriotic defending them?\n\nWhile we are outfield, new citizens are already entering the workforce, gaining a 2 year career head start. 2 years of promotions, 2 years of experience. How am I to feel patriotic when it feels like a disadvantage for being born local?\n\nCitizens make up about 60% of our 6.1 million population. The rest are PRs and work pass holders. Less than 20% of the people currently living in Singapore have ever carried the physical burden of defending it.\n\nLook at South Korea for comparison. South Korea is facing a worse TFR, hitting a record low of 0.72 but is rebounding to 0.80 due to supportive policies. Unlike us, they haven't leaned as heavily on immigration to take the easy way out.\n\nWhen I’m in the jungle, I’m not defending a GDP figure. I’m defending my family and my loved ones who grew up with me.\n\nSo when will it be enough? 6.9m? 8m? 10m? When the Singapore population drops to 40%? 20%? When each minister has 2 cars and 1 GCB?\n\nHow am I to feel patriotic?",
      "comments": [
        {
          "text": "If people that come in integrate with us they are immigrants. If people come in and expect us to integrate with them, they are invaders. Already full of invaders.",
          "score": 141
        },
        {
          "text": "I feel the same as you. There are reasons why Singaporeans opt not to have more children... there are reasons why Singaporeans don't watch National Day Parades anymore... Half the work force are people from PRC, India, vietnam and myanmar... So many cases of Singaporeans bullied by foreigners and yet we are told to be more forgiving to them so they can blend in.... I don't even recognise my country when I go out now, having a meal and the next few tables are loud PRCs talking and making a scene... Thank you PAP.",
          "score": 128
        },
        {
          "text": "You dont have to worry. When the shit hit the fan, the FTs will be on the first flight out of SG.",
          "score": 73
        },
        {
          "text": "ex-CDO here, used to be really proud of serving my country and being able to do more to help defend her. Even wore no.1 for NDP.\nNow? if war comes, i am leaving or not fighting. I DO NOT feel patriotic nowadays, even stopped watching NDP since after Covid. PAP must realise for economic growth they have sacrificed the Singaporean Core.",
          "score": 43
        },
        {
          "text": "This message has been there on EDMW for 20 years.\n\nNext cycle of EDMWers are here.\n\nI feel so old...\n\nSo let's sing the EDMW anthem!!!\n\nWho did you vote for ?",
          "score": 32
        },
        {
          "text": "Singapore is now just a company for the govt to make more money. The people are the workers.",
          "score": 30
        },
        {
          "text": "Best part, despite all the budget surplus, they can't even give NSF a fair allowance. Also, tax incentives for NSmen is honestly a joke, seeing it just makes my blood boil",
          "score": 30
        },
        {
          "text": "# When each minister has 2 cars and 1 GCB?\n\n1 GCB? Research again, many have several properties earning passive incomes.\n\nI had a friend whose wife was an ex-varsity mate of an MP who held an official appointment (not a minister). She (yes, it was a 'she') whined to her (friend's wife) about the high cost of living, \\*and not making enough, but owned and leased out several properties, while sending her children overseas for education.\n\nI was \"WTF\", what about us peasants?\n\nEdit: \\*and not making enough",
          "score": 24
        },
        {
          "text": "You're defending Minister Gan Kim Yong's salary of $1m+ per year. You don't feel patriotic doing that? Maybe one day, you too could rise to become a meritorious minister making a million.",
          "score": 23
        },
        {
          "text": "Its never gonna be enough because human greed is endless. Valuing kpi and gdp over the wellbeing of your citizens will never have a good ending. If no changes are made, what is meant to happen will happen eventually.",
          "score": 23
        },
        {
          "text": "150k new voters for a voter base of 2.5m. that's around 5% of new PAP votes. This is the main objective.",
          "score": 20
        },
        {
          "text": "It's a big fat joke Lor.  Low birth rate, who caused it one?  Then try to solve it by what?  Doing the same freaking thing that causes it in first place.  \n\nNo one is giving birth or having kids coz every year, govt got surplus after surplus.  What's the link you ask, cox everything is so bloody expensive.  \n\nYou got compute how much one need to raise a kid in Singapore and most rationale and logical person will say Noooooooooo..........\n\nAnd what about Indranee heading the committee to tackle this?  She is single For Heaven's sake....no one else who is married that know the pain or cost of raising a child in Singapore within PAP to head it? \n\nAlso, can we have a fixed or constant Education Minister a not?  Keep changing a few years.  CCS established himself already and I felt positive and now that DL came in....come in and do what?  Wait and watch again like what he did at HDB?  \n\nStill tell us must pay good money when they can't even find a right fit candidate for the role.  Joke....Minister who is single to tackle why Singaporeans not having kids......hahahahaha",
          "score": 16
        },
        {
          "text": "when war comes, round them up and ask \"what kind of singaporean are you?\"",
          "score": 12
        },
        {
          "text": "Do they even know how to sing majulah singapura or say the pledge.. \nAsk any new citizen randomly to say either one of it.. \nThey can be \"new citizens\" on paper but def dont hold patriotism to the soil..\n\nDo you think any of them will take up citizenship if they made serving NS a compulsory requirement for new citizens.. Hardly none will..",
          "score": 12
        },
        {
          "text": "You wear green, serve your 2+10 years slave sentence or you go to prison.  \n\nThat’s the system in place that the majority voted for.",
          "score": 9
        },
        {
          "text": "Not to mention the half of the \"citizens\" that have no responsibilities but even more privileges than the men.",
          "score": 9
        },
        {
          "text": "You are just a useful drone",
          "score": 9
        },
        {
          "text": "it's a company with lowly paid guards",
          "score": 9
        }
      ]
    },
    {
      "id": "t3_1rf9f6j",
      "subreddit": "SingaporeRaw",
      "title": "Singaporean male go into society still have to fight with 30k new citizens for jobs after losing two years to servicing national service.",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rf9f6j/singaporean_male_go_into_society_still_have_to/",
      "score": 200,
      "num_comments": 54,
      "created_at": "2026-02-26T20:55:49",
      "selftext": "After NS and university, at around 25 years old, you start your first job. Meanwhile, a new citizen of the same age(NS exempt)may already have two years of work experience and could be your senior. Sinkie is New Citizen ka kia",
      "comments": [
        {
          "text": "Basically someone is selling out countrymen for the sake of their GDP bonus.\n\nBut no suprise, the first PM was a sell out in WW2 to the invaders.",
          "score": 117
        },
        {
          "text": "Training to be soldiers\nFight for 1%\nOnce in our life\nTwo years of our time\nHave you ever wondered\nWhy must we serve\nBecause pap love ft\nAnd you can all go eat shit go eat shit, AH",
          "score": 35
        },
        {
          "text": "https://i.redd.it/2gmqfwviaulg1.gif",
          "score": 23
        },
        {
          "text": "Don’t forget after NS still have reservist.",
          "score": 20
        },
        {
          "text": "Serve NS to be treated like fourth class citizen",
          "score": 13
        },
        {
          "text": "https://i.redd.it/by92g6mzevlg1.gif\n\n",
          "score": 10
        },
        {
          "text": "For GDP!",
          "score": 10
        },
        {
          "text": "30k too less already. If PAP wants to self destruct faster then tell them to bring in 100k annually and go beyond the quota",
          "score": 9
        },
        {
          "text": "Well, as a man attempting to move up in the world, you learn that life is unfair.",
          "score": 7
        },
        {
          "text": "How about this suggestion - we get new citizens to serve NS so that they free up our natural born Singaporeans to actually pursue high value work. Why don’t they do that? Then you have committed new citizens too.",
          "score": 3
        },
        {
          "text": "![gif](giphy|46aI3IITWh107aQtBR)",
          "score": 2
        },
        {
          "text": "your chance to retify this has passed. ",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rfacc0",
      "subreddit": "SingaporeRaw",
      "title": "Thanks 65%, you're the problem not the solution.",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rfacc0/thanks_65_youre_the_problem_not_the_solution/",
      "score": 168,
      "num_comments": 48,
      "created_at": "2026-02-26T21:36:38",
      "selftext": "Name me one policy since last election not even a year ago that benefits Singaporeans.\n\nNONE.\n\nMost of which is increase here and there.\nTax here and there.\nMore foreigners here and there.\n\nPAP Govt have the audacity of asking ministerial pay increases.\n\nNow, the failed taskforce man said no guarantee of job growth in future and now, he said 25-30k new citizens from now till 2030, coincidentally next election for new citizens to vote for PAP.\n\nThanks to doofus 65% for your hard work.",
      "comments": [
        {
          "text": "Before you know it, the 65% has grown to 75%...",
          "score": 83
        },
        {
          "text": "Home away from home n surrounded by foreigners.... unfortunately that's our fate ... 😕 😔",
          "score": 33
        },
        {
          "text": "Immigration much easier than getting Singaporean to have kids bro. Must think of cost effectiveness",
          "score": 32
        },
        {
          "text": "Kumgong 65%  fkers",
          "score": 23
        },
        {
          "text": "Kinda no choice to amend this lol we are on a fixed timeline the very definition of singaporean has now changed, people are just too comfortable ig",
          "score": 20
        },
        {
          "text": "https://preview.redd.it/3mzff135uulg1.jpeg?width=846&amp;format=pjpg&amp;auto=webp&amp;s=ecccdfd5914dd490f1d62a15a7aacaabc14e9acd",
          "score": 18
        },
        {
          "text": "Therefore it’s a catch 22 to have kids or not. Kids will face a tough future. But if not enough kids, foreigners will be brought in to substitute. Even if you wanna have kids the expenses of bringing up a kid is astronomical. Education is one big chunk already. \n\nNo doubt sg is safe and relatively more functional than most countries. But I doubt the happiness is real. Mostly materialistic. And most importantly it’s a long grind till old age here. But there are some old people who would still like to exercise collecting cardboards lah (sarcasm)",
          "score": 17
        },
        {
          "text": "rest assure that 2030 they will give out more food stamps and vouchers. then that year stop the foreigners coming in. Go GE landslide win again. daft sinkies",
          "score": 15
        },
        {
          "text": "And they’re justifying getting a raise! Their highest in the world, inflation proof for years “bonus” from civil service whom they mentioned cannot be measured in dollars and cents!",
          "score": 13
        },
        {
          "text": "For all we know, the 65% may have comprises 30% new citizen already from all the past 30 years of 20k to 30k annual imports. In 5 years time, with the additional 200K , sure win for them. Cannot guarantee jobs but can guarantee more foreigners will be here to take jobs else how they survive?",
          "score": 12
        },
        {
          "text": "Have to wait till Year 4 and 5 before they announced benefits for Singaporeans. Same game every 5 years",
          "score": 10
        },
        {
          "text": "Lol someone called petronas towers is complaining about sg policy ",
          "score": 10
        },
        {
          "text": "Well, the country still prospers but the people suffers",
          "score": 7
        },
        {
          "text": "https://i.redd.it/woavkn1prulg1.gif\n\nThis is what the pap wants. Fighting among the people.",
          "score": 6
        },
        {
          "text": "If you think the 65% is from true blue singaporeans... you are mistaken",
          "score": 5
        },
        {
          "text": "Indranee to solve this problem? Shows you how much they care about it\n\nHahah",
          "score": 5
        },
        {
          "text": "Haha now you know, actually more on unemployed or underemployed or complain ones that did not vote wisely at fault.\n\nThose got a good pay job, good life and etc , of course it makes sense to vote PAP",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1rf4ybe",
      "subreddit": "SingaporeRaw",
      "title": "Grab driver suspended for driving with passenger in car after tyre burst",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rf4ybe/grab_driver_suspended_for_driving_with_passenger/",
      "score": 125,
      "num_comments": 30,
      "created_at": "2026-02-26T16:38:46",
      "selftext": "https://mothership.sg/2026/02/grab-driver-suspended-burst-tyre/",
      "comments": [
        {
          "text": "Hey can film herself screaming since this is called Car Turbulence!",
          "score": 68
        },
        {
          "text": "die die must complete the job or won't get incentive bonus. Grab for life.",
          "score": 32
        },
        {
          "text": "why on earth would the driver risk further damage to the vehicle by continuing to drive with the burst tyre?",
          "score": 27
        },
        {
          "text": "&gt;Vivian Goh\n\nhttps://preview.redd.it/mspospfj4tlg1.png?width=755&amp;format=png&amp;auto=webp&amp;s=c1ce4453e6ce5dd637753e0d0b82344fd1d14ef0",
          "score": 19
        },
        {
          "text": "This is like mormon soaking method lmao",
          "score": 10
        },
        {
          "text": "noticed alot of PHV cars are in really bad shape. LTA r u sleeping the job again?",
          "score": 7
        },
        {
          "text": "At this point, maybe consider belting up too",
          "score": 5
        },
        {
          "text": "The girl is legit chio.",
          "score": 5
        },
        {
          "text": "Driving on a flat tyre will damage the rim and suspension. Don't know what the Grab driver was thinking.",
          "score": 4
        },
        {
          "text": "there was no rubber on the wheel...? that's not just punctured, that tyre was completely shredded lol...",
          "score": 2
        },
        {
          "text": "Is it the car sound system , bass booster?",
          "score": 1
        },
        {
          "text": "WHY IS THE WOMAN NOT WEARING SEATBELT????? ...😎",
          "score": 1
        },
        {
          "text": "At one time I thought it’s music *lol … on the other hand, she’s quite cute.",
          "score": 1
        },
        {
          "text": " I didnt give ya any permission to film me driving, mind your business",
          "score": 1
        },
        {
          "text": "Hmmm....so like something something......IYKYK.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rf2yqt",
      "subreddit": "SingaporeRaw",
      "title": "What is the point studying Accountancy in NUS, NTU and SMU if the employment results are similar?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rf2yqt/what_is_the_point_studying_accountancy_in_nus_ntu/",
      "score": 76,
      "num_comments": 39,
      "created_at": "2026-02-26T14:39:09",
      "selftext": "",
      "comments": [
        {
          "text": "Same goes with \"what is the point of living if the end result is dead\"",
          "score": 172
        },
        {
          "text": "What's the point of studying accountancy when SG big 4 filled with bolehland? Might as well rename is to Big 4 Bolehland instead",
          "score": 77
        },
        {
          "text": "What’s the point of even studying Accounting today?",
          "score": 23
        },
        {
          "text": "The entry requirements have really dropped over the years. It's like a dumping ground for business schools. CA Singapore also promoting their own CA SG qualification, easier transition for poly grads to enter.",
          "score": 19
        },
        {
          "text": "What is the point of Fing girls when you F yourself?",
          "score": 12
        },
        {
          "text": "This era still got people want to go for Accountancy",
          "score": 12
        },
        {
          "text": "What can sinkie offer over a bolehland that is deserving of the price premium?\n\nSame for civil engineering as well",
          "score": 10
        },
        {
          "text": "should have uni open house soon, go there and ask them?",
          "score": 9
        },
        {
          "text": "Thats why I am BBFA. Big boycotter for accountancy",
          "score": 7
        },
        {
          "text": "Whats the point of studying when u can just sleep or politics to a vp strategy role?",
          "score": 7
        },
        {
          "text": "What is the point of life?",
          "score": 6
        },
        {
          "text": "Time to lay flat",
          "score": 5
        },
        {
          "text": "Kind of stupid that they correctly use MEAN here but used MEDIAN to report salary for experienced workers",
          "score": 5
        },
        {
          "text": "You sound like my son. Every single morning, he would ask me why the school starts so early and why he even needs to go to school. 😅",
          "score": 4
        },
        {
          "text": "What is the point of this post if the number of replies are low?",
          "score": 4
        },
        {
          "text": "What the point of this question",
          "score": 3
        },
        {
          "text": "Who said there was a point in the first place 🤨",
          "score": 3
        },
        {
          "text": "Uh. Interests?",
          "score": 2
        },
        {
          "text": "What's the point of studying in top rank autonomous unis when jobs are given to others studying lower ranked overseas unis?",
          "score": 2
        },
        {
          "text": "Is this salary inclusive of employer contribution? \nIt looks awfully low.",
          "score": 2
        },
        {
          "text": "Don't know why singapore salaries so low despite very high standard of living",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1rfcxr4",
      "subreddit": "SingaporeRaw",
      "title": "A national referendum must be held on the population target",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rfcxr4/a_national_referendum_must_be_held_on_the/",
      "score": 71,
      "num_comments": 41,
      "created_at": "2026-02-26T23:20:47",
      "selftext": "This is the single most divisive topic in the country that could shape the nation’s future in irreversible ways.\n\nLet’s not hide behind political affiliations, promises of election goodies, feel good speeches and mindless personal attacks. Let the people address this topic head on and deal with the consequences that follow.\n\nNo to 30,000 per year.\n\nReposting here as it was deleted from r/Singapore ",
      "comments": [
        {
          "text": "Ceca so angrily debated also no referendum\n\nEven ah gong old house they also heck care, what's a population target?",
          "score": 47
        },
        {
          "text": "The average Singaporean have no issues letting someone like NCM leading them (as seen in SMC Jalan Kayu) due to political apathy. Even a referendum would be pointless.",
          "score": 31
        },
        {
          "text": "Welcome to the club. \n\n  \nAnd unfortunately, there will not be a referendum.\n\n  \nAnd even if there is a referendum, I think most people are too dumb to understand what its about.",
          "score": 19
        },
        {
          "text": "https://en.wikipedia.org/wiki/Population_White_Paper\n\nunfortunately 65 percent voted for this\n\ni think they are not really concerned about fewer Singaporeans in future, rather they are more concerned about the economy, they need younger people to work and support the older people so that the government doesn't have to do it. They don't care about our Singaporean way of life or you and me, they are concerned about Singapore Inc. If the TFR could be increased by job protection for Singaporeans, cheaper housing, free primary education and tuition, they still wouldn't do it because it's more expensive than importing. Everything is about money to them, it's never about you and me.",
          "score": 16
        },
        {
          "text": "That national referendum was the last election. To be exact it was in West Coast GRC where a party who was determined to fight for locals were destroyed by the traitors action party. \n\nMove on. 65% loves foreigners and traitors",
          "score": 10
        },
        {
          "text": "They literally changed the constitution for the \"selected\" presidency without a referendum. Guess who voted for them back in again in the 2020 General Election?",
          "score": 5
        },
        {
          "text": "When I came across this news I knew they are on target to hit the 10 million to feed the population ponzi. Blaming us for the low birth rate, when Singapore before the mass influx, was only about 3.5 million population comprising of true blue Singaporeans 20 years ago, was simply trying to gaslit us. \nTo be honest I felt hopeless and disappointed with the direction this country is taking and with our leaders.",
          "score": 5
        },
        {
          "text": "Nope. Political and critical thinking education in this country is abysmal and state-influenced. People have been conditioned to think anything other than the status quo risks complete chaos, and simply remain politically fully apathetic. The ruling party would simply and easily convince this apathetic voting population to just follow their lead.\n\nNothing is gonna change in SG. You're coming with this preconceived notion that **SG is somehow a functioning, healthy democracy like Switzerland, when in fact it's far from it.**",
          "score": 5
        },
        {
          "text": "Man I really hate to say this but nothing's gonna happen. We need the balls to do what we need to do, but we won't do it because our balls are restrained nicely. So really just have to stay united, then maybe our balls maybe unrestrained, hopefully la. Inshallah, popi and whatever else we use to pray",
          "score": 5
        },
        {
          "text": "Yep...PAP messed up big time in population (purposely? ) so oh very conveniently they decide they should give out more citizenship to their favoured future voters. \n\nFuck them",
          "score": 2
        },
        {
          "text": "30000 a year means everyday there will be close to 80 people getting citizenship ",
          "score": 2
        },
        {
          "text": "# National Referendum?\n\nNaah... Don't waste time, lah. The population issue is not new and has been around for many years. Last May, 65% gave it further affirmation.\n\nWe can't expect changes by repeating the same action.",
          "score": 2
        },
        {
          "text": "i know the beghan nepobaby pap govt can say 10mil. after all what skill you need to type 10 mil on ppt?\n\nnow the underlying tech stack to get to 10mil? cybersec also cannot make it every day tio hack, you think they can do infra to support 10mil?\n\nhaha",
          "score": 1
        },
        {
          "text": "Already held. The referendum of referendums was held last year. The results were conclusive.",
          "score": 1
        },
        {
          "text": "Good idea. But, has SG PAP ever held any referendum before? And actually listen?\n\nMaybe the sun will rise in the west first.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rf4g41",
      "subreddit": "singaporefi",
      "title": "Are you still optimistic in US?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1rf4g41/are_you_still_optimistic_in_us/",
      "score": 27,
      "num_comments": 41,
      "created_at": "2026-02-26T16:07:13",
      "selftext": "Wondering what is everyone’s opinion in the country and currency they are most vested in. ",
      "comments": [
        {
          "text": "How to predict these things. \n\nMy wife is a huge proponent of EU stocks, and for years her portfolio was a dead fish and I was sure she was wrong. But past few years its just been shooting up and I'm pretty sure ladt yr it out performed S&amp;P500. \n\nMy mother is a huge proponent of SG stocks. She has like a million in DBS. Her portfolio stagnated for years but last year also skyrocketed.\n\nWho could have known.",
          "score": 104
        },
        {
          "text": "Yes very.\n\nCan replace a president.\nCan send ships and planes over half the planet.\nCan import tariffs.\nCan ask for Greenland.\nCan make demands without facing any pucj back.\n\nTruly a great nation",
          "score": 33
        },
        {
          "text": "got better alternative meh ?",
          "score": 18
        },
        {
          "text": "Where else we could invest? \n\nEU? China? \"Emerging\" market? :| ",
          "score": 15
        },
        {
          "text": "USA is declining. How soon and whether they'll go quietly without starting WW3 is anybody's guess. \n\n\nBiggest problem for them isn't the orange turd, but the abysmally poor education system. Their public education is garbage and you need to pay lots to get into a good private school. Thanks to their poor education policy more and more Americans are growing up stupid and uneducated. From what I last read, around 50% of their adults have literacy levels of ~P6. I would say the majority lack critical thinking skills. \n\n\nIn the modern knowledge economy, that means the vast majority of Americans are doomed to fail. And this is just a downwards spiral. ",
          "score": 8
        },
        {
          "text": "Last year same time ppl talking about moving all money to other markets coz of trump fiasco... what do you think?",
          "score": 7
        },
        {
          "text": "Nobody can predict the future. There are moments in history where the USA underperformed the rest of the world and vice versa. The best practice is to hold a market weighted portfolio to capture global returns. Doing so also improves the sharpe ratio of your portfolio.",
          "score": 7
        },
        {
          "text": "[removed]",
          "score": 4
        },
        {
          "text": "Rather than the country itself, I'm very disappointed in the current administration and those who support it.",
          "score": 4
        },
        {
          "text": "Still? Hell no.",
          "score": 3
        },
        {
          "text": "US up only, just look at mag 7 less TSLA.\n\nLiterally printing money,,,",
          "score": 2
        },
        {
          "text": "Never bet against the US. Not my words. The wise man from Omaha said so. I truly believe in it. Although China is moving up, it has a long road ahead in terms of becoming a financial hub.",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1rf9ce6",
      "subreddit": "singaporefi",
      "title": "Personal Finance App (version 3)",
      "url": "https://old.reddit.com/r/singaporefi/comments/1rf9ce6/personal_finance_app_version_3/",
      "score": 10,
      "num_comments": 7,
      "created_at": "2026-02-26T20:51:59",
      "selftext": "Repost because Reddit automatically removed my post (*probably due to external link*)\n\nPlease DM me if you would like the link to try out.\n\n\\------------------------------------------------------------------\n\nThis is my first posting here -\n\nThis is version 3 of my (free) personal finance app first released 3 weeks ago, after listening to feedbacks from u/Kyith, cryptypudgy, Ed, Ra and others (with help of AI). Please let me know if you would like to see more features, or if there are any errors.\n\nThere is the option to input multiple insurance policies, CPF (BRS, FRS, ERS) , one-time spike events and also modelling the sequence of returns through different historical periods in **both the US and in Singapore.**\n\nI previously shared it in my telegram group chat but was told to share it here to benefit more folks.\n\n\n\n**1. Multiple Insurance Policies Input**\n\nYou can enter details for more than one insurance policy you hold — including premiums, coverage types, and cash values — so the projection accounts for insurance-related financial flows over time.\n\nThis helps in modelling how life/health/other insurance affects your net worth and cashflow.\n\n\n\n**2. CPF Modelling (Singapore-Specific)**\n\nThe tool includes CPF (Central Provident Fund) projections, allowing you to account for:\n\nCPF balances by account (OA, SA, RA, etc.)\n\nAge-based milestones like BRS, FRS, and ERS\n\nHow CPF balances grow over time\n\nThis makes the projections tailored to Singapore residents.\n\n\n\n**3. One-Time Events &amp; Spike Modelling**\n\nYou can add single large events such as:\n\nLump-sum gifts or inheritances\n\nInheritances\n\nOne-off expenses like big medical bills\n\nCareer breaks or sudden expense spikes\n\nThis enriches the projection beyond constant yearly inputs.\n\n\n\n**4. Sequence of Returns Modelling**\n\nInstead of assuming one fixed growth rate forever, the projector lets you simulate what happens if returns vary year-by-year — including using historical return sequences from Singapore or the US market.\n\nThat’s important because how returns occur over time — especially early in retirement — can drastically change outcomes.\n\n\n\n**5. Withdrawal &amp; Retirement Runway Projections**\n\nThe app models how your portfolio can be drawn down in retirement using different strategies, so you can see:\n\n📍 How long your savings may last\n\n📍 How different withdrawal rules affect sustainability\n\nIt allows you to experiment with different approaches to withdrawing assets over time.\n\n\n\n**6. Monte Carlo / Historical Stress Testing**\n\nSome versions include simulations and historical stress tests, where your plan is tested against different market return scenarios — including severe downturns — to see how resilient your finances might be.\n\nWhile this feature may not be full Monte Carlo yet in every build, historical sequence testing is definitely part of it.\n\n\n\n**7. CPF &amp; Cashflow Timeline**\n\nThe app shows a timeline of how your CPF balances and other financial elements evolve year by year based on your inputs, giving you a clear picture of future wealth trajectory.\n\nThis is similar in concept to much more complex financial plans but simplified for personal modelling.\n\n  \nPlease let me know if you would like to see more features/apps in future!\n\nThank you. \n\n  \nSG Faiya\n\nhttps://preview.redd.it/ycppcjni5ulg1.jpg?width=2886&amp;format=pjpg&amp;auto=webp&amp;s=02c7b219a59d56692c0c4466d16923c8e763ea5c\n\nhttps://preview.redd.it/t6j2dnni5ulg1.jpg?width=1885&amp;format=pjpg&amp;auto=webp&amp;s=ef38b0b531b0e42ba08817067b240c1ae01c462f\n\nhttps://preview.redd.it/295ovkni5ulg1.jpg?width=1947&amp;format=pjpg&amp;auto=webp&amp;s=76c8bad41f613fd13f4828f546d838de0b8379f4\n\nhttps://preview.redd.it/0xo8kmni5ulg1.jpg?width=2077&amp;format=pjpg&amp;auto=webp&amp;s=e04ba12c6521ecca20f5545c60a5982f49b1c08d\n\n  \n",
      "comments": [
        {
          "text": "Link: [https://sg-faiya-personal-actuarial-financial-projector-729777708832.us-west1.run.app/](https://sg-faiya-personal-actuarial-financial-projector-729777708832.us-west1.run.app/)",
          "score": 4
        },
        {
          "text": "looks good op",
          "score": 2
        },
        {
          "text": "Free?",
          "score": 2
        },
        {
          "text": "gm  \nincome growth seems to be in annual basis and expense growth is in monthly basis, might be good to make them consistent \n\n",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1rfhd8j",
      "subreddit": "singaporefi",
      "title": "Best way to minimise SGD to USD FX cost for monthly DCA into S&amp;P500?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1rfhd8j/best_way_to_minimise_sgd_to_usd_fx_cost_for/",
      "score": 8,
      "num_comments": 10,
      "created_at": "2026-02-27T02:00:28",
      "selftext": "Hi all, I’m based in Singapore and planning to DCA monthly into the S&amp;P 500.\n\nSince US ETFs are USD-denominated, I need to convert SGD to USD every month. I’m trying to minimise FX cost and wondering what is the most cost-efficient method?\n\nAlso, since we earn and spend in SGD, how do you manage USD/SGD currency risk long term?",
      "comments": [
        {
          "text": "You can automate the entire process on Ibkr. The conversion of (1)sgd&gt;usd and then (2)usd&gt;s&amp;p500. Item (1) will not incur transaction fee and Ibkr offers competitive rates. Kelvin got video. Can check out and follow",
          "score": 5
        },
        {
          "text": "I",
          "score": 3
        },
        {
          "text": "long-term currency risk is inherent so more averaging (+buying when SGD is strong based on MAS bands)\n\n  \noverall IBKR is good, it's automated and you can deposit whenever",
          "score": 1
        },
        {
          "text": "IBKR has negligible FX costs.",
          "score": 0
        },
        {
          "text": "Amundi USA prime fund on poems is traded in sgd and is almost perfectly correlated to SP500 with very low TER.",
          "score": -8
        }
      ]
    },
    {
      "id": "t3_1rf46my",
      "subreddit": "singaporefi",
      "title": "Setting up of multiple account under same log in/profile in IBKR",
      "url": "https://old.reddit.com/r/singaporefi/comments/1rf46my/setting_up_of_multiple_account_under_same_log/",
      "score": 0,
      "num_comments": 0,
      "created_at": "2026-02-26T15:51:27",
      "selftext": "Hi all, need some advice \n\n1.\t⁠How do i set up a new account under the same profile (i already have 3, but i can't remember how to set it up)\n2.\t⁠Is there a maximum number of accounts which i can set up?",
      "comments": []
    },
    {
      "id": "t3_1rfu2b8",
      "subreddit": "singaporefi",
      "title": "Might be tripping",
      "url": "https://old.reddit.com/r/singaporefi/comments/1rfu2b8/might_be_tripping/",
      "score": 0,
      "num_comments": 5,
      "created_at": "2026-02-27T10:16:51",
      "selftext": "Hi guys.\n\nI'm trying to write and sell a covered call, and normally I think I should be looking for this graph, however my order type above says it's a buy so I'm wondering why the graph is reversed. Unless I'm supposed to be doing this and if that's the case, can someone help explain? Thanks.\n\nalso can someone help me figure out what the premium is? thanks\n\npaper trade btw coz I need to find out how the mechanics work on moomoo. ",
      "comments": [
        {
          "text": "You can buy and sell a call. Just flip it to sell. \n\n\nThis is how it looks on ibkr. \n\n\nhttps://ibb.co/d4tBbJ9X",
          "score": 2
        },
        {
          "text": "Premiums is 397.50",
          "score": 1
        },
        {
          "text": "Let me give it a go, the reason you see its 'buy' because you are trying to perform a covered call strategy, i guess the broker automatically buys 100x of HSY at 232.5, then perform to sell Calls.\n\nOne you might try is to buy the stock separately first, then select 'sell call' under strategy. I saw your strategy selected is 'covered call' which most likely you dont own the stock hence the broker helps you to buy underlying as well. ",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rf4mh5",
      "subreddit": "singaporefi",
      "title": "[uni grad] debating btw 2 offers",
      "url": "https://old.reddit.com/r/singaporefi/comments/1rf4mh5/uni_grad_debating_btw_2_offers/",
      "score": 0,
      "num_comments": 27,
      "created_at": "2026-02-26T16:18:19",
      "selftext": "For context, I'm a Y4 undergraduate studying CS in Big 3, debating btw 2 offers. One's a private MNC, the other's a gov agency. First one's likely offering low 70k, second one mid-high 80k (total annual package).\n\nThings I considered:\n\n\\- I'm in the tech field, i.e. a fast moving field - starting my first job in a private MNC is likely to give high growth/development in skillsets + good exit opportunities. However, the drawback is lower pay.\n\n\\- However, it's well known that your first job dictates your future job's salary. By taking the lower offer, my salary growth might be slower in the long run. Hence it might be better to take the higher offer, but the drawback is gov agencies have more red tapes and are generally slower-paced, meaning slower growth in relevant skills.\n\nIt's really a debate between (my foreseen) faster salary growth vs skill growth, of which the latter might result in even higher salary growth in the long run, due to accumulation of highly relevant skills that will give me a stronger edge in future.\n\nAny advice regarding this?\n\nEdit: For added context, both are software engineering roles, job title for both is similar. Private MNC likely has a wider tech stack and  cloud/devops related tasks alongside swe, while the gov agency might have some AI related tasks alongside swe.\n\nAlso, I will consider job hopping regardless of which company I join, so things like promotions aren't too big a concern to me. Only concern is that skills may stagnate faster in the gov agency compared to private.",
      "comments": [
        {
          "text": "Private may not necessarily be better, depends on the job scope and tech stack.",
          "score": 6
        },
        {
          "text": "Money talk and it's quite a big difference so just take the higher package and go private after 2 years for 100k+\n\nOr maybe you will like it at government sector who knows?",
          "score": 4
        },
        {
          "text": "Go for the one with higher growth prospects, both in terms of brand name and role potential. \n\nThere are always avenues to not anchor your future salary growth based on previous job pay such as further studies (especially less so if the next company is a proper company with fair comp), so you shouldnt be too fixated on that.",
          "score": 2
        },
        {
          "text": "Used to work in government as a civil servant.\n\nFor civil service, one important thing you need to know when taking a high paying job is the expectations behind that work. Currently government is doing a lot of right-sizing of permanent staffs, so some departments are getting smaller and more work are loading onto the remaining team's backs.\n\nPromotion cycles are also vicious, unlike private sectors where how much you work determines if you can get promoted or not, in civil service you are being based on how likeable you are. So in a way, the iron rice bowl job will only reward you to remain stagnant and comfortable with the way you are working there.\n\nMy personal opinion here is that if you have the opportunity to work outside for a lower pay, take it first as an experience learning first. You will learn more skills, develop more personal growth and make new network connections much more easily than working in civil service.\n\n  \nIf you are someone who is worried about job security, then civil service is your option, if you are someone who wants to grow more as a person so that you can land the dream career that you want, private sector is the way to go. ",
          "score": 2
        },
        {
          "text": "Whoa, you're right that this is a really tough and tight comparison. So more details like exactly job role/scope/companies/agency might be needed to give you a more accurate assessement.\n\nBut in general, from my POV, you generally go out into the world to learn and experiment and go to a gov agency to \"semi-retire\" from your career.\n\nI know you are thinking of the salary growth thing, but if you are out in the private sector, the trend now is to jump every 1 - 2 years, which will be much faster salary growth then staying in the gov agency. It's easier to be a job hopper in the private sector than the public one. So the salary growth thing is a bit moot.",
          "score": 1
        },
        {
          "text": "no need to overgeneralise and form stereotypes, you'll only really know once you're inside there. I know one who's doing software engineering in so called fast moving MNCs is just doing simple stuff like adjusting labels, fonts and colours, and he feels like quitting his high paying job that doesn't give him learning opportunities.\n\nthe only thing that is confirmed is the salary difference and it's a lot. don't make decisions based on 'likely' or 'not likely'. pick wisely so that you don't regret later on.",
          "score": 1
        },
        {
          "text": "Frankly speaking, I don’t think 10k diff in full annual package is a big factor. Because you hardly know how much exact bonus will it be for both of them. \nTo me, business domain and company culture is more important. What’s the rating for both in Glassdoor or other apps? What tech stack and exposure will you get? You want to gain more experience which can sell better in future..",
          "score": 1
        },
        {
          "text": "First of all, congrats! This is a good problem to have.\n\nLike someone else said it's hard to answer without more context. Like what's important to you: if the MNC has a brutal lifestyle and work/life balance is important to you, for example, then you should avoid it. On the other hand if you need a lot of money for whatever reason then just take the higher pay.\n\nHere's my two-cent question:\n\nImagine you choose one of them and leave after two years. Will the other still be willing to take you on?\n\nGood luck!",
          "score": 1
        },
        {
          "text": "10k is not alot TBH. so choose the one with more growth. I am a job hopper, started with 60k annual pay. after 4 years, i am at 150k. From my experience, your skills and knowledge gives you more edge on negotiating the pay. One more thing i like is the networking. (private sector tends to have more turn over rate compared to gov, so you will make more connections)",
          "score": 1
        },
        {
          "text": "I would probably go for the higher pay.  The decent package seemed to suggest a higher tier government agency that can pay quite well and probably involved in more interesting projects that's good for your CV.",
          "score": 1
        },
        {
          "text": "In tech, it's not your starting pay but your learning trajectory that matters. Join a lousy project or work on something that doesn't increase your skills = dead end. \n\nAs a SWE your goal is to learn to be a great engineer that builds a great product that can operate at scale. Each part of that sentence is something that has several meanings. \n\nWhile you may not necessarily get bad so to speak, but the people you work with and learn from ultimately affect your career trajectory.",
          "score": 1
        },
        {
          "text": "In tech, job scope is everything ",
          "score": 1
        },
        {
          "text": "No brainer.\n\nTake the MNC job.",
          "score": 1
        }
      ]
    }
  ]
}