{
  "schema_version": "raw_scrape_v1",
  "report_id": "2026-02-15",
  "scraped_at": "2026-02-15T13:42:02.680237",
  "subreddits": [
    "singapore",
    "askSingapore",
    "SingaporeRaw",
    "singaporefi"
  ],
  "total_posts": 40,
  "total_comments": 459,
  "posts": [
    {
      "id": "t3_1r4hg1t",
      "subreddit": "singapore",
      "title": "Has anyone seen this before?",
      "url": "https://old.reddit.com/r/singapore/comments/1r4hg1t/has_anyone_seen_this_before/",
      "score": 384,
      "num_comments": 16,
      "created_at": "2026-02-14T18:34:12",
      "selftext": "Seen this when digging through my house, tried googling more information about this but nothing came up. I don’t see a listing on Carousell for this either. I only saw a picture of a similar card but in silver for this. ",
      "comments": [
        {
          "text": "wow a limited edition item from almost 30 years. Wonder if it’s worth something to collectors.",
          "score": 176
        },
        {
          "text": "would be lowkey hilarious if this goes viral and the other 4999 show up to post theirs",
          "score": 84
        },
        {
          "text": "$1 my offer best",
          "score": 55
        },
        {
          "text": "You can try to share this to Metro and see if there is any response from them",
          "score": 16
        },
        {
          "text": "If we have one, can we go to the Willy wonka factory",
          "score": 9
        },
        {
          "text": "My uncle bought and gave me those limited edition MRT cards when I was a kid. If got value inside I suppose he'll use it up first.\n\nBut 1g gold, even if got value inside I'll also not insert it inside the fare machine in case it gets eaten or the gold is worn off.",
          "score": 8
        },
        {
          "text": "Ah the good old days in Singapore.",
          "score": 8
        },
        {
          "text": "Flavius Anicius Petronius Maximus Augustus",
          "score": 6
        },
        {
          "text": "Based off this website: [https://goldprice.org/gold-price.html](https://goldprice.org/gold-price.html)   (I'm assuming it should be accurate, given that they have \"gold\" in their name. 😃)   \n\nAs of 15 Feb 2026, it is priced at US$162 per gram  \n\n30 years ago, 1996, it is priced around US$18 per gram.   \n\n  \nSo, considering that it was made 30 years ago, it seems reasonable to make a gold plated card. (probably the cost of making the card is around 30\\~40 dollars. probably)",
          "score": 2
        },
        {
          "text": "Where is this photo taken?",
          "score": 1
        },
        {
          "text": "$20 fast deal pls",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1r4g850",
      "subreddit": "singapore",
      "title": "5-room HDB flat along Punggol Drive sold for S$1.47 million",
      "url": "https://old.reddit.com/r/singapore/comments/1r4g850/5room_hdb_flat_along_punggol_drive_sold_for_s147/",
      "score": 318,
      "num_comments": 109,
      "created_at": "2026-02-14T17:18:12",
      "selftext": "",
      "comments": [
        {
          "text": "I’ve become so numb",
          "score": 415
        },
        {
          "text": "I believe it’s a loft unit cos it’s 1500+ sqft. These units are very rare",
          "score": 221
        },
        {
          "text": "I feel like the govt owes all Gen Z and Alphas a huge apology for letting HDB prices get to this state. Wtf.",
          "score": 116
        },
        {
          "text": "&gt;The unit, located at 306D Punggol Drive, spans 1,582 square feet and has a remaining lease of around 85 years.\n\nThe neighbours:\n\n![gif](giphy|mcH0upG1TeEak)\n\n/s",
          "score": 64
        },
        {
          "text": "as 1 solo candidate said before the election,your grandchildren is paying for this price",
          "score": 46
        },
        {
          "text": "i will never understand punggol sky high prices",
          "score": 42
        },
        {
          "text": "Just 15 years ago and a 5 room flat was almost 1600 sqft? Do they even make 5 room flats now...",
          "score": 41
        }
      ]
    },
    {
      "id": "t3_1r53rf7",
      "subreddit": "singapore",
      "title": "Chinese influencer alleges 2-day detention at Changi Airport, ICA says foreigner entry 'not a right'",
      "url": "https://old.reddit.com/r/singapore/comments/1r53rf7/chinese_influencer_alleges_2day_detention_at/",
      "score": 246,
      "num_comments": 115,
      "created_at": "2026-02-15T11:05:09",
      "selftext": "",
      "comments": [
        {
          "text": "A Chinese woman, who recently travelled to Singapore, alleged that she was stopped at the airport upon her arrival and detained for two days.\n\nIn a video uploaded to Douyin, the influencer claimed that she was asked to pay over S$500 before being released and deported back to China.\n\nIn response, the Immigration and Checkpoints Authority (ICA) said it does not impose any fees on travellers who have been refused entry.",
          "score": 245
        },
        {
          "text": "&gt;When her phone was checked, officers found messages of her being coached to address questions that may be posed by immigration officers.\n\nI mean...who prepped for a holiday so hard that they get coaching for this.",
          "score": 154
        },
        {
          "text": "First the girl from Taiwan now this. ICA probably have cause to believe they trying to come in to work",
          "score": 110
        },
        {
          "text": "She confirm P ban liao.",
          "score": 72
        },
        {
          "text": "Onward air ticket is a requirement. Amount was for repatriation flight.",
          "score": 68
        },
        {
          "text": "No onward flight, no itinerary, no money, coached to answer ica qns.\n\n\nThe sister confirm not a teacher here lol",
          "score": 63
        },
        {
          "text": "Imma say what the article is skirting ard. ICA suspect she was planning to come to Singapore to work. Probably vice. \n\nShe now buey song and want to win netizen's pity.",
          "score": 63
        },
        {
          "text": "Her video is getting pummelled in the comments lol",
          "score": 55
        },
        {
          "text": "ICA did their job. 💪🏼\n\nSovereign countries have the legal right to refuse entry to any individual they deem unfit to enter.",
          "score": 27
        },
        {
          "text": "Visa free",
          "score": 8
        },
        {
          "text": "Good job ICA 👍\n\nProbably salty that her plans to earn 'Freelance' income for the CNY period has gone up in smoke",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r4h3dz",
      "subreddit": "singapore",
      "title": "Do you think Property Lim Brothers is going to close down because of the whole scandal?",
      "url": "https://old.reddit.com/r/singapore/comments/1r4h3dz/do_you_think_property_lim_brothers_is_going_to/",
      "score": 187,
      "num_comments": 100,
      "created_at": "2026-02-14T18:12:29",
      "selftext": "Ruined reputation from the BabyGrayce and Melvin affair, public scrutiny, agents taking their 100 agents with them and leaving the company. With all of this happening it just feels unsustainable for the company to keep going. Does anyone who is more informed on matters such of this think it is going to go under or not? ",
      "comments": [
        {
          "text": "This is why you don't build a business surrounding key person. Especially if your business is in the service/relationship (pun intended) industry.",
          "score": 298
        },
        {
          "text": "Probably, especially since for Property Lim Brothers, Melvin is essentially the product. So no Melvin, no PLB. Sadly it's the case for brands that rely on their founders e.g. Mr Beast, The Paul Brothers, etc.",
          "score": 128
        },
        {
          "text": "just have to hold out for 3 months, and most people would have moved on to the next story of the week.",
          "score": 82
        },
        {
          "text": "They just posted a video on Instagram of around more than 50 of them throwing yusheng at each other. These people are just kids in adult bodies with IQ less than 50. They don't look like collapsing yet.\n And here we thought NTU yusheng incident was bad",
          "score": 76
        },
        {
          "text": "They will close down because it is so easy for employees to move shop. Barrier to entry for real estate isn’t tagged to company, it’s tagged to an agent’s network",
          "score": 35
        },
        {
          "text": "Foreigner here with a genuine question - why are these people famous?",
          "score": 23
        },
        {
          "text": "All their businesses will shut down. Nobody going baby hotpot too",
          "score": 9
        },
        {
          "text": "If it goes down. It's because they treat it like a game. The beginning reminds me of those ghost movie.\n\n[Parc Condo | 3-Bedder | 600 Sqft](https://www.youtube.com/shorts/xH5-8cbX_8s)",
          "score": 8
        },
        {
          "text": "Likely.\nIf its Melvin and some ML lady maybe still got chance. \n\nThis scandal putting someone useless in 200k poistion cause of sex.\n\nImagine you are bottom worker helping company earn 200k. But they just pay you 60k annual and thank you for your service",
          "score": 6
        },
        {
          "text": "Melvin made this fatal mistake as he is psycho by Grayce to cut his partner Adrian, hence KW is formed. Once hoes over bros it is over as betrayal. The bros who fought with you to succeed is very important. Based on this Melvin has peaked years ago and the businesses open with her will crash as well.",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1r525p2",
      "subreddit": "singapore",
      "title": "‘As if the world is breaking’: Tampines residents woken up by traffic noise in the wee hours",
      "url": "https://old.reddit.com/r/singapore/comments/1r525p2/as_if_the_world_is_breaking_tampines_residents/",
      "score": 156,
      "num_comments": 46,
      "created_at": "2026-02-15T09:45:45",
      "selftext": "",
      "comments": [
        {
          "text": "Uwu bird: \"Finally! A worthy opponent! Our battle will be legendary!\"",
          "score": 149
        },
        {
          "text": "This is an every night affair at Punggol. Several loud modified exhausts and no enforcement at all. LTA needs to wake up",
          "score": 79
        },
        {
          "text": "No enforcement on modified exhausts thats why",
          "score": 71
        },
        {
          "text": "If you're a light sleeper it can be jarring enough to jolt you out of sleep. Especially the ones that sound like explosions. It sounds even closer in the middle of the night when ambient noise is low. \n\nI love the sound of engines, but I'd be very ashamed if my \"enjoyment\" is waking up people in their sleep. What self-centered pricks.",
          "score": 53
        },
        {
          "text": "Solving the problem in Tampines isn’t nearly enough. It’s the same issue anywhere in Singapore when an asshole with a modified exhaust decides to drive past at night.",
          "score": 31
        },
        {
          "text": "Bruh “as if the world is breaking”, and people say Singaporeans lack an artistic flair. They just haven’t seen us facing a nuisance of the public 😂",
          "score": 27
        },
        {
          "text": "Sibei drama \"world is breaking\" might as well say your pantat breaking",
          "score": 23
        },
        {
          "text": "I can see why the residents at Blk 366 Tampines Street 34 are especially affected by the vehicular noise, block orientation notwithstanding. The trees that used to be there had previously dampened the noise, but were obviously cut down to accommodate the expansion of the viaduct. Also, most of the unmodified units are still outfitted with sliding windows, which are extremely bad at reducing noise. Worse still, corridor units are not allowed to use casement windows, so the only reprieve they are gonna get is when the permanent noise barriers are erected. \n\nBut if these permanent noise barriers are anything like the ones that were captured on Street View, they clearly don't work since the height is not even as tall as the block. They should be minimally be as tall as the viaduct to be effective.",
          "score": 10
        },
        {
          "text": "Zero Enforcement! This gov has been coasting on the reputation of1G, 2G and 3G",
          "score": 10
        },
        {
          "text": "As long as we have motorbikes with mod, or the diesel trucks revving up at 0500, or on the roads, there is no way one can have a good sleep",
          "score": 5
        },
        {
          "text": "&gt; Dr Chen said there were concerns that traffic noise would increase as more roads are built in the area. \n\n\nBut govt still wants car-lite Singapore. What a joke ",
          "score": 3
        },
        {
          "text": "Noise cameras, other cities have it already.",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1r4k2cs",
      "subreddit": "singapore",
      "title": "Staff of student care operator Little Professors file reports for unpaid salaries and CPF contributions",
      "url": "https://old.reddit.com/r/singapore/comments/1r4k2cs/staff_of_student_care_operator_little_professors/",
      "score": 121,
      "num_comments": 20,
      "created_at": "2026-02-14T21:01:18",
      "selftext": "",
      "comments": [
        {
          "text": "&gt;_The message informed employees that their employment contract with Little Professors was no longer considered valid, and **they could resign without serving notice.**_\n\nNice try but nobody's gonna resign just like that.\n\nPlus, I'm quite sure the authorities will come hard after the operator.. _thou shalt not mess with unpaid CPF_!!",
          "score": 65
        },
        {
          "text": "SME nonsense again",
          "score": 52
        },
        {
          "text": "fun fact , they breached the contract by failing to pay us within the 7-day grace period, so the contract became invalid and no notice was required.",
          "score": 19
        },
        {
          "text": "Teachers get screwed again.\n\nMOE ordered schools to call back all Excos to school today(HOD, Year Heads, etc) to call and inform affected parents.\n\nExcos have also been assigned as temporary student care after school hours since last week.\n\nSource: My friend is in 1 of the affected schools.",
          "score": 10
        },
        {
          "text": "&gt;“He said the principal, vice-principal and teachers had taken over the serving of food and care of the children in student care... He also saw some parents from the parent support group being activated to help out,” said Mrs Tan.\n\nI dare say that if it were the current management of any school’s student care, they would not step in from headquarters to take over. Their standards and level of professionalism are truly dismal.",
          "score": 9
        },
        {
          "text": "&gt; Several parents have also discovered that they had been double-charged via GIRO deductions for their children’s February student care fees.\n\n\nIf it's a struggling fnb business that has very low sales, I wouldn't be as shocked about unpaid salaries but this is more shocking to me cos this is a student care (several branches in MOE schools!) with money received consistently from parents/guardians every month. They even somehow accidentally double charged parents via GIRO for Feb payment but still didn't pay the staff's January salaries and few months worth of CPF. So where did all the money go? How long has the director gone MIA?",
          "score": 2
        },
        {
          "text": "Any idea who's the owner?",
          "score": 1
        },
        {
          "text": "Learning centres, pre-schools seem to be facing similar competitive situation as those in food and beverage sector.  ",
          "score": 1
        },
        {
          "text": "i was so close to starting my job with this company. i backed out 3 days before the start of my contract. i did some research and i was shocked to see the amount of bad reviews given by the employees. super red flag. when i was interviewed, i felt an uneasy moment like my gut was telling me this job is sketchy af.",
          "score": 1
        },
        {
          "text": "lol i backed out of joining last minute thank god",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r4kq2q",
      "subreddit": "singapore",
      "title": "Pedestrian dies after accident involving truck in Boon Lay, driver arrested",
      "url": "https://old.reddit.com/r/singapore/comments/1r4kq2q/pedestrian_dies_after_accident_involving_truck_in/",
      "score": 107,
      "num_comments": 23,
      "created_at": "2026-02-14T21:32:52",
      "selftext": "",
      "comments": [
        {
          "text": "It's only Feb and there are so many tragic accidents already.\n\nCondolences to the victims family. No one family shld endure this kind of grieve",
          "score": 92
        },
        {
          "text": "Driving in SG is hell",
          "score": 52
        },
        {
          "text": "Seems there is an uptick in traffic accidents \\*reporting\\* this month.\n\nNot sure if traffic accidents really increase, or the media's algorithm caught on that traffic accident reports garner more views &amp; ~~interactions~~ *engagements* (that's the buzzword I was thinking of). \n\nWhatever is the case, it is working; at least on me, because, here I am, commenting on another traffic accident. 🤔",
          "score": 12
        },
        {
          "text": "driver, vehicle or pedestrian fault?🤔",
          "score": 4
        },
        {
          "text": "How come this case driver seemed to be arrested immediately but Chinatown one arrest took 1 day ??",
          "score": -1
        },
        {
          "text": "AGAIN!?This cannot be a coincidence...",
          "score": -4
        },
        {
          "text": "How come noone bashing the race and nationality of the driver here ah? Its because hes the wrong race right?",
          "score": -31
        }
      ]
    },
    {
      "id": "t3_1r55imi",
      "subreddit": "singapore",
      "title": "S'porean woman, 54, keeps starting fires, padlocks neighbour's gate, sets fire to it, threatens to stab him, gets 5 years &amp; 3 months jail",
      "url": "https://old.reddit.com/r/singapore/comments/1r55imi/sporean_woman_54_keeps_starting_fires_padlocks/",
      "score": 85,
      "num_comments": 24,
      "created_at": "2026-02-15T12:36:58",
      "selftext": "",
      "comments": [
        {
          "text": "This one is straight up attempt to murder sia.",
          "score": 1
        },
        {
          "text": "I am surprised they didn't send her to IMH instead.",
          "score": 1
        },
        {
          "text": "How is she able to be released from bail, on the same day, when she reoffended WITHIN 2 DAYS\n\nCrazy Ah ~~Leong~~ Long",
          "score": 1
        },
        {
          "text": "&gt;She pointed a knife at him and said: “You come out, and I will stab you.”\n\n&gt;Leong used the sharp edge of the knife to hit the metal gate.\n\n&gt;The knife's blade eventually broke.\n\nPoor knife",
          "score": 1
        },
        {
          "text": "5 years seem too light when this is attempted homicide",
          "score": 1
        },
        {
          "text": "Most sane neighbour",
          "score": 1
        },
        {
          "text": "The Perfect Neighbour",
          "score": 1
        },
        {
          "text": "Siao lang many",
          "score": 1
        },
        {
          "text": "Wow..  \nNeighbour now got exactly 4 years to sell and move on. Buffer for good behaviour?\n\nCaveat Emptor.",
          "score": 1
        },
        {
          "text": "Take care of your mental health before it turns into this specific kind of crazy.",
          "score": 1
        },
        {
          "text": "Wtf did she literally commit arson ?",
          "score": 1
        },
        {
          "text": "Say you want free stay in changi without saying you want free stay in changi.",
          "score": 1
        },
        {
          "text": "This is a serious mental case, likely schizophrenic and might harm public safety. Why is she sent to jail and not IMH instead?",
          "score": 1
        },
        {
          "text": "Hwah siao neighbour",
          "score": 1
        },
        {
          "text": "living in arkham city",
          "score": 1
        },
        {
          "text": "&gt;She then started a fire using items, such as a blanket, towels, **a banana**, a soft toy, and a set of bedsheets, which were placed outside the gate.\n\n🍌🔥?",
          "score": 1
        },
        {
          "text": "Traffic accident injury or death 3 wks-5mths😒",
          "score": 1
        },
        {
          "text": "Could have gone so wrong.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r52uno",
      "subreddit": "singapore",
      "title": "Sharing for parents: Cost of single visit to Mount Elizabeth Orchard",
      "url": "https://old.reddit.com/r/singapore/comments/1r52uno/sharing_for_parents_cost_of_single_visit_to_mount/",
      "score": 67,
      "num_comments": 95,
      "created_at": "2026-02-15T10:19:58",
      "selftext": "Kid was in Orchard with my wife few days ago for some CNY shopping. I wasn't around.\n\nHe was on the MRT to Orchard when he felt nausea and vomited after alighting. Thought it could be a one-off incident but he then vomited again during lunch and a few times after. Total 5 times.\n\nClearly he wasn't feeling well and it was decided that he should seek medical attention asap. Given that it's Orchard with heavy traffic at that time, took taxi at Ion and he was sent Mount Elizabeth Orchard instead.\n\nHe got IV drip, blood test, consultation etc. Thankfully, nothing much serious and he was discharged with medication later.\n\nThe bill was $900+ though. Maybe this isn't a surprise to most people but it came as a bill shock for me. Jokingly told my wife, maybe call ambulance sent to kkh might be cheaper and better medical attention overall.\n\nWe did bought accident insurance plan for him so hopefully it can cover partially.\n\nAm also wondering, what're some alternative routes we could have taken if such similar incidents were to happen again? Maybe there're GP clinics around Orchard that could have been considered? \n\n",
      "comments": [
        {
          "text": "This is Singapore, no such thing as far here. \n\nTaxi/Grab can get you to KKH in 15 mins from Orchard. \n\nThe queue at KKH A&amp;E is another story though. \n\nI guess that $900 is worth it if you want fast treatment because in KKH, you have to wait a few hours if they deem your case as not life threatening.",
          "score": 231
        },
        {
          "text": "KKH, you go there, wait 2-4 hours cos your kid is not serious case. Just barely started vomiting only, not even 24 hours. \n\nIt was probably unnecessary to have started a drip, which would have added to the cost considerably.",
          "score": 94
        },
        {
          "text": "KKH isn't far",
          "score": 93
        },
        {
          "text": "$900 is the real cost for medical fees and fast attention to your case. Kkh is got subsidies.",
          "score": 68
        },
        {
          "text": "Sorry just checking if you’re a local Singaporean? Most locals usually go to a GP, especially if kid is vomiting, which isn’t a rare occurrence at all. Kids vomit all the time.",
          "score": 38
        },
        {
          "text": "People in the comments saying kkh is long wait but frankly all the times we've been to their a&amp;e for our kids (not many times, thankfully), it actually wasn't bad at all. \n\nJust recently my 6yo had persistent cough, went GP also didn't subside (in fact it worsened), decided to go straight to kkh. So was aware not urgent case, BUT whole process (including chest xray, review of xray with doc afterwards and edit: collect meds) was just over an hour. \n\n$180.",
          "score": 24
        },
        {
          "text": "This amount isn't shocking at all. Think of all the amount that you didn't have to spend because your child is healthy. ",
          "score": 20
        },
        {
          "text": "900+ is standard for a and e charges for a weekend. But there’s plenty of GP around the area. Don’t need to visit an and e first.",
          "score": 18
        },
        {
          "text": "went through the same thing when i had a flu during early days of Covid, panicked and went to the nearest hospital nearby (it was a sunday, so clinics were closed) they added on an ultrasound for my lungs and blood test, bill was 1200 🥲",
          "score": 14
        },
        {
          "text": "You didn't say who sent him there? Your wife or the ambulance? Makes a difference. In both cases, both decided not on cost, but on the circumstances and the medical case. It is only after everything is over and settled, you would quibble about the costs and say you should have done this instead of that.",
          "score": 12
        },
        {
          "text": "KK wouldn't even do blood tests or IVs for stable vomiting cases...",
          "score": 10
        },
        {
          "text": "We brought our 1YO to KKH emergency for respiratory issues. She was in bed and choking and sounded like she couldn’t breath, and we arrived around 10:30pm.\n\nCould tell they fast tracked us as we expected to wait but the nurses attended to us almost immediately. We were then sent to registration and paid one-time fee ~S$130 (claimed insurance) and Doctor attended to us in less than 20 minutes after registration. \n\nThere were maybe 5-6 families that were there, but no one seemed impatient or upset. Seems like everyone have already been attended to and/or waiting for next steps (further tests, medication etc).\n\nTurns out my child had croup which sounds worse than it is, but they offered us a medication that needed 2 doses with 1 hour waiting time in between. We left the hospital about 1:30am, so in and out in 3 hours.\n\nYMMV, maybe it was a “slow” day or croup is on their arbitrary urgent case list, but we felt the experience was pretty impressive and unexpected. For flat S$130 with medication and care included.",
          "score": 10
        },
        {
          "text": "I went to Gleneagles for a fractured rib. 6800 for one day stay.",
          "score": 8
        },
        {
          "text": "First child? It's normal to be far more anxious with first child and to pay for the peace of mind.\n\nAs you become more experienced you'll also be able to make your own decisions on what seems severe and what doesn't.\n\nOf course individual gancheongness and ability to pay factors in heavily.\n\nFor me as long as my kid is not in massive discomfort or show very abnormal or alarm symptoms, I'm happy with kkh.",
          "score": 8
        },
        {
          "text": "Yup! Thats the cost of private. But its faster than KKH which prioritises urgent cases.\n\nMy go to is Parkway East urgent care centre for kids, if I feel that more investigations might be needed. Else a GP or PD like Kinders Clinic at Paragon (since you mentioned Orchard) would suffice. \n\nFor accident claims, it depends on doctor's report. If it states things that are covereed like food poisoning, will be claimable.",
          "score": 5
        },
        {
          "text": "Honestly. I wasn’t expecting it to be 3 digits. Won’t say it’s “cheap” but this price is pretty reasonable.",
          "score": 4
        },
        {
          "text": "Why would you put a price tag on your child’s health?",
          "score": 4
        },
        {
          "text": "As a parent I totally get what you mean. You’re allowed to complain. $900 is crazy. Vomiting multiple times for kids can be extremely serious can even lead to the unthinkable in mere hours. Their bodies are so tiny. Mum did what she had to do to make sure her baby was ok and that alone makes it ok to me. \n\n In hindsight going to KKH A&amp;E would have been cheaper. Don’t worry about the wait, they will evaluate the child and decide if situation is serious or not.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r4fvho",
      "subreddit": "singapore",
      "title": "Stream for the 2026 Winter Olympics Alpine Skiing Men's Giant Slalom event, starting 5pm Singapore time today (14 Feb). Singaporean Faiz Basha is competing!",
      "url": "https://old.reddit.com/r/singapore/comments/1r4fvho/stream_for_the_2026_winter_olympics_alpine_skiing/",
      "score": 59,
      "num_comments": 7,
      "created_at": "2026-02-14T16:56:58",
      "selftext": "The free and legal stream is available here: [https://www.youtube.com/watch?v=RjhkFoLYNZc](https://www.youtube.com/watch?v=RjhkFoLYNZc)\n\nThe starting list and results are here; Faiz Basha will be the 73rd of the 81 skiers : [https://www.olympics.com/en/milano-cortina-2026/results/alp/sl/m/gs----------------/fnl-/000100--/race-result](https://www.olympics.com/en/milano-cortina-2026/results/alp/sl/m/gs----------------/fnl-/000100--/race-result)\n\nHere is an article about him in the Straits Times: [https://www.straitstimes.com/sport/spore-alpine-skier-faiz-bashas-winter-olympics-races-to-be-streamed-live-on-youtube](https://www.straitstimes.com/sport/spore-alpine-skier-faiz-bashas-winter-olympics-races-to-be-streamed-live-on-youtube)\n\nAlways fun to see Singaporeans at the Olympics. All the best Faiz!",
      "comments": [
        {
          "text": "Seem like he will not get a run 2 after DNF in run 1\n\nSo fast Olympics participation is over",
          "score": 9
        },
        {
          "text": "Whoops, fell on his first run. Hope he does better in the second...\n\n[https://www.youtube.com/live/RjhkFoLYNZc?t=6655s](https://www.youtube.com/live/RjhkFoLYNZc?t=6655s)",
          "score": 8
        },
        {
          "text": "Hope he didn’t sustain any injuries, after suffering a fall like that.",
          "score": 5
        },
        {
          "text": "[removed]",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r4m7zo",
      "subreddit": "askSingapore",
      "title": "Why Singaporeans don't work in SG shipyard",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r4m7zo/why_singaporeans_dont_work_in_sg_shipyard/",
      "score": 348,
      "num_comments": 98,
      "created_at": "2026-02-14T22:38:06",
      "selftext": "28M SG working at a on-site shipyard (MNC based). Job scope involves the following:\n\n\\-applying safety permits for vessel works\n\n\\-inspection of sites where work is taking place\n\n\\-filing of documents regarding these inspections\n\nThese roles often mean being out in the sun for extended periods of time, and inspections can be in enclosed and small spaces. It also requires frequent communication to foreign ship owners and shipyard workers (often Indian).\n\nI am fortunate to be paid above the median salary for an entry level job (fresh uni grad). Due to above-mentioned factors, I don't see AI taking over my job, at least not in the near future. \n\nHowever, I often wonder why younger Singaporeans like myself don't like taking over these roles, yet complain so much about AI taking over their roles.",
      "comments": [
        {
          "text": "Probably because don't see job listing for it anywhere and have no idea about the job?\n\nHow's career progression? Benefits? Etc",
          "score": 273
        },
        {
          "text": "Most singaporeans dont really know what happens or how to get into the maritime industry, even though it's massive. The industry has no glamor, very little information online, and no media covering what actually happens inside. Aerospace is taking bulk of the attention away.",
          "score": 79
        },
        {
          "text": "I can easily think of few reasons?\n\n1. Is it Tuas Megayard? The location itself is a deterrent for many.\n\n2. It is physically demanding compared to manufacturing plant. Climbing the gangway itself is already tiring enough. On board, you need to walk to many different compartments in your coverall and PPE. Its not for everyone.\n\n3. The environment is dirty, noisy and dusty. Safety is another factor. Most of the workers there are Indian/Bangladeshi/Malaysian/PRC. You often have to use broken English to communicate well with them. Some people really can't get used to it.\n\n4. The working hours start at 7.30am? But it also ends early la. But if its at Tuas megayard and you stay at East Side, need to travel very far.\n\n5. Marine/Oil and gas are not as rosy as it was used to be compared to early 2010s. Last time Keppel and Sembcorp are the big brothers of rig building but oil and gas upstream has changed so much over the last 10 years it is not as profitable as before.\n\n6. Depending on the roles, project engineer/production engineer doing project ships can have very high stress because of tight schedules. Commisioning engineers need to OT like mad near handover time. You will get shouted/berated a lot or reciprocate to your vendors for many stressful issues.\n\nThe above honestly applies to much of the traditional engineering work. That's why fresh grad usually not motivated to join the industry.",
          "score": 69
        },
        {
          "text": "Got lobang? Jobless looking for job",
          "score": 38
        },
        {
          "text": "There was a shipyard just opposite Sentosa in the 80s and 90s. Now it’s a condominium with a marina. Lots of locals work there before. I miss 90’s in Singapore so bad.",
          "score": 23
        },
        {
          "text": "Shipyard quite hard work (the non paper work kind.)",
          "score": 13
        },
        {
          "text": "I worked in a shipyard building oil rigs during the good old days of high oil prices where my bonuses was 8-12 months. I was in a field role so I got the full deal of wearing a hard hat, coveralls and going up to the vessels such as rigs and FPSO etc. But I left in the end and I suggest you better leave this industry as well. Many reasons as below:\n\n\n- Safety. Saw an injury from an unintended discharge from a hydraulic line at 200-300 bar. Had a colleague who fell from a 3 storey height due to poor safety barriers erection by contractors. No amount of $$ can buy back your limbs or life.\n\n- Field work is tough and even tougher when you are older. I knew i didn’t want to be climbing up gangways or flare towers when I’m 40 plus.\n\n- Oil and gas is cyclical and I got laid off at another company when oil price crash. And given the green transition to renewable energies, this is a mega trend which is unstoppable. Oil and gas will play a smaller role in the future. \n\n- Your enemy is not AI but the decline of this industry in Singapore. This industry has been increasingly moving to other countries and we are now very far from the heydays where Keppel was renowned as a world leader for its B class jack up rigs and the yard were packed with ever increasing orders backlog and foreign workers. These days, the yards are very quiet. \n\n\nMarine vessels are dominated by Chinese and Korean yards. Rig building and vessel conversions is steadily declining in Singapore. Your future options are to move to these countries to work. Many oil and gas and marine contractors are now located in KL as their APAC HQ instead.\n\n\nYou can DM me, always happy to have a chat with someone who has worked in this industry that i have worked in before .",
          "score": 13
        },
        {
          "text": "Idk, never heard of it and feels like this is way out of my experience base. What degree do you have/need to be qualified for this role?",
          "score": 12
        },
        {
          "text": "How profitable are all the blue collar SMEs in the marine industry? Previously as an intern, I had experience working in a simlar industrial setting at Jurong Island, and some of my colleagues were saying those SME towkays in those blue collar trades (e.g., scaffolding, welding, etc) supporting those plant maintenance works are very rich? \n\nPersonally, I am also interested in venturing into these blue collar trades and starting a business. Although I am currently still in Uni, and dont have any trade skills. I am interested in learning though. Actually to anyone knowledgable in this area, what are like the most profitable blue collar trades to learn/enter? I am primarily looking at those trades that support heavy industrial activity, not so much for those non-industrial activity like air con repair",
          "score": 8
        },
        {
          "text": "Because I diploma holder and I live in the east. Workplace might be far",
          "score": 5
        },
        {
          "text": "Maybe because they don't know about the jobs or how to apply.\nJob boards are so cluttered it's very challenging to determine what to apply for and what's just slop and since all these job boards require you to click onto categories. ...a job in a shipyard....what category would that fall under?",
          "score": 4
        }
      ]
    },
    {
      "id": "t3_1r4ey2k",
      "subreddit": "askSingapore",
      "title": "Broke down at work infront of colleagues and a customer. How should I feel. What will people think?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r4ey2k/broke_down_at_work_infront_of_colleagues_and_a/",
      "score": 132,
      "num_comments": 55,
      "created_at": "2026-02-14T16:00:01",
      "selftext": "I’m a teen working part time at a restaurant. Before working, I have been struggling with stuttering and my memory. I can easily blank out completely and forget a conversation just that happened just a while ago (though I think is pretty common). Nontheless I thought a fast paced environment would help me to overcome these issues that I have been (still am) facing.\n\nI’ve been working for almost to 4 months, so there are certain expectations that people have of me.\n\nYesterday however, I was working a full shift. In the afternoon, I was not in the right state of mind. It was very heavy and hazy. This subsequently  affected my performance at night, despite me stationed at a position I’m very familiar with. I was so slow, pacing back and forth, and did many things wrongly. This was very unusual of me, even my coworkers realised. One of them asked me if I was okay since I seemed very stressed and not knowing what to do. At that point in time, I knew I messed up shitloads. But I still had to keep going.\n\nThat was when I was super unlucky. I accidentally cut myself with a staple bullet. I didn’t know the cut was deeper than a usual paper cut until blood started leaking on the receipts I touched. I was shocked. Those receipts were meant to be given to the customers. Thankfully though, those customers didn’t want a receipt from the start so I could keep the extra clean spare one. The problem though was that it didn’t stop bleeding for 10-15 minutes, and there were still a long line of customers who wanted to pay.\n\nBeing a cashier, you’d have to wipe the tables after helping customers to pay. Unluckily the two tables I had to wipe had pools of water customers accidentally spilled, which would take me much more time to clean. Moreover more and more customers wanted to pay, so I had to stop what I was doing and go back to the cashier.\n\nMy breaking point was when a guy ordered takeaway. He basically wanted to order a bottle of wine, but restaurant policy states that takeaway orders for wine would require customers to buy something else with it. I told him and he said he will consider. He came back and I double checked with him “So you want the red wine? A whole bottle?”, then he said, in a tone I’m not sure condescending “You mean we can order a glass of wine for takeaway”. This made me think about that one time I actually made this mistake when I was still new, so my voice just cracked and I started breaking down.\n\nLater on after closing, the same colleague asked me the same question, whether I was okay since tonight was extremely messy. This happened infront of two other colleagues. I didn’t mean to break down in front of them. I really didn’t. However, I kept thinking about my incompetence at work, how even after 4 months I couldn’t be as quick as my colleagues, and that I kept stammering. Coupled with flashbacks when my mother scolded me for being useless, incapable, and that she ultimately raised a pig. (She said this more than once). Moreover, when I’m stressed, I sometimes hear voices calling me, which makes me go crazy since sometimes I’ll walk up to customers asking if they needed anything, and my colleagues will see it as I’m walking back and forth. At that point, I just couldn’t take it anymore. I was incompetent to say the least. I was problematic and practically a burden. I wish I had the authority to deny, but looking at what’d I done, having my colleagues to resolve so many of my mistakes yesterday night, overwhelmed me with guilt.",
      "comments": [
        {
          "text": "Hello hello my dear! What you are experiencing is called being overwhelmed, and possibly overstimulation exacerbated by stress. I noticed there are several triggers you've mentioned (eg. haze, heaviness). I have a suspicion that you are neurodivergent based on the traits you've mentioned (memory issues, stuttering, sensitivity to environmental triggers).\n\nI think this is far beyond anything a redditor can do for you, BUT what I CAN help you with is to help you make sense of things, but you must promise to go to see a doctor. Only a doctor/psychiatrist would be in the position to evaluate you and rule out other possible medical issues.\n\nThis series of events is not common nor normal, and this has caused you issues with your day to day functioning. At this point, it becomes a condition that requires professional help. Everything you're experiencing is common amongst neurodivergent people. For some of us, it's worst in childhood. The good news is that as adults, usually, things \"settle down\" a bit already.\n\nIf you want, you can DM me/ask me here and I can help you make sense of things so you can bring it to a doctor. I've been through the medical system in SG so I know the cost-efficient route. My DMs are always open ya if you feel you don't want to share too much publicly! Hugs and take care!",
          "score": 168
        },
        {
          "text": "Hearing voices? You need to get proper medical help. See polyclinic for referral.",
          "score": 159
        },
        {
          "text": "You are a teen. When you work in a front line position, even grown ups break down. All the time. I was a full grown person with tonnes of life experiences and when I stepped into front line work I want to pull my hair out or pull the customers hair all the time. It takes years to grow a thick skin and be immune to this kind of stress. \n\nAs some of the other posters suggest, you may have underlying mental health issues. Do explore that with a doctor. \n\nTake care and be kind to yourself. The customers and colleagues probably already forgot this moment.",
          "score": 27
        },
        {
          "text": "This is above reddit's paygrade. Please seek help. An appointment at a polyclinic is a good place to start, and how I got started seeking help, too. From my own experience, the staff are friendly and empathetic. \n\nLet me know if you've any questions. My DMs are open.",
          "score": 27
        },
        {
          "text": "Honestly it’s all good. You handled it well.\n\nYou’ll look back on this as just another bad day. Don’t let this bring you down in the long term. Good job on putting yourself out there, in a stressful environment, to improve yourself. Not many will do this.\n\nKeep it up. You’ve got this.",
          "score": 20
        },
        {
          "text": "It is common. The F&amp;B service line is known to be harsh. I have seen countless service personnel dropping tears at work.",
          "score": 13
        },
        {
          "text": "Hey as the top comment says, please seek medical help. But that aside, I want to say that you are doing a really really amazing job by putting yourself out there. The teens I know would never willingly put themselves out on part time jobs - they’d rather stay home and hang out with friends or play games! You’re already doing great. Even us adults get overwhelmed at work and break down sometimes.",
          "score": 8
        },
        {
          "text": "This is deep seated and beyond just work. For proper help, look for it in places that are not Reddit. No one here is qualified to assist.",
          "score": 8
        },
        {
          "text": "Here is the truth which I don’t expect u to understand. It sounds blunt, but it is liberating once u realise it. \n\nEverybody has their own challenges. Im not saying what u are feeling is invalid, but I’m saying that unless it affects them on a personal level, people dont care, let alone, allow it to stay long enough to form an impression. \n\nBut if this repeats, it becomes a pattern. It is no longer an impression, it’s ur identity",
          "score": 6
        },
        {
          "text": "Working in a service line causes you to curse the customer countless times in your mind. It's quite normal. The thing is, people do not really care about your feelings. Paying some money and bringing attitude to the table is what many people do. Anyway, this is just the tip of the iceberg. When you grow up, you might face people who are more ridiculous. It's a learning process. Even adults who have worked for years are unable to manage when reaching a breaking point. We are human after all.",
          "score": 4
        },
        {
          "text": "Your experience sounds like it was overwhelming and you were at a stress limit, physically and otherwise. (Minor bleeding from small injury usually seals up on its own very fast) The work and home environment also sounds like it doesn't help at all either. This is not a matter for guilt, OP, this is a matter for medical and maybe psychiatric intervention, including change in your work or living arrangements if feasible. Start by going to the polyclinic. \nDon't guilt yourself for what you cannot help. ",
          "score": 4
        },
        {
          "text": "but tbh if you have been working there for 4 mths and your colleagues haven't given any negative feedback abt your work, then you must be doing alright. or better than you think.\n\nright now, it may seem like a big mistake but in the long run, you will find that it's normal and we are just human...just do your best and maybe can consider more slow-paced job\n\nwhen i started working, i had a lot of anxiety and memory issues. you can try doing breathing and memory exercises and see if it helps? and if you think there are other underlying issues and are struggling mentally outside work, it's good to seek counselling or therapy",
          "score": 4
        },
        {
          "text": "Once when teaching I almost broke down in front of my class. Went out when I felt a panic attack coming and broke down in front of my boss and HR admin. Another teacher had to continue teaching the class. My bosses were understanding but that event definitely affected my career progression. It’s obvious that they don’t want to engage me anymore as a teacher even though they are very happy with my work. I’m now a lot better after starting therapy. I recommend you to do the same. Or at least go for counselling at SAMH or Fei Yue. I’ve used their services before so I can recommend them.",
          "score": 3
        },
        {
          "text": "Don't worry too much. I used to study hospitality and most of my batchmates (myself included) mentioned crying at work or due to work. Working in the service line is really stressful and many people underestimate how much pressure one has working in this industry, especially as a young person.\n\nI faced similar \"symptoms\" as you, and visibly broke down at work a few times when overwhelmed. It got so bad that I went to see a school counsellor.\n\nThe thing about service is that next day will be a different day. You can always bounce back :)\n\nAlso remember to take care of your health. Work is just work. And mistakes will pass you.",
          "score": 3
        },
        {
          "text": "*pats pats* customer service is not easy, I would’ve done the same as well and I am well over the age of being a teen (have very bad anxiety and personally I’m quite slow in doing things, customers who are impatient or have demanding and rude attitude trigger me a lot and I’ll had a whole breakdown there). What are some things that you might be good at or are confident in?",
          "score": 3
        },
        {
          "text": "I broke down infront of customers before as well. Don’t be too harsh on yourself, sometimes it gets really overwhelming and we may already have personal issues to deal with but need to maintain professionalism",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1r54a67",
      "subreddit": "askSingapore",
      "title": "Dilemma: Want to whistleblow but could get foreigner GF into trouble. What to do?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r54a67/dilemma_want_to_whistleblow_but_could_get/",
      "score": 70,
      "num_comments": 44,
      "created_at": "2026-02-15T11:31:20",
      "selftext": "Context: My girlfriend is Burmese, and like many people back home, left the country amidst the military coup and political instability. She enrolled in private diploma course in Singapore, did an internship and subsequently went on to work for the company in the F&amp;B industry. We met while I did a gig job at the shop.\n\nHer company is a small shop with a focus on selling traditional desserts, located somewhere in central Singapore. They expanded to a secondary outlet but it closed down less than a year due to poor sales. The original outlet also suffered from poor sales and the owner failed to renegotiate a new lease, resulting in a relocation to a new location, where my girlfriend is currently at. In between the lease expiry and the set-up of the new location, my girlfriend did not draw a salary for about 2 months but was held on as an employee because the boss said \"don't worry I know going back to Myanmar is very difficult now\". I was initially grateful for the gesture but things turned bad.\n\nGF has been with the shop since the beginning, and you could say I am biased but she has been really diligent. On some days even when she was unwell, she refused to be on medical leave as it would be \"bad for the company and difficult for colleagues\". She gets one off day per week, which is common for F&amp;B. What I am concerned about are her working hours.\n\nBack at the original store, her shift is 1100-2300, with a 1-hour break. When she was selected to go to the second shop, her hours became 1000-2100, similarly with a 1-hour break. At the newest location, her work hours are 0700-2000, and while there's a 1-hour break on paper, she gets about 15-20 minutes to eat at most. That works out to be more than 72 hours per week. Her boss also recently informed that they will be unable to take an off day for 2 weeks as another Malaysian colleague will be on leave. I know this is a clear violation of so many MOM regulations, and I really want to confront the management on her behalf and write in to the relevant authorities, but I am really afraid of the backlash she might receive.\n\nShe has been applying for numerous jobs but was always met with \"sorry no quota\". As a Burmese, she requires a Work Permit (NTS) which means there must be a higher corresponding number of locals in the company before a Burmese van be hired. Additionally, there is a limit to the roles she can work, such as manufacturering, F&amp;B and housekeeping.\n\nDespite being with her shop for almost 3 years, her boss seems to favour 2 new Malaysian staff that was recently hired; giving them more authority and leeway compared to my GF and her other Burmese colleague. She is really very exhausted but looking for a new job is proving an uphill task and she is afraid to voice out to the current boss lest her work permit gets cancelled. An alternative would be to apply for a job via an agent, but I have been scrawling through the postings for the past few weeks and most of them are either similarly bad or worse off. Majority of the jobs posted provide a median salary of $1500 with either 1 or 2 off day the entire month. This is excluding a hefty agent fee of about $6000. Not sure how they exploit certain loopholes when it is clearly listed that workers on a WP should be paid a minimum wage of $2000.\n\nThank you for reading and any advice is greatly appreciated.",
      "comments": [
        {
          "text": "Not the best reason to get married, but that would probably be the first step to making things easier for her to stay in singapore and find jobs. ",
          "score": 115
        },
        {
          "text": "Marry her loh, else u are ruining her life by whistleblowing",
          "score": 94
        },
        {
          "text": "This is the problem.  \n\"She has been applying for numerous jobs but was always met with \"sorry no quota\".\"\n\nBeggars cannot choose. The boss knows it. You know it.  \nYou can right the wrong (MOM regulations), and justice prevails for upholding MOM Regulations.\n\nBut it does not produce the desired outcome for the individual. The boss let her go after righting the wrong.\n\nSo the only recourse you have is solving the cause of it.  \n\"She has been applying for numerous jobs but was always met with \"sorry no quota\".\"\n\nMaybe have to find mymmar business where they will be more sympathetic to your needs. BUT , be prepared it will usually ends up in the same predicament. Most SMEs are known to be lean and mean because it is the boss money. Can save by hiring 1 worker, i will not hire 2 workers. Can exploit 1 worker legally, i will do it.\n\nYou can ask the cleaners or those SME staff how many annual leave they have and do they dare to take MC. hehe  .. I was damn surprised at their annual leave and they thought it was normal.",
          "score": 30
        },
        {
          "text": "There are millions in Myanmar that would give up anything to trade their life with her. Suggest to suck it up or likely hood she'll be replaced with another cheaper foreign labour and she ends up back to her war torn country.\n\nIt's cruel but it's the harsh fact that life is never fair when you are born at the wrong place, wrong family.\n\nYou can rescue her though by marrying her eventually.",
          "score": 30
        },
        {
          "text": "Name and shame the company",
          "score": 28
        },
        {
          "text": "...have you asked her how she feels about this?",
          "score": 27
        },
        {
          "text": "If you are ready to be married then ROM. Don’t think there is much you can do",
          "score": 24
        },
        {
          "text": "Unless you want her to be sent back after losing her job, you should do nothing.\n\nIf you're tired of her and want an easy way to break up then whistleblow",
          "score": 14
        },
        {
          "text": "And how much is she getting paid now? \n\nAt least now we know while the working hours are long. She won’t have risk of getting sent back, maybe the boss is “nice” in this sense for keeping her but the new hires are Malaysians. \n\nEven in industrial areas I overheard lunch conversations where these office people are also afraid of going home for years. \n\nDo you all wanna risk a chance where the next job might lay her off?",
          "score": 13
        },
        {
          "text": "1. Refer the case to HOME or TWC2. They have legal advisors, etc that can assist. \n\n2. This is very tough. I have volunteered with the Myanmar community and exploitation of Myanmar workers is more common because unlike workers from other countries, going home is not a real option for them. They have accrued massive debt just to get out and they risk not being able to get another passport, etc. This is why when they have to change jobs, they go to Thailand or Indonesia rather than go back to Myanmar. \n\n3. The problem is that any MOM investigation may lead to her wrongful termination. And yes, if she is fired, she is going to have to challenge that it was wrongful. This will cost money. In the mean time, she has no income, place to stay or even a valid permit to stay in the country. \n\n4. Even if she is not deemed to be a whistleblower, the risk of termination purely based on lack of money is real. \n\n5. OP  - at this point, you are aware of the harsh reality that she is in and the options are very limited. But your concerns are very real that she will work herself to death at this rate. Frankly, so many in Myanmar were eager to get out and agents exploit this with high fees and then leave them in terrible work situations. And Singapore sounds better for them compared to Malaysian and Thailand (also lots of Myanmar folks there) but we also have work conditions like this. \n\n6. Options I can see. \n\nA. Give feedback (through her and her colleagues), to the bosses that they cannot tahan. Yes, there is a risk but if the owner is smart, they also know they cannot work them to the bone. It is possible they continue with the conditions because they genuinely think that Myanmar people don't mind. \n\nB. Threat of escalation (through her or yourself) to MOM. This is a gamble, since it can definitely lead to retaliation. In this case, both need to be ready for work place retaliation as well as unjust firing. You may need to set aside funds/accom while she fights the case. \n\nC. Quit. Commit to finding another job in sg or overseas. This comes with a real risk of long term separation. \n\nD. Commit to marriage early. We should not take marriage lightly at all but if both of you are really sure that you want to be with each other, then it does ease a lot of the problems that you had on your mind. \n\n  \nGood luck bro. Thanks for trying your best for her. I hope for the best outcomes. \n\n",
          "score": 11
        },
        {
          "text": "72 hours per week far exceeds what she’s supposed to do for her pay. \n\nShe’s basically a slave at this stage. \n\nThere’s a NGO that helps migrant workers, perhaps they can better advise: https://www.home.org.sg/",
          "score": 10
        },
        {
          "text": "Willing buyer willing seller. Reality hurts. Unfortunately there is an abundance of people fleeing a war-torn country and people are willing to go to lengths to stay im Sg. If your girlfriend won't play ball someone else will.\nComplain to MOM he will just cancel wp and put her on a flight back. Investigation might get dropped or not depends on mamy factors. \nThe boss might not be a bad guy but forced to cut corners since business not doing well.\nUnless you have ideas on hiw to improve the business not much you can do.",
          "score": 8
        },
        {
          "text": "If u really want help her. Marry her. Get LTVP. No quota. Can whistle blow as much as u want. No cap. Unless you're afraid to take on the responsibility as a husband and prefer to stay as bf then okay",
          "score": 7
        },
        {
          "text": "Not “could” get her in trouble. More like “would”. Then she’d lose her job, then would have trouble staying in SG, then sent back home. List goes on",
          "score": 6
        },
        {
          "text": "Enroll in degree or advanced dip course for student visa to buy time, then whistleblow. Not sure if can take tuition fee loan from bank, but the upgrade in qualifications will be a plus too.\n\nEdit: you house and share food with her too since she would likely become unemployed temporarily",
          "score": 5
        },
        {
          "text": "In theory, there are some infringements of labour laws taking place as you have listed. \n\nIn practice, although her life here is hard (72 hour work weeks compared to whatever the lawful limit is), is it still much better than the alternative (working and living in Myanmar)? If yes, then which is the practical choice?",
          "score": 3
        },
        {
          "text": "No matter what, PLEASE do not travel to Myanmar for whatever reason. ",
          "score": 3
        },
        {
          "text": "As someone working in F&amp;B for a decade. I've come across such issues all the time.\n\nTo be direct, she has no chance of being treated anywhere close to Malaysian, let alone singaporean.\n\nHer salary and benefits will definitely be worse \n(My workplace hires Burmese with 2.5K but 60-70hrs a week)\n\nWhistleblowing also doesn't do much. Our government isn't as strong as what it seems.... A lot of wayang\n\nAlso, please don't listen to feedbacks on how you should just Marry her. I'm married to a non citizen and life isn't as easy as it seems",
          "score": 1
        },
        {
          "text": "You could save her by marrying her. But in all honesty (and I'm probably gonna attract downvotes for this), please choose your spouse carefully. Your quality of life vastly improves with a spouse on a similar earning level as yourself. Regardless of race or nationality.",
          "score": 1
        },
        {
          "text": "Seems pretty obvious to me that whistleblowing would put her at risk. What the hell are you thinking?",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r517wx",
      "subreddit": "askSingapore",
      "title": "Has someone ever stood up for you in public?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r517wx/has_someone_ever_stood_up_for_you_in_public/",
      "score": 69,
      "num_comments": 33,
      "created_at": "2026-02-15T08:59:34",
      "selftext": "Not in the literal, stand up to offer you their seat definition.\n\nRather, when they saw that you were being victimised/picked on unfairly by another person. Just curious what the general experience is considering how we as a people, for the most part, usually mind our own business.",
      "comments": [
        {
          "text": "Yes. One time in a crowded bus on the way home from uni, I was sat in window seat and this fucking creep sat in the seat next to me. Kept talking to me, manspreading on purpose so his legs touch my legs, I squish myself into the window/wall and he just move closer to me some more, motherfucker even take off his shoes. My brain was kind of in panic mode and I just froze and couldn't say anything and he keep leaning more and more into my space, I was almost crying/having panic attack and looking around at all the people around us like begging with my eyes for help. Of course since this is SG most people either didn't notice or didn't care 😅\n\nBut!! This super nice hijabi nurse who was sitting in the row behind me, I think she got sick of no one helping and she literally push the guy away from me and scold him like hell, almost yelling at him. Then the motherfucker faster get off the bus on the next stop. When I thanked her afterwards, she said the guy was like a serial creep and had done it before :( I was scared to take that bus home for a long time after that. I'm really grateful that nurse stepped in otherwise I think he might have tried to legit touch me or see where I get off the bus.",
          "score": 94
        },
        {
          "text": "Ok not exactly the type of scenario you’re asking for but recently I was trying to pass through the gantry at the MRT with my kid in the stroller, and dozens of people just streamed out from the wide gantry (despite there being 2-3 more available gantries) even though they could see I had a stroller. I could only stand and wait.\n\nThen an MRT staff got out from his office, stood in front of the gantry to block the way, and let me pass. It was his job la but I was still quite touched. Also, to all these inconsiderate people hogging the wide gantries even when you can see that there are people who need to use them, shame on you!!!!\n\nSame goes for able-bodied people cutting queues and hogging lifts. Once saw a shameless couple cut a wheelchair-bound girl’s queue to squeeze into the lift, which was 80% filled with people who appear to be able-bodied.",
          "score": 87
        },
        {
          "text": "Once I was with my family (with a stroller) at OCBC skyway. I was queueing to take the elevator down. Suddenly one group of tourist (probably about 6-7 of them, one whole family) from country i cut the queue and straight away enter the elevator. In my mind I was thinking (eh here got differentiate normal and VIP ticket one meh).\n\nGot one kind gentleman (ah Beng) shouted “eh don’t let them go in the lift, they cut the queue. The family (me) should go first”. He proceeded to go straight to the lift and tell the staff to ask the tourists to get out of the lift and join the queue. \n\nThe staff is a young girl and seems to be caught in an awkward position, but have no choice but keep **repeatedly** ask the tourists to come out and join the queue.\n\nI said thank you to the kind gentleman and he replied “No problem bro”.\n\nThis happened a few days before National Day and i kept thinking is this a small way how Singaporeans help one another?",
          "score": 49
        },
        {
          "text": "Happened long time ago when I was Police NSF...\n\nOn my off day I was at Sentosa beach on a weekday so whole beach was just me and slightly later a young lady parked herself about 200-300m away. Once a while I will glance around my surroundings (a safety behavior) and saw that she was later joined by a much older man. Of course nothing out of the ordinary. Next time I glanced he was applying suntan lotion on her back. Later, I could hear footsteps on the sand getting closer to me. The lady asked for my help and claimed that she had been molested. I asked a few basic questions just to be sure of what she claimed and at the same time the man took his bag and started walking away which strongly implies her claim was correct. In my mind was thinking god damn this has to happen on my off day and furthermore I was almost naked only in my swimming trunks didn't have time to put on clothes but I immediately chased after him.\n\nIf i recall correctly you need to walk quite a long distance from Tanjung Beach to the nearest bus stop and I tailed him. He noticed I was following him and later stopped to tell me to stop following him. Me being a great talk-cocker said I'm not following him and I'm going to take the bus. Obviously he knew I was BS'ing. After few more metres he stopped and begged me to stop following him said he cannot afford to go back to jail again. Sounds like an admission to me. Anyway, luckily he boarded the bus and I could get the driver to alert the police. The man realized the bus is not moving and he pressed the emergency button, exited the bus and started running. I gave chase. Luckily he doesn't have stamina to run and gave up eventually and we waited till the police came. Police drove me back to Tanjung Beach to get the lady and I finally got to put on my clothes lol.",
          "score": 33
        },
        {
          "text": "Yes someone has :) \n\nThere’s a guy who likes to ask for money in the TEL by going from carriage to carriage (still does it) and about a few months ago, I saw him asking a lady for some money (not the first time I observed this). She told him she gave already $10 yesterday so why is he asking for more? She tells him to find a job and that he must learn to work (just aunty advice 🩷). \n\nHe starts to berate her so I step in and tell him to leave her alone. He gets pretty aggressive berating me too telling me I’m poor, “don’t want to give don’t give lah just mind (my) own fucking business” and this one tall, pretty jacked bald dude who has been watching us comes over and towers over him. \n\nHe literally looks him dead in the eye and asks him if he has a problem. 😂 the guy looks like he’s about to crap his pants but keeps running his mouth as he backs away. When the train pulls into the next stop, he leaves quickly while mocking all three of us as we all step out. \n\nThe man who stood up for us asks us both if we’re okay (lady is quite shaken tbh) and follows us to speak to the station officers. \n\nThe complaints haven’t done anything to deter the guy asking for money tho but I liked knowing that someone stood up for the other lady and me.",
          "score": 29
        },
        {
          "text": "I wish I did it more. My parents are both great at this. I’ve seen my father tell off a driver who was shouting at his taxi driver who had given him enough way to pass on a one way road, and my mother start shouting back at another driver who was being rude to a petrol station attendant. \n\nI think it involves having a wider sense of community and responsibility than most Singaporeans have, and it’s not easy because most of us are non-confrontational, but if we all try to stand up for people in need, Singapore would be a nicer and warmer place to live.",
          "score": 22
        },
        {
          "text": "I have stood up for people, and also have had people stand up for me.\n\nWas in the MRT and some senior citizen had techno music blasting on his PMD. It was clubbing level, you couldn't hear the person next to you. Went on for one stop, then I buay tahan. Went to ask the old man to turn it down.\n\nOld guy of course started yelling at me, saying his PMD is registered, he has his rights. But what was scary was that he actually took a step towards me, first raised.\n\nTwo male passengers immediately leaned forward, so that they were on either side of me. The old guy immediately backed down, and muttered furiously before getting off. The male passengers went back to their phones. It was kinda nice, cos until that  moment I didn't even realise they were paying attention. No conversation required, just people doing what they needed to do. \n\n\nAnother instance - I was nine months pregnant and in the queue to enter a charity bazaar. Some old uncle behind me was trying to sneak past me and cut queue. I told him \"excuse me, I'm in front of you* and quickly closed the gap.\n\nUncle did *not* like being called out. Started shouting that he didn't know if I was queueing since I was dreaming, demanded to know if I was Singaporean, told me I was obviously a Filipino and dunno how to behave in Singapore, etc, etc.\n\nThe charity volunteer managing the entry to the bazaar heard the yelling and looked up. Now, the charity's focus is prevention of  domestic violence. And what she saw was an uncle threatening a very pregnant woman.\n\nAuntie did not playplay. \"SHADDUP LAH YOU CAN SEE SHE'S PREGNANT??!\" \n\nUncle clammed up so fast as the entire queue (all women) stared at him. Easily one of the most satisfying moments in life.\n\n\nTldr, Singaporeans will do the right thing for complete strangers, they just need nudging.\n(Also there are a lot of uncles with anger management issues)",
          "score": 21
        },
        {
          "text": "Once at a hawker centre. I was looking to buy back a fish soup for my colleague. Context i am non-chinese. I was taking my time standing around, making a few rounds deciding which shop to buy from when the aunty rudely told me off in mandarin. Mind you i was not blocking anyone and it's not like i was in a queue. Obviously i didnt understand and then a kind lady yelled back to the aunty and told me \"sorry i don't know why she's screaming m, i suggest u buy from another shop\". Does this count hahaha",
          "score": 21
        },
        {
          "text": "confronting people is really hard I've learned LOL\n\nbut I've had really kind strangers go out of their way to help me tho ☺️",
          "score": 13
        },
        {
          "text": "I was at a bar and accidentally walked in on a guy in an occupied toilet as he hadn't locked the door, hitting him in the back with the door in the process. I apologised and then waited outside expecting nothing more than a bit of embarrassed eye contact when he came out. \n\nInstead when he was finished he came out screaming at me, labelling me an entitled white guy and getting in my face. Before I had time to process what was going on the local guy behind me in the queue stepped in and unloaded on the guy screaming at me. I couldn't quite grasp everything that was said and there was a lot of non English words in his rant, but it was effectively along the lines of if he doesn't want people to walk in on him he should lock the door.",
          "score": 9
        },
        {
          "text": "I just settled into a bus and an old uncle (60s) followed behind. He then sat next to me and appeared to be constantly rummaging through his bag. While doing this, he kept elbowing his arm towards me, so I blocked myself from him with one arm. At that time, there was just another seat available to switch and it was the one beside the uncle. All this while I was thinking, \"wth does this uncle think he's doing, should I say anything? He's so frail looking, maybe he was looking for medication.. I need a witness before ppl start calling me crazy for \"falsely accusing\" an old uncle.\" Luckily another guy around 40s boarded the bus at the next stop. As he settled beside that uncle and he immediately noticed what the uncle was doing and called him out. The uncle, surprised and embarrassed, quickly stopped his actions. 😿",
          "score": 6
        },
        {
          "text": "I was scooping ice cream at a buffet. One of our protocols is that we can't handle customer spoons, bowls, etc. because of hygiene purposes. So we always tell customers to take their own bowls before we scoop. \n\n99.999% of the time it's chill because it's not a big deal. But there was one time where a man came up and got peeved that I couldn't take the bowl for him. \"No, please help yourself\" he replied back, basically telling me to do it for him. I explained our protocol to him and he was outraged over it, said it was stupid logic, all that. \n\nThe *very next* customer was another man and his teen son, and the first thing they said to me was \"Forget about him, he's not worth it. You're doing a ***great*** job.\" His teen son then echoed the same sentiment to me after his dad left. And when they left the buffet some time later, the same dad told me he gave me a good service review to my manager.\n\nStill touches me to this day. Man obviously didn't need to do any of that, but still stood up for a service staff. He's teaching his kids right.",
          "score": 3
        },
        {
          "text": "One time, I was walking out of an mrt station when suddenly a toddler ran in front of my path and I accidentally stepped on her slipper, causing her to fall. Her mum then turned back and saw the commotion and decided to start blaming me (seriously, why was your daughter behind you?)\n\nShe wanted to see a doc and demanded me to pony up the cash, luckily there were a few women who saw the whole thing and stood up for me. In the end, the woman left to see the doc in a huff.\n\nIm so thankful for those women who stood up for me. And to the bitch that couldn't even watch over your own daughter, do better.",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1r4iafg",
      "subreddit": "askSingapore",
      "title": "What do you think is Jack Neo's worst movie?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r4iafg/what_do_you_think_is_jack_neos_worst_movie/",
      "score": 57,
      "num_comments": 66,
      "created_at": "2026-02-14T19:25:36",
      "selftext": "I think Ah Girls Go Army and I Want To Be Boss are the worst ",
      "comments": [
        {
          "text": "Ah Girls go Army - full of ads and cringe dialogue",
          "score": 233
        },
        {
          "text": "Easier to ask which is his watchable movie.",
          "score": 94
        },
        {
          "text": "All his movies are trash - relying largely on horrible stereotypes which makes no sense",
          "score": 49
        },
        {
          "text": "Which one hasn't been bad?",
          "score": 34
        },
        {
          "text": "Never watch ah girl go army. \n\nBut lion man was 2 movie length worth of ads",
          "score": 23
        },
        {
          "text": "Gotta put it out for you guys. The reason why Money No Enough 1 was good? It was never directed by Jack Neo.",
          "score": 16
        },
        {
          "text": "anything without mark lee and hui ge",
          "score": 15
        },
        {
          "text": "AGGA is the worst of all so far, rest of his movies are at least decent enough to watch. I can't wait to watch Liang Po Po vs Ah Beng on CNY day 1, hope that is at least watchable enough. ",
          "score": 14
        },
        {
          "text": "He should stick to Liang Po Po and ask Voucher wong to join him",
          "score": 9
        }
      ]
    },
    {
      "id": "t3_1r4npsu",
      "subreddit": "askSingapore",
      "title": "Who here doesn't like your job but is following through anyway?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r4npsu/who_here_doesnt_like_your_job_but_is_following/",
      "score": 54,
      "num_comments": 19,
      "created_at": "2026-02-14T23:39:28",
      "selftext": "I am actually wondering how many of us are lost in life and have no idea what we really wanna do, but took up a random academic path and followed through with a job that feels foreign?\n\nI'd love to gain some insight on your experiences",
      "comments": [
        {
          "text": "There’s no 100% job that you will like, some days are 80%, some days feel like 20%. \n\nAt the end of a day, it’s just a job. If you have a good boss, nice colleagues and decent pay that’s enough for me.",
          "score": 103
        },
        {
          "text": "I used to love my job. The job was perfect. I had great friends, the work was manageable.\n\nThen a big tech company came and offered me an insane salary bump. I thought wow, finally I can do something big and never have to worry about money again.\n\nIts the worst place I’ve ever been in, mentally. The intensity and the cutthroat environment saps the life out of you and you dont have time nor energy to spend all that money. I dont even get called for interviews because everyone automatically assumes im too expensive to hire. i’m too scared to quit because if i do, getting employed again is a big uphill battle.\n\nthis is my life now, golden handcuffed to a job I hate. shouldve learnt to be content with what I had, which is retrospect, was alot.",
          "score": 54
        },
        {
          "text": "I dont think I've ever met someone who absolutely love their job at hand. \n\nAt some point, we just gotta admit we're doing it so that we can put food on our tables and with better privilege, plan our next overseas vacation.\n\nEdit: grammar",
          "score": 16
        },
        {
          "text": "Got straight As for A levels but didn’t know what I wanted, I was super sick of the hyper competitive environment in one of the top JCs so avoided law/medicine. In the end, by process of elimination I picked a course I thought I won’t hate. \n\nOne year before graduating I got into a mini depression as I had to enter the working world soon and still felt lost. First few years of work in public healthcare was tough, I downspiralled again, needed to take unpaid leave and was on depression meds for a bit. My work needed me to do night shifts, regular Saturdays, some public holidays, Sundays. Many times for the sake of my patients, had to shorten my lunch timing, there was a lot of OT too. It was super difficult to take leave because everyone had one year of leave brought forward and we needed to ballot one year in advance. \n\nYears on in my mid thirties now and I’m in a much better place. I don’t think I’m super passionate about what I do still but I’m peaceful about it. It still contributes a lot to society which is meaningful. I realized work-life balance is very important to me and I’m quite easily satisfied. I found out my core values are family, health and pleasure for self. Am in a job currently that allows me to knock off on the dot, have proper meal breaks, strictly office hours with no OT, and able to take leave flexibly. I got married and have two preschoolers now and I’m so glad I can spend quality time outside of work with them. I exercise regularly to ensure I’m healthy and won’t have regrets when older. I invest my money in global diversified ETFs early on and the capital gains I get is sufficient for me to coastfire in a few years time and be on track for full retirement before 58. This is despite me not being high earning (still below salary cap for bto!) \n\nAm also a Christian which gives me hope beyond my current life. \n\nSo if you ask me if I found something I’m truly passionate about career wise I’d answer I don’t think so but I don’t think it’s important. If you ask if I’m happy currently? I’m happy with my life, thankful for my loved ones and fully at peace :) \n\nSo advice is to find out what you value in this life (there are online quizzes on this you can do easily) and work toward that. It’s likely going to be different from those around you so no point comparing their achievements to yours. I hope you find peace and direction ;)",
          "score": 12
        },
        {
          "text": "My job is almost perfect, barring the lack of challenge and progression - great WLB and colleagues, good pay and benefits. Even then, I still struggled occasionally with dissatisfaction and boredom. Now I'm more or less checked out - just do my work for the pay cheque and use the extra WLB to spend time with my kids.\n\nSo even if you get your dream job, chances are there'll be times when you still won't like it and it feels foreign / sian. There's no 100% happy utopia out there, just like how you're gonna argue occasionally even with your perfect soulmate. Understanding this and dealing with it is part of being an adult.",
          "score": 12
        },
        {
          "text": "Even if you do find one, you’re bound to find ******* who will try to screw it up for their own benefit.",
          "score": 7
        },
        {
          "text": "I really enjoyed my job when I first joined my current company. Great job, team mates/culture and interesting variety of work. Career progression happened so I moved to a different team and was promoted to sort of middle management (as a IC) for a few years. Pays great but man some days can be so demoralizing.\n\nHalf of the time is dealing with internal politics, resolving conflicts between different regional teams and preparing for executive level updates/reportsn or  revenue optimisation exercise. \n\nBut I have made my peace. Life is more than just work and work should not drive your outlook to life.\nIt is a means to an end. \n\nBeyond the 9-6, you can choose to focus your energy and passion on things that are meaningful to you as a person. It can be your family, your social attachments, community/charity work, hobbies or any other matters of interest to you. These are the things that define you, rather than the time spent in an office.",
          "score": 5
        },
        {
          "text": "Left a job I love because it didn’t feel stable anymore. Joined a job that pays better and I hated it. I thought I should just power through… I’d probably feel good about the job every other month but it doesn’t last. I miss caring about my job, I can do so much more but this job isn’t allowing me to grow or tap into my full potential. Everyone keeps speaking in Chinese too haha so I felt super left out. It genuinely got me depressed. \n\nGoing almost 2 years and finally, a (seemingly) good job offer came up and I took it. Bigger role. bigger pay. Immediately. \n\nI know people who show up, clock in and out, without making strong connections at work. Just do the job and fuck off, y’know? I’m not one of those, I couldn’t do that. I need a job that matters to me, working with like-minded people and I may have just found it? Hopefully. \n\nWish me luck!",
          "score": 5
        },
        {
          "text": "There are moments where I feel like damn i love what I do and there are moments where I absolutely hate it and just can’t wait to leave but I know it’s my way of funding my lifestyle. That keeps me going. I don’t do the bare minimum but I also don’t overwork myself. I’m in at 9 and leave at 6. Between those hours I will do what needs to be done but don’t expect me to be sacrificing my own time for the company. I always make that clear during the interview and I’ll let the company decide if they can accept that.",
          "score": 2
        },
        {
          "text": "The idea of liking the job not only means the jobscope but more often it also means liking your boss and coworkers. Which doesnt happen easily.\n\nOnly 2 longer proper jobs on my resume and 1st one was chill but pay was low and feels very sunset, and japanese company so i ran as my gut feeling told me. The ppl were generally nice boss also was just a friendly uncle bjt i had nightmares  and being the first job after grad i was stressed over my future. A year or 2 after i left the place closed down and their office moved over to local hq and the parent company got eventually bought over and i think delisted.\n\n2nd is us company, imi actually quitted and hovered more than a year so i just thought this cant go on and just went yolo with it, no point thinking about the future without the present. People were nice the culture is so dofferent and i came as a batch, but half of us are gone but most of those who left didnt like it, some even left their next workplace within half a year. Also my management seldom accept people back once they leave, i tdont think im ready yet\n\nStill waiting for my eureka moment to explore smth else, till then imma just be happy i can pay my bills and get the kachinga in my pocket.",
          "score": 1
        },
        {
          "text": "They pay you money to do your job. Think about it.",
          "score": 1
        },
        {
          "text": "Recently in a job in May 2025 which I thought I can work till I retire. Moreover, I have come to a stage where I am not ambitious to climb up the corporate ladder anymore.\n\nAs of now, I feel so draggy to go to work. Despite the my colleagues are not nasty, the working environment is hectic, overwhelming with workloads and the runways are short for most tasks. Makes me feel so burnt out that I wish I can change job.\n\nBut changing jobs in my 40s makes me feel anxious and it also makes me feel that I am less resilient because my history length of employment has always been 2 to 5 years. So I thought it would be best to stay a few more years. =&gt;😓",
          "score": 1
        },
        {
          "text": "Every job I’ve been in I like it for the first 3-6 months. With time you’ll start to feel burdened and that’s normal",
          "score": 1
        },
        {
          "text": "Was studying law. Switched to accounting. Questioning life everyday that I’m stuck with number crunching now when I miss using my writing skills",
          "score": 1
        },
        {
          "text": "I'm one of them, I'm stuck because I can't seem to find something better elsewhere so I haven't yet made that jump, I have progressed exceptionally fast  (mid management in a Japanese chemicals company) at my current place though because people of the same rank as me are like 10 years older? But ultimately, I know this place is not for me. I'm just a ticking time bomb because my notice period is just 1 month and I will have 25 days of leave upon resignation",
          "score": 1
        },
        {
          "text": "depend wot kind of component u dont like lohhhhhhhhh\n\ni dont like it when my job is super forking brain ded and monotonous without challengeeeeee\n\nbut then the jobs that are challenging dont want me cuzzzz no degree no certifcations reeeeeeeeeeeee",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r4nfnr",
      "subreddit": "askSingapore",
      "title": "Why are there so few local horror movies made here?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r4nfnr/why_are_there_so_few_local_horror_movies_made_here/",
      "score": 38,
      "num_comments": 34,
      "created_at": "2026-02-14T23:27:59",
      "selftext": "I think I can count with one hand already the number of local SG horror movies. Ignoring some unserious ones and animated movies, I can only list:\n\n\\- The Maid (best sg horror ever in my opinion btw)\n\n\\- 23:59\n\n\\- Haunted Changi\n\n\\- Ghost Child\n\n\\- Revenge of Potianak\n\nAs a horror movie buff, it's pretty sad considering most of these few local horror movies are actually rather decent and can sometimes be scarier than international productions due to better relatability (eg. ghost haunting in a HDB compared to some terrace house).\n\nAlso for some reason, the horror genre here has completely died in recent years. I remember back when Incredible Tales was a thing. When kids all read Mr Midnight and True SG Ghost Stories. What happened??",
      "comments": [
        {
          "text": "Cost of living is scarier",
          "score": 67
        },
        {
          "text": "mon-fri alr scares me shitless",
          "score": 22
        },
        {
          "text": "They get too scary. Search for 迷离夜 drama series by SBC.",
          "score": 19
        },
        {
          "text": "Sorry - digressing here. I’m also a horror lover, any good horrors to recommend?",
          "score": 11
        },
        {
          "text": "Gaddamn I fell asleep whilst watching Haunted Changi. Thank goodness my friends didn’t leave me behind when it ended.",
          "score": 6
        },
        {
          "text": "Market is niche. There are no efforts to market the movies internationally. Low box office means less incentive for filmmakers to make such movies.",
          "score": 5
        },
        {
          "text": "Have you seen Utt now from The Incredible Tales? He is the real incredible tales. Fella doesnt age sia",
          "score": 5
        },
        {
          "text": "can't stuff it full of advertisements like a jack Neo movie ma... can't be half way into movie the ghost suddenly compliment the starmex aircon very cold and power saving LOL ",
          "score": 5
        },
        {
          "text": "cant seem to find new mr midnight/mystery anymore too, anyone knows what happened to them?",
          "score": 5
        },
        {
          "text": "The same reason why there’s so few local anything here.\n\n\nEdit: in the arts space anyways",
          "score": 3
        },
        {
          "text": "There’s no market for horror here. Even for hollywood horror blockblusters you’d be lucky if the cinema was even half full",
          "score": 2
        },
        {
          "text": "I have a lived experience with horror. \n\nIt was called retrenchment.",
          "score": 2
        },
        {
          "text": "Wait for mrt to break down during peak hour, you are part of the movie alrdy",
          "score": 2
        },
        {
          "text": "There’s no real need for local horror movies as the cost of living is already a horror happening in real time .",
          "score": 2
        },
        {
          "text": "Getting up every day and going to work for 40 years  is enough horror",
          "score": 2
        },
        {
          "text": "That’s already quite a few lol. Try action or scifi and the landscape is even more barren.",
          "score": 1
        },
        {
          "text": "Nothing really scary about Singapore",
          "score": 1
        },
        {
          "text": "Most malays get their horror fix from Malaysia/Indonesia movies already. Personally i prefer thai horror movies they are scary af + the different language and culture vibe",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r4f7us",
      "subreddit": "askSingapore",
      "title": "Sim Lim Square - PC Repair Recommendations",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r4f7us/sim_lim_square_pc_repair_recommendations/",
      "score": 31,
      "num_comments": 31,
      "created_at": "2026-02-14T16:15:51",
      "selftext": "Hi All,\n\nI bought my PC in 2020, haven't taken that much care of it over the years, monthly cleaning, and stuff, but it has served me well. It is definitely a bit older now, but I think still good enough for my use cases. I never overclocked, or used it that much either, maybe 2-3 months a year when I'm free. Haven't played many games on it either since 2023. \n\nRecently it randomly stopped working recently, I think its a PSU issue. But also realized, I haven't added CPU paste since 2020, so not sure what the issue is. That is why I'm worried about going straight to SLS, scared of scams. \n\n  \nAny recommendations for a shop in Sim Lim Square (SLS), that I can take it for repair that won't rip me off (I'm not too knowledgeable about this stuff - but will do my research before I go). I just want a good service, and decent price can already.\n\n  \nThank you! ",
      "comments": [
        {
          "text": "Bring to PC Care and Solution and look for Nigel",
          "score": 90
        },
        {
          "text": "The dodgy shops in SLS were those selling cameras and electronics on the first floor. The PC hardware shops are generally all decent.",
          "score": 11
        },
        {
          "text": "Pc clinic level 4. Step out of passenger lift turn left walk straight.  Look for kenneth",
          "score": 3
        },
        {
          "text": "A quick check if its a PSU problem (if you can still turn on your pc): Download HWiNFO, run the application in \"Sensors only\" mode and scroll down to the motherboard section to monitor key voltages (+12V, +5V, +3.3V). The numbers should not be too different from the stated voltage.",
          "score": 3
        },
        {
          "text": "Any PC builder could sort this eg Performance PC, Dynacore, Vii. Is just a matter of finding the right part to swap.\n\nTalk to a few and go with your gut.",
          "score": 2
        },
        {
          "text": "If you cannot power on at all confirm PSU. Thermal paste can last for a long time. Only the most siao on PC enthusiast will repaste every year or so. If it's not having overheating problems, best is to not do anything.",
          "score": 2
        },
        {
          "text": "You can try PC themes at sim lim. Level 4. There’s a friendly giant there who can help you.",
          "score": 1
        },
        {
          "text": "#04-18 the pc repair shop.",
          "score": 1
        },
        {
          "text": "If you stay at Toa payoh.i can check it for free.",
          "score": 1
        },
        {
          "text": "Any lights from your motherboard?",
          "score": 1
        },
        {
          "text": "You can hire private cleaner to come over to do thermal paste replacement. Deluxe pc",
          "score": 1
        },
        {
          "text": "At this era, I really don't recommend any parts to be repaired.. just replace it, unless it's like a $3000-$5000 GPU.\n\nI had bad experience with those kok simlim repair.. my ram was swapped with another kit.. they denied it even after I produced my original kit box and the number did not match the one they returns me.. my original kit was silicon lottery..\n\nIf you really don't know how to do basic diagnosis or troubleshooting, just find a young boy in carousel and offer to pay him $100 to $150 to come your house to diagnose and basic troubleshooting..\n\nAnd provide recommendation for any new components that i  to be procured by yourself.",
          "score": 1
        },
        {
          "text": "Did my repair at Mansa computers. Turns out it was just a small problem and they solved it for cheap. Honest bunch.",
          "score": 1
        },
        {
          "text": "I used to do internships at Vii PC and troubleshooting was one of the things I was trained at. We charge customers $20 to troubleshoot any issues with the PC and identify which component was causing the problem. Once identified, the customer can decide whether they want to replace the faulty component or not. They don't do component repairs, if you planning to repair the components, you'll have to look somewhere else",
          "score": 1
        },
        {
          "text": "PC themes",
          "score": 1
        },
        {
          "text": "If you're willing to do research and work on it yourself, any half decent PC store will be able to help you troubleshoot the issue, and you fix accordingly.\n\nA while back I did mine at Mansa Computers, paid the guys 15 dollars to test and tell me that it was PSU problem. Bought a new PSU elsewhere and did the change myself.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r51a1j",
      "subreddit": "askSingapore",
      "title": "has anyone dropped their surname ?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r51a1j/has_anyone_dropped_their_surname/",
      "score": 22,
      "num_comments": 41,
      "created_at": "2026-02-15T09:02:13",
      "selftext": "id like to know whats the process like to drop my father's name . im malay so i have the binte i wna scrap that entire last name HAHAHAHA what are the fees &amp; process like ? which lawyers or whatever can you recommend ? ",
      "comments": [
        {
          "text": "You can change it via deed poll. It involves submitting it online to a law firm for drafting then in person signing. Then you need to change NRIC passports etc. cost should be less than 200 total\n\nI did the process for my child but she was less than one year old so just needed to go to ICA no need lawyer",
          "score": 28
        },
        {
          "text": "Do so via [deed poll](https://singaporelegaladvice.com/law-articles/how-do-i-legally-change-my-name/)\n\nDunno about the charges. But i've seen one of my Malay colleagues without \"binte\" in her name. Basically instead of Sabrina Binte Ali, she's just Sabrina Ali. And one who left and reapplied within the company with a totally different name.",
          "score": 23
        },
        {
          "text": "Op that’s technically not a surname it’s a patronymic :) if it were from your mother it’d be a matronymic",
          "score": 18
        },
        {
          "text": "But what are you gonna indicate as your last name on your passport  ? What happens when you travel abroad?\n\n  \nIf you insist you can reduplicate your name\n\ne.g. Siti SITI \n\nFirst name Siti , Last Name Siti",
          "score": 17
        },
        {
          "text": "Im considering dropping mine too. Kinda hate my father's entire clan. Bunch of selfish pricks",
          "score": 8
        },
        {
          "text": "If you change your name, just remember you have to update a bunch of companies and documents. Like banks, insurance, any will you have done, your current company, school if you are studying, etc.",
          "score": 6
        },
        {
          "text": "Go to a lawyer, they can do it for you. You can Google for such law firms , not expensive",
          "score": 4
        },
        {
          "text": "My Malay friend and their spouse and even child did. Go to a lawyer for a deedpoll, do the needful, then update via ICA online. Deed poll $50. IC = $60, Passport = $70 or 80 can't remember. Just google deed poll singapore. Also thats not your surname, but your patronymic name (i.e. father's name).\n\nBe VERY careful about not having a last name, cos some countries ban people who do not have last names, I think UAE and China disallow. You need to google and check. \n\n[https://irblaw.com.sg/practice-areas/deed-poll/](https://irblaw.com.sg/practice-areas/deed-poll/)",
          "score": 4
        },
        {
          "text": "You need a deed poll,just go to lawyer office and inquire and pay the required fees.",
          "score": 1
        },
        {
          "text": "I paid abt $50 to change my name 20 years ago via deed poll. It shouldnt be that expensive now I think.",
          "score": 1
        },
        {
          "text": "Any lawyer can do it. I am also Muslim and I dropped the bin and the first name from my name. Makes it easier for work if my name is just 2 words (first and last name).",
          "score": 1
        },
        {
          "text": "Nothing wrong with it but why?\n\nI don't go around parading my full name to people \n\nJust curious as to why one would wanna , one possible reason is fallout hence wanting nothing to do with your father",
          "score": 1
        },
        {
          "text": "I'm sure you can. But when I looked into changing my name. I had to update ALLLL my certs and talk to bank, Moe, etc etc etc. it was such a big job",
          "score": 1
        },
        {
          "text": "Wait…that’s not your surname isn’t it?",
          "score": 1
        },
        {
          "text": "Dropping the bin or binte is quite common nowadays. It fixes travel and visa problems a lot. Different airlines and different countries have different rules on how to treat the bin and binte. Also families end up ungrouped because parents and children have different surnames. I am Malay and a few years ago I was travelling with my wife and kids but French immigration did not easily believe my kids were mine as we don’t share a family surname.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r53pmx",
      "subreddit": "askSingapore",
      "title": "Youtrip Biometric Verification",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r53pmx/youtrip_biometric_verification/",
      "score": 17,
      "num_comments": 21,
      "created_at": "2026-02-15T11:02:39",
      "selftext": "I haven’t used Youtrip in a while but recently logged in as I’m going on a trip soon. I realize they have implemented biometric verification requiring users to send their face scans to them (not Apple FaceID). \n\nOther than SingPass and government related services, I’ve never had apps requesting for such private information. Is it safe to provide biometric information to private companies and is this required by law? \n\nI’m concerned what happens to the data when leaks happen given such data is essentially like fingerprint and can’t be changed. How can we protect ourselves as consumers?",
      "comments": [
        {
          "text": "If it is through Singpass then no biometric information will be sent to Youtrip. Singpass acts as an intermediary to tell Youtrip that u/nincompoop is a real person\n\nFYI, Youtrip is considered financial services so they will need your IC/Passport details as per MAS regulation",
          "score": 11
        },
        {
          "text": "Is using youtrip essential for you? To protect yourself as consumer, look for other that don't require this. Govt does not offer you protection in cases of leak. ",
          "score": 6
        },
        {
          "text": "All companies will claim that they securely process your personal data, but it's always good to be skeptical because we do not see *how* they process that data (who/what/where it's being passed on to, etc.). Even if not required by law, and it isn't prohibited by law, companies can enforce it in the name of account security because it's their service and they can manage how they want to.\n\nThere's not much you can do in this scenario in terms of data privacy. If you're really concerned about providing your biometric data, the alternative is to stop using YouTrip (but that's probably not the answer you're looking for)",
          "score": 5
        },
        {
          "text": "Came here to see if anyone else has brought it up too 😂😂 and it sucks that they will lock your account if you refuse for more than 3 times. I felt so pressured to do the face scan because I’m also travelling soon but definitely uncomfortable since no other financial service has asked for this",
          "score": 4
        },
        {
          "text": "Just delete Youtrip, its trashy anyways, who knows what biometrric data they gonna lose?",
          "score": 4
        },
        {
          "text": "Just ignore. after ignoring 3 times they stop prompting me in subsequent apps open\n\nif most people dont do it, they have less leverage",
          "score": 3
        },
        {
          "text": "Getgo sign up now also require singpass face verification, but that's through singpass to provide authentication to Getgo. ( Though I have no idea what they did to make Singpass agree to let them have the feature)",
          "score": 1
        },
        {
          "text": "Was charged me S$20 from a random Saturday noon while I was taking a nap through grab and I can’t seem to get a refund",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r4jf8s",
      "subreddit": "SingaporeRaw",
      "title": "This condo looks like a HDB estate",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r4jf8s/this_condo_looks_like_a_hdb_estate/",
      "score": 310,
      "num_comments": 36,
      "created_at": "2026-02-14T20:28:21",
      "selftext": "",
      "comments": [
        {
          "text": "Yes, Ivory Heights was formerly an HUDC estate. HUDC is the predecessor of what we have as ECs today -- slightly more atas than HDB but below condo. Larger space. Read about the HUDC concept here.\n\nHUDC Flats in Singapore: The \"OG\" Public Housing For Our Sandwich Class https://share.google/cHEh1BUTPHta8GD2M",
          "score": 149
        },
        {
          "text": "HUDC was a thing",
          "score": 103
        },
        {
          "text": "The one at JE?\n\nI visited a family staying there.\nIt's quite big sized compared to new gen condos and the space between each buildings is a distance away.\n\nReally a gem.",
          "score": 63
        },
        {
          "text": "Former HUDC flats that were privatised. \n\nMost got enblock and redeveloped",
          "score": 22
        },
        {
          "text": "It was, they privatised it many years ago.",
          "score": 21
        },
        {
          "text": "The golden age of older condos before they adopted the BTO mass production layout style. It is very spacious inside. They are trying to en bloc though. Slowly by slowly.",
          "score": 21
        },
        {
          "text": "When we went shopping for a condo to upgrade to, we were shocked to see how badly maintained and inefficient the condo units and grounds were. \n\nI kid you not, standard HdB estate is really the pinnacle. The space allotment and planning is just superior to most modern condo.\n\nAfter entire days of looking at the condos, returning back to our 25 year old HdB was a real eye-opener. Our 25 year old estate was far better maintained even compared to 5-10 years old condos.\n\nIf we didn’t have to move for our child’s school, I’d be perfectly happy to stay in HdB estates.",
          "score": 13
        },
        {
          "text": "Unit size for 3 bedroom there is 1700 sqft it’s location opposite town center, JEM and and mrt is walking distance. As long as you reno to your taste, the location and interior space is chef’s kiss.",
          "score": 7
        },
        {
          "text": "i miss those open spaces and throwback to a better time tbh",
          "score": 7
        },
        {
          "text": "And this hudc stills look better than the Melville condo at simei despite it being better damn",
          "score": 7
        },
        {
          "text": "All I know is HDB and private developers pakat together to make adjacent HDB estates look ugly, otherwise condos will have less of a pull factor. ",
          "score": 7
        },
        {
          "text": "Old Condos are a vibe lol",
          "score": 7
        },
        {
          "text": "The living room is like the size of a modern 3 room hdb. My extended stays there.",
          "score": 5
        },
        {
          "text": "Ivory Heights have very spacious units, some of their living and dining rooms work like dual tier setup. Sprawling space.",
          "score": 2
        },
        {
          "text": "Ivory heights tried to en bloc many times but not successful. Not much lease left.",
          "score": 2
        },
        {
          "text": "Nowadays hdb a lot nicer",
          "score": 1
        },
        {
          "text": "It is HUDC. So it was built and designed by HDB.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r4zz2q",
      "subreddit": "SingaporeRaw",
      "title": "Cantonmnt Close void deck celebrates CNY! If I tell you this Is made by CECA?!!",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r4zz2q/cantonmnt_close_void_deck_celebrates_cny_if_i/",
      "score": 91,
      "num_comments": 25,
      "created_at": "2026-02-15T08:01:45",
      "selftext": "",
      "comments": [
        {
          "text": "According to thesmartlocal, she's Singaporean and her sons did NS. So yea you can tell us this is made by CECA but at least from online sources she is one of us.",
          "score": 104
        },
        {
          "text": "Stupid or what. Not all Indians are CECA",
          "score": 92
        },
        {
          "text": "Bruh a nice makeover also end up ceca or not debate like are we that low😮‍💨 ngl its a lot of effort to do this for the whole void deck.\nSo instead of figuring who did it, why not appreciate it instead?",
          "score": 48
        },
        {
          "text": "Finally some news of an expat doing something positive",
          "score": 44
        },
        {
          "text": "Reddit Singaporean can't make it. They are good at Seollal and tet deco. ",
          "score": 18
        },
        {
          "text": "Regardless, nice.",
          "score": 12
        },
        {
          "text": "Local Indian = ceca ??",
          "score": 8
        },
        {
          "text": "Kudos. I have to give them S-tier for their effort and SSS for the result.”",
          "score": 5
        },
        {
          "text": "Wait till you see the paper dolls at night without lights",
          "score": 3
        },
        {
          "text": "Really nice tho.",
          "score": 2
        },
        {
          "text": "Macham haw par villa",
          "score": 2
        },
        {
          "text": "By 7th month must take down, abo resident night time heart atk",
          "score": 1
        },
        {
          "text": "Ceca?!!",
          "score": 1
        },
        {
          "text": "Of course if really is CECA origin but make effort to integrate, behave civil, nobody will not welcome you.\n \nHow many CECAs are there that are like that? A one in a million ~~",
          "score": 1
        },
        {
          "text": "Posted yesterday too lol .",
          "score": 1
        },
        {
          "text": "Doesn’t matter who made it.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r55mqc",
      "subreddit": "SingaporeRaw",
      "title": "actually what's left of Singapore identity and culture these days? We are hitting 10 Million population very soon, so overcrowded with all sorts of New Citizens, until even PRC tourists joked to their families back home they are seeing all the China restaurants, shops, services staff all PRC",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r55mqc/actually_whats_left_of_singapore_identity_and/",
      "score": 91,
      "num_comments": 51,
      "created_at": "2026-02-15T12:43:04",
      "selftext": "from Sam Choo:\n\n“I felt like walking into a different country.”\n\nA few years before Covid, a minister shared that when he stepped into a lift, he heard people around him speaking in a language not his own. He said it was the first time he felt like a foreigner in his own country.\n\nBack then, I was working in the same area, serving one of the big banks. Every morning I would walk past a department with glass walls. One day I glanced in. Row after row of desks. Computer screens glowing. And every single person inside seemed to be from the same foreign country. It's like a foreign village planted into the room. \n\n \n\nYesterday, I read a post from a fellow Singaporean working in an office in the West. He said most of his colleagues were foreigners. They had their own lingo, their own inside jokes, their own favorite lunch spots. He found himself listening to conversations he could not quite follow. Smiling when everyone laughed, even when he did not fully get the joke. He said he felt like a minority in his own turf.\n\n \n\nWhen you sit in your own office and feel like the outsider, something shifts quietly inside your identity.  It is just a subtle dislocation. Like the furniture in your house has been rearranged and you are still trying to find the light switch in the dark.\n\nLast night, after dinner, I walked into the mall nearby. I had not been there since Covid. Same building. Same escalators. But it felt unfamiliar. Many of the shop signs were brands from one particular foreign country. I caught myself wondering where the local brands had gone.\n\nAnother day, my wife and I visited a neighborhood shop. The cashier could not speak English. We stumbled through the transaction. It was awkward.\n\nIn your workplace, do you ever feel like a guest in your own country?\n\nSome of us carry a quiet ache that is hard to explain. It is not about hating anyone. It is not about rejecting change. It is simply the feeling of being slightly displaced in a place you once knew so well.\n\nWe start asking ourselves, softly: Is this still my home?\n\nOr am I slowly becoming a minority in my own land?\n\nIt is a strange feeling to have.\n\nMaybe all I am really saying is this.\n\nI just want to feel at home.",
      "comments": [
        {
          "text": "Your duty is to serve NS to protect foreigners so our elites can continue to enjoy their fantastic GDP bonus and million dollars salaries.",
          "score": 46
        },
        {
          "text": "I feel super at home when i go for ict lol",
          "score": 43
        },
        {
          "text": "why is the star and moon on the flag turkish 😭😭",
          "score": 24
        },
        {
          "text": "This is my country \nThis is my flag\nWe have no future\nPlease Fk My Life….",
          "score": 22
        },
        {
          "text": "Switzerland around 60x our size still got the 10 Million population cap.\n\n\nMay I just kindly ask if when is our population cap proposal coming?\n\n\nSG now is super-crowded liao, new HDBs/BTOs/Condos built so close to each other. And because need to rush, the new flats' quality now so cui compared to last time built in the 1970s and 1980s one.",
          "score": 20
        },
        {
          "text": "I think at this point nobody cares for Singapore tbh. I’m pretty sure during times of war, not a lot of people actually gives a shit and will even open door for the enemy to get in",
          "score": 14
        },
        {
          "text": "Another 3-4 elections and i think local born singaporeans dont need to vote already. Converts and new first gen singaporeans will vote on their behalf",
          "score": 11
        },
        {
          "text": "NS for Singaporeans.\nJobs for everyone else ",
          "score": 9
        },
        {
          "text": "Just say it.  Changi business park's nickname is Changalore. ",
          "score": 7
        },
        {
          "text": "To those who complained have you voted for the opposition?",
          "score": 4
        },
        {
          "text": "These days I freeze my sperm so that in future if they need Singaporeans I can sell it at a high price.",
          "score": 4
        },
        {
          "text": "Just leverage on ur passport and move elsewhere if ur industry allows.",
          "score": 3
        },
        {
          "text": "Dey happi can alrdy. Most impt is Yuu ownself must happi.",
          "score": 3
        },
        {
          "text": "This is home, truly",
          "score": 3
        },
        {
          "text": "Singapore is at 6 million people right now it will be a while before 10 million, Singapore is extremely strict on immigration, and most immigrants who are becoming citizens are Malay Chinese  because they are closest in demographic to Singapore.   But it’s true as Singapore continues to grow more and more immigrants are going to come. Due to one of the lowest birthrates in the world Singapore isn’t replacing itself and the ministry needs to continue to recruit talent to keep the economy dynamic and to keep economy from collapsing because we don’t have enough young people to pay for the growing old. \n\nJust know this is a world problem not a Singapore problem it’s why the us is all over the news for the immigrant roundups and purging which is an overreaction",
          "score": 2
        },
        {
          "text": "our singapore identity : is something like give up soul for money and greed\n\nUnique singapore culture like Sinkie pwn sinkie\n\nso dont say we dont have culture or identity,  we have both, and just happen to be toxic as hell",
          "score": 2
        },
        {
          "text": "Feel like foreigner here",
          "score": 2
        },
        {
          "text": "Just fuck off and be a foreign talent in another country. Who cares about SG",
          "score": 2
        },
        {
          "text": "I couldn’t even find someone to chat about the old days. The landscape changed so much from 10-30 years ago. Shops I use to patronise are gone. My workplace, colleagues are mostly foreigners. It’s really sad. \n\nThere is a genuine lack of belonging and they destroyed the 40-50 years of nation building identity in less than a decade. \n\nRecently, the kpop vs SEA drama got me thinking. Singapore was left over as SEAbling. I guess it’s very real. What is Singapore and who are Singaporeans? That unique identity once proud is now eroded. Most Singaporeans are naturalized citizens (data not publicly given). Those pumping RON95 and giving a bad rep? PR/converts. SEA don’t really care what a Singaporean is because we don’t have an identify. We have Vietnamese, Malaysians, Filipinos, Indonesians all living here. Sg-Chinese? Sg-Malay? Sg-Indian? It’s not relevant anymore. \n\nSo what is a Singaporean exactly? Just a citizenship on paper and a passport I guess. Those left behind are neither Chinese nor Singaporean since we can’t exactly pin point what’s that. \n\nOur heritage? All artificially kept alive on life support. Just look at NDP and all the nostalgia stuff are very out of touch. Dragon playground? Gone a damn long time ago no one I talk to around me knows about sand playground. 5 stones? No one I talk to knows the game. \n\nI envy my SG-Malay friends. The culture is at least protected to some extent. They are minority but not withstanding the effect of PRC or India migrant culture erosion. I love speaking to them. They are the last group I can 100% interact with and know they understand what I’m talking about at least a good 80% in spirit, in nostalgia and in mindset.",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1r4eed8",
      "subreddit": "SingaporeRaw",
      "title": "On and on and on and on ~",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r4eed8/on_and_on_and_on_and_on/",
      "score": 87,
      "num_comments": 34,
      "created_at": "2026-02-14T15:27:45",
      "selftext": "",
      "comments": [
        {
          "text": "The people complaining are not the ones voting PAP. Your problem is you think this echo chamber on reddit represents the majority of Singaporeans. It doesn’t. You are the 30% who will never vote PAP even if they made everyone billionaires.\n\nIn politics, there are only 3 groups.\n\n30% who will never vote PAP, no matter what.\n\n30% who will vote PAP, no matter what.\n\n40% who are reasonable and can be swayed either way. \n\nYou here on Reddit are the 30% who die die will never vote PAP, and that’s fine, but don’t get confused. If you want a win, y’all have to convince the 40% block but constantly complaining about everything really is not going to do it.",
          "score": 42
        },
        {
          "text": "Anyone who voted before will know you don't give a tick",
          "score": 31
        },
        {
          "text": "https://preview.redd.it/mfkhp4fuofjg1.jpeg?width=846&amp;format=pjpg&amp;auto=webp&amp;s=3a6693f7bc0602ed0381f38b147682413b5bd692",
          "score": 11
        },
        {
          "text": "after erection, cigarette up 20%, coe up again and no parf, more charges on virtual erp, oh foreigners pay raise! \nthey give us some food stamps and vouchers to make you feel happy. \nThen next erection, the cycle continue. \n\nThat is why we are called sinkies.",
          "score": 10
        },
        {
          "text": "Singaporeans love to complain, but deep down, they know there is no suitable alternative to the PAP. RDU was the opposition party in my constituency. I'm not fucking voting for RDU.",
          "score": 8
        },
        {
          "text": "Have you considered that you are in the 35% who don't vote pap.",
          "score": 7
        },
        {
          "text": "Cos most Singaporeans not bat shit insane",
          "score": 4
        },
        {
          "text": "I've always been amused by the skinny guy on the left side in this picture.",
          "score": 3
        },
        {
          "text": "When CDC voucher come.. all become like angels",
          "score": 2
        },
        {
          "text": "Someone did say that Sinkies were \"Daft.\"",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1r51fsz",
      "subreddit": "SingaporeRaw",
      "title": "Asking the obvious: has the Chinatown accident driver been named? Has she been charged?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r51fsz/asking_the_obvious_has_the_chinatown_accident/",
      "score": 83,
      "num_comments": 43,
      "created_at": "2026-02-15T09:10:10",
      "selftext": "How long has it been since the accident happened? No name no action. Leaving it to the authorities to investigate? So how long will it take?\n\nIf it’s the process and norm not to release name unless being charged, then has the suspect being charged?\n\nIf there are no naming of suspect, then there’s no reason for the driver or her partner to surrender their passport. If they flew out of Singapore, say to a country with no extradition agreement, then what’s next?\n\nI can go on and on. But investigation are generally not announce to public. However, the public demands accountability since this has become very public.\n\nEdit: linked this comments for info on what to expect next. But again, the ball is on whoever decide or not to decide the charge. Since the passport does not need to surrender, having her absconded would be an ultimate disgrace to our law and justice system.",
      "comments": [
        {
          "text": "Must have engaged expensive lawyers to advise them",
          "score": 70
        },
        {
          "text": "The silence and slowness on the action taken for such a tragic event that killed a young girl is deafening and worrying.",
          "score": 56
        },
        {
          "text": "My barometer is that Tampines driver that ploughed through the traffic light, 22 Apr 2024. \n\nHis name was on CNA by 25 Apr 2024. \n\nTalk about privilege…",
          "score": 47
        },
        {
          "text": "Like Jane Lee of Sumo Salad driven to suicide by a CECA's insurance scam, perpetrator hasn't been charged and our media doesn't cover any updates to the investigation.\n\nhttps://mothership.sg/2025/07/sumo-salad-jane-lee/",
          "score": 35
        },
        {
          "text": "No and no. They are scratching their heads bald trying to twist this.\n\nFark CECA and the assholes who signed it without even a say from citizens",
          "score": 21
        },
        {
          "text": "Hopefully, it wouldn't be like this\n\n[https://theworld.org/stories/2016/04/22/why-drivers-who-kill-people-india-have-little-worry-about](https://theworld.org/stories/2016/04/22/why-drivers-who-kill-people-india-have-little-worry-about)",
          "score": 20
        },
        {
          "text": "Act blur live longer, thats why they shake the head liddat",
          "score": 17
        },
        {
          "text": "Last reported as she was being arrested and no more official updates since.  \nArrested at this point means she should be out on bail, a station bail.  \nThat is a bail before any charges from our state, the AGC.   \nIt depends on how fast the IO and the DPP on this to bring the state charges against her.  \nBut meanwhile, someone has bailed her out and her bailor is responsible for her to appear at the police station whenever she is summoned or required.\n\nLet's say she skipped town. The bailor has to pay the bail which S$10K for station bail.   \nAnd if she really skipped town, we wont be able to locate her so easily if she landed in India.  \nIndia is the mecca for all Fake Shit For All Stuff, so she and her identity will disappear if she chooses to.   \nUnfortunately this is our legal system.   \nIn the event she skipped town and is located in India, there is an informal extradition treaty SG has with India.  \nSome chances of getting their help to extradite her. \n\nIf she hasnt skipped town and is out on bail, this is going to happen next.  \nAGC must decide what charges to bring against her.   \nConvert station bail to court bail. Once that is done she will have to appear in court.  \nThat is an administrative judicial window. Appear in court.   \nDPP present the charges to the court to be read to her.   \nOn that very day she has to decide to plead guilty or not.   \nOr she wants to engage a legal defence to decide and understand her charges.   \nHence, another waiting period pursue and we havent factor in if she wants to claim trial or not. \n\nFor now, there is no status on her charges. \n\n![gif](giphy|z4lwT4QTkK3sYITR7Z)\n\n",
          "score": 7
        },
        {
          "text": "Rumor she is married to a biglaw partner",
          "score": 5
        },
        {
          "text": "Will be forgotten soon as usual.",
          "score": 5
        },
        {
          "text": "Monitoring closely with the eyes closed",
          "score": 5
        },
        {
          "text": "Waiting for things to die down and hope another scandal or waiting to highlight something bad done by a Singaporean",
          "score": 4
        },
        {
          "text": "It will be a slap on the wrist for the driver. She will laugh it off this incident and continue with her life as usual. While the victims will have their lives changed entirely because of her..",
          "score": 3
        },
        {
          "text": "These investigations and sentencing takes years to conclude.\n\n\nFor example, [drunk Australian man](https://mothership.sg/2026/02/man-drink-driving-sever-pedestrian-body/) only got sentenced at the start of Feb when the event happened in 2023 ",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1r4ngkh",
      "subreddit": "SingaporeRaw",
      "title": "In 2025, COE collected 8.6 billion",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r4ngkh/in_2025_coe_collected_86_billion/",
      "score": 76,
      "num_comments": 55,
      "created_at": "2026-02-14T23:29:02",
      "selftext": "1.3 million Singaporean households received CDC vouchers.\n\nS$8.6 billion works out to roughly S$6,600 per household ! far more than the S$800 we actually get.\n\nCOE is ‘windfall’ revenue that literally comes from selling paper, money extracted from residents.\n\nWhy is the govt so stingy when they can well afford to pay more JUST ON COE collected in a single year ?\n\nNot even asking for the full amount , even 2k is peanuts to them.",
      "comments": [
        {
          "text": "Singaporeans being proud of having a budget surplus are like minimum wage workers being proud of their company making record profits.",
          "score": 69
        },
        {
          "text": "time to vote wisely next election",
          "score": 41
        },
        {
          "text": "Until you get a general audit to find out what explanation they have for the amount spent on defense.",
          "score": 40
        },
        {
          "text": "They need to increase their own salaries for a job well done in extracting max value from car owners\n\nThere is no incentive to fix mrt breakdowns. In fact, quite the opposite",
          "score": 31
        },
        {
          "text": "dude if we all get 6000 per household, inflation would definitely skyrocket...",
          "score": 26
        },
        {
          "text": "Their stupid argument will be they need to be conservative and invest/save for SG Reserve so that our future generation can benefit. I'm not against this stance but let's be honest, from our grandfathers time they been saying that till now, do you see any major improvement in employment/salaries/cost of living for true blue Singaporeans? If anything it's even worst than our parents generation.  \n  \nI am almost certain that the day will come when the amount in our reserves will mean absolutely nothing be it due to war or a major economy crisis when our SGD will devalue greatly.\n\nThey want to pay our ministers top dollar to \"stop corruption\"? Fine I'm ok with that.   \nBut its about fucking time they value Singaporean especially those who served 2 years of NS.  ",
          "score": 13
        },
        {
          "text": "That's why act blur when phv vehicles are driving COE prices up",
          "score": 10
        },
        {
          "text": "Where did you get this number?",
          "score": 6
        },
        {
          "text": "Where does one go to find out how much money they collected through fines in the legal system, and the flats that HDB sells?",
          "score": 3
        },
        {
          "text": "They will collect more this year with the recent parf/arf change and more next year with the ERP 2. Justification for a salary increase.",
          "score": 2
        },
        {
          "text": "Where's the stingy when Ministers and Mayors are the highest paid in the world?",
          "score": 2
        },
        {
          "text": "COE is a tax, a very specific consumption-ish (Pigouvian) tax that attaches to one use or asset. \n\nThe supply is 100% controlled by LTA so the amount collected is roughly known (apart from price up/down) and would not be considered a “windfall”.\n\nIt also goes into the consolidated budget with no earmarks (for roads, pavements, expressways for eg). Hence there is no established mechanism for directing the proceeds anywhere specific.\n\nOur gahmen is pretty good at broadening their revenue sources to keep income taxes low.",
          "score": 2
        },
        {
          "text": "They need the money to overhaul the erp system so they can nickel and dime drivers more, duh.",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1r4h885",
      "subreddit": "SingaporeRaw",
      "title": "Mothership went down to interview the aunty fruit seller and also reached out to the OP of the video",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r4h885/mothership_went_down_to_interview_the_aunty_fruit/",
      "score": 71,
      "num_comments": 25,
      "created_at": "2026-02-14T18:20:37",
      "selftext": "I already made a post yesterday - [https://www.reddit.com/r/SingaporeRaw/comments/1r3a1ix/aiyo\\_why\\_auntie\\_so\\_pekcek/?utm\\_source=share&amp;utm\\_medium=web3x&amp;utm\\_name=web3xcss&amp;utm\\_term=1&amp;utm\\_content=share\\_button](https://www.reddit.com/r/SingaporeRaw/comments/1r3a1ix/aiyo_why_auntie_so_pekcek/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button)\n\nMothership went down to talk to the auntie and reached out to the lady. Apparently there was a group of tourist who tried to haggle and asked lots of questions. The ladies in question may or may not belong to that group but I can understand her frustration. I used to work with tourist and most of them can be very annoying. People don't just lose their temper without reason ",
      "comments": [
        {
          "text": "See always got two side of the story…",
          "score": 43
        },
        {
          "text": "Always is same pattern people world wide causing trouble for locals",
          "score": 30
        },
        {
          "text": "I can understand the seller's frustration. These tourists probably think they can haggle like in Thailand, similar to how SG tourist keep haggling over small costs in Thailand, very irritating.\n\nThat said, as a seller, she should still keep her cool and be professional about this. Well, encountering bad attitude sellers can also be part of the cultural experience of Singapore.",
          "score": 18
        },
        {
          "text": "Isn’t Mothershit usually quite biased in their reporting?? What happened, did they decided to change for once?",
          "score": 9
        },
        {
          "text": "&gt; The fruit seller said that prior to the heated interaction, the group of tourists had attempted to bargain with her.\n\n&gt; She also told the paper that the tourists squeezed the fruits, a charge that the tourist denied to Shin Min as well.\n\nAllegations like this are why businesses should install CCTV.\n\nIt can't always be the \"tourist\" or \"customer\" recording when sometimes they're looking to provoke a reaction.\n\nWebcam CCTVs are cheap these days. I bought 2K resolution ones for $30 recently. MicroSD cards are $8-$15 on Amazon.",
          "score": 6
        },
        {
          "text": "黑人那個",
          "score": 4
        },
        {
          "text": "So much for investigative journalism from Mothership. Got interview the driver from the Chinatown incident?",
          "score": 3
        },
        {
          "text": "And none of people here read the article. I bet they hear what they want to hear and ignore the rest. No local Singaporean would support this kind of business. I heard people say they would buy her fruits but the place is too far away. Really? It’s Singapore. How far it could be? 🤡 Hypocrite until they finally scolded by her 🤣",
          "score": 1
        },
        {
          "text": "why are people defending the foreigner?",
          "score": 0
        },
        {
          "text": "Iya CECA making trouble again. Wanna buy buy. Don’t want to buy don’t buy. Preemptively Record video either it is a fake or making trouble.",
          "score": -9
        }
      ]
    },
    {
      "id": "t3_1r4i34u",
      "subreddit": "SingaporeRaw",
      "title": "Podcast: Singapore Budget 2026 - Why the big bet on AI?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r4i34u/podcast_singapore_budget_2026_why_the_big_bet_on/",
      "score": 28,
      "num_comments": 38,
      "created_at": "2026-02-14T19:13:47",
      "selftext": "",
      "comments": [
        {
          "text": "engineering, biomedical science, IT, hospitality....  \n  \ndéjà vu? ",
          "score": 31
        },
        {
          "text": "My opinion: AI the tech will be permanent in some fashion. I don't know what it'll look like, but it's here to stay. Probably not as useful as it's hyped up to be, like how Google assistant and Siri was the big hype then it all went away pretty fast once people find its limitations.\n\nAI the investment though, I think will burst. It's an economic bubble, not a tech bubble. The dot com bubble burst but the internet never went away. In fact, it was too far ahead of its time, that's why it burst. Now everyone has a website and some sort of online presence. Many have services that you can purchase online, like redmart/groceries, order and pick up from store, etc. Same for AI, I think there will be some uses for it, but not in the revolutionary tech bro way it's marketed.\n\nHope SG is involved with the tech side instead of the investment side.",
          "score": 26
        },
        {
          "text": "Another bad bet that will eventually be on the taxpayers again. The authorities had proven their lack of foresight in the past with bets in IT, life science, casinos, wealth management and now AI. \n\nThe root problem isn't about chasing or not chasing after the latest trend but the lack of indigenous capabilities and ecosystems that we can leverage on to exploit the latest technology. As long as the authorities continue to put the cart before the horses, we will go nowhere.\n\nWe should be investing in indigenous capabilities and ecosystems rather than the latest new technology. Then, leverage on these internal strengths to synergize with and leverage onto the latest technologies i.e. don't build technologies, build ecosystems that create and/or merge with new technologies.",
          "score": 13
        },
        {
          "text": "The big bet on AI will benefit big corporations and vendors working with players such as Amazon and Microsoft.\n\nBarely any support to develop local talent once again.\n\nExpect to see AI subscription prices go up.",
          "score": 4
        },
        {
          "text": "AI businesses are not location based. It’s community based. Whatever “hub” or “city” we try to make, how are we going to compete with the likes of Silicon Valley and other tech cities by bigger countries?",
          "score": 2
        },
        {
          "text": "Usually, by the time GIC invests large, it is too late. Governments are usually laggards based on how much delay, procedures and bureaucracy they have. \n\n\nIt is time to start cashing out of AI. ",
          "score": 2
        },
        {
          "text": "Because it's a buzzword.\n\nWhen new buzzword come they will migrate accordingly",
          "score": 2
        },
        {
          "text": "Hi. Please refer to Nvidia and TikTok playbook. We are here so the China can wash tech through SG. That is the main play. The key players in AI in the future is China and US. Who in the G7 want to use China AI? But if it's SG AI? No problem. \n\nThis is the bet.",
          "score": 1
        },
        {
          "text": "if Singapore bets on AI, that means killing many white collar jobs eventually. Good bye to votes.",
          "score": 1
        },
        {
          "text": "Last time 1 person salary do 3 ppl's job. With AI, 1 person do 100 ppl's job. \n\n\nAnyway, AI impact is real and here to stay. Many industries have already been disrupted. The recent advancements in LLM reasoning models and Agentic AI are pretty scary.  Our workforce is aging and shrinking. Either prepare for Singaporeans to embrace AI to be more productive or get ready for more retrenchment.",
          "score": 1
        },
        {
          "text": "Soon a darling \"local\" AI startup will be prominent, few years later it will be found out to be a fraud or in financial mess, same story :)",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r4m0ac",
      "subreddit": "SingaporeRaw",
      "title": "4 taken to hospital after car overturns in River Valley",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r4m0ac/4_taken_to_hospital_after_car_overturns_in_river/",
      "score": 20,
      "num_comments": 6,
      "created_at": "2026-02-14T22:28:53",
      "selftext": "BYD car? What the heck is happening this year.",
      "comments": [
        {
          "text": "driver or car fault?🤔",
          "score": 1
        },
        {
          "text": "Mount kerb or drive up kerb and flipped. Most probably not paying attention",
          "score": 1
        },
        {
          "text": "Tell you buy Tesla dun wan.",
          "score": 1
        },
        {
          "text": "Must be prc or ceca fault\n\n/s",
          "score": 1
        },
        {
          "text": "I think because electric car just entered the market. A lot of driver not used to it or something.",
          "score": -6
        }
      ]
    },
    {
      "id": "t3_1r4hs7v",
      "subreddit": "SingaporeRaw",
      "title": "Yet another… abandoned",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r4hs7v/yet_another_abandoned/",
      "score": 15,
      "num_comments": 6,
      "created_at": "2026-02-14T18:55:33",
      "selftext": "Wow, yet another abandoned obike spotted…",
      "comments": [
        {
          "text": "bring it home, beings to no one now",
          "score": 6
        },
        {
          "text": "It’s a relic, legit pre-covid relic. belongs to a company that no longer exists.",
          "score": 5
        },
        {
          "text": "Wow what a relic",
          "score": 3
        },
        {
          "text": "That day i saw one in JB a3on chilling outside the shopping centre",
          "score": 3
        },
        {
          "text": "Dinosaur fossil",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r53mbt",
      "subreddit": "singaporefi",
      "title": "Health is wealth. Hitting 30 this year, looking for recommendations on comprehensive, affordable full body health check-ups!",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r53mbt/health_is_wealth_hitting_30_this_year_looking_for/",
      "score": 23,
      "num_comments": 23,
      "created_at": "2026-02-15T10:58:14",
      "selftext": "Hi, all. Probably isn't the correct sub for this (technically still financial planning for my future), but as the title says, I'm hitting 30 this year and looking to do a health check-up to get some sort of direction on how I can keep myself healthy and future healthcare costs low.\n\nI do have 2 questions in this regard:\n\n1. At age 30, how comprehensive of a health check-up should I go for? Should I add-on tumor marker tests, ultrasound tests, etc.? I saw the package by Raffles and they have all sorts of tests that I'm unsure whether I should or should not do.\n\n2. On that note, what are some affordable available options?\n\nThank you!",
      "comments": [
        {
          "text": "Jb cheaper",
          "score": 16
        },
        {
          "text": "Minmed has right? Iirc the price is not bad for what youre getting.\n\nDont make the same mistake as me (I almost did anyway), make sure you sort out your CI, ECI, Life insurance all these first. Especially for CI / ECI, make sure its after 90 days since the policy is active. (I think default 90-days, but best to check) :)",
          "score": 9
        },
        {
          "text": "Yes do all of the above \n\nIf your company has corporate insurance there might be benefits - if not join one of those free medical check ups and upgrade",
          "score": 8
        },
        {
          "text": "I do annual cancer checks, last year I did a super comprehensive one that according to the dr only needs to be done every 5 years \n\nI just did a check up with minmed and asked about tumor marker blood test, the dr said that actually it’s not super accurate for ppl without a history of cancer. So was recommended the genetic testing by minmed instead, can read up and consider… I’m also still considering as it’s a bit expensive\n\nBut fyi, thought it’ll be relevant info as you’re planning your health check ups!",
          "score": 8
        },
        {
          "text": "depends on how frequent u do and what ur last medical scans have revealed.  \nIf u want comprehensive  \nwill recommend separate eye health checkup   \nfull body health screening -full  blood, kidney, urine, stool . the standard stuff in the standard package. the basic packages should already have the essentials like blood and urine and blood pressure.  \nTumour marker not accurate fyi.  \nultrasound - abdomen / pelvis if female.",
          "score": 4
        },
        {
          "text": "You can do the Helios study. It’s at NTU and can get 100 bucks or something",
          "score": 2
        },
        {
          "text": "Go jb",
          "score": 2
        },
        {
          "text": "Don't do in sg. Now that all medical records are shareable if they detect something it will affect your chances at buying insurance. Do it in jb instead. Cheaper too",
          "score": 2
        },
        {
          "text": "You’ll get the same comprehensive package at normal polyclinic as well. Schedule for a doc consultation and discuss with them your concerns n they’ll recc the appropriate health/ blood test. They’ll discuss with u the markers n you’ll hv another round of prob every 6-12 mths check. Any issues they’ll refer u to specialists. But really, the blood test will help u with your lifestyles",
          "score": 1
        },
        {
          "text": "It's your first so just start with a &lt;$100 test. A lot of clinics, even your downstairs GP clinics, will offer it. They typically include blood test for lipids (cholesterol), height weight waist circumference, maybe body fat %age, blood sugar, blood pressure. Top up one or two things if you are really concerned e.g. anaemia test. \n\nSome clinics will really upsell these health screenings e.g. F u l l e r t o n lol.",
          "score": 1
        },
        {
          "text": "Can anyone recommend which in jb pls",
          "score": 1
        },
        {
          "text": "I go to SataCommhealth. Their packages are quite comprehensive and affordable, online booking was a breeze",
          "score": 1
        },
        {
          "text": "Fullerton health- go for the women/men screening packages. Includes the essentials and price is ok. More value for money than their executive packages which imo a bit overkill.",
          "score": 1
        },
        {
          "text": "For Raffles (I use them), I assume you have not done a full check up for a long time (i.e. more than 10y).  If that is the case, take the Executive package.  Subsequent years, you can just do the minimal.\n\nVERY IMPORTANT - Before you go do you health screening, ensure that your insurance are fully settled.  I am referring to your personal policies, not your corporate.\n\nI.e. if you don't have, apply.  If you want to upgrade, upgrade.  \n\nBecause if you apply before checkup, insurance will cover everything (assume you don't have any preexisting conditions).  But if you apply AFTER checkup and the screening shows anything (they usually do, even basic things like elevated blood pressure), insurance will NOT cover them.\n\nGood luck.",
          "score": 1
        },
        {
          "text": "Probably just drop by a GP and ask for it, some clinics do give competitive rates",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r4cy73",
      "subreddit": "singaporefi",
      "title": "Does area matters more or living with more cash matters more",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r4cy73/does_area_matters_more_or_living_with_more_cash/",
      "score": 13,
      "num_comments": 43,
      "created_at": "2026-02-14T14:04:34",
      "selftext": "hi! I’m in the process of selling my Amk flat and looking at my next property. The internet is flooded with sell 1 HDB and buy 2 condo options…\n\nMeanwhile I’m thinking if I can go to north/northeast to a bigger house at a lower price. Then I can make a significant amount of cash to save/invest! But isit a good move to go from AMK to Punggol/Sembawang?",
      "comments": [
        {
          "text": "It’s typically a personal decision - individuals have their bias - you just have to tune out and decide for yourself because ultimately you’re the one living there. \n \nFYI - commute is one of our daily stressors",
          "score": 37
        },
        {
          "text": "NEL, if possible, don't stay past serangoon. Peak hour commute is damn shag.",
          "score": 15
        },
        {
          "text": "I mean I stay at the Canberra region willingly because my parents stay at sbw, both our houses are right smack beside the mrt- if u do plan for or have kids and grandparents are helping out, it’s rly good to stay nearby. \n\nI personally don’t find it inconvenient (possibly also because I’m right next to the mrt). It takes me around half an hour to travel to work via NSL; Northpoint is big enough for me to get things I need. I hardly go to town except to meet my friends occasionally. But this will also depend on where your workplace is as the daily commute can wear you out. if your work can be almost or fully remote then it doesn’t matter that much too.\n\nHousing wise we got our bto at a steal at less than 270k (it’s valued at around 800k now), so yes thanks to that I could invest a lot more of both my cash and my cpf OA. We’ve fully paid off our house too. We plan to stay minimally till kids complete Pri sch which we are &lt;1km away and they will fall under 2A scheme and a sure-in.\n\nIn short, we chose to stay at the Sembawang region primarily because of our family needs- proximity to alternative caregivers, guaranteed admission to a good primary school, acceptable travelling time to and from workplace (mainly because we stay right next to the train station)",
          "score": 10
        },
        {
          "text": "area matters more man, super hate punggol that region coz of super congested mrt. but that’s me. if you can afford it TEL line is the best like east coast region",
          "score": 10
        },
        {
          "text": "Avoid MRT bottlenecks, e.g. too far up the NEL, or having no choice but to pass through Jurong East. There is probably a threshold/turning point for anyone (with a daily rush hour commute) when the value for money in a home is outweighed by the loss of QoL from having to commute through tight bottlenecks.",
          "score": 6
        },
        {
          "text": "Only you can make that decision. Because it's not a comparison of money vs money. It's a comparison of money vs time/quality of life. ",
          "score": 6
        },
        {
          "text": "I run away from sembawang to city fringe \n\nPlease don't go there. \n\nIt's like 乡下",
          "score": 2
        },
        {
          "text": "Go smrtrabak sub and see the amount of Punggol residents complaining.",
          "score": 2
        },
        {
          "text": "Depending on the area, please take into account transport time for work/leisure. Even if you own a car, your wife/kids need to go out when you are not available. Imagine having to travel 1hr (change bus/lrt/transfer train lines, etc) to go out of town.\n\nIf all is good, then I think it’s a good idea.",
          "score": 1
        },
        {
          "text": "Your plans is not wrong, either risk averse or risk-it-all, but risk averse has its perks",
          "score": 1
        },
        {
          "text": "I think it depends a lot on your family/needs? \n\nLike whether do you need the location, schools, amenities etc. A lot of people from D19 are looking to move closer to town, and the newer bigger flats in the north/northeast aren't exactly cheaper. \n\n",
          "score": 1
        },
        {
          "text": "Shouldn’t you have thought of that before you sold? What a joke.",
          "score": 1
        },
        {
          "text": "Your life your choice.\n\nI wouldn't based on amk vs this option.",
          "score": 1
        },
        {
          "text": "If you assume an efficient market (like we all do in this sub), you need to ask yourself what your competitive advantage is. How do you differ from the average participant? What you're looking for is a decision that maximises your surplus, i.e. the decision in which the benefits exceeds the costs by the greatest amount. If you are the average participant in an efficient market, your surplus will be zero, by definition of how an efficient market works. But if, for example, you know that you're someone whose time is worth more than the average person (either from monetisable time or simply the value you place on leisure time), paying more to reduce commute times will increase your surplus.",
          "score": 1
        },
        {
          "text": "If you move to sbw, you will probably miss amk. Yishun is a closer version of amk amenities wise.\n\nPunggol is crazy crowded and the residents are generally younger so if you going to have kids finding childcare is a challenge. \n\nThe daily travel to work or just travelling to anywhere in singapore is far for sbw. On a 'bright' side there is pretty much no work location or social gatherings location preferences since going anywhere is about equally far.",
          "score": 1
        },
        {
          "text": "Where do you work, where does your wife work and where are your children's schools... all of you could get into a bad situation of daily 2hr commute and then slowly you will realise why flats in ulu north zone (right beside JB already) are the cheapest.\n\nAs long as all of you can tolerate the commute, I welcome you to ulu Marsiling... this is where you can still find 5-room flats below 450k.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r4me3l",
      "subreddit": "singaporefi",
      "title": "Beware of Capitaland Private fund scam",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r4me3l/beware_of_capitaland_private_fund_scam/",
      "score": 10,
      "num_comments": 4,
      "created_at": "2026-02-14T22:45:21",
      "selftext": "The scammers are on dating apps, social media and telegram. Please do not trust them!! Posting this so no more new victim to this case.. They build rapport and relationship with you so that they can succeed in scamming.",
      "comments": [
        {
          "text": "As long as I am able to interact with chio bu for more than 10 mins, its worth it.",
          "score": 3
        },
        {
          "text": "Some Singaporean are just gullible and very rich. That’s all I can say.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r4drpy",
      "subreddit": "singaporefi",
      "title": "Tier Vs Fixed Commisions",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r4drpy/tier_vs_fixed_commisions/",
      "score": 8,
      "num_comments": 24,
      "created_at": "2026-02-14T14:51:15",
      "selftext": "Hello, realized no one mention about this. For MM users, what commission structure do you use? Did some scalping &amp; trading yesterday, realized today that the commissions charged was a whooping 800 USD??! See balance from 10.5K to 9.7K. Im currently on Fixed Structure, would changing to tiered be better If I were to continue trading at this frequency &amp; volume?",
      "comments": [
        {
          "text": "My my my...retail gamma scalping....over cpis no less",
          "score": 6
        },
        {
          "text": "I know it's not the answer you're looking for, but switch to IBKR.\n\nMy commissions for options trading is less than 2 USD each time I open or close.",
          "score": 3
        },
        {
          "text": "I'm on tiered and pay between $0.20 to $0.50 per contract.",
          "score": 2
        },
        {
          "text": "29.82 USD for an option sell trade? That's nuts compared to what I'm getting which is 0.65 per contract.",
          "score": 2
        },
        {
          "text": "I don’t know how many contracts you are doing but these fees are so bad.\n\nI use IBKR tiered. A few contracts cost me 2dollars plus/minus.",
          "score": 1
        },
        {
          "text": "Wtf 800USD fees is fking wild.. switch to ibkr",
          "score": 1
        },
        {
          "text": "ok, let me get this correct .... you paid $800 on fees and your account is $10k?\n\nso errr ... fees wiped out 8% of your capital in one session :)\n\nyou Champion",
          "score": -2
        }
      ]
    },
    {
      "id": "t3_1r521ik",
      "subreddit": "singaporefi",
      "title": "Taking advantage of strong USD/SGD",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r521ik/taking_advantage_of_strong_usdsgd/",
      "score": 7,
      "num_comments": 41,
      "created_at": "2026-02-15T09:39:57",
      "selftext": "Anyone buying USD with the intention of converting back to SGD later? How best to do it? I was thinking of using Wise.",
      "comments": [
        {
          "text": "What empirical evidence is there that suggests the USD will recover?",
          "score": 66
        },
        {
          "text": "US dollar is weakening and I think that's structural, (record debt, loss of confidence, economic policy chaos, dedollarization, at least for another 3 years until trump's term ends) think it's no longer cyclical\n\nThe big money are rushing to alternate overseas safe havens with SGD one of the safest out there so won't bet against the market if I were u",
          "score": 15
        },
        {
          "text": "It's a good rate now for sure but never assume it will go back up. Take GBP/SGD for example - it used to be more than 3 SGD for 1 GBP decades ago. Today it's almost halved that rate and never went back to even 2:1 since 10 years ago",
          "score": 14
        },
        {
          "text": "lol people roasting OP like as if they know better. No one knows whats going to happen, so just create a thesis you trust and execute it.",
          "score": 11
        },
        {
          "text": "fx trading is riskier than you might think, and it's not for amateurs ",
          "score": 4
        },
        {
          "text": "Everyone running away from usd u running towards. May pay off, you do you, if it doesn't I guess its time for a holiday trip to the US.",
          "score": 3
        },
        {
          "text": "err fx flipping? no go. also outlook for SGD:USD pairing is bound for parity as reported a few times now",
          "score": 2
        },
        {
          "text": "You can buy fx on ibkr just buy something like USD bonds or treasuries. ",
          "score": 2
        },
        {
          "text": "No one knows anything especially Singaporeans who always like to be experts on exchange rates.\n\nJust to share I went to Genting last CNY and won 27k ringgit. Everyone was telling me how I should “faster convert because by 2026 sure 4:1)\n\nJust trust your gut.",
          "score": 2
        },
        {
          "text": "Unless you’re converting upwards of 100k, I don’t think there’s much money to earn?",
          "score": 2
        },
        {
          "text": "The most i see it recovering is to 1.3 and thats being generous.",
          "score": 1
        },
        {
          "text": "You should actually use Endowus. \n\nEndowus is built to serve SGD savers in Singapore. It does not charge forex for converting SGD to USD. For accredited investors, it has Goldman Sachs Asset Management US Treasuries-based money market funds and other USD based fixed income products that you can get in a SGD wrapper. It also has low cost equivalents of S&amp;P500 and MSCI world equity funds.\n\nYou can withdraw in USD later to your USD account, too.",
          "score": 1
        },
        {
          "text": "Many moons ago was 1US=S$1.75",
          "score": 1
        },
        {
          "text": "I guess if you want you can always use IBKR to do a currency conversion, then park the money in IB01 or something until you're ready to withdraw back.",
          "score": 1
        },
        {
          "text": "USD is down over 90% lol, yall still buying? maybe buy another currency that’s not down so much ya?",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r53t7o",
      "subreddit": "singaporefi",
      "title": "GE Hosp Rider",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r53t7o/ge_hosp_rider/",
      "score": 3,
      "num_comments": 4,
      "created_at": "2026-02-15T11:07:35",
      "selftext": "I am (30yo)currently a cancer \n\npatient receiving treatment at a private hospital and expect to make claims yearly as my condition is not yet stabilised.\n\nMy GE agent advised me to downgrade from P Signature to P Optimum, he mentioned that if I do not downgrade within 6 months, I may not be able to switch to P Optimum in future and would instead be placed on a government-hospital plan(something along this line).\n\nMy concern is whether it is better to remain on the higher-tier plan in case of future policy changes and to maintain better coverage flexibility.\n\nCould I seek your advice on whether downgrading now is advisable for a lower premium payment.",
      "comments": [
        {
          "text": "What do you (or him) mean by can't switch and placed on government plan? If you're already in P Signature, you mean GE will kick you out / not renew?\n\nAsk him in writing and present several scenarios and get him to write to the relevant department(s) with you in the loop, to get the black and white.\n\nI'm on P Signature now (with rider) and see no reason to switch to a supposedly cheaper plan. After all, it is only cheaper today; we all know they can simply revert to higher prices (at lower coverage) in future.",
          "score": 4
        },
        {
          "text": "Im just stating this based on my experience. If you already have a condition, just stick with the best plan u have and dont downgrade. Penny wise pound foolish",
          "score": 3
        },
        {
          "text": "DO NOT DOWNGRADE",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r4gif9",
      "subreddit": "singaporefi",
      "title": "HDB deferred income assessment for singles?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r4gif9/hdb_deferred_income_assessment_for_singles/",
      "score": 0,
      "num_comments": 11,
      "created_at": "2026-02-14T17:36:20",
      "selftext": "Hi fellow Singaporeans anyone has been in the same situation as me and can give some clarity.\n\nI am currently applying for BTO under the singles scheme. I have been doing my full time postgraduate studies for the past 2 years so I have been unemployed and thus the HFE letter indicates that I am not eligible for any grants or loans.\n\nIf I were to apply for an upcoming BTO project would I be eligible for the deferred income assessment to reassess if I can get any grants or loans as my employment status and income will be changing this year? I tried searching the HDB portal but it seems like deferred income assessment is only for couples below 30 years old? Thanks in advanced for any help yall can provide. 🥲\n\nEdit: clarifying I’m 35 now",
      "comments": [
        {
          "text": "You already answered yourself. Deferred Income Assessment scheme is to induce young couples to get married. Those not so young and not so willing to commit to a future wedding don't qualify.\n\nI think you already read the HDB website but just in case you forgot where it was, you can read it again [here](https://www.hdb.gov.sg/residential/buying-a-flat/buying-procedure-for-new-flats/booking-of-flat).",
          "score": 3
        },
        {
          "text": "Consider to just go ahead with no grant no HDB loan, take bank loan when you graduate, and save your first-timer status for later.",
          "score": 2
        },
        {
          "text": "It says on HDB website that DIA is for young couples. So sadly you are not eligible for it. \n\nFurthermore: At the point of the HFE letter application, at least 1 party must be aged 30 or below.\n\nThis shows it needs to be two parties and hence your ineligibility",
          "score": 1
        },
        {
          "text": "What does your HFE says? \n\nApply HFE then talk. Cause you need a rejected HFE to even start your appeal process.",
          "score": 1
        },
        {
          "text": "Interesting predicament tbh. Usually, deferred income assessment(DIA) is for couples only, but I really believe that if HDB didn't grant you DIA, you might be able to appeal/write in to MP. You might also want to call HDB and ask about it. \n\nIf you don't mind, can you update if you have the answer? I'm quite curious about this! 🙏🏻",
          "score": -2
        },
        {
          "text": "Singles above 35 then can apply pls at least learn to read the rules before making such a big financial decision for yourself",
          "score": -13
        }
      ]
    },
    {
      "id": "t3_1r4gmf2",
      "subreddit": "singaporefi",
      "title": "HFE - only up to 4 room flat",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r4gmf2/hfe_only_up_to_4_room_flat/",
      "score": 0,
      "num_comments": 10,
      "created_at": "2026-02-14T17:43:28",
      "selftext": "I just realise my HFE is approved up to 4 room flat only. Would it be able to appeal to allow 5 room flat to be purchased?",
      "comments": [
        {
          "text": "How are you going to magically be able to afford 5-room in HDB’s eyes?",
          "score": 13
        },
        {
          "text": "Typically HFE doesn’t limit the type of flats u can purchase. Even if your loan amt is low it will not stop u from buying a higher value flat. So unless there’s something else that u are not telling us?",
          "score": 3
        },
        {
          "text": "If you have to appeal means u can’t afford it",
          "score": 3
        },
        {
          "text": "I would say you just write in to appeal and tell your saddest story and give whatever documents you have to prove you are really the especially sad case. Asking Redditors whether you can appeal or not is kinda funny because zero of us have any authority to approve your appeal... even if 100% of us say yes also doesn't mean you can get your appeal approved.",
          "score": 3
        },
        {
          "text": "TIL HFE tells you what type of flat you are approved for. Lol surprised because I have applied for HFE and am already waiting for my BTO lol",
          "score": 1
        },
        {
          "text": "HFE includes grants, which might have different amount or eligibility for 5 room",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r4kosp",
      "subreddit": "singaporefi",
      "title": "Is renovation insurance something SG homeowners would care about?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r4kosp/is_renovation_insurance_something_sg_homeowners/",
      "score": 0,
      "num_comments": 17,
      "created_at": "2026-02-14T21:31:16",
      "selftext": "Hi everyone,\n\nI’m doing early research and would value honest opinions. After hearing too many renovation horror stories, I’m exploring a **renovation insurance idea for homeowners** — very early stage, still validating demand.\n\nConcept is simple:\n\n* Flat‑fee insurance\n* Covers homeowners during renovation\n* Protection against losses or issues caused by contractors\n\nIf you’ve renovated before, would something like this matter to you?\n\nJust trying to understand if this solves a real problem.",
      "comments": [
        {
          "text": "Flat fee? Lmao. ",
          "score": 6
        },
        {
          "text": "Are you an insurance company? How are you going to predict the expected losses?",
          "score": 3
        },
        {
          "text": "This is bad underwriting risk. Either your flat fee gonna be damn high or they limit your claim",
          "score": 3
        },
        {
          "text": "Reno insurance already exist. ",
          "score": 3
        },
        {
          "text": "Is there really a need for every comment you're writing to be passed through AI",
          "score": 3
        },
        {
          "text": "It should work... against you due to a lot of claim from scams.",
          "score": 2
        },
        {
          "text": "How about escrow services? Like handshake.finance",
          "score": 1
        },
        {
          "text": "Do you have background in actuary? Tbh there’s too many Reno related payment applications that are trending now. Reno insurance is too difficult to diversify products. \n\nI would think escrow apps and deferred payment apps have already reduced the risk of renovations/IDs running.\n\nAdditionally with a renown ID, you’re probably not Gng to get customers to purchase insurance. So your risk of default is already on the higher side.",
          "score": 1
        },
        {
          "text": "Yes it gave me peace of mind during my reno despite being told there’s no such thing, especially for my small run of the mill project. I finally found an insurance broker with such a plan.\n\nEdit: I’m not selling shit and don’t know OP, which I imagine the downvote is for.",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1r545xi",
      "subreddit": "singaporefi",
      "title": "I don’t think people know where the market is headed",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r545xi/i_dont_think_people_know_where_the_market_is/",
      "score": 0,
      "num_comments": 11,
      "created_at": "2026-02-15T11:25:27",
      "selftext": "CPI has kept steady at a rate of 2.5% annually which is acceptable to most economists out there.\n\n  \n\nReports of institutional investors rotating out of tech and into energy and staples should indicate preparing for another recession as supported by the yield curve inversion.\n\n  \n\nHowever, they are still exposed to tech but not 100% so their expected outlook is still divided on bullish or bearish. This is a strange time but I guess we get more indication at NVDA earnings report this late Feb.\n\n  \n\nI doubt we’re at the peak yet - and with any comfort from SG’s budget 2026, I doubt AI is going away - personally, I’ve had real productivity gains from learning new python formulas to improve workflow.",
      "comments": [
        {
          "text": "You wrote 4 paragraphs just to tell us that no one knows where the market is headed - well done, Captain Obvious.",
          "score": 40
        },
        {
          "text": "Yes we not at peak. You want us to support you",
          "score": 3
        },
        {
          "text": "Okay, noted.",
          "score": 3
        },
        {
          "text": "you had a realisation that AI isn't going away just because you discovered some simple python scripts?..",
          "score": 3
        },
        {
          "text": "thanks after this post i now know that no one knows where the market is headed",
          "score": 3
        },
        {
          "text": "Uh yeah? Otherwise why is the advice to just keep DCAing (from excess salary, not talking about lump sum in hand).",
          "score": 2
        },
        {
          "text": "Tell us what we don't already know. Oh wait, you just did.",
          "score": 2
        },
        {
          "text": "Abuthen",
          "score": 2
        },
        {
          "text": "Go ahead and max leverage your shorts. And long your puts even.\n\nThe delusional bulls will eat it all as we go higher and higher.",
          "score": 1
        },
        {
          "text": "I know it’s headed right for sure.\n\nUp for down I don’t know.\n\nIf anyone can make it go left and replay the chart…\n\nAnother thing I know for sure is fund managers salivating over the extra 1.5B eqdp funds. More fees for the fund managers to buy new condos.",
          "score": 1
        }
      ]
    }
  ]
}