{
  "schema_version": "raw_scrape_v1",
  "report_id": "2026-02-06",
  "scraped_at": "2026-02-06T11:32:54.092359",
  "subreddits": [
    "singapore",
    "askSingapore",
    "SingaporeRaw",
    "singaporefi"
  ],
  "total_posts": 40,
  "total_comments": 438,
  "posts": [
    {
      "id": "t3_1qwdyq9",
      "subreddit": "singapore",
      "title": "Ian Fang’s PR status revoked, to be deported, barred from re-entering S’pore: ICA",
      "url": "https://old.reddit.com/r/singapore/comments/1qwdyq9/ian_fangs_pr_status_revoked_to_be_deported_barred/",
      "score": 709,
      "num_comments": 119,
      "created_at": "2026-02-05T14:34:42",
      "selftext": "",
      "comments": [
        {
          "text": "Rebecca Lim really dodged a giant missile",
          "score": 468
        },
        {
          "text": "Rare publicised case of PR revocation. Really wonder what is the bar set by ICA.",
          "score": 337
        },
        {
          "text": "One last bang for Carrie\n\nGood ICA set the right message for these scums",
          "score": 112
        },
        {
          "text": "Technically, he is very lucky that the victim didn't accuse him of rape or the law didn't charge him for rape, otherwise, he may end up like Kris wu who got 13 years, and for KW, I believe he's still at the peak of his career, and I believe it's a lost cause for this guy even if his PR has not been revoked, because he was really not good in acting and kind of have this..  LJ face..  \n\nDon't understand these people..  They have got good status, and would be easy for them to hookup, and they choose to fool around with minors..",
          "score": 99
        },
        {
          "text": "you can’t be a teacher at the same time and prey on underage girls at the same time and use your celebrity status at the same time to do love spell and hunt down on your students at the same time and then be in a girl-man-teacher-celebrity relationship at the same time. \n\nhe broke a lot of code of conduct there.\n\nso yes, he basically exploited his celebrity actor status and also exploited his teacher status.",
          "score": 94
        },
        {
          "text": "Singapore is more superior than America. We are faster and more decisive in deporting pedophiles. Look at how Amos Yee is still stuck over there.",
          "score": 65
        },
        {
          "text": "Ian Fack.",
          "score": 62
        },
        {
          "text": "Became a PR in 2015, revoked after 10 year. \n\nFully deserved it. After serving his sentence, go back China can do what?",
          "score": 52
        },
        {
          "text": "Best news I read today",
          "score": 42
        },
        {
          "text": "Good fuckin riddance!",
          "score": 40
        },
        {
          "text": "Can’t believe this guy is an ex-eight dukes of SG…\n\nWhat a joke! Scumbag face.",
          "score": 8
        }
      ]
    },
    {
      "id": "t3_1qwoh1t",
      "subreddit": "singapore",
      "title": "Fire at Orchard Towers",
      "url": "https://old.reddit.com/r/singapore/comments/1qwoh1t/fire_at_orchard_towers/",
      "score": 419,
      "num_comments": 38,
      "created_at": "2026-02-05T23:36:17",
      "selftext": "",
      "comments": [
        {
          "text": "4 floors of fire hoses",
          "score": 111
        },
        {
          "text": "Let this be a moral lesson.\n\nWhen the prostitutes left,\n\nThe fire came",
          "score": 106
        },
        {
          "text": "Church on 4th floor, but looks like the smoke damage is going to be extensive, and that’s if the building is still structurally sound.\n\nShag. They only moved in, what, Dec last year?",
          "score": 78
        },
        {
          "text": "is that the new Church?",
          "score": 33
        },
        {
          "text": "Call fire engine 995, don’t post Reddit lei!!",
          "score": 31
        },
        {
          "text": "That’s the carpark right",
          "score": 17
        },
        {
          "text": "![gif](giphy|b68BS1De5D4OY)",
          "score": 4
        },
        {
          "text": "Wa this one big time, top floors kenna smokeout",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1qwgh8s",
      "subreddit": "singapore",
      "title": "Mediacorp secures rights to broadcast 2026 FIFA World Cup; 28 matches to be shown for free",
      "url": "https://old.reddit.com/r/singapore/comments/1qwgh8s/mediacorp_secures_rights_to_broadcast_2026_fifa/",
      "score": 392,
      "num_comments": 65,
      "created_at": "2026-02-05T17:08:40",
      "selftext": "",
      "comments": [
        {
          "text": "Wah so shiok!! Saves me time from looking for illegal websites.",
          "score": 124
        },
        {
          "text": "28/104 is free, not bad after all.\n\nat least get to watch 24 group stage matches",
          "score": 120
        },
        {
          "text": "No more stupid starhub and singtel battle to screw consumer this year?",
          "score": 80
        },
        {
          "text": "It looks like All the 104 matches and official ceremonies of the 2026 World Cup will be available to subscribers on Mediacorp's mewatch platform. Lets hope the live broadcast streams without issues.\n\nDo you think Argentina could win again? They won the 2022 World Cup.",
          "score": 50
        },
        {
          "text": "Nice. Dont need to sail the high seas for streams! LOL\n\nTo be honest, due to time difference I dont think will be able to watch much of the matches anyway unless its those 12-1am maybe I can drag my tired ass to stay up to watch if its two big countries playing.\n\nMost prob will watch from quarters onwards.\n\nI recalled my first World Cup I watched was ironically USA 1994 when I was a student and watching Baggio missed THAT iconic PK.",
          "score": 26
        },
        {
          "text": "Did Singapore Pools (Tote Board) made any contribution? I guess they will be the biggest legal winner.",
          "score": 15
        },
        {
          "text": "Iirc back in the early 2000s, WC is on free to air channel qtr finals onwards. \n\nI remember watching WC'02 and the blockbuster matches of England Vs Brazil &amp; Brazil vs Turkey. \n\nFun times. Have lost interest in soccer though.",
          "score": 13
        },
        {
          "text": "Doing something right for once",
          "score": 10
        },
        {
          "text": "Government subsidy. Good job to the civil servants who managed to make this a ‘national sporting initiative’ or ‘community spirit building’ or something like that.\n\nFuck the telcos. This is the best use case. Not gov subsidising telcos’ profits.",
          "score": 7
        }
      ]
    },
    {
      "id": "t3_1qwkrlq",
      "subreddit": "singapore",
      "title": "Over 100 property agents to leave KW Singapore after fallout from PropertyLimBrothers saga",
      "url": "https://old.reddit.com/r/singapore/comments/1qwkrlq/over_100_property_agents_to_leave_kw_singapore/",
      "score": 349,
      "num_comments": 65,
      "created_at": "2026-02-05T21:05:56",
      "selftext": "",
      "comments": [
        {
          "text": "Abandon sinking ship.\n\nPractical move.\n\nSo much for 1 team 1 dream",
          "score": 358
        },
        {
          "text": "Can any property agent chime in on how what company you work for matters. Seem like most agents are 'freelancers' anyway what.\n\nIt's not like any clients will choose agent/property based on what company you are.",
          "score": 160
        },
        {
          "text": "property agents are probably the largest group of economic parasites in Singapore, does it really matter what they do",
          "score": 117
        },
        {
          "text": "One earn 10k+ for the company and get average pay.\nOne lost money for the company but get promoted to 200k per PA poistion",
          "score": 67
        },
        {
          "text": "how about PLB? I would have thought that they would have more agents leaving.",
          "score": 35
        },
        {
          "text": "PLB will be gone at this rate",
          "score": 9
        },
        {
          "text": "PLB should be shuttered and reborn as something new, minus Melvin. People are saying he’d still be okay without an active role because of his share in the business, so shut it down.",
          "score": 9
        },
        {
          "text": "Mass exodus liao, could be shutting down soon",
          "score": 8
        }
      ]
    },
    {
      "id": "t3_1qwi81l",
      "subreddit": "singapore",
      "title": "RSAF quietly unveils rocket powered winged suit at Singapore Airshow 2026",
      "url": "https://old.reddit.com/r/singapore/comments/1qwi81l/rsaf_quietly_unveils_rocket_powered_winged_suit/",
      "score": 276,
      "num_comments": 39,
      "created_at": "2026-02-05T18:54:41",
      "selftext": "I caught some glimpses of the top secret winged suit during flying displays of the other aerobatic teams on opening day of the airshow. They tried to be hush hush about it, but there's no escaping the 1/2000 shutter speed camera. ",
      "comments": [
        {
          "text": "paid actor",
          "score": 96
        },
        {
          "text": "There is nothing quiet about rsaf.\n\nTheir planes are earlier than my morning wood.",
          "score": 62
        },
        {
          "text": "Pic 3 will have sent our neighbouring country to shiet their pants how clear the suit is like. Thanks for selling our country secret away /s",
          "score": 25
        },
        {
          "text": "![gif](giphy|YJIzOvDDVEm7vhAwvp)",
          "score": 11
        },
        {
          "text": "Wheres PETA",
          "score": 6
        },
        {
          "text": "UwU\nUwU\nUwU",
          "score": 6
        },
        {
          "text": "Is it still \"quietly\" if it's at a show that the public can attend?",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1qwg415",
      "subreddit": "singapore",
      "title": "Over 1,500 speeding tickets erroneously issued, affected motorists to get refunds and demerit points voided",
      "url": "https://old.reddit.com/r/singapore/comments/1qwg415/over_1500_speeding_tickets_erroneously_issued/",
      "score": 150,
      "num_comments": 44,
      "created_at": "2026-02-05T16:45:25",
      "selftext": "",
      "comments": [
        {
          "text": "They blame the contractor 1st. \n\nThen my next question is, who in LTA sign off the acceptance ? They never check or test that job is completed as per scope?",
          "score": 135
        },
        {
          "text": "is LTA the most legendary stat board",
          "score": 132
        },
        {
          "text": "The refund will include interest?\n\nAs per a certain Leader of the House, where's the accountability?",
          "score": 49
        },
        {
          "text": "I never got a speeding ticket but doesn't the ticket include proof of the speed, measurement and camera configuration? No one called and said huh why I'm getting this ticket? Anyone cares to share what it is that you get when you get a speeding fine?",
          "score": 25
        },
        {
          "text": "tbh I don’t blame the LTA contractor.\nBut who the fk in TP think it is a good idea to not check the tickets they issue? Dont anyone who handled the tickets thought something is wrong?\n\nDidnt Shanmugan said just 3 months ago in parliament that TP will double check for two weeks before notice of offence is issued? \n\nCan say Pritam lie in parliament, isn’t this a lie as well? The wrong tickets are issued between Oct 30 and Dec, his statement about TP checking tickets is in November.\n\nSo while he is saying there are checks, his fellows are issuing false tickets. So isn’t him outright lying with two eyes open about the things he said.\n\nhttps://www.channelnewsasia.com/singapore/traffic-police-summons-backlog-due-spike-road-violations-ransomware-attack-shanmugam-gerald-giam-parliament-5450336\n\n“In a written reply on Thursday (Nov 6) to a parliamentary question by MP Gerald Giam (WP-Aljunied), Mr Shanmugam said the traffic police typically take about two weeks to issue a Notice to Furnish Driver’s Particulars to the registered vehicle owner, after the officers have verified the offence and the vehicle number captured by the speed camera.”",
          "score": 23
        },
        {
          "text": "Here me out 1,500 tickets equal to 1,500 votes. That's enough to tip a GRC. For the opposition lah of cos.",
          "score": 17
        },
        {
          "text": "Approver and reviewer should get sacked.",
          "score": 9
        },
        {
          "text": "Don't know what it is about Singaporean culture that makes it so we offload work to 3rd parties. Just buy the service rather than do it yourself. I'm talking about in general, not even as a corporate thing. But I mean the shoe fits. How many times have we read about some 3rd party contractor hired by the government making a mrss",
          "score": 7
        },
        {
          "text": "Yet they still want to do ERP 2.0 with the possibility of using satelite instead of a physical grantry? How stupid.\n\nIf they can’t even detect the speed accurately, how will they detect which road we are on in such a dense country? \n\nI can’t wait for them to charge drivers for being on MCE when they are underneath on Keppel Road",
          "score": 6
        },
        {
          "text": "LTA massive L. How can dis be allow?!",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1qwcavy",
      "subreddit": "singapore",
      "title": "Singapore Airshow 2026: ST Engineering unveils new kit",
      "url": "https://old.reddit.com/r/singapore/comments/1qwcavy/singapore_airshow_2026_st_engineering_unveils_new/",
      "score": 104,
      "num_comments": 31,
      "created_at": "2026-02-05T13:07:14",
      "selftext": "",
      "comments": [
        {
          "text": "Ditched AR-15s to produced SAR-21, guess we back to AR-15s now xd, looks like a cheaper version of the URGI",
          "score": 60
        },
        {
          "text": "st eng shares 📈📈📈📈📈🖨️💵🖨️💵🖨️💵🖨️💵🖨️💵🖨️💵",
          "score": 60
        },
        {
          "text": "The Taurus is nice. 🙂 Protect against drones and maybe help carry matador.",
          "score": 13
        },
        {
          "text": "I see anti drone laser and microwave system... About time, our ports are full of shipping containers. Remember how Ukraine launched drones deep in Russian territory using shipping containers",
          "score": 6
        },
        {
          "text": "wow hybrid electric terrex, ESG approved ✅✅✅",
          "score": 4
        },
        {
          "text": "Bbbbbb-based",
          "score": 2
        },
        {
          "text": "lol When I saw HED, my first thought was Heavy Elimination Device.",
          "score": 2
        },
        {
          "text": "Which one easiest to clean?",
          "score": 2
        },
        {
          "text": "Look at that Eaglestrike drone. That could be a killstreak in Call of Duty.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qwdgq7",
      "subreddit": "singapore",
      "title": "Drug dealers, underage drivers caught using deregistered vehicles as cases surge",
      "url": "https://old.reddit.com/r/singapore/comments/1qwdgq7/drug_dealers_underage_drivers_caught_using/",
      "score": 102,
      "num_comments": 29,
      "created_at": "2026-02-05T14:07:30",
      "selftext": "",
      "comments": [
        {
          "text": "how to get deregistered vehicles off the roads?🤔",
          "score": 48
        },
        {
          "text": "$2000 fine and up to 3 months jail for first offence? Doesn’t sound sufficient. Especially if use in conjunction with other crimes. \n\nAnd with the requirement for proof of export/destruction, means there are leaks in the system allowing for false submission of documentation? \n\nThis should not stop at the end user. Hopefully deeper digging is being done to clamp down on this.",
          "score": 28
        },
        {
          "text": "I'm convinced that the authorities in Singapore barely conduct checks anymore and are instead just praying every night that people in Singapore will police themselves and do the right thing.\n\n\"Please behave leh guys😭\"",
          "score": 26
        },
        {
          "text": "Once OBU system is in place; wouldn’t LTA have all the data about cars that are being driven should their road tax be expired; etc? then fines can be automated. no more having to “catch” manually by sight.",
          "score": 13
        },
        {
          "text": "Heard almost all comms r done thru telegram. Surprised imda has no leverage over it. Y never summon telegram ceo for coi lol",
          "score": 2
        },
        {
          "text": "One have to wonder how many of these are on the road. Just avoid all ERPs, don't speed, no accident. Who will even check.",
          "score": 2
        },
        {
          "text": "These operations are pretty sophisticated... \n\nJust my crackpot theory... But the vape ban has caused the emergence of an extremely lucrative underground industry. And these deregistered vehicle trade is likely growing in size and sophistication in response to the increased demand and spending power of the underground vape dealers. \n\nI wouldn't be surprised is an entire network of distribution, payments processing and crypto currency based money laundering had already sprung up. We know from the Thai tourist visa holders caught working in the vape warehouses that a whole network of disposable manpower is already in place. \n\nEither legalisation/regulation needs to come in or much stronger penalities need to come down. American prohibition should have been an example we learnt from in history",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1qwkfsd",
      "subreddit": "singapore",
      "title": "Unlicensed driving instructor taught over 100 students, gets jail",
      "url": "https://old.reddit.com/r/singapore/comments/1qwkfsd/unlicensed_driving_instructor_taught_over_100/",
      "score": 90,
      "num_comments": 15,
      "created_at": "2026-02-05T20:50:48",
      "selftext": "",
      "comments": [
        {
          "text": "&gt;She gave a long list of past traffic violations by Tan. These include repeat instances of speeding and running a red light. On other occasions, he failed to wear a seatbelt and was caught for careless driving.\n\nWhen you see bad drivers on the road &amp; wonder who they learned it from... they had a special driving instructor lol",
          "score": 113
        },
        {
          "text": "1 less PDI horror story source i guess",
          "score": 36
        },
        {
          "text": "No L plate and no brake control wtf. Really accident waiting to happen.\n\nWhat did he expect to do if the student anyhow and was heading towards an accident? Grab the wheel from him or something?",
          "score": 32
        },
        {
          "text": "Did they pass?",
          "score": 14
        },
        {
          "text": "The 71 yo PDI who was his fiat accomplice was not charged? wtf?",
          "score": 12
        },
        {
          "text": "How they take their driving test..",
          "score": 8
        },
        {
          "text": "Pap loves \"licensing\" because it's an easy money grab. And what for? We still have a majority of drivers who don't use their turn signal.",
          "score": 5
        },
        {
          "text": "Knn wtf bbq",
          "score": 4
        },
        {
          "text": "So that's why there are so many bad drivers",
          "score": 4
        },
        {
          "text": "wah lai dat also can.😲 unlicensed driving instructor neber hear b4. students hv2check driving instructor's license b4 taking new class lo❤️",
          "score": -10
        }
      ]
    },
    {
      "id": "t3_1qwhrod",
      "subreddit": "singapore",
      "title": "Ten ideas to improve public buses in Singapore!",
      "url": "https://old.reddit.com/r/singapore/comments/1qwhrod/ten_ideas_to_improve_public_buses_in_singapore/",
      "score": 85,
      "num_comments": 52,
      "created_at": "2026-02-05T18:27:57",
      "selftext": "LTA launched the Bus Connectivity Enhancement Programme in July 2024 in the name of improving coverage and access by public buses. There's steady progress that's been made there, regardless how different people might perceive its intents and purposes.\n\nHere's a 10-point plan outlining how our buses can be further improved, upon the basis of existing initiatives intended to enhance service, accessibility and connectivity for residents across Singapore.\n\nLet me know what you guys think about these proposed plans, and feel free to reach out to discuss them in greater depth! :)\n\nClarifications section, because I couldn't fit every last elaborate detail into the slides:\n\n\\#2 Redesigns to major \"hub\" bus stops and bus interchanges are intended to also improve the efficiency of passenger and bus flow, thus reducing the time spent bottlenecking around them, which is a common problem in current bus infrastructure designs.\n\n\\#4 a) Please note the distinction between rapid and express stopping patterns, b) \"Direct express\" routes referenced indicate bus services that operate in a pure point-to-point fashion, operating between two termini with \\*zero\\* intermediate stops, covering long distances across Singapore, c) \"Relay express\" routes are of a similar nature, but instead cover shorter links bridging gaps in the MRT network\n\n\\#5 Lower base fares help offset the removal of feeder fare caps for (est. two-thirds or more) bus riders, whose feeder bus rides lie outside the 3.2km feeder cap range.\n\n\\#9 Despite feeder integration, existing local bus connections will be retained to the maximum extent possible.\n\n\\#10 The expanded premium scheme differs from current premium bus services in the sense that private bus operators are given more flexibility to design their own routes and schedules to meet unmet demand, as opposed to the current arrangement where routes and schedules are set by LTA and subcontracted to private companies.",
      "comments": [
        {
          "text": "All door boarding is just going to make stops even slower. The occurence of people not giving way to alighting passengers in MRT is common enough that I expect the same clusterfuck to happen at the bus stop.",
          "score": 50
        },
        {
          "text": "Some more ideas you can consider:\n\n1. Installing card readers at the bus stop to reduce boarding time for express buses\n\n2. Bus lanes on expressways. Maybe a no move timing for heavy vehicles during peak hour to reduce the impact of the bus lane in reducing road space",
          "score": 37
        },
        {
          "text": "On point 1: can we just have more comfort for seats rather than the knee touching seats (the 4 seaters on some models) we have now, and please can we stop having the exhaust face the left aka the rest of us peasants at the bus stop. I get that the people who approve the bus models don't take the buses at all but they should at least try",
          "score": 30
        },
        {
          "text": "I do not agree with #3.\n\nImagine the consolidated entity is like SMRT trains, predictably ran by ex-SAF scholars who had no f***ing idea about transportation anyway.\n\nSome “competition” is needed. An operator that is consistently shit will stand out. Without competitors, the entity can become complacent.\n\nJust like how SBS Transit makes SMRT Trains look bad, we cannot have a monopoly where the entire system is operated by just one entity.\n\nFor #2, it is probably not possible to implement on some of the worst examples of bus interchanges. \n\nIf anyone need an example of a shitty bus interchange, just look at Yishun. Many key feeders are at the far end of the interchange. Maybe that is why 807 at opposite Khatib MRT bus stop is so chaotic and crowded. Nobody wants to walk 400m, going up and down multiple escalators, just to get to the berth in the freaking interchange, when the bus stop at Khatib is only 100m away.\n\nI think #9 is not that helpful. Combined portions for feeders tend to be well served corridors, or stops that are relatively closer to the MRT/interchange. They do not really need that frequency boost, compared to the more distant stops which feeder routes are really serving.\n\nFeeders are supposed to get people from the distant parts of a town to the town centre. People who are already near the town centre is not the key targets for feeders.\n\nHonestly, SG needs full day “express” buses (not just express bus, but also buses with long express sectors) that parallels MRT lines. The 500 series that links the east and west to town is good, but that is sorely lacking from the northern and northeastern side.\n\nRight now, many express bus routes from the north simply are not competitive. You are paying more in terms of fares and time, just to get away from crowds.\n\nTime should not be part of the trade-off! The ideal express route should be a trade-off between paying more for comfort (with equivalent travel time).\n\nAsk yourself, who the heck would take 851e, from say Clarke Quay to Yishun, when you have to pay express fare, wait for a bus that comes at the frequency of 30 mins, and still take longer than the MRT (plus transfers) to get to Yishun! Unless you really do not want to stand or you do not want crowds, why would you even take that bus? No wonder ridership is crap.\n\nFull day city direct services would be good. City direct services are actually competitive in terms of time, compared to MRT. It is really an ideal trade off between paying more and comfort.\n\nWhich is why for the routes that are competitive, they can be quite packed.",
          "score": 18
        },
        {
          "text": "Express surcharge was increased this year from 60 cents to $1 due to \"low utilisation\". Should have asked LTA if it would have been fairer and better utilised if basic fares were charged for express bus trips between local stops i.e. without travelling on express sectors?",
          "score": 16
        },
        {
          "text": "More bus lanes. Harsher penalties for drivers who fail to respect them.",
          "score": 16
        },
        {
          "text": "Get rid of those back facing seats",
          "score": 9
        },
        {
          "text": "Bendy buses could be used for suburbs, then for more traffic dense areas like CBD and town centres I guess double deckers would work too. One would complement the other, not replace it.",
          "score": 8
        },
        {
          "text": "I know that buses have a schedule to keep, but sometimes the drivers would deliberately drive antagonising slow and would purposefully wait till a traffic light turns red then start moving to the traffic light is so pissing me off. They would also sometimes wait at a bus stop for a full minute before moving off.",
          "score": 8
        },
        {
          "text": "Why bendy buses over double deck?",
          "score": 4
        },
        {
          "text": "Express Buses from East to West. Living in punngol and going to NTU is a pain.",
          "score": 3
        },
        {
          "text": "For 2 they can really upgrade the bus stop at the mrt side especially at Khatib and Yishun. They are too small when the opposite side is much bigger",
          "score": 3
        },
        {
          "text": "This is a \"Serious Discussion\". Joke, irrelevant or off-topic comments will be removed and **offenders will face restrictions in accessing /r/singapore** such as temporary or permanent bans. Please report such posts and comments. OPs must also engage in a bona fide discussion, i.e. the post should not be one just to incite outrage.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/singapore) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "text": "I am a car owner and never take public transport. \n\nHowever, i am all for improving public transport to remove more cars from the road. \n\nI was living in London for the last 30 years. One thing that London did right was extremely stiff penalty for driving in bus lane. \n\nThey had fully automated the tracking system using cctv and automated number plate recognition. Every single infringement is £50 automated fine. If you drive along the bus lane for a few junctions, you can easily get a free hundred £££ fine - don't ask how i found out 😭\n\nIn fact, the bus lane penalty was so successful that most Londoners don't even drive in bus lanes when the lane is not operational. \n\nMany times when crossing London, taking a bus is only slightly slower than taking the tube.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qwd99y",
      "subreddit": "askSingapore",
      "title": "Singapore bridesmaids — is this normal?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qwd99y/singapore_bridesmaids_is_this_normal/",
      "score": 480,
      "num_comments": 220,
      "created_at": "2026-02-05T13:56:33",
      "selftext": "I had a very frustrating bridesmaid experience and would like to share my experience and see if others have similar stories. I thought being a bridesmaid meant supporting your friend on her big day, but it ended up being exhausting and frustrating.\n\nThe TLDR points below:\n\n* The couple didn't pay for the dress.\n* We were referred to as helpers instead of friends.\n* I received less than $30 from the couple despite staying over at the bride's house and waking up in the wee hours to assist her until the reception.\n* During gate crash, the groom gave me just $10. There were less than 3 bridesmaids.\n* The couple are well-off.\n\nI know weddings are stressful, and I was there in my capacity as a friend to support her on her big day, but I felt so shitty. I honestly feel like rejecting future bridesmaid offers because of this. Is this kind of treatment normal for bridesmaids in Singapore?\n\nEDIT: I gave the couple few hundreds in angpow. ",
      "comments": [
        {
          "text": "Sometimes you just really see your friends for who they are when you become part of their bridal party.\n\nIn the future ensure that you agree to be a bridesmaid only when you really know and love the couple. If you spot red flags from early on, try your best to bow out.\n\nDon’t let this bad experience set the tone for other friends of your who might really love and appreciate you when you are in their bridal party.\n\nAlso take this as a future learning to NOT be this kinda bride.\n\nCurious, did you give them an Ang pow for the wedding? If yes then yeah, pain.",
          "score": 517
        },
        {
          "text": "Cant really comment as im a guy, but just as a bystander looking through the window, i think this is less abt being bridesmaid and more abt the bride and groom being shitty friends",
          "score": 179
        },
        {
          "text": "It's not normal. The couple comes across as cheapskates and the bride in particular isn't being a very good friend. Sometimes it takes moments like this to truly understand how your friends perceive you and your relationship.",
          "score": 173
        },
        {
          "text": "I was a groomsman once and never want to do it again. A lot of times, these so-called friends ask you to be a bridesmaid/groomsman just for the headcount. I was clearly asked because they wanted even numbers for both the bridesmaids and the groomsmen. \n\nFor me, it's less about the money received—because if you were my best friend, I'd do it for free—but it's more about being asked out of the blue, then going radio silent AFTER the wedding. For you, it looks like they wanted cheap labour and got it.  \n  \nI'd take this as a learning opportunity and be more discerning as to whom I accept such invitations from. ",
          "score": 122
        },
        {
          "text": "It just shows they're selfish. Though it is their \"big day\", it doesn't mean they should inconvenience their own friends and treat them like dirt. It is supposed to be a joyous day for everyone, not just for themselves. It highlights their selfishness.\n\nI know I'm going to get downvoted for saying this but...  You can struck them off as friends in future. Don't bother anymore. It is a one-way friendship. I can guarantee you they/she won't ask you out ever again except when they need help. And they will only invite you all over again during their \"housewarming\", \"baby shower\", \"baby's first birthday\" just for ang baos, gifts, or blessings, but never the other way round ever again.\n\nNever forget, when someone gets married, their priorities and personality will change. They will become more family-oriented than ever before. If she/they are already so selfish to you all during their wedding (which you all contributed so much to) and they treat you this way... Imagine how much worse it will be after this.",
          "score": 72
        },
        {
          "text": "She isn't your friend.",
          "score": 62
        },
        {
          "text": "No it’s not normal. Your friend just wanted cheap sai kang warrior.",
          "score": 43
        },
        {
          "text": "lol surprised you had to ask this, obviously they're not good friends 🤷‍♀️",
          "score": 43
        },
        {
          "text": "The couple being well off isn’t too relevant. But Op, you might want to reconsider your friendship \n\nTo be very blunt. You are taken advantage off. Even my friend who is laid off for &gt;1 year still gave each groomsmen $88. (There’s 5 of us)",
          "score": 41
        },
        {
          "text": "My spouse and I gave our bridesmaids and groomsmen different amounts of angpao depending on their jobscope. Ranging from $50 - $200. \n\nDress wise, we didn’t have a dress code so we just let them wear whatever they have/want so we didn’t pay for them. However, our other friends who had standardized bridesmaids outfits paid for our dresses/shirts. \n\nMy rich friend (both husband and wife are well off stay in landed type) whom I helped at the wedding, also didn’t give me any angpao. I guess… some rich people are just stingy? 😅 \n\nBut I feel ok lah, because I’m a friend who is helping out, not a vendor they engaged. So to me if they give me angpao, it’s a bonus but not expected.",
          "score": 31
        },
        {
          "text": "Similar to when I was one. \n\n- can't exactly if I remembered our outfit were paid \n\n- no red packets for us - yes with all the wee hours prep, making sure everything went smoothly. \n\n- being \"tsk\" at by bride's aunt at the gate lcaused she was late and we were in the middle of gate crashing. Proceeded with sarcastic remarks by her and glaring throughout the event.\n\n- door opening red packets being taken away by them cause we didn't need the money. \n\n- no lunch/meal/drink provided. First half ended, everyone went home tired, hungry, thirsty. \n\nWedding dinner - we were sitted at the very far back at the corner of the room. Someone actually commented asking why and apparently we weren't \"important\" enough. \n\nBut when they needed to go on stage, we still had to rush forward to help.\n\nSo yeah never again. Bride's family is well to do. Few millions condo which I believed would be double the price in these days now but we were treated like absolutely crap",
          "score": 28
        },
        {
          "text": "If i want to be a bridesmaid, i do it willingly. If i get angbao, it's a bonus. Otherwise, i'll be very willing to help out a friend. \n\nI was a bridesmaid for my Indian friend. She paid for our saree fabric, we paid for our own tailoring. I cannot remember if i received angbao, but that aside, i guess many would expect receiving one. \n\nI guess that's the cause of your frustration - money. Maybe ask yourself if you're there for money or for your friend.\n\nOn a side note, are you appreciated? Probably not as well. Being referred to as helpers? Nope. What a way to address your bridesmaids/close friends. I'll hold a grudge just for this.",
          "score": 23
        },
        {
          "text": "Have been a bridesmaid many times (6 at least). Let’s take out the financial position of your friend. But most times have cost me a lot of money. In the beginning days the bride and groom didn’t have a lot of extra but they always made me feel loved and appreciated for standing up with them for their special day. In the words, actions, care, etc. friendship shouldn’t be about money (though of course everyone has financial limitations). I never looked to come out ahead financially and always came out ahead emotionally. But I can see why feeling disrespected has made you look at the more tangible aspects of your commitment. Really I think you should separate it from bridesmaid/wedding/money issue and realize that your friend showed you who she really is.",
          "score": 21
        },
        {
          "text": "It’s not normal but tbh the few times I was a bridesmaid - maybe 4x in the past, I didn’t really have any expectation I would be paid. \n\nPlus even if I wasn’t paid I would be okay with it because I love them and enjoy the events leading up to the wedding hahah. I wonder if the couple might have forgotten tho? Cos for my friend’s wedding she was busy and didn’t mange to catch us after the wedding itself so she gave some of us an angbao during the next meetup.",
          "score": 21
        },
        {
          "text": "I choose who I become bridesmaid for very carefully\n\nBut thankfully I only ever become a bridesmaid to my sister, and to my poly friend of 19 years \n\nMy other poly friends have their bridesmaids from other close communities in their lives like church cell group friends and family members. \n\nMy sister gave me a $68 ang bao, and gatecrash my brother in law gave us bridesmaid $18 ang bao, we didn't make it too hard for him, just play the usual games that's all. This was 18 years ago. \n\nFast forward to 2024, my poly friend's wedding, she and her husband are expats. Both are in good stages of their careers, not rich but well to do as career is in good place. They paid for our bridesmaid dresses, bride let us choose from Shein and she bought them for us, meet us for a dinner while she passed us the dress 👗 (she treated us the dinner, while we delegated the bridesmaid work, who takes care of what, who recce the place while joining the bride and groom for menu tasting, who is bridesmaid of honor and so on)\n\nDuring pre wedding decor we all woke up super early (as its a lunch), we did our own makeup and hair, help to decorate the wedding lunch space. Help each other (bridesmaids, there are about 6 of us) with hair and makeup. We bring our own decorations to contribute, like i bought a bubble gun and solution, fairy lights and flower petals, out of my own pocket.\n\nWe bridesmaids also give ang baos for the wedding lunch. It was at Andaz, I gave a $288 angbao, with $2 notes from the flower series (older singapore notes), cause my mum has some old notes. Some bridesmaids who are closer to bride, like a workplace bestie bought her a customised jewellery piece on top of ang bao.\n\nAfter the wedding lunch, we joined the bride and groom and his friends from the country he's from, for a dinner by the fullerton riverside, as a compensation from the bride and groom. Bride and groom gave us a small wedding gift bag, which the bride's sister prepared on their behalf, with a $50 ang bao. \n\nI'm sharing, because i feel everyone's life experiences are different. And at the end of the day, bridesmaid duty is quite heavy, choose wisely who you are a bridesmaid for. It is okay to reject being a bridesmaid if you think you dont not have the bandwidth. \n\nAnd depending on how close you are to the bride, like my good friend despite in the midst of divorce she still find the mental strength and bandwidth to be a bridesmaid. This is because she is very good friend with the bride, and the bride is not chinese, who is not pantang whether a \"divorcee\" will pass the luck to the newlyweds. Like they are such good friends, nothing stands in the way for them celebrate for the bride's union joys. \n\nOP, revisit why you become a bridesmaid moving forward. Money is not always the right currency, if you are truly close and celebrate your friend's new life milestone joys.",
          "score": 15
        },
        {
          "text": "actually i thought bridesmaids/groomsmen don't need to give red packets",
          "score": 12
        },
        {
          "text": "I’ve been a bridesmaid a few times alr. Yes of course you should not expect to be paid when doing this, and I think OP also didnt, but as the bride, your friend should have tried to limit the out of pocket expenses that OP has to make (besides the ang bao), since after all, this is the bride’s wedding, not the bridesmaids’ wedding. Why should they incur extra costs for sth thats not theirs to begin with? And OP did try to help as much as she could alr.\n\nI believe this boils down to the bride not being thoughtful and sensitive enough to make OP feel appreciated, not necessarily because of money entirely. One time I had to fly overseas to be a bridesmaid, of course the ang bao the bride gave me was not enough to cover the tickets and everything, she paid for the dress and didnt refer to me as helpers LOL, so I felt very happy that I could be there for her big day. After all, ppl will never be bridesmaids for someone they’re not close with, so the bride could have shown more thoughtfulness in this case",
          "score": 10
        }
      ]
    },
    {
      "id": "t3_1qwoc1x",
      "subreddit": "askSingapore",
      "title": "Is it illegal? - Hidden CCTVs in Office Space",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qwoc1x/is_it_illegal_hidden_cctvs_in_office_space/",
      "score": 129,
      "num_comments": 39,
      "created_at": "2026-02-05T23:30:59",
      "selftext": "My office, which is an SME, had a CCTV camera that management had repeatedly described as a dummy camera, supposedly placed only as a symbolic or “provoking” gesture. Because of this assurance, none of us believed that actual surveillance was taking place.\n\nHowever, last week, a colleague and I accidentally discovered two concealed cameras within the office. One was positioned directly above my desk, and the other was placed on top of a cabinet behind where I sit. It later became clear that these were not dummy cameras.\n\nlI was never informed that I was being recorded, let alone by cameras placed so closely and directly around my personal workspace.\n\nWhat makes this even more troubling is that I am the only female employee in a male-dominated workplace, and there have been previous incidents of sexual harassment involving a former colleague. Given this history, the presence and placement of hidden cameras feels extremely invasive and alarming.\n\nI am struggling to understand whether such hidden surveillance is allowed, and more importantly, why it was deemed necessary to conceal these cameras instead of being transparent with employees.\n\nEdit: On top of that, I was told that apparently in Singapore you need to register or have a valid licence to set up CCTV (or something like that), and because they felt it was a long and troublesome process, they didn’t go ahead with the “dummy” ones and instead chose to install hidden cameras without our knowledge.",
      "comments": [
        {
          "text": "Don’t say a word to alarm the management, or else they will remove the evidence. Report to police",
          "score": 123
        },
        {
          "text": "Creepy. Who knows what they install in the toilets?",
          "score": 121
        },
        {
          "text": "[https://www.mom.gov.sg/newsroom/parliament-questions-and-replies/2023/0918-oral-answer-to-pq-on-guidelines-for-cctvs-at-workplaces](https://www.mom.gov.sg/newsroom/parliament-questions-and-replies/2023/0918-oral-answer-to-pq-on-guidelines-for-cctvs-at-workplaces)\n\n  \n[https://www.pdpc.gov.sg/-/media/files/pdpc/pdf-files/advisory-guidelines/ag-on-selected-topics/advisory-guidelines-on-the-pdpa-for-selected-topics-(revised-may-2024).pdf](https://www.pdpc.gov.sg/-/media/files/pdpc/pdf-files/advisory-guidelines/ag-on-selected-topics/advisory-guidelines-on-the-pdpa-for-selected-topics-(revised-may-2024).pdf)",
          "score": 56
        },
        {
          "text": "Scary. U shd gather evidence first. Hv pics/vids of the secret cctvs before u decide what to do.\n\nMake sure yr pic/vids shows your desk/surroundings clearly too.\n\nNot sure if they can view you taking these pics/vids from the cctv angles but you'll have to think how. Discreetly.",
          "score": 56
        },
        {
          "text": "&gt;I am struggling to understand whether such hidden surveillance is allowed, and more importantly, why it was deemed necessary to conceal these cameras instead of being transparent with employees.\n\nWhy i wonder\n\n&gt;My office, which is an SME\n\nAh that's why. Time to GTFO and work for an MNC that respects employees as individuals than cattle.",
          "score": 40
        },
        {
          "text": "Please report this. You never know if your reporting might save someone else from getting violated- maybe not in the same space but at least a precedent will be there",
          "score": 28
        },
        {
          "text": "This is super tricky and creepy. I was a HR at an SME and they have a cctv that was told to me it was a dummy (but reminded me not to tell the rest 🙄 so that they will be on the ball while working.) but the camera was placed in a way that the video will be a wide angle shot. Everyone can see the cctv. \n\n1) make sure you have evidence of cctv’s positions. ensure you’re able to see that they are turned on and recording. This is so they don’t gaslight you. Even if they say it’s not turned on, why have the camera there? Sus. are the cameras positioned to record you only? Have you checked other areas?\n\n2) call MOM. Tell them you have this situation, ensure that you have NOT been notified that you will be recorded. So you need to check your contract. In private office buildings, employers need to inform employees that cctv are in place and they are being recorded with consent. Or else it’s a breach of PDPA.",
          "score": 19
        },
        {
          "text": "Idk. As someone that's been working in Mnc all my life, I always assumed that we are always monitored and that there's no such thing as privacy in public spaces of the office.\n\nThe surveillance in my office is so zai that got one time I didn't adhere to some cumbersome security protocol when entering the office and I got an email telling me not to do that again.",
          "score": 13
        },
        {
          "text": "Worked in an SME before and there were cameras all over. Prominently displayed though and not hidden and the boss had access to all of them. I always assumed that most offices had CCTVs installed tbh, but if you're finding hidden cameras then best you leave if you're uncomfortable because you have no idea how many more hidden cameras there are around you.",
          "score": 4
        },
        {
          "text": "That’s not normal and definitely crosses a line, especially if you were told the cameras were dummy. Hidden surveillance at an individual desk without consent is a huge red flag",
          "score": 3
        },
        {
          "text": "Given the past harassment context, you should document everything and seek advice ASAP. This isn’t just uncomfortable, it could be unlawful",
          "score": 3
        },
        {
          "text": "Remember to resign first before you report to the police",
          "score": 2
        },
        {
          "text": "Please report to police and let them take care of it",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qwopa2",
      "subreddit": "askSingapore",
      "title": "Feeling lost after being laid off. Advice needed",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qwopa2/feeling_lost_after_being_laid_off_advice_needed/",
      "score": 115,
      "num_comments": 71,
      "created_at": "2026-02-05T23:44:58",
      "selftext": "Got laid off due to company restructuring. Been job hunting for almost a year now. I have been applying for openings from different industries too but it is really tough without relevant experience and education. I also consulted several people on taking up professional certs to pivot. Their mixed feedbacks make me hesitant to commit due to uncertain hiring prospects, lack of relevant experience, and financial constraints. \n\nI have a degree that’s practically worthless now, so I am considering burning through my savings going back to poly to reskill (nursing or engineering) and pivot from there. However, I’d be in my 30s by the time I graduate, and I don’t think I’d be as desirable as fresh grads a decade younger than me. The unemployment, anxiety of ageism and the financial stress + constraint is eating me alive. I don’t really have anyone to discuss this with or to help me. \n\nAny advice/resource would be greatly appreciated 🙏🏻",
      "comments": [
        {
          "text": "I am sorry to hear that. Maybe you could share more specifically about your prior experience and education for more relevant advice to your situation as the information so far is rather generic",
          "score": 41
        },
        {
          "text": "Nursing is a recession proof job, but there are instances where some graduates are not able to land a hospital posting (search reddit thread). Nursing also have their own sets of issues, burnt out, toxic ward culture, salary does not pay well enough for the amount of work you put in etc etc.",
          "score": 24
        },
        {
          "text": "Can consider mid career switch to nursing. My husband applied the other day, and tbh, their allowance are actually pretty good. To be receiving 2.5k - 3.1k is still better than nothing I supposed? Plus, I guess you can call nursing as still an iron clad bowl. \n\nhttps://conversion.mycareersfuture.gov.sg/Portal/ProgramDetails.aspx?ProgID=P00000189",
          "score": 9
        },
        {
          "text": "I took a WDA career conversion programme then I took part time degree. \n\nIt keeps you employed until you get your degree.",
          "score": 9
        },
        {
          "text": "considering your degree in psychology, will you be open to counselling or social service roles?",
          "score": 8
        },
        {
          "text": "anonymized your resume and upload here or /r/resumes\n\nit's either your resume or your interview skills... \n\ndon't give up, yeah?",
          "score": 5
        },
        {
          "text": "Office admin, HR, secretary; these are roles you can consider.",
          "score": 3
        },
        {
          "text": "Try teaching. \n\nLearning centres like people impact specifically hire people with psychology degrees. I heard the salary is relatively good, from there you can pivot into centre manager or backend for education field.",
          "score": 3
        },
        {
          "text": "what is your degree in",
          "score": 2
        },
        {
          "text": "Possible to take master in clinical practice?",
          "score": 2
        },
        {
          "text": "Who talk abt degree when u got working experience. But do look at taking up short courses to rebuild ur confidence. Ask ur gd fren to look at hr cv, ask them to mock interview w u. U cfm have something do wrong",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1qwdsvd",
      "subreddit": "askSingapore",
      "title": "What to do after witnessing a fall in public?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qwdsvd/what_to_do_after_witnessing_a_fall_in_public/",
      "score": 105,
      "num_comments": 27,
      "created_at": "2026-02-05T14:25:47",
      "selftext": "Earlier I saw an elderly man lying on the floor in public after falling, he likely seemed to have hit his head. There were a lot of other people passing by but no one else stopped so I went to check on him. It was difficult to communicate due to a language barrier so I had to use an online translator. He said he felt fine and could walk, and when I brought up seeing a doctor or going to hospital he strongly refused. So I just walked him to his destination (a government building) and sat him down safely so he could wait for it to open (we lost contact after that... I was in a rush to get to work). In retrospect I’m really worried I should have called emergency services despite his refusal given his age, I know it was extremely stupid not to, but I really wasn’t thinking clearly at the time :(\n\nIs there anything appropriate to do after the fact? Is there any point in calling emergency to report the fall now even if I have no way of identifying him? (I know it doesn't really make sense since presumably there's no way to reliably trace him, but idk would it be helpful for their records if he were to maybe turn up at the hospital needing medical care later?) If I call up the government building to ask if they'd seen him just now, I assume they wouldn't be able to disclose his contact since it might be a PDPA violation or something? Thanks for any advice or if anyone has experience/stories to share",
      "comments": [
        {
          "text": "That awesome of you not to be affected by bystander effect. You've done more than the others for sure.\n\n\nI'm not as well versed in injury check, so I'll likely find a person of authority:\n\n1. I'll probably do the same thing as you first and offered ambulance services for expert assistance. In his case, probably he balked at the likely medical cost? If so I'll go to the next step\n\n\n2. Ask if he's traveling with anyone, or any number he can share like his children, etc. I'll try to call them to share the situation and if they wanted to come over.\n\n\n3. If he's unwilling to provide or you fear it may go ugly (family members accusing you of hurting him etc), I'll just go to his destination (in this case govt building) and discreetly reported to the security guard to look after him and explain the situation. In that case they can monitor his well being after you left and maybe be more forceful for him to accede to #1 or #2 above.",
          "score": 84
        },
        {
          "text": "You did well helping him to a govt building. Don't worry, the front liners there will make sure he gets the help he needs, they're trained for this. Even if they're not, they will escalate till it reaches someone who does (they will likely call for medical help).",
          "score": 48
        },
        {
          "text": "It was very kind of you to help him, and what you did was absolutely right. Calling emergency services really depends on the situation. If the person is conscious and able to communicate that he is okay, it may not be necessary. However, if he is unconscious, then emergency services should definitely be called.\n\nMany people may want to help but are rushing to work, feel hesitant, or are unsure what to do especially with a language barrier. Thank you for taking the first step to help. We need more people like you. If it were myself or a family member in that situation, I would be truly grateful that someone was willing to help.",
          "score": 18
        },
        {
          "text": "You are a rare one! You've done what you could. The only other thing I would have done is to alert the customer service counter or security personnel of the fact that the man had fallen.\n\nSome years back, I fainted while cycling and fell on the sidewalk. It was morning and I supposed the folks at tanjong pagar just walked around me or across me. I woke up some time later in confusion and wheeled myself out of the way. Another friend who was pregnant fainted in chinatown and was lying at the end of the escalator for a good 15 min before an angmoh stopped to help her. According to our experiences, you are an exceptional being.",
          "score": 14
        },
        {
          "text": "I encountered the same before. An uncle fell and he had a hard time going up. Good thing is that another guy helped us to get him up. The guy and me insisted to bring him to hospital but he refused. He then walked slowly like nothing happened.\n\nI felt bad also and i feel like we should’ve called emergency services also.",
          "score": 9
        },
        {
          "text": "These elderly people are often very afraid of medical bills. So if you help and they refuse to go to the doctor and refuse your offer to call an ambulance, you should not over-ride their wishes. Unless you can obviously see that the guy needs stitches or has a broken bone etc. \n\nYour suggestions in the second paragraph are all a bit too \"extra\". If the building was open, you could let a security guard know to watch out for the guy. But if it was closed, you already did enough and should consider it a job well done. ",
          "score": 9
        },
        {
          "text": "respect",
          "score": 7
        },
        {
          "text": "I saw an older lady fall off a bench once, and her elderly husband was trying to pick her up but couldn't . I rushed over to try and help her up but I was also struggling to pick her up. Luckily two other women also saw what happened and they also rushed over to help and three of us managed to get her back on to the bench.\n\nWe checked with the couple to make sure they're ok and the lady didn't hit her head or was injured anywhere else. They insisted they were fine, didn't need an ambulance or medical help, and they lived at a nearby block (they pointed it to us). We asked if they wanted us to help accompany them back and they said no need. They'll just rest a bit and make their own way home. Since she didn't appear to be in pain from her fall and we can't see any visible injuries, we just told them to walk slowly and take care of themselves and we left.\n\nI think sometimes you can make a judgment if a person needs medical intervention. Like in my case, the lady was coherent, if a little embarassed, she didn't appear in pain, there was no visible injuries of concern like deep cuts or head injuries, and she had someone else with her (her husband), so I think it was find to let them go about their day.\n\nBut if you think someone needs help, then you can inforrm any nearby authorities. Like in your case, the people from the government building should be able to render aid, or if you're near to an MRT station, can run inside and ask the staff for assistance. Or can just call 995 to report the incident, even if the person refuses aid but look like they need it. Just to be sure.",
          "score": 6
        },
        {
          "text": "Just sharing this story I’ve heard since it’s very similar to what happened to my friend’s friend. Her dad fell near the bus stop and hit his head as well. The only other person at the bus stop checked on him but he insisted he was ok and was helped onto the seat to rest. Then the person continued on his way so the dad was left alone there, but his condition deteriorated and he passed away. I’m not sure if he died at the bus stop itself while he was left alone, but it’s really a tragic incident overall. \n\nNot to say you didn’t do enough, OP! It’s tough when the elderly insists to not be sent to the hospital. But after hearing about what happened to my friend’s friend’s dad, I feel it’s better to just call the ambulance when such a situation happens. 😢",
          "score": 5
        },
        {
          "text": "I encountered same cases few times and always helped the person. I cannot speak Chinese so sometimes I wait a bit to see any Chinese look-alike stop and help but most of the cases I need to take action. But I am still pondering why people just walk past without helping like the person is invisible. So strange. Just from my observations, most of the cases those who stop and help are from minority races…",
          "score": 4
        },
        {
          "text": "do we wanna help? yes.\n\nare we scared if we help something negative might happen to us? yes.\n\nso in the end, we don't help, because nobody knows what could happen. 😔",
          "score": 4
        },
        {
          "text": "Unrelated but the google-translate app have a convo mode where u can point both sides of the screen to each other for real-time translation. Apparently translation has a major upgrade since dec25. And you can launch it quickly without a lot of buttons, good if a foreigner approach u or vice versa",
          "score": 2
        },
        {
          "text": "I think you could call emergency services and let them assess him and ask if he wants to go despite him initially telling you no. An elderly fell when I was volunteering and they just called 995 w/o asking him and had the paramedics + doctor assess whether he's ok and fit enough to not go hospital if he dw",
          "score": 2
        },
        {
          "text": "You did great . ",
          "score": 2
        },
        {
          "text": "I'm an American staying in Singapore for a few months. Not realizing this was a Singapore post at first, my first thought was that the man might not be \"documented\" for stay in the US and was fearful of deportation. Also, fear of the high cost of medical care since we don't have universal health care from our shameful government. \n\nBRAVO for doing the best you could at the time, and surely he was tended to by other concerned people. 😎",
          "score": 2
        },
        {
          "text": "OP, thank you for helping. You did good. The man was probably embarrassed. But it’s ok, let him decide whether he wants medical attention. There are many reasons why a person says no. Ultimately it’s his choice. Don’t worry about it any more.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qwakys",
      "subreddit": "askSingapore",
      "title": "Can a fresh university graduate negotiate their salary?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qwakys/can_a_fresh_university_graduate_negotiate_their/",
      "score": 74,
      "num_comments": 44,
      "created_at": "2026-02-05T11:45:02",
      "selftext": "I'm a fresh university graduate who just got offered a full time job but it's below what I was looking for. \n\nI have yet to accept the offer, but I'm wondering if it's acceptable as a fresh graduate to respectfully ask if they could offer a slightly higher pay? If so, how should I go about this? \n\nThank you :)",
      "comments": [
        {
          "text": "Of course you can. They also can say no. Always go into the negotiation prepared for all outcomes. Makes dealing with the fallout easier.",
          "score": 166
        },
        {
          "text": "Anyone can negotiate, but keep in mind the leverage of your position.\n\nFor example, do you have a rare and unique skillset? An established track record? Then your negotiating position is strong.\n\nRight now, with the job market weak and you are a fresh graduate, your position is weak.\n\nIf you do negotiate, think about why you might deserve a better pay. Are you bringing more to the table than other potential employees? Asking \" i was hoping for x% higher because I have y skillset and can deliver z for the company\" versus \" i was hoping for x% higher just because\" is going to have a better chance.",
          "score": 132
        },
        {
          "text": "Just make sure you can justify what you bring to the table is worth the salary they set for you, then yep you can negotiate with your HR POC\n\nIf it's a big company that pays by salary band, quite hard to negotiate",
          "score": 27
        },
        {
          "text": "In all negotiations, you need to know your leverage (perceived inclusive).\n\nThese leverage can come in many form. Eg. Past experiences, academic standing, willingness to be deployed in unfavorable conditions like night shift, oversea, many job offers etc. If you don't have much  then you are negotiating on the margin of their hiring budget. Still can increase salary but small amount.",
          "score": 12
        },
        {
          "text": "Market is definitely very tough atm and I think you can ask but be prepared to lose the offer",
          "score": 9
        },
        {
          "text": "Only advisable if you have another offer to negotiate with.",
          "score": 8
        },
        {
          "text": "Play it out in your head. What are you doing to command the salary of your ask?\n\nBeyond salary, have you looked into the employee benefits? \n\nAnd would you hire yourself for the salary of your asking?",
          "score": 4
        },
        {
          "text": "Yes you can definitely negotiate, similarly they can say no.\n\nYou need to convince in which area you are better than other fresh grad applicants.",
          "score": 4
        },
        {
          "text": "\"Is there any room to bump up the starting pay a little bit more to XXX amount, I'd really appreciate the accommodation.\"\n\nSo, yes, even starting pay can be negotiated, with the understanding you are at the disadvantage. So, you ask in a way that still keeps the offer open rather than an ultimatum that threatens the offer.\n\nState an amount you'd be happy with, don't be ridiculous. Save the ridiculous asking price for when you have some experience and accolades under your belt.",
          "score": 4
        },
        {
          "text": "try and think about this way...\nanything in life is always negotiable but the thing is whether you have anything to offer as well?\n\nsometimes u can think from the perspective as an employer..\nwould u allow a fresh graduate to negotiate?\nif yes...why? what does the fresh graduate have to offer?\nelse it will always be a no",
          "score": 3
        },
        {
          "text": "In general you can't, especially for MNC roles which will be standard package. To negotiate you need ammo, commonly:\n\n1. Past salary\n2. Past compensation and benefits\n3. Employers' desired related experience or their previous intern \n4. Niche skillsets\n5. Competing offers\n\nAs a fresh grad, if you don't have outstanding awards, you can't. Even a normal FCH will not have much ability to negotiate if they don't have the above criterias, just a better base package.\n\nIf you try to negotiate, you have only 1 chance and you cannot push too hard.",
          "score": 3
        },
        {
          "text": "If you have no other offers you cant. Why would an employer pay you more if you are going to accept anyway?",
          "score": 2
        },
        {
          "text": "Negotiate after you receive offer! Not during interview\n\nAt the stage of offer, HR have most likely shortlist you as the top, they do not wish to go through the whole process. They have a range of salary they can work with, so it is possible for negotiation",
          "score": 2
        },
        {
          "text": "Yes i negotiated a $500 increase",
          "score": 1
        },
        {
          "text": "How much?",
          "score": 1
        },
        {
          "text": "Yeah you can ask nicely and humbly. Especially if you have dependents etc. just don't make it a demand and burn any bridges. \n\nJust take note that entry level roles have established pay so that internal equity is maintained ..ie. avoid conflicts with staff already there.",
          "score": 1
        },
        {
          "text": "I guess what I’d do is to find the range for similar roles and then to use that to leverage “hey the market for similar roles is X, since I’m being offered Y, could we close that gap?”",
          "score": 1
        },
        {
          "text": "Leverage. If you don’t have leverage then you can’t negotiating. If you’re a fresh grad, ask yourself, what is the leverage that you have?",
          "score": 1
        },
        {
          "text": "if it’s an MNC, chances are you can’t negotiate as the hiring managing or HR isn’t in a position to give you a higher salary.\n\nbut it doesn’t hurt to try. Just be prepared when they say no",
          "score": 1
        },
        {
          "text": "No harm asking.   \n  \nHow about transport, mobile allowance, other staff benefits ?",
          "score": 1
        },
        {
          "text": "Sure why not.",
          "score": 1
        },
        {
          "text": "BTW, there is a small caveat, some like MA programs, big 4s, most govt programs, all have fixed pay. Don't bother trying for those.\n\nIn general. If they are hiring multiple people per role, you don't have a chance to negotiate.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qwqz0x",
      "subreddit": "askSingapore",
      "title": "I’m having my first suicidal thoughts, where can I go for help?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qwqz0x/im_having_my_first_suicidal_thoughts_where_can_i/",
      "score": 55,
      "num_comments": 34,
      "created_at": "2026-02-06T01:07:08",
      "selftext": "I’m an international graduate student, living alone and far from home. I do have friends but the idea of opening up to them drains me this time, as we have dwelled to each other over assignments, exams etc. \n\nI thought adjusting to Singapore would be easier as I come from a fellow SEA neighboring country but it isn’t getting any easier. Every time I try to get my mental health back on track, some extra problem shows up and messes with my progress.\n\nSorry for the messy post, but would appreciate any advice on where should I go ",
      "comments": [
        {
          "text": "Call 1767. Talk to someone who is from your country. I personally think having to use the second language all the time is draining emotionally, and cause distance. Call old friends, and catch up. Find a friend who is on the same page as you. Someone who has similar problems, same background, etc. Don’t stay alone all the time. May be join volunteering activities, you will meet a lot of kind people, and also feel accomplished giving help to those who need. And remember you don’t need to figure out everything, just showing up everyday is enough.",
          "score": 48
        },
        {
          "text": "\nTry to see if you can differentiate between a passive (‘I’d rather not wake up tomorrow’, ‘maybe dying would not be so bad’) and an active suicidal thought (‘I want to end myself by ____’). \n\nI’ll list down the stages of suicidal ideation, and how urgently I feel you should seek help: \n\n1. Intermittent passive thoughts - hotlines are a good first step. Please seek help early still - approach your university counsellor first thing tomorrow. They may or may not refer you to a psychiatrist. \n\n2. Progressing to active thoughts, not quite planning/preparing yet, but getting more difficult to manage - please seek help urgently. In the context of this post (wee hours), if intense, head to IMH Emergency (24/7), because most other acute psychiatric services are not available at this time. If it can wait till morning, go to any A&amp;E in Singapore, the emergency doctor will refer you to the psychiatrist during office hours (you’d most likely be seen by a psychiatrist IN the emergency department itself, esp if you go in the morning). \n\n3. Extremely intense and distressing active thoughts, and/or have progressed to the stage of planning and preparation, please visit IMH Emergency ASAP. \n\n4. If you’re in the stage of executing the plans right now, and the only reason you’re posting this is because you’re having second thoughts, please call 995 IMMEDIATELY.\n\nMy thoughts are with you OP.",
          "score": 41
        },
        {
          "text": "You may reach out to Samaritans of Singapore (SOS) at their 24 hours hotline at 1767 or their 24 hour CareText at 9151 1767 (via WhatsApp).",
          "score": 8
        },
        {
          "text": "if you’re in university, you may want to seek out the the university counselor",
          "score": 7
        },
        {
          "text": "“before u kill urself get a six pack first” someone told me that and it changed my life",
          "score": 5
        },
        {
          "text": "Call the national mindline 1771",
          "score": 3
        },
        {
          "text": "Your friends care more about you than you think. You don’t have to pour it all out, but expressing yourself a little helps. \n\nHang in there and hope it gets better.",
          "score": 3
        },
        {
          "text": "It must be tough for you to manage your school work and away from family. Feel free to chat if you need a listening ear. Please take care",
          "score": 3
        },
        {
          "text": "Aside from seeking help (can't rly suggest since the counsellor I always talk to, no longer at same place)\n\nPlease do find some space for yourself, like sight seeing, people watching, explore different corner of hidden gems like cafe taste-test coffees etc to seek zen, it does help me a lot during those times",
          "score": 2
        },
        {
          "text": "I’m sorry to hear what you’re going through. You are not alone. I don’t know your religion. Try praying or meditating. Move away from those dark thoughts.",
          "score": 2
        },
        {
          "text": "[https://www.reasonstostay.co.uk](https://www.reasonstostay.co.uk)\n\nPlease have a read. Life is tough and riddled with problems but there are still many reasons for you to stay.",
          "score": 2
        },
        {
          "text": "I am so sorry you are feeling this way. \nThere are many hotlines provided already. \n\nPlease call and let someone do something for you. Tell someone. Please call. You are not alone. \n\nMy thoughts are you with you.",
          "score": 2
        },
        {
          "text": "Your university should have a student counselling team. Do try to talk to them as well.",
          "score": 2
        },
        {
          "text": "21f here studying in university.  I desperately need someone to talk to just in case anyone reads this comment.  Pls dm me.  Ideally someone who recovered from severe depression/anxiety and just grad or in uni.",
          "score": 2
        },
        {
          "text": "Counselling helpline here but not for urgent cases:\n\n[Youthline](https://youthline.sg)",
          "score": 2
        },
        {
          "text": "Maybe you need a psychologist. I tried counselling. Didnt work neurofeedback-asia.com",
          "score": 1
        },
        {
          "text": "Speak to your school teacher/ lecturer (someone that you trust/ like) - who will then refer you to the school counsellor. I think thats the fastest way for you to quickly get in touch with someone who can talk to you and also help you (on what to do about this suicidal thoughts). \n\n\nIm not sure if this is a good suggestion but if you're feeling down/have small problems (but not feeling suicidal at the moment), try to write the problem out to chatgpt. It does give good advice, and will share tips on how to regulate yourself etc. So, instead of friends who dont want to listen, you have chatgpt that doesnt judge you at all. You might get temporary relief.\n\nBut if you are feeling suicidal or too depressed, get human help asap. Call the hotlines as what the others suggested.\n\nI hope you will feel better soon and think of your family.\n\nPls try to quickly get in touch with your school counsellor &amp; say its urgent. If there is an office for counselling in your sch, walk-in bravely. (I think, maybe no need lecturer to help you recommend for counselling).",
          "score": 1
        },
        {
          "text": "hello, you can try finding your school counsellor or talk to suicidal hotlines. \nJust wanna let you know you are not alone in this! &lt;3",
          "score": 1
        },
        {
          "text": "Call those hotlines. It’s important. Also get enough sleep and good diet it will help your moods. And exercise. These are the big 3.",
          "score": 1
        },
        {
          "text": "I had suicidal thoughts too , for me it was that  I was too focused on my problems , I was so short sighted that I forgot there's a future and theres a way out .\nDon't forget that",
          "score": 1
        },
        {
          "text": "I know there's some stigma against medication but, I was really REALLY depressed/ anxious abour adjusting to work and what really helped me was taking medications.  \n\nThese medications are given by psychiatrists. They don't do as much talking but they are able to prescribed medication. Some are long term meds that have been life changing for me",
          "score": 1
        },
        {
          "text": "what caused the thoughts? Is it a short term or long term issue?\n\nWhat would be your choice of solution to the problem?\n\nWe don't know you, so we can't judge you. It helps to lay everything out and sometimes, it shows an acceptable route out",
          "score": 1
        },
        {
          "text": "Find out something you can enjoy n make busy hobbies or small things, running helped me better. Cheers bro. Will be alright.",
          "score": 1
        },
        {
          "text": "Possible to get at least 1 of your family member come stay with you?  \nSingapore is not the chill place to survive because a lot of people fighting for job in small country.",
          "score": 1
        },
        {
          "text": "Hi Friend,\n\nYou can whatsapp 91511767 if you don't like to voice call or 1767 if you are ok with it.\n\nOpening up to friends, especially ones that you don't feel close to can be daunting and may not be the best thing to do.\n\nRemember, there is no trouble too big that warrants an escape like that.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qwfoge",
      "subreddit": "askSingapore",
      "title": "Best quiet area in SG for long term stay? (WFH, ~$5k budget)",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qwfoge/best_quiet_area_in_sg_for_long_term_stay_wfh_5k/",
      "score": 43,
      "num_comments": 91,
      "created_at": "2026-02-05T16:18:10",
      "selftext": "Hey all, relocating to singapore long term and trying to figure out where to live. not a tourist, actual long term stay\n\nbasically i WFH so dont need to be near CBD or anything, just want somewhere quiet and peaceful with good MRT access for when i actually need to go somewhere. budget around 5k, looking for a modern condo with decent space (not those tiny shoebox units lol). nearby park would be amazing\n\nbeen looking at punggol, bukit timah, east coast area. any of these actually quiet or just marketing? open to other suggestions too\n\nanyone got experience living in these areas? whats it actually like day to day?\n\nThanks!\n\nEdit - Thank you everyone for your suggestions. I really appreciate it.",
      "comments": [
        {
          "text": "Consider the Hillview MRT area, in Upper Bukit Timah. Downtown MRT Line is elite - less than 30 mins to Orchard, and takes you all the way to the airport if you want.\n\nSome of the developments are along the rail corridor which feeds into lots of green spaces. \n\nArea feels less densely built up.\n\nCondos tend to be older but units are also bigger. All have full facilities.\n\nRents are decent for what you’re getting. A 2 bedroom ~1000 square feet unit at Glendale Park which is right next to the MRT and opposite a small mall is $4k ish.",
          "score": 89
        },
        {
          "text": "Quiet is relative. Get one away from the main roads but still within walking distance (perhaps 200-300m away from the nearest MRT) if you don't have a car or are going to take public transport.\n\nThat said, your best bet will probably be   \n\\- Pasir Ris (Pasir Ris Park and Tampines Eco Green nearby)  \n\\- East Coast (East Coast Park and possibly Marina Bay area is walkable or runnable if you can go on 5km walks/runs) \\[catch is there is a premium on the rental prices here\\]  \n\\- Changi/Siglap area \\[Close to changi beach/east coast and Pulau ubin(need to take a ferry there)\\] This area is large so can stretch from very densely populated areas to very sparsely populated areas. Search well.  \n\\- Serangoon/Bidadari/Boon Keng (Bidadari Park. But population here is quite dense)  \n\\- Bukit Timah (Close to central catchment parks - Dairy Farm, Bukit Timah, Chestnut Park etc etc) - But, definitely has a premium on rental prices possibly higher than anywhere else due to closeness to nature parks and also to the CBD\n\nWould probably skip punggol sengkang area as this place is one of the most densely populated areas in Singapore.",
          "score": 19
        },
        {
          "text": "More details needed.\n\nWhat do you like to do? When you go out. You are single? \n\nHow about river valley near great world? Great connectivity and quiet",
          "score": 18
        },
        {
          "text": "Chinese garden/lakeside, there are a few condos in the area. Parc Oasis, Mayfair, Lakeview, Lake grande, Lakeshore to name a few. Near Mrt and bus services that will take you across the island and a literal 5 to 10 minutes walk to the Jurong lake gardens on one side and great hawker food on the other. Not as crowded as the east too.",
          "score": 18
        },
        {
          "text": "pasir ris would be nice. You're near the beach, plenty of malls, there's a train that takes you to the city if need be.",
          "score": 14
        },
        {
          "text": "You can look around Telok Kurau (depending which end you’re at, close to Kembangan MRT or Marine Terrace MRT). \n\nDepending which Lorong you’re on, you could be 10-15mins slow jog away from East Coast Park. :) \n\nA 2bedroom apartment is around $4.3k per month for rent. \n\n20mins to CBD and a bit more to Orchard for proximity perspective.",
          "score": 10
        },
        {
          "text": "Bukit Timah would be my top pick for your criteria. It's genuinely quiet (lots of landed property areas nearby), has great green spaces (Bukit Timah Nature Reserve, Dairy Farm), and decent MRT access on the Downtown Line. The condos there are typically more spacious and you'll easily find something nice within 5k. It's popular with expat families so very established. \\^\\^",
          "score": 6
        },
        {
          "text": "Try looking around the proximity of these MRT stations,\n\nPasir Panjang MRT - Southern Ridge Park\n\nTanjong Katong / Marine Parade MRT - East Coast Park \n\nBedok Reservoir MRT - Bedok Reservoir Park\n\nMarymount MRT - MacRitchie Park\n\nChinese Garden MRT - Jurong Lake\n\nBotanics Garden MRT\n\nPunggol MRT",
          "score": 6
        },
        {
          "text": "Bukit Timah should be relatively peaceful but I think the rental would be towards the higher side as well",
          "score": 5
        },
        {
          "text": "Skip Punggol because it is near airbase",
          "score": 4
        },
        {
          "text": "You’ll definitely not want Punggol if you’re looking for quiet. Flight routes of Air Force fighter jets from nearby Paya Lebar Air Base cuts through Punggol and Sengkang, and at a point when they are still climbing to higher altitudes, engine full blasting and all.\n\nI know because I used to live there during Covid. Windows were shaking, zoom meetings interrupted. Can’t recall how many times I had to mute my mic or ask colleagues to repeat because of the deafening roar.\n\nAnother thing to note. The air base is moving to Tengah in 2030 onwards. So might want to consider avoiding that area for the sake of your peace in the future.",
          "score": 4
        },
        {
          "text": "Siglap. ",
          "score": 3
        },
        {
          "text": "There's an upcoming condo at Springleaf. It's a quiet, low-density suburban neighbourhood surrounded by greenery, in fact the condo will be the only high-rise building there at least for the first decade or so. It's also right beside the MRT station, which goes directly to Orchard",
          "score": 3
        },
        {
          "text": "Cbd has tall apartments and is really quiet weekday evening and weekends.",
          "score": 3
        },
        {
          "text": "5 k can get a nice city fringe 2 br condo.",
          "score": 3
        },
        {
          "text": "UE Square Residences. Old condo but has the usual facilities. Next to MRT and Fort Canning Park\n\nThere are several suburban/more local nieghbourhoods suggested but if you're new to SG, I wouldn't recommend - better to ease into local living and habits least you have a severe case of culture shock.",
          "score": 3
        },
        {
          "text": "Best to to come and experience yourself to define what is quiet and what is convenient. Better visit in the day when you can hear if there are any construction sites nearby. Especially for high floors. By night and Sundays my place in Balestier is considered peaceful. But weekdays and Saturdays, omg. 3 construction sites from 7am to late. I have to switch on the air conditioner everyday with ear plugs to block the noise.",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1qx4xei",
      "subreddit": "askSingapore",
      "title": "Can I take MC if having period fatigue?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qx4xei/can_i_take_mc_if_having_period_fatigue/",
      "score": 41,
      "num_comments": 47,
      "created_at": "2026-02-06T10:09:01",
      "selftext": "Period came yesterday midnight and now I keep yawning every 15mins in the office with a sore back. \n\nGenuinely asking, can we take MC if we're feeling very tired and sluggish from period? Will the doctor accept these symptoms for MC?\n\n  \nI'm so sleepy right now HELP QAQ",
      "comments": [
        {
          "text": "Your company does not care if you died today. Your company does not care if your dog died today. Your company does not care if your fridge or air-con broke down today.",
          "score": 84
        },
        {
          "text": "Can go to à GP and just say you have a migraine. They can’t really question that.",
          "score": 55
        },
        {
          "text": "GPs will give for dysmenorrhea. \nDon’t lie and say it’s migraine. \nWaste everyone’s time. \nI hate seeing migraines. \nSo many things I have to check. \n\nDon’t lie.",
          "score": 13
        },
        {
          "text": "do teledoctor and say you have migraines or stomach ache. usually quite fast",
          "score": 10
        },
        {
          "text": "I just tell the doctor I'm having bad cramps. Usually I look so pale with cold sweat that no doctor ever questions the severity of it.",
          "score": 9
        },
        {
          "text": "Hey I took mc when the weather was stupidly hot and I couldn't sleep so yes.",
          "score": 7
        },
        {
          "text": "Yes. Take care of yourself first.",
          "score": 4
        },
        {
          "text": "I sometimes just go gp say not enough sleep",
          "score": 3
        },
        {
          "text": "Why need to say migraine. Lol\n\n\nCould have say back pain related to menses or heavy flow. GP would give MC for any period related symptoms",
          "score": 1
        },
        {
          "text": "Just tell the truth. Maybe there is a real issue like you are tired and sluggish because you are anemic, and it manifests during your period. Then you get blood test and iron supplements and actually improve your issue, instead of just getting an MC. ",
          "score": 1
        },
        {
          "text": "Can accept. Doctor will give you menstrual medicine.",
          "score": 1
        },
        {
          "text": "Just take MC lah. If it’s so bad that you can’t function and perform at work then of course you are allowed to rest!",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qwenod",
      "subreddit": "askSingapore",
      "title": "Lost Wedding band. Looking to find the owner",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qwenod/lost_wedding_band_looking_to_find_the_owner/",
      "score": 36,
      "num_comments": 34,
      "created_at": "2026-02-05T15:14:58",
      "selftext": "Hey everyone, I found a wedding band at Outram park MRT station. Trying to get it back to the owner. Let me know (you can dm this account) if you have lost a wedding band.\n\nPlease help to ask around as well :)",
      "comments": [
        {
          "text": "The first places we check when loosing something precious is the nearby store/mrt/local security, not reddit. You just need to give it to the nearest point where you found it, or hand it into the police.  \nWhen my husband lost his wedding band in the carpark it was never found. Although, we never checked reddit.",
          "score": 134
        },
        {
          "text": "most common sense is to give the item to MRT lost &amp; found or to the police station.\n\nnot everyone goes on to reddit whenever they lose something..\n\nanyone who holds onto such item personally is suspicious, OP are you trying your luck to get some \"finders fee\" in return from the owner?",
          "score": 51
        },
        {
          "text": "Give to station staff? Police? Finding the owner via reddit is a reach.",
          "score": 50
        },
        {
          "text": "you're supposed to hand it over to station staff and then announce it on social media platforms lol",
          "score": 23
        },
        {
          "text": "You should turn it over to the station master or control room for record and safekeeping. Sharing it here or social media helps but let there be a proper record for the lost &amp; found. ",
          "score": 11
        },
        {
          "text": "Read through OP’s comment history. Respectfully, OP, this is not the time to play hero la ok. Just hand it over to the police or security, case closed. Poor dude whoever it is probably losing his shit",
          "score": 7
        },
        {
          "text": "WEAR IT. \n\nYOU ARE THE WIFE TO THE HUSBAND NOW MUAHAHAHHAHHAJAAHJAAJAHAH",
          "score": 3
        },
        {
          "text": "You are so sweet for this! ❤️",
          "score": -2
        },
        {
          "text": "Okay for everyone who suggested that I hand it over to the authorities and then post it, thank you. That was a better suggestion than what I did truthfully - I will also be doing that when I pass by the station. \n\nFor those who seemed frustrated, I get your point too. But in the last few hours, at least 10 people have came forward to ask if the ring I found matches the one they lost (meaning that, reaching out on social media was indeed helpful.) \n\nThough the harshness in many comments was unnecessary to be honest… lol, like why would I want to post in multiple threads if I had other intentions of wanting to go the extra mile to return back something that I understand to hold huge sentimental value. Please do stop to think before jumping to conclusions. \n\nAnyway, have a good rest everyone! Take care and yeah continue asking around if they had lost a ring and if so call/head over to Outram",
          "score": -8
        }
      ]
    },
    {
      "id": "t3_1qwqb9v",
      "subreddit": "askSingapore",
      "title": "Is it possible to run a loop around Singapore?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qwqb9v/is_it_possible_to_run_a_loop_around_singapore/",
      "score": 10,
      "num_comments": 13,
      "created_at": "2026-02-06T00:43:26",
      "selftext": "I came across the story of two brothers who ran a 200ish km long loop around Singapore. But when I search for the same, I get estimates ranging from 110-150km. Can anybody confirm what is the total perimeter of the country which is available to the general public, and if I need any special permissions from the authorities to run around the country?",
      "comments": [
        {
          "text": "https://pcn.nparks.gov.sg/know-our-pcn/island-wide-routes/\n\nThe routes here are what the public can access.",
          "score": 5
        },
        {
          "text": "Yes done it many times, possible",
          "score": 2
        },
        {
          "text": "Yes it's around 200 with strict perimeter",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qwfeax",
      "subreddit": "SingaporeRaw",
      "title": "oh hello thr!",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qwfeax/oh_hello_thr/",
      "score": 379,
      "num_comments": 33,
      "created_at": "2026-02-05T16:00:47",
      "selftext": "",
      "comments": [
        {
          "text": "look left look right to find a side quest",
          "score": 137
        },
        {
          "text": "The contradiction is that we shit on the minister for their excessive pay then we also shit on opposition parties.",
          "score": 137
        },
        {
          "text": "because u neer vote him into a job. he take delivery job lo.",
          "score": 114
        },
        {
          "text": "dude is tryin2make an honest living also la. gif him more tips ya!👍❤️⭐🖨️💵🖨️💵🖨️💵🖨️💵🖨️💵🖨️💵",
          "score": 97
        },
        {
          "text": "At least he is not jogging from house to house giving out flyers then fiddling some titties come night time",
          "score": 89
        },
        {
          "text": "It’s just food, don’t politicize it. 😬",
          "score": 38
        },
        {
          "text": "At least he tried to speak up for Singaporeans, failed and now earning a decent living.",
          "score": 23
        },
        {
          "text": "Default job for 40s job seeker",
          "score": 15
        },
        {
          "text": "This guy do delivery\n\nMr ong wai be full time influencer\n\n2026 good start ya for hustling",
          "score": 9
        },
        {
          "text": "Leave him alone 😭",
          "score": 7
        },
        {
          "text": "Hope he run for elexrions afain\n\n\nI dont tjink he is the smartestnor most experienced but he is an average guy tryihgbti make a living like us",
          "score": 7
        },
        {
          "text": "So did you look left and look right for him to show up ?",
          "score": 5
        },
        {
          "text": "Saw him as a security guard near Raffles Place though. Moonlighting?!",
          "score": 4
        }
      ]
    },
    {
      "id": "t3_1qwtvtl",
      "subreddit": "SingaporeRaw",
      "title": "SG polticians pictured having dinner with Bill Clinton and Jeffrey Epstein",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qwtvtl/sg_polticians_pictured_having_dinner_with_bill/",
      "score": 112,
      "num_comments": 43,
      "created_at": "2026-02-06T02:50:37",
      "selftext": "Thoughts?",
      "comments": [
        {
          "text": "Recycle same answer from May 2025 pls",
          "score": 33
        },
        {
          "text": "I read the Epstein files , particularly the testimonies from victims... \nAnd the majority mentioned that lady in this picture(red top)... \nGhislaine Maxwell... She is the devil in human form.. \nEquivalently cruel to Epstein, clinton etc..\n\nIts harrowing when you realise what happened on that island... I honestly can hear the screams and sobbing of those victims when i read their testimonies...it was that gruesome..",
          "score": 22
        },
        {
          "text": "Favour trading, money grubbing and money-laundering. SID and the foreign service are not so incompetent that they didn't know what was going on. ",
          "score": 12
        },
        {
          "text": "Baller elites hanging out with each other",
          "score": 6
        },
        {
          "text": "Whiter than white",
          "score": 5
        },
        {
          "text": "Is that Tommy Koh 2nd from right ??",
          "score": 4
        },
        {
          "text": "Posted that Epstein's circle had Singapore phone numbers and friends",
          "score": 4
        },
        {
          "text": "why do they give audience to him. not everyone gets to eat with the political high office leh.",
          "score": 3
        },
        {
          "text": "Why is Bill and GCK standing ?",
          "score": 2
        },
        {
          "text": "cry more brother. u serve them",
          "score": 2
        },
        {
          "text": "Su hai jin",
          "score": 2
        },
        {
          "text": "I think Epstein found a way to get close to people in power, not just for connections but also for other privileges to protect him, but until the files related to the people mentioned or in the picture are thoroughly dug up, this will all remain a mystery to those of us reading this issue.",
          "score": 1
        },
        {
          "text": "Often after ge, so many pics coming up. Oxley house, dinner with \"stranger\", now dinner with another person, etc. So many complain yet often after ge. What the point? 5yrs later so many ppl forget again. If just before ge, don't think can get 65%.",
          "score": 1
        },
        {
          "text": "Did they went to his parties?",
          "score": 0
        },
        {
          "text": "This is just a picture",
          "score": -3
        }
      ]
    },
    {
      "id": "t3_1qwlccy",
      "subreddit": "SingaporeRaw",
      "title": "Property Poolside Team Retreat This Week",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qwlccy/property_poolside_team_retreat_this_week/",
      "score": 104,
      "num_comments": 39,
      "created_at": "2026-02-05T21:31:19",
      "selftext": "Funny this property team under George Peng went Bali for team retreat right after the recent scandal. Bad look at the moment?\n\n* Is it ok for corporate training to be held by the pool?\n* How will you feel if your partner attend work events in swimwear?\n* Do such events contribute to extra-marital affairs among real estate agents?",
      "comments": [
        {
          "text": "Here’s something better. George Peng is married to Melvin’s sister.",
          "score": 148
        },
        {
          "text": "Property agents are a bane to society",
          "score": 106
        },
        {
          "text": "Property Agent is the most useless role. If buyer like the property, they will buy it regardless of how well you market it. We seriously need to disrupt this entire industry.",
          "score": 71
        },
        {
          "text": "Look like a bunch of biggest douches ever",
          "score": 60
        },
        {
          "text": "Met George during lunch once, really came across as a prick",
          "score": 46
        },
        {
          "text": "“Director of Growth” is such a vague title, like ML finding a reason to give G money for doing nothing\n\nOr maybe she is growing his brinjal in the dark",
          "score": 38
        },
        {
          "text": "https://preview.redd.it/xcguy6ztpohg1.jpeg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=40ebfbb7952666b32a8e4b03b245f09d3dd7d119",
          "score": 29
        },
        {
          "text": "wah george peng deadass looks like radical kindness..",
          "score": 24
        },
        {
          "text": "I really hate property agents.",
          "score": 15
        },
        {
          "text": "https://preview.redd.it/2azugy7srohg1.jpeg?width=1220&amp;format=pjpg&amp;auto=webp&amp;s=cde6c8cfd045f9ae7e259e05abf138eee0916050",
          "score": 13
        },
        {
          "text": "That’s how baby bonuses are given out",
          "score": 11
        },
        {
          "text": "Which is worse. Property agent or insurance agent. Take your prick",
          "score": 9
        },
        {
          "text": "Wonder how many are banging each other.",
          "score": 8
        },
        {
          "text": "Gay ahhh meeting",
          "score": 6
        },
        {
          "text": "It's like affairs are so common among them that when the news broke they went\n\n![gif](giphy|7k2LoEykY5i1hfeWQB)",
          "score": 4
        },
        {
          "text": "Can i join? I've got a very stiff, hard and throbbing resolve to contribute to fair and save practices to ensure public wellbeing in the commercial and residential property sector. My resilience is obvious from my 6 foot stature, 8 pack abs and 8 inch member that i mean business. I have the stamina of an Olympic boxer and the sophistication of a business veteran with significant ties with well known Epstein and P. Diddy social groups.",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1qwe7v5",
      "subreddit": "SingaporeRaw",
      "title": "Ian Fang’s PR status revoked, to be deported",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qwe7v5/ian_fangs_pr_status_revoked_to_be_deported/",
      "score": 93,
      "num_comments": 43,
      "created_at": "2026-02-05T14:49:36",
      "selftext": "SINGAPORE - Former actor Ian Fang will be deported from Singapore and barred from re-entering after serving his jail sentence for sexual offences.\n\nThe 35-year-old was[ sentenced to 40 months’ jail in May 2025](https://www.straitstimes.com/singapore/courts-crime/actor-ian-fang-jailed-40-months-for-sexual-offences-against-teen-15?ref=inline-article) after pleading guilty to three counts of sexually penetrating an underage girl.\n\nFive other charges, including sexual penetration of an underage girl, harassment and obstructing the course of justice, were taken into account during sentencing.\n\nHe began serving his sentence on [June 16, 2025](https://www.straitstimes.com/singapore/courts-crime/former-actor-ian-fang-surrenders-to-court-to-begin-40-months-jail-sentence?ref=inline-article)\n\nIn response to queries from The Straits Times, a spokesman for the Immigration and Checkpoints Authority said Singapore permanent residents who have been convicted of an offence will have their permanent residence (PR) status reviewed.\n\nIt revoked Fang’s PR status on Feb 5 and said he will be deported and barred from re-entering Singapore.\n\nThere was initially a gag order on Fang’s identity when he was charged.\n\nBut he was identified in court after District Judge Eddy Tham lifted the gag order on his identity following an application by the prosecution.\n\nThe judge said that while the main focus of the gag order was to protect the victim from further harm, he would respect the wishes of the victim and her family to reveal his identity.\n\nThe victim cannot be named due to a court-imposed gag order. She was a 15-year-old student at the time of the offences.",
      "comments": [
        {
          "text": "Nice la! Send this tiong back to China!",
          "score": 49
        },
        {
          "text": "Deport the 2 time drunk driving ones also should deport and revoked PR after sentence",
          "score": 48
        },
        {
          "text": "Rebecca dodged a bullet",
          "score": 29
        },
        {
          "text": "Good riddance",
          "score": 16
        },
        {
          "text": "SWEE LA fine cane jail denature deport.\n\nMORE TO COME",
          "score": 8
        },
        {
          "text": "Faster, go buy 4D! \nSG government actually does something bad to a Foreigner !",
          "score": 5
        },
        {
          "text": "i think most reditors here will agree on \" good riddance\"",
          "score": 4
        },
        {
          "text": "![gif](giphy|YRuFixSNWFVcXaxpmX)",
          "score": 3
        },
        {
          "text": "kong wee and his gang will feel very sad sia",
          "score": 3
        },
        {
          "text": "Hooray! ",
          "score": 2
        },
        {
          "text": "deport to where?",
          "score": 2
        },
        {
          "text": "He going to Epstein island soon ",
          "score": 2
        },
        {
          "text": "$50 he will try to come back with a different Identity.",
          "score": 2
        },
        {
          "text": "OBS dodge one",
          "score": 1
        },
        {
          "text": "https://media1.tenor.com/m/Ghyib0UBrV8AAAAd/sit-song-bo.gif",
          "score": 1
        },
        {
          "text": "NIce preview of how they treat Amos.",
          "score": 1
        },
        {
          "text": "Sayonara…. 👋🏾👋🏾👋🏾",
          "score": 1
        },
        {
          "text": "![gif](giphy|lwPIo8HinGCY4EjOhF)",
          "score": 1
        },
        {
          "text": "Let him and Amos yee be cell mates lah … both their needs of touching others will be satisfied",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qwffoi",
      "subreddit": "SingaporeRaw",
      "title": "from the Epstein files",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qwffoi/from_the_epstein_files/",
      "score": 68,
      "num_comments": 36,
      "created_at": "2026-02-05T16:02:55",
      "selftext": "",
      "comments": [
        {
          "text": "\n\nWhile the people are so divided with religion, race etc, Epstein case just shows how united the elites are.\n\nSo united that they could play with justice, and let society accept those injustice. And they could get away with unethics.",
          "score": 61
        },
        {
          "text": "I feel that anytime epstein file is posted it feels that it is intentionally left without context but in bad faith.",
          "score": 53
        },
        {
          "text": "Even with this redacted release, the amount of evidence showing how wide and deeply connected he was, is still damn shocking. It’s on a global scale, within the close circle of the rich and powerful.",
          "score": 37
        },
        {
          "text": "https://preview.redd.it/tp1fohykymhg1.png?width=777&amp;format=png&amp;auto=webp&amp;s=299884256e49cdd3641df0f927c4a0426d80cd0f\n\nfull email",
          "score": 18
        },
        {
          "text": "David Stern as in the former NBA commish?",
          "score": 17
        },
        {
          "text": "It doesn't mean anything lol... Unless someone from sg visited the island everything else is crap",
          "score": 15
        },
        {
          "text": "Er... doesn't mean anything",
          "score": 6
        },
        {
          "text": "Who is PA",
          "score": 5
        },
        {
          "text": "There are still 3 million unreleased files. Lots to look forward to. DOJ and FBI absolutely have to reopen investigations into claims made in the epstein files and investigate those closely related to epstein if not ppl will start forming their own conspiracy theories.",
          "score": 4
        },
        {
          "text": "https://i.redd.it/n0dlvp1y6nhg1.gif",
          "score": 4
        },
        {
          "text": "While many Singaporeans doesn't realized that this may not be as harmful for us, it's actually quite concerning how the elites are talking behind our backs. Things may be taken out of context here and tarnished our country. Our civil service also has to be extra cautious talking about some matters outside of work.",
          "score": 3
        },
        {
          "text": "Considering all the black magic voodoo child sacrifice shit hes been doing, im not surprised we are involved in this.",
          "score": 3
        },
        {
          "text": "I am gonna email my friend before I meet him",
          "score": 3
        },
        {
          "text": "https://preview.redd.it/gofad914enhg1.jpeg?width=1219&amp;format=pjpg&amp;auto=webp&amp;s=9e5aa89cba7734f1873f4d1b2ea09d183ce82b3b",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1qwh0d0",
      "subreddit": "SingaporeRaw",
      "title": "Who is PA? Who is close enough to Epstein to get a hug?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qwh0d0/who_is_pa_who_is_close_enough_to_epstein_to_get_a/",
      "score": 65,
      "num_comments": 29,
      "created_at": "2026-02-05T17:42:07",
      "selftext": "It's almost definitely Prince Andrew. Found another email from David Stern (what's the NBA commissioner doing meeting lhl and temasek?) where he mentions PA's birthday. Timeline sort of checks out also since lhl met \\[Prince\\] Andrew in London in April 2018, before their supposed June 2018 meeting.\n\nFound on [jmail.world](http://jmail.world), which hosts all the epstein emails in a searchable format.",
      "comments": [
        {
          "text": "Prince Andrew.  I mean, there was a photo recently released of him on all fours over a girl lol",
          "score": 54
        },
        {
          "text": "# Visit Details\n\nPrince Andrew, Duke of York, was in Singapore from June 2 to 7, 2018, primarily to attend InnovFest Unbound, a key event during the Infocomm Media Development Authority's Smart Nation Innovations Week.",
          "score": 28
        },
        {
          "text": "People’s association was also founded in 1960… was in July though.",
          "score": 6
        },
        {
          "text": "People Association.",
          "score": 5
        },
        {
          "text": "Paul Atreides",
          "score": 2
        },
        {
          "text": "There were several well known David Sterns at that time, not only the NBA commissioner. People think it was one at JPM",
          "score": 1
        },
        {
          "text": "Peter Andre",
          "score": 1
        },
        {
          "text": "According to the American left, it’s Ponald Arump. That applies to every abbreviation in the 3 million documents.",
          "score": -4
        },
        {
          "text": "Confirm is PritAm. Need another COI and send him to jail this time. Cannot let these deviants try and destabilise our government. Amen.",
          "score": -23
        }
      ]
    },
    {
      "id": "t3_1qwg4x5",
      "subreddit": "SingaporeRaw",
      "title": "please dont come back",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qwg4x5/please_dont_come_back/",
      "score": 61,
      "num_comments": 27,
      "created_at": "2026-02-05T16:47:03",
      "selftext": "",
      "comments": [
        {
          "text": "How come my prev comments 90% sg view, 5% india view uh. Isnt this sg sub",
          "score": 15
        },
        {
          "text": "https://preview.redd.it/72f0n7lzanhg1.png?width=1080&amp;format=png&amp;auto=webp&amp;s=b835f685ce113ead4ff9e6975c313fd0732df18f",
          "score": 13
        },
        {
          "text": "Other countries take back their own trash, it’s only fair we take back our own trash. Fair’s fair.",
          "score": 13
        },
        {
          "text": "Lose one loser, gain one loser. Really cannot win.",
          "score": 4
        },
        {
          "text": "Really going to pity the army sergeant and officer in charge of him.",
          "score": 2
        },
        {
          "text": "All he had to do was to ride the right leaning gravy train. He would have been quite a big influencer with his own podcast by now.. all set for life. Sponsorship etc etc. He has to fuck it up by speed running his pedo arc as soon as he stepped in USA.\n\nhttps://preview.redd.it/hr50de428ohg1.jpeg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=b86aeddea139ff4a4741f494355581b32e8554d0",
          "score": 1
        },
        {
          "text": "Gib ah mo a chance la. Maybe he will be reformed after serving NS",
          "score": -1
        }
      ]
    },
    {
      "id": "t3_1qwax9i",
      "subreddit": "SingaporeRaw",
      "title": "Homeless people found at Tampines Hub",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qwax9i/homeless_people_found_at_tampines_hub/",
      "score": 63,
      "num_comments": 19,
      "created_at": "2026-02-05T12:00:45",
      "selftext": "",
      "comments": [
        {
          "text": "Some have homes but choose to sleep outside due to family conflict or issue with their housemates.. it's sad they can't have a place to call their own and have to share with others who may not jell well together.\n\nThanks for doing charity. I hope people can continue by donating to homeless charities.",
          "score": 58
        },
        {
          "text": "not homelessssss those r jusssssssss rough sleeeeeeeepersssss",
          "score": 35
        },
        {
          "text": "Tampenisian here who lives near OTH. this has been the case since at least 10yrs ago.",
          "score": 27
        },
        {
          "text": "Say what you want but this is a very kind act from this lady here. She seems like she has a heart of gold.",
          "score": 11
        },
        {
          "text": "Jurong Lake Garden on a Saturday night as well. Though they're not \"homeless\" just drunk.",
          "score": 9
        },
        {
          "text": "There's a young chap hanging around Westgate too. Dressed in tatters, carrying a large plastic bag. Smells like he hasn't showered for months. Quite surprised to see someone so young and seemingly so healthy in such a state in SG.",
          "score": 7
        },
        {
          "text": "hubs have become a place of refuge for rough sleepers😢❤️",
          "score": 5
        },
        {
          "text": "https://preview.redd.it/1s5o0uur3mhg1.jpeg?width=960&amp;format=pjpg&amp;auto=webp&amp;s=76d6d063f7bd7727adb43224bb994133469bc8c3",
          "score": 4
        },
        {
          "text": "Some elder shared rental flat with strangers sometime they fight/not in good terms. So 1 of them rather sleep at void deck.",
          "score": 3
        },
        {
          "text": "Masah allah 🙏🏻",
          "score": 2
        },
        {
          "text": "Can u pls dont shame my weekly hobby.. not ez to get peace and quiet at home",
          "score": 1
        },
        {
          "text": "Love this ❤️",
          "score": 0
        },
        {
          "text": "right under the nose of the town hub where all the govt apparatus is working at ..\n\nTime to clean up that image... hehe..\n\nSingapore has no homeless people! :D",
          "score": -2
        }
      ]
    },
    {
      "id": "t3_1qwneuc",
      "subreddit": "SingaporeRaw",
      "title": "[Live Incident] Fire at Orchard Towers",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qwneuc/live_incident_fire_at_orchard_towers/",
      "score": 50,
      "num_comments": 19,
      "created_at": "2026-02-05T22:55:55",
      "selftext": "",
      "comments": [
        {
          "text": "Insurance claims 🤑🤑🤑",
          "score": 20
        },
        {
          "text": "Thoughts and prayers.",
          "score": 5
        },
        {
          "text": "hope everyone's ok❤️",
          "score": 4
        },
        {
          "text": "STRAITS TIMES REPORT REFERENCING THIS POST AND SUBREDDIT:\n\n[https://www.straitstimes.com/singapore/fire-involving-a-car-breaks-out-at-orchard-towers](https://www.straitstimes.com/singapore/fire-involving-a-car-breaks-out-at-orchard-towers)\n\nhttps://preview.redd.it/7afuegexdrhg1.png?width=1925&amp;format=png&amp;auto=webp&amp;s=4859c5bc09e25dfa0f73cbe0460686c3d574098b\n\n",
          "score": 4
        },
        {
          "text": "Car park!",
          "score": 3
        },
        {
          "text": "SCDF Arriving to Fire: [https://www.reddit.com/r/SingaporeRaw/comments/1qwnyo3/live\\_incident\\_scdf\\_arriving\\_at\\_orchard\\_towers/?utm\\_source=share&amp;utm\\_medium=web3x&amp;utm\\_name=web3xcss&amp;utm\\_term=1&amp;utm\\_content=share\\_button](https://www.reddit.com/r/SingaporeRaw/comments/1qwnyo3/live_incident_scdf_arriving_at_orchard_towers/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button) ",
          "score": 2
        },
        {
          "text": "Is this the infamous 4 floors of whores? ",
          "score": 2
        },
        {
          "text": "Looks to be a carpark fire if one references the Google Maps street view.\n\nFair guess looking at the size of it that it's an EV fire (?). \n\nhttps://preview.redd.it/boenh25axohg1.png?width=1750&amp;format=png&amp;auto=webp&amp;s=5a1235c5c7a9e823654edc1c6cf7e15b7d6b3d37",
          "score": 1
        },
        {
          "text": "Wonder how that church would spin this",
          "score": 1
        },
        {
          "text": "LET IT RIPPPPP!! 🎉🎉🎉🎉",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qwo8qi",
      "subreddit": "SingaporeRaw",
      "title": "Didn't something similar happen last year? 小红书 XiaoHongShu users slam NTU use of 'Lunar New Year'",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qwo8qi/didnt_something_similar_happen_last_year_小红书/",
      "score": 19,
      "num_comments": 42,
      "created_at": "2026-02-05T23:27:33",
      "selftext": "https://www.stomp.sg/trending-now/should-it-be-chinese-new-year-ntu-slammed-over-lunar-new-year-email-invite?ref=home-editors-picks",
      "comments": [
        {
          "text": "just tell them to fk off. they don't own the usage of words. do they want to claim chinatown too? or we have to rename it as smth else?",
          "score": 62
        },
        {
          "text": "Good that NTU stood firm on it. Cannot just use Lunar to make it more inclusive meh. Holiday also must claim who first.",
          "score": 29
        },
        {
          "text": "They don’t call it Chinese New Year in Chinese either, they call it the Spring Festival 春节. At most it’s the farmer calendar’s new year 农历新年. Until they start calling it 华人新年 I’m sure we can call it whatever the hell we want and don’t need to limit it to Chinese new year only.",
          "score": 19
        },
        {
          "text": "In Singapore, we celebrate Chinese New Year.\n\nhttps://preview.redd.it/a8fw7u7grphg1.jpeg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=e2d1edf6a336d966cee6774dac0ed7d63b1dddca\n\nSource: MOM",
          "score": 11
        },
        {
          "text": "Wishing all HAPPY LUNAR NEW YEAR in about 2 weeks time 🎉🎉🎉",
          "score": 6
        },
        {
          "text": "&gt;In the Xiaohongshu post titled \"Lunar New Year, NTU, are you serious?\", the user criticised the choice of terminology.\n\n&gt;The user also remarked that netizens were \"pretending to be relaxed and indifferent\" while commenting on the issue.\n\n&gt;A similar Xiaohongshu post, which was circulated on Reddit, also criticised the NTU email invitation to the \"Lunar New Year party\".\n\n&gt;Netizens commenting on the original Xiaohongshu post expressed indignation over what they felt was a misuse of the term. \n\n&gt;Commenters on Reddit agreed that the two terms were often used interchangeably, with some describing those upset by the wording as \"fragile\" and \"sensitive\".",
          "score": 4
        },
        {
          "text": "Its should be called chinese new year in english because it was the chinese who created the calender and many countries celebrate their new year on the same day because they were culturally influence by the chinese civilisation. \n\n\nTechnically lunar is wrong, it should be lunisolar.",
          "score": 4
        },
        {
          "text": "The irony is during Cultural Revolution, everything tied to Chinese history is burn die blah blah blah.\n\nNow  the morons is \"OMG CHINESE IS CHAIIINERR! How can dis be allowed!\" \n\nhahahahahahaha",
          "score": 2
        },
        {
          "text": "honestly speaking, lunar new year is the wrong term for this festival, be it Tet or Seollal , the festival itself is based off the chinese calendar, which is lunisolar(moon and the sun) and if it's it's the lunar new year as they say then it would be following the Islamic calendar(based off the moon) instead so 1st day of the year would be on the jun 16th of this year. A more fitting name that would be more neutral would be the spring festival actually.",
          "score": 1
        },
        {
          "text": "Nobody died in the process, just move on",
          "score": 1
        },
        {
          "text": "90% of Singaporeans be like\n\n![gif](giphy|129OnZ9Qn2i0Ew)\n\nWhether is CNY or LNY, everyone knows what it is.",
          "score": 1
        },
        {
          "text": "Huh? All along it was CNY, but donno last decade.. somehow it changed to LNY (i thought it was to integrate the china chinese here). So now? The china chinese is saying it's wrong? LOL.\n\nSOmeone ought to be fired.",
          "score": -10
        }
      ]
    },
    {
      "id": "t3_1qx0cxz",
      "subreddit": "singaporefi",
      "title": "The game of finances",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qx0cxz/the_game_of_finances/",
      "score": 55,
      "num_comments": 35,
      "created_at": "2026-02-06T06:50:14",
      "selftext": "I’d like to share a tip to those struggling with finances like me. You gotta zoom in to daily cash flows instead of looking at your month end balance. \n\n  \n\nI’ve started treating finances like a game where I play daily.\n\n  \n\nYou’re gonna want to buy that artisanal coffee for $7. But once you defeat that temptation, that “in-game monster” is gonna drop $7 for you to collect.\n\n  \n\nOnly managing your finances at the end of the month when bills are due is gonna be hard if you don’t have stop gaps every 30 days of the month.\n\n  \n\nSo go forth and defeat your daily temptations: reserve 1 day a week to treat yourself to a casual meal. Negotiate downwards how many drinks you’re gonna have at a social event. \n\n  \n\nFinances is as much internal as it is tangible.\n\n  \n\nFrom somebody who lives paycheck to paycheck, I managed this month with money leftover on payday so I see this game as a success even though I’m only level 3.\n\n  \n\nAnother pro tip: those with high credit card balances - and find yourself with little to no cash after payday. Convert your balance to installments and stop using CC. Use cash and you can eat $5 cai png instead of having to charge food to your credit to survive. It’s cheaper in the long run and prevents snowball. ",
      "comments": [
        {
          "text": "This guy obviously is not a gamer. You grind like that , you won't level up that way. You will lagged behind pro gamers.  \nWhat you are doing is call Min-Maxing. -&gt; Grinding low value items for money and then hope to buy that mid-tier sword (but by then, everyone else is already on high-tier sword and you are just lagging badly and the mid-teir is the new low-tier).  And you wonder why you can't catch up with inflation and cost of living.\n\n  \nWhat you should be doing is focus on Scaling -&gt; XP multipliers and Skill Trees (ie, build skills to maximize income) which will allow you to defeat monsters to get high value items easily which will create multiple streams of income.",
          "score": 86
        },
        {
          "text": "Bro needs dopamine hit again",
          "score": 24
        },
        {
          "text": "How about this contrarian point.\n\nIf you buy Starbucks $7 3 times a week for 1 month. Thats $84 spent / saved.\n\nId argue that if youre living paycheck to paycheck and needs this extra $84 to tide you over, youre probably doing something wrong.\n\nId say that most people who struggle with money often blow past their budget in 1 - 2 big spends a month. Be it gacha, shopping or big meals at restaurants.\n\nOf course there might be people who might benefit from your \"game\" but i feel there'll be more people who require monthly tracking as it'd be easier to see and spot these extra spending than \"1 offs\" per month...\n\nSo its easier to cut back on these big spends than trying to optimize the small things. Basically this [meme](https://static.wikia.nocookie.net/dril9047/images/2/23/DrilCandles.jpeg/revision/latest?cb=20170623190510)",
          "score": 22
        },
        {
          "text": "Protip: earn more",
          "score": 11
        },
        {
          "text": "Don't quite agree. It's the big expenditures that get you, not the $7 artisianial coffee here and there, unless you have severe daily lifestyle inflation (like eat at $20-30 restaurants, drink $10+ attas drinks, and grab/taxi around everyday). Additionally, not everyone can tah han $4-5 cai peng every single day without losing their minds/being miserable from the monotony. \n\nIt's better to be more flexible with daily spending on food and drinks (within reason), and cut big things like gacha spending, furniture, branded clothes and shoes, etc.",
          "score": 4
        },
        {
          "text": "You make a good point, OP. Friction maxxing does help save a lot of money. \n\nBut I think your constant posting is why no one can take you in good faith. You post about not being able to save or be frugal enough then you find some new hack to survive on x dollars a day or the fact that you saved 19 dollars by only buying 5 dollars worth of Toto instead of 24 so you post about that. \n\nI get it. We're all humans and we're learning every day but we know too much about you. \n\nFor your particular situation, I'd say you should automate your finances based on priorities. Your emergency fund isn't built up, your savings bucket for your BTO renovation isn't ready, you probably don't have an investment pool for your kid yet - these are things that should already take precedence over your 7 dollar coffee. Once all these buckets have been automated and paid out on pay day, then you can see how to survive on the rest of the money. \n\nI really hope we get to hear a win story from you instead of advice that is coming from someone at level 3.",
          "score": 3
        },
        {
          "text": "First off I appreciate the spirit and I agree with you that for a goal towards FIRE lifestyle, cashflow is king, so you have to run your life almost like a business in the sense that you ought to track what you have (assets), what you need to pay out (liabilities) and what you make (revenue). Then you figure out if you need to amortise or generate revenue from your assets. Finally, you arrive at a well-categorised list of things in your balance sheet and using that you can project into the future.\n\nThat said, once you do that, you'll easily realise with your eyes that scrimping will not be the way to reach FIRE. Once you have tabulated everything, you quickly see that saving $7 on a iced latte every now and then or 'splurging' on a grab trip or delivery, pales in comparison to large ticket items such as a car loan or mortgage payments, trips to Europe, buying a new iPhone every year, etc; choosing to eat cai png over an Astons or 2 barely make a dent towards optimising cashflow.\n\nInstead, the top 2 things, and really quite obvious, are to increase cashflow in and decrease big ticket items out.\n\nTurning this back to gamer analog, grinding a mob 100x that +1 to stats each time is less effective than getting a drop that has a multiplier affix.",
          "score": 3
        },
        {
          "text": "What’s ur salary?",
          "score": 2
        },
        {
          "text": "Jiayou OP, don't let negative comments get you down! Saving is wise :)",
          "score": 2
        },
        {
          "text": "Can be taught but cannot be learned by alot of people. Same reason why alot of people are not able to lose weight despite knowing to eat less",
          "score": 1
        },
        {
          "text": "Thanks for sharing",
          "score": 1
        },
        {
          "text": "When I think of buying a gadget, mirrorless lens, audio stuff, car mod etc, I immediately buy ETFs of the same value. Then I forget about the item.\n\nAs for meals, coffee etc, just enjoy life. Why be miserable when it comes to the little things?",
          "score": 1
        },
        {
          "text": "Life is like a game. Spend money to upgrade your own gear and skills and fight bigger bosses (solve problems). I seldom play actual electronic games now though.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qwi3l6",
      "subreddit": "singaporefi",
      "title": "Billionaire doctor in boardroom key to OCBC’s new CEO Tan Teck Long ambition",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qwi3l6/billionaire_doctor_in_boardroom_key_to_ocbcs_new/",
      "score": 31,
      "num_comments": 25,
      "created_at": "2026-02-05T18:47:33",
      "selftext": "This is a very interesting read on family owned OCBC vs DBS and its internal politics ",
      "comments": [
        {
          "text": "USD1 billion dividends is impressive",
          "score": 13
        },
        {
          "text": "Risky moves by the bank could jeopardise that wealth. In recent years, several planned investments were derailed after the family balked at ponying up, according to the people. These include a S$2 billion (US$1.57 billion) renovation of the bank’s 50-year-old headquarters, and a sweetened bid to take its Great Eastern Holdings Ltd insurance business private. Despite pitches from bank executives, the potential returns in each case weren’t seen to justify the costs, said the people.\n\n\\--&gt; If I am the shareholder, I would have fired that CEO who wants me to renovate a building for $2billion!  That one is call Investment?",
          "score": 13
        },
        {
          "text": "I loled when the article seem to attribute recent earnings growth to Wong, without mentioning the interest rate backdrop.",
          "score": 12
        }
      ]
    },
    {
      "id": "t3_1qx2v3g",
      "subreddit": "singaporefi",
      "title": "QQQ dropped ~10% in Aug-Oct 2023 for reasons that feel similar to today",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qx2v3g/qqq_dropped_10_in_augoct_2023_for_reasons_that/",
      "score": 17,
      "num_comments": 27,
      "created_at": "2026-02-06T08:36:08",
      "selftext": "Lately the setup feels a lot like Aug - Oct 2023, when QQQ/Nasdaq pulled back \\~ 10% without anything actually \"breaking.\"\n\nBack then it wasn't one big headline that caused the drop. It was more a slow grind..\n\n\\- Rates stayed higher for longer than people wanted (now: Warsh).\n\n\\- Economic data kept coming in strong, so rate cuts kept getting pushed out.\n\n\\- Overt geopolitical tensions and uncertainty.\n\n\\- Nasdaq had already ripped, Al hype was hot, and the market needed to cool off.\n\nFast forward to now and a lot of that feels familiar.\n\nWDYT?",
      "comments": [
        {
          "text": "I wait for electronictear to come and throw FUDs then I buy the dip.",
          "score": 15
        },
        {
          "text": "Spending outpace revenue. Investors are not seeing corresponding revenue increase compared to AI spending. \n\nBigTech is trying to out-build each other. This is similar when BigTech are trying to out-hire SWE during COVID and then have to let them go now. \n\nSome things are showing cracks. Valuations are sky high compared to revenue, that’s what I feel.",
          "score": 9
        },
        {
          "text": "Im waiting for the suicide hotline to be posted",
          "score": 4
        },
        {
          "text": "Its as if the [median intra-year drawdown is ~10%](https://www.reddit.com/r/singaporefi/s/axLvq9gAhF) .",
          "score": 2
        },
        {
          "text": "side track, local banks more resilient than gold silver and global stocks. DBS hit 70 bucks plz!!! HAHAHHA",
          "score": 2
        },
        {
          "text": "It is not the bottom yet until ET post",
          "score": 2
        },
        {
          "text": "Big tech capex spending means less share buybacks",
          "score": 1
        },
        {
          "text": "Tonight is the even worse. Scoop bit by bit if there’s a leftover $.. \np.s.: not financial advice. DYOD",
          "score": 1
        },
        {
          "text": "Investors are starting to realize AI is not a magic bullet",
          "score": 1
        },
        {
          "text": "Imagin shorting altcoins wahh , some just on no point of return dud like even lower than 2018 level lol.\n\nWhatever return on btc has been returned back and even lower thn before the orange man was president",
          "score": 1
        },
        {
          "text": "at the index level, its still fine because of rotation.\n\nI will just say this as most of you hate bad data - S&amp;P 500 is at Cape 40.  This quarter is bad because narrative is \"why spend so much?\".\n\nNext quarter, the narrative might become \"no profit, scaling down\".\n\nRotation will not save the index anymore and there might be a true mean reversion.  If uncontrolled, it will snowball.",
          "score": 1
        },
        {
          "text": "When China produces AI and chips at a fraction of Western prices it will thereafter become a commodity - ie prices will be a race to the bottom. Inflation will rise, causing interest rates to do likewise, which willtrigger a run from tech stocks because investors will realise no money is to be made from it. A crash will ensue. It’s just a question of when. \n\nNever bet against the US, sure. But never bet against China either.",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qwc9ax",
      "subreddit": "singaporefi",
      "title": "Anyone using TrustBank to buy stocks?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qwc9ax/anyone_using_trustbank_to_buy_stocks/",
      "score": 13,
      "num_comments": 19,
      "created_at": "2026-02-05T13:05:07",
      "selftext": "Now 0 commission, wondering want to get some on the app not or just use the usual IBKR",
      "comments": [
        {
          "text": "For most people, currency exchange spread will matter more than commission. I can't find how is Trust's exchange rate for the brokerage part. \n\nAlso, later on minimum commission will be US$2.99, which is terrible. ",
          "score": 14
        },
        {
          "text": "Side note, it’s actually a really good initiative. Some people have the weird habit of consolidating accounts and Trust allows you to save, transact and invest on 1 platform.\n  \nI’m rather convinced but my salary crediting is with a local bank because of employment requirements\n  \nEdit: this is the reason why I think SOFI ticker will do well in the long run..",
          "score": 7
        },
        {
          "text": "Seamless user experience all in one app, use Trust. \n\nFX spread concerns or low comm or larger market access , use IBKR.",
          "score": 4
        },
        {
          "text": "I actually got $50 Tesla stock after first trade. It’s the most simple trading App I have ever used.. I can’t go back to IBKR and others now. Good initiative!",
          "score": 3
        },
        {
          "text": "I bought some last month with the app. It's user friendly",
          "score": 1
        },
        {
          "text": "Trust bank speciality is everyday banking. For buying stock just use a platform broker that specialises in it",
          "score": 1
        },
        {
          "text": "I bought some in Dec , it’s easy to use and nice to consolidate everything in one app.",
          "score": 1
        },
        {
          "text": "a bank that has \"trust\" in their name? no thanks",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qwtayx",
      "subreddit": "singaporefi",
      "title": "Advices for hfe application",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qwtayx/advices_for_hfe_application/",
      "score": 7,
      "num_comments": 10,
      "created_at": "2026-02-06T02:30:05",
      "selftext": "Hi all,\n\nWould like to seek some advice before applying for HFE.\n\nThe situation is I am earning around average gross 5-5.5k per month excluding bonuses and my partner is currently a full time student.\n\nFirst,I have read on hdb website that bonuses and aws is excluded in the income assessment guidelines. And since both bonus and aws are cpf deductible, hence if  I submit cpf contribution history for past 15 months. How would hdb be able to separate those two from the contributions? Also,would it be better to submit income letter from the company?\n\nSecondly, currently i have a car loan finance by bank, loan balance is 1 year. I plan to do full settlement so that tdsr ratio drops to zero hence i can get a higher loan. Would be it a good option to do so?\n\nLastly, since currently my partner is a full time student and graduate by next year march,Would be it be advisable to get DIA? Assuming if we get DIA, by then my partner would be working, definitely combined income higher but that means EHG lower.\n\nLooking forward to helpful advices! Thanks!",
      "comments": [
        {
          "text": "Are you getting a HDB? HDB doesn’t consider TDSR, only MSR. \n  \nHFE application has the field to add bonus - unsure if it’s considered.\n  \nThe question of DIA is - do you need their income to meet 75% LTV? Else, do you have enough CPF/cash to meet the downpayment?",
          "score": 6
        },
        {
          "text": "Just applied HFE few months ago so i can confirm, they do require you to submit payslips. \n\nCan't answer your 2nd qn. \n\n3rd qn - ya DIA is better to ensure sufficient loan amount. Don't depend on EHG. Unless you are very sure the loan amt based on your single income is enough. So depends on the house price also",
          "score": 5
        },
        {
          "text": "Hi there I am a property agent I am just going to make the assumption that you are going for BTO and are a SC.\n\nCurrently based on your stated income you are eligible for EHG the specific amount will be included in your HFE, a note on this the disbursement will be credited to your CPF and this in turn means you will have to pay accrued interest overtime.\n\ntrust me when I say HDB and CPF are able to with a high level of accuracy churn out your income before bonus and AWS. If that are not able to do so they will highlight to you to provide a payslip instead. In any case I would recommend you to use the affordability calculator by HDB to get a rough estimation. \n\nAre you and your partner planning to take hdb loan or bank loan? If your partner is studying I am gonna make another offhand assumption that you and your partner are relatively young, I would highly recommend going for a HDB loan. HDB Loan is MSR calculation so your current liabilities does not affect the loan, only the monthly income is tabulated. Bank loan will take into account TDSR AND MSR and bank’s will typically give the lower of the 2 quantum for your loan. \n\nThe ceiling for EHG eligibility is 9k, whether to DIA or not in my opinion is to roughly project how much your partner is going to earn in the industry and position. There’s way too many variables to advise this on.",
          "score": 3
        },
        {
          "text": "For the first question, the CPF contributions history shows it monthly. So if they see most months is $X but December and April are higher, they know those are the bonus months. They can just look at the non-outlier months. \n\nIs your car loan so high that 55% TDSR is more of a limiting factor than 30% MSR? Like your car loan payment is more than 25% of your gross monthly pay? If not, 30% MSR is the limiting factor and paying off the car loan doesn’t help. \n\nDIA or not is a complicated calculation that depends on the flat price as well as whether you can afford to buy the flat with the lower loan.",
          "score": 2
        },
        {
          "text": "upvote bc im curious",
          "score": 1
        },
        {
          "text": "DIA depends on whether you are getting a $400/$500k or $800k house? Because maybe the loan and EHG currently can still cover non mature estate houses…",
          "score": 1
        },
        {
          "text": "HFE does consider your bonus so that has to be included\n\nWhat is included or not will be shown to you during HFE application so don’t worry too much, CPF contribution history is cross-referenced as well.\n\nPlease take HDB loan if you qualify as well, bank loan options can come in later if you want to consider",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qwln1u",
      "subreddit": "singaporefi",
      "title": "OCBC premier banking",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qwln1u/ocbc_premier_banking/",
      "score": 4,
      "num_comments": 16,
      "created_at": "2026-02-05T21:43:50",
      "selftext": "I was contacted by this relationship manager today. She told me that she wants to recommend me premier banking but the savings in my OCBC 360 is very far off from the 350k requirement. What maybe her motives?",
      "comments": [
        {
          "text": "Obviously to sell you products. You think she just want to give you premier ang pow and help you to change notes?",
          "score": 28
        },
        {
          "text": "She thinks you handsome and wants to know you better",
          "score": 23
        },
        {
          "text": "No reason to keep more than 100k in ocbc360 as it earns minimal interest",
          "score": 11
        },
        {
          "text": "She cannot hit sales quota with existing premier clients. Once become premier, OCBC RM will often contact you to sell investment and insurance from bank.",
          "score": 9
        },
        {
          "text": "probably tasked by the bank's instruction to cold call clients to recommend upgrade premier and eventually meet you up and upsell you financial products. why she would call you if your acct dont meet the requirement is the real question. maybe she notice your monthly income into 360 acct very high. you should ask her back.",
          "score": 6
        },
        {
          "text": "Although it's generally not really worth the hassle, at least they leave you alone after that. And you don't lose the \"status\" even if your balance falls way below 350k. \n\nThe very slight benefits: \n\n* A free credit card with 2 Dragonpass lounge access per year\n\n* A Mastercard World Elite debit card which offers a number of privileges (check Milelion articles on it). World Elite is still not super common, so this is nice\n\n* Kopi",
          "score": 3
        },
        {
          "text": "They’re just trying their luck. They kept calling me despite having only 4 dollars in my savings account.",
          "score": 2
        },
        {
          "text": "They probably will intro u to ILP. Giving 7-8% interest bla bla bla….just want u to sign",
          "score": 2
        },
        {
          "text": "Maybe $350k includes those in SRS",
          "score": 1
        },
        {
          "text": "You're simply the next cash cow in line",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qwejwm",
      "subreddit": "singaporefi",
      "title": "10 years in PruFlexiCash 7th Series(ILP) - Will you surrender or keep?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qwejwm/10_years_in_pruflexicash_7th_seriesilp_will_you/",
      "score": 4,
      "num_comments": 13,
      "created_at": "2026-02-05T15:08:45",
      "selftext": "I’m a 35M and signed this plan back in 2015(for 25 years) when I had just landed my first stable job. At the time, I rushed into getting coverage without fully understanding the product. Fast forward to today — I’m trying to be more intentional with my finances. \n\nI’ve contacted Prudential and was informed that I would receive around **$12k+** from the surrender value plus accumulated cashback.\n\nIf I proceed with surrendering, my current plan is to reinvest the funds into:\n\n* SG stocks, **or** topping up my **VWRA**, **or** possibly entering another ETF\n\nAdditionally, I reached out to a third-party buyer (T\\*\\* C\\*\\*\\*\\*\\*\\*), who mentioned they could offer **5–25% more** than Prudential for the policy.\n\nI’d really appreciate your thoughts on:\n\n* Whether surrendering makes sense now\n* Using a third-party buyer vs surrendering directly\n* How you’d deploy the $12k+ if you were in my position\n\nhttps://preview.redd.it/in90uw32lmhg1.jpg?width=1152&amp;format=pjpg&amp;auto=webp&amp;s=7854832942b6d711cfe45e40944693d674a51f56\n\n  \n",
      "comments": [
        {
          "text": "This is actually an endowment plan. You can take it as a force saving. Since you already saved for 10 years. The breakeven point usually ard year 15 onwards. Less off the protection elements.",
          "score": 16
        },
        {
          "text": "Funny part is that it isn’t even an ILP",
          "score": 7
        },
        {
          "text": "You'll have to run the numbers yourself because it's not a simple calculation. But if you can get 100% surrender value in 5 years and only 50% now, it may not be worth it to surrender now because it will be hard to beat the surrender penalty in a instrument with similar risk profile.",
          "score": 5
        },
        {
          "text": "Hi, I have the 6th series one and the guaranteed portion in BI is much lesser than the original premuum paid. Is that the same for your 7th series?\n\nP.s my agent tried to sell me another endowment (pruactive saver 2) plan 6 years ago when I was 10 years in the pruflexicash 6th series by saying I could use the premiums paid for pruflexicash to pay for the other endowment but I was very sceptical due to the agent's past mis-sells to me.",
          "score": 2
        },
        {
          "text": "Can use the revised BI to calculate. What is the projected value at maturity?\nThen work out how much return you’d need to come out ahead if you were to cash out and invest on your own. \n\nI’ve done similar calculations on my policies, and ended up cancelling the ILPs but keeping the endowments.",
          "score": 1
        },
        {
          "text": "Think of it as forced savings and that’s it",
          "score": 1
        },
        {
          "text": "Unpopular opinion but treat it as a lost cause continue paying but draw out max allowable per year and take the remainder as your bond component if the monthly premium is not high",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qwqihy",
      "subreddit": "singaporefi",
      "title": "SBF application Feb 2026",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qwqihy/sbf_application_feb_2026/",
      "score": 1,
      "num_comments": 5,
      "created_at": "2026-02-06T00:50:31",
      "selftext": "What is everyone interested in for the upcoming SBF round? What are the chances of getting non-prime units for the Kallang/ Whampoa area?",
      "comments": [
        {
          "text": "I’m also eyeing the non-prime units in Kallang/whampoa. Specifically McNair Height and Rajah Residences. 5 year MOP in these areas are a steal these days lol.",
          "score": 2
        },
        {
          "text": "Why this time round got so many sbf?",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qwc3ug",
      "subreddit": "singaporefi",
      "title": "FSMOne RSP fees",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qwc3ug/fsmone_rsp_fees/",
      "score": 1,
      "num_comments": 5,
      "created_at": "2026-02-05T12:57:56",
      "selftext": "Hi all, \n\nI seem to get charged on FSMone when I buy via RSP for SGX ETF. No response at all from their client service team so seeking help here. \n\nIt seems that POEMS has better customer support as they are normally prompt in their reply, or in any case within 24h. Unsure what is the standard reply time for FSMone. ",
      "comments": [
        {
          "text": "The ad is always \"enjoy 0%\\* processing fee\" with an \\*\n\n[https://secure.fundsupermart.com/fsmone/article/rcms286460/invest-smartly-and-regularly-into-etfs-with-fsmones-etf-rsp](https://secure.fundsupermart.com/fsmone/article/rcms286460/invest-smartly-and-regularly-into-etfs-with-fsmones-etf-rsp)\n\nThe \\* says \n\n\\*excludes exchange-related fees and prevailing GST charges apply\n\nSGX exchange fees are not negligible. The main one is 0.0325% clearing fee, but there are some smaller ones also. \n\nHow much did you get charged for what amount purchased?",
          "score": 3
        },
        {
          "text": "there’s only one time I needed FSMone support and I called them. They picked up and answered my questions. Can call so it’s faster",
          "score": 1
        },
        {
          "text": "Call in, just call in since its a local company. You paid for it already, utilize the phone support",
          "score": 1
        },
        {
          "text": "I been using fsmone rsp since April 2025 till now. I look at the statement and there is no fee charge. Maybe you can call them to check.",
          "score": 1
        },
        {
          "text": "It’s probably the exchange related fees which SGX charges. Nobody is exempt from those.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qx4kkv",
      "subreddit": "singaporefi",
      "title": "Manulife Investready 3 plan",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qx4kkv/manulife_investready_3_plan/",
      "score": 0,
      "num_comments": 13,
      "created_at": "2026-02-06T09:53:01",
      "selftext": "hii all, new to investment here\n\nso recently was called by DBS wealth planning person on saving more money. got introd into signing up for the multipler account which alr have the 1.8% then was further taught on how to make it 2.1% after purchasing insurance.\n\ntried apply for insurance but due to I have health conditions hence underwriting was rejected, so wealth planning person say how about try this investment plan of 10 years of paying $300 monthly to help me since I can't get any health insurances and cash out if in the event I need the money \n\nso now, on my first year on this plan and reading up on other people stories so idk have I dig my own hole or got myself scammed",
      "comments": [
        {
          "text": "Yes congrats you got scammed 👍 (not kidding btw)",
          "score": 5
        },
        {
          "text": "This is a trick preying on your \"uninsurability\".\n\nFor this particular plan, the insurance coverage is very low. You're simply getting your money back without surrender fee.\n\n[https://www.comparefirst.sg/wap/prodSummaryPdf/198002116D/WA\\_MIR03\\_PdtSum.pdf](https://www.comparefirst.sg/wap/prodSummaryPdf/198002116D/WA_MIR03_PdtSum.pdf)\n\n&gt;If the life insured dies during the policy term, we will pay the higher of:\n\n&gt;(a) 101% of (total basic premium paid plus any top-up premium less any withdrawal made); or\n\n&gt;(b) account value,\n\n&gt;less any amount owing to us\n\nYou can't cash out to pay hospital fees. You only cash out if you die or get diagnosed with a terminal illness. And the amount you get is lesser than if you invested the money yourself in a brokerage or unit trust platform.\n\nFor health insurance, you might be stuck with basic Medishield and should go to public hospital ward B2/C for everything. But you won't go bankrupt from medical fees if you do this and are a Singapore citizen. While you're working, you can also lean on work-provided group health insurance where they probably won't exclude you.\n\nIf you haven't paid up yet, or it's within the free look period, please cancel Manulife immediately. Within first year, also surrender.",
          "score": 2
        },
        {
          "text": "I wont say scam...\n\nIf you die die dont want to learn how to invest yourself (EDIT) **AND** be 100% sure you will never want to learn it in the next 10-20 years as well for ILP to be okay.\n\nBut since you're already here and doing a VERY BRIEF search on this plan, its likely worth to give up on this plan and do yourself, even if you've already paid the first year premium + surrender value being 0.\n\nTo get started, can read the pinned post **THEN** \n\nhttps://www.reddit.com/r/singaporefi/s/Kb8NEI78oj\n\nThe tricky thing here is the underlying health conditions. Is it possible for you to get term life insurance from other provider?",
          "score": 2
        },
        {
          "text": "So you committed $36,000 over 10 years for a 0.3% additional interest for 1 year.\n\n\nYou behaved exactly like one of my prospect. Even after I explained the absurdity of how lopsided the deal was.\n\n\nAnd it was when interest rates were higher, he got 1% more on his multiplier as well!.\n\n\nHis thinking, hey I am getting 1% more on my $100k deposit! Total interest around 7%/$7000!\n\n\nI explained to him, the total CHARGES from his investment policy already more than all the additional interest he can get from the ONE year of additional interest. \n\n\nIt was some more within the free-look period, but last 2 days. I told him, let's call dbs NOW and free look the policy. He still say want to reconsider, I shoot him, reconsider what? The additional interest or paying 10 years of premium? Funny fella. But not my money not my client not my problem. \n\n\nI called him on the last day of the free look period to remind him, he hang up my calls and dodge my messages reminding him to freelook.\n\n\nGuess who spam call me 2 weeks later asking me to freelook the policy.\n\n\nTurns out he was waiting for the dividend payout from the policy, dividend advantage fund, around 1% yield.\n\n\nI told him it's after the free-look period le mr prospect, I cant help you. Technically I can, but the way he dodged my calls and messages pissed me off. If he just upfront about being greedy for the dividend payout and wanted to test the system, I could also be upfront about what will possibly happen and potential steps we can take if he still willing to do business with me. \n\n\nReally 贪小便宜.",
          "score": 2
        },
        {
          "text": "cancel now bro.\n&gt; cash out if in the event I need the money\n\nyou might aswell keep it in the bank and earn 1-2% than suddenly need to withdraw with a penalty % \nplus its an ilp, its invested in something. your principal gonna go up or down, need to withdraw during a down phase leh? surrender also got fee.\n\nyou wanna invest and earn a yield? keep emergency funds separate, rest can invest in vwra or bond funds if you want something safer",
          "score": 1
        }
      ]
    }
  ]
}