{
  "schema_version": "raw_scrape_v1",
  "report_id": "2026-02-04",
  "scraped_at": "2026-02-04T03:34:54.156186",
  "subreddits": [
    "singapore",
    "askSingapore",
    "SingaporeRaw",
    "singaporefi"
  ],
  "total_posts": 40,
  "total_comments": 808,
  "posts": [
    {
      "id": "t3_1qulqle",
      "subreddit": "singapore",
      "title": "This isn't from Woodlands, it's a photo taken from inside a Cambodian scam compound",
      "url": "https://old.reddit.com/r/singapore/comments/1qulqle/this_isnt_from_woodlands_its_a_photo_taken_from/",
      "score": 2425,
      "num_comments": 153,
      "created_at": "2026-02-03T07:37:20",
      "selftext": "More photos hereand anews article here",
      "comments": [
        {
          "text": "I thought they just use background filter. The way they actually spent some budget making an actual glossy background 😭",
          "score": 800
        },
        {
          "text": "Hello Polis?",
          "score": 566
        },
        {
          "text": "你好",
          "score": 222
        },
        {
          "text": "Background filter is really obvious when someone moves around at all.",
          "score": 207
        },
        {
          "text": "这是新加坡警察局",
          "score": 188
        },
        {
          "text": "I also got video call from someone from ‘Ministry of Law’ full background with Acrylic signboard in their conference room. Half tempted to print a CID background to use to reply these calls. “Really ah? I’m under investigation? Come my office level 4 to see me in person”",
          "score": 150
        },
        {
          "text": "This costs just a fraction of what they can get from a good victim. KH Scam centers are estimated to have revenue about half of Cambodian foemal GDP",
          "score": 54
        },
        {
          "text": "Money spent on a glossy backdrop instead of just using a filter. Priorities are wild.",
          "score": 50
        },
        {
          "text": "Yall are picking up video calls from unknown numbers?",
          "score": 43
        },
        {
          "text": "i used to entertain them for fun but i stopped when i heard they could be using your voice (and probably likeness, if you take it to video call) to train AI.",
          "score": 31
        },
        {
          "text": "My parents would tell any kidnappers to keep me. AI or not they are in no danger from such scams",
          "score": 31
        },
        {
          "text": "Not really video calls, but normal calls that get transferred into video calls if you really wanna waste people time haha",
          "score": 28
        },
        {
          "text": "They are rich from scamming. Look at Chen Zhi of prince group who was recently caught, dude was worth $60billion USD.",
          "score": 24
        },
        {
          "text": "Never keep up with the times.",
          "score": 22
        },
        {
          "text": "Haha my friend in ICA legit got called by them before. He just cite this law and that law and ask them which one he break lol.",
          "score": 18
        },
        {
          "text": "Other people receive phone calls from scammers. Your parents call up the scammers instead.",
          "score": 14
        },
        {
          "text": "if I can waste their time, all the better some of them are stupid enough to believe my name is Joseph Stalin or Ben Gurion",
          "score": 11
        },
        {
          "text": "I used to do this when I was in UAE and guys called me saying they were from the Central Bank; I was like \"eh which floor are you on, I'll come down talk to you.\"",
          "score": 9
        },
        {
          "text": "I always try to use a different accent to throw them off before proceeding to drop a Deez Nuts on them.",
          "score": 6
        },
        {
          "text": "Indonesian here. They use a phone and move the phone around to make it seem convincing.",
          "score": 6
        },
        {
          "text": "In this case, the gloss ACTUALLY gives it away, IMO. I'd share, but the last thing I'd want is for a lurking scammer to learn",
          "score": 5
        },
        {
          "text": "6/10 Thais have fallen victim to a scam in the last year. The volume is insane. Average loss is a bit under the average monthly salary. Some a lot higher. https://www.nationthailand.com/news/general/40058129",
          "score": 3
        },
        {
          "text": "Seems higher budget than our local drama",
          "score": 3
        },
        {
          "text": "DEW IT!!!",
          "score": 1
        },
        {
          "text": "Uno Reverse master-class.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qupccv",
      "subreddit": "singapore",
      "title": "Personal mobility scooters to be restricted to those with a medical need or above age 70 from June 2026",
      "url": "https://old.reddit.com/r/singapore/comments/1qupccv/personal_mobility_scooters_to_be_restricted_to/",
      "score": 830,
      "num_comments": 136,
      "created_at": "2026-02-03T11:20:11",
      "selftext": "",
      "comments": [
        {
          "text": "Sounds like a good move. Some of these PMA users are becoming way too entitled.",
          "score": 570
        },
        {
          "text": "There will still be many who will abuse the usage of PMAs until caught and feign ignorance of the new rulings",
          "score": 264
        },
        {
          "text": "It’s ok. At least the first step of official legislation is done The only way things work in Singapore is to fine them. So fine those clowns. Every offence find $10K or jail 1 year You see how fast people become compliant",
          "score": 200
        },
        {
          "text": "If I almost get mowed down by 2 fat fucks who are otherwise perfectly abled riding a PMA blasting music down a sidewalk one more time I'm going to crash out.",
          "score": 155
        },
        {
          "text": "- 3 years jail, plus- family income tax 400% over the next 15 years or 2 generations, plus- extended family of up to 3 degrees cannot flip BTO, plus- 200% capital gain tax, plus- 300% insurance premium, plus- 5 strokes of cane, or 3 months of jail in exchange for each stroke of cane and worst of all.. no cdc vouchers forLIFE",
          "score": 69
        },
        {
          "text": "A bit of wishful thinking. Just look back to what happened a few years ago when there were a few high profile deaths due to PMD. A lot of legislation to restrict usage on paths, impose speed limits etc. A few sacrificial lambs prosecuted to set an example. Then, after that? Crickets. Once in awhile there's a big report about enforcement action but I still see YPs all around my estate pillioning their xmm around and overtaking cars with no helmets on.",
          "score": 42
        },
        {
          "text": "And burdening the system(public transport ,lift) and increasing fire risk with non-compliant chargers. Actually why not enforce through the importer and seller?",
          "score": 31
        },
        {
          "text": "Over here legislators, for you to copy & paste.",
          "score": 22
        },
        {
          "text": "They should punish them with corrective work order. Go blow leaves from pavement, pick up litter at HDB common areas, etc.",
          "score": 20
        },
        {
          "text": "Sorry. U are still going to crash out if u bump into 2 fat f....",
          "score": 19
        },
        {
          "text": "Alrd give 4 months heads up, cant feign ignorance mah However...still got people that were not aware of the Circle Line works and got mad about it so its possible",
          "score": 14
        },
        {
          "text": "i like this one. actually just need 'no cdc vouchers for LIFE' should be enough to deter people",
          "score": 11
        },
        {
          "text": "And thus becoming a further drain on the healthcare system.",
          "score": 10
        },
        {
          "text": "Ignorance is not an excuse when it comes to the law. They can feign all they want but if the government is serious about a show of force then the offenders will suffer the consequences.",
          "score": 10
        },
        {
          "text": "Just take solace in the fact that they'll most likely end up with diabetes.",
          "score": 8
        },
        {
          "text": "sounds good on paper, hard to enforce in real life",
          "score": 8
        },
        {
          "text": "They likely already have diabetes",
          "score": 5
        },
        {
          "text": "Unker: Haih....Ok lor, but can I do it while riding my PMA?",
          "score": 5
        },
        {
          "text": "SIGH",
          "score": 4
        },
        {
          "text": "Problem is with enforcing laws as always. Unless everyone is as \"on\" as that policeman who held onto that illegal ebiker as he tried to run then probably nothing is going to change.",
          "score": 4
        },
        {
          "text": "I saw an short vid from CNA on Baey's speech, supposedly they're also going to be fining (and jailing) sellers of illegal PMDs that exceed a certain size and speed limit",
          "score": 3
        },
        {
          "text": "Bro I am voting you for next GE",
          "score": 3
        },
        {
          "text": "Won’t happen fast enough, plus waste medical resources. It’s a shame there isn’t a more immediate and finite solution to cessation",
          "score": 2
        },
        {
          "text": "I was agreeing with you all the way until...no CDC vouchers? Man, that's way too harsh for my liberal bleeding heart...",
          "score": 2
        },
        {
          "text": "Sg pple damn easy one la, charge 10c plastic bag, or ask to return plates, all gwai gwai follow liow. But seriously i think lta or police understaffed la. If in HK, they can evem use cctv trace the PMD to find the culprit",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1quh2nu",
      "subreddit": "singapore",
      "title": "S'pore to import Jeju black pork & Hanwoo beef from South Korea",
      "url": "https://old.reddit.com/r/singapore/comments/1quh2nu/spore_to_import_jeju_black_pork_hanwoo_beef_from/",
      "score": 300,
      "num_comments": 33,
      "created_at": "2026-02-03T03:31:03",
      "selftext": "",
      "comments": [
        {
          "text": "More exotic meats for CNY hotpot!",
          "score": 112
        },
        {
          "text": "Its already been in singapore for a month or so now, not sure why there was an \"official\" launch a day or two ago and now this news from Min Fu. The price is like $33/100g for hanwoo though. Cannot afford lol.",
          "score": 64
        },
        {
          "text": "I didn't know south Korea was willing to export Hanwoo. I thought they kept it for domestic consumption only",
          "score": 52
        },
        {
          "text": "Some of it is diplomacy I guess. they don't export it to just anywhere",
          "score": 30
        },
        {
          "text": "Madness. Who are you to judge what's a good way to eat wagyu beef?? The japanese themselves use quality cuts of wagyu beef in hotpot, soups and ramen. I like steaks and marbled beef with hotpot equally.",
          "score": 30
        },
        {
          "text": "\"Boiling more healthier\" - my mum and a dozen other relatives",
          "score": 29
        },
        {
          "text": "Texture wise its more tender. There’s much lesser gamey/ smelly pork smell compared to msia pork. Black pork u can just cook/grill on its own and its flavorful. Msia pork needs a bit of seasoning to get rid of the gamey smell.",
          "score": 28
        },
        {
          "text": "More expensive as well",
          "score": 27
        },
        {
          "text": "Boils in salted water filled with heavy spices and a thick layer of red oil on top",
          "score": 25
        },
        {
          "text": "More expensive than wagyu",
          "score": 20
        },
        {
          "text": "Once a year!",
          "score": 18
        },
        {
          "text": "Why not? Incredible marbling, rendered by a few seconds dipped in a hotpot Sounds amazing, in a light soup base to bring out the meaty flavours. Agree that it's wasted if you blast it in mala soup or whatnot Expensive but sometimes you just gotta treat yourself",
          "score": 18
        },
        {
          "text": "this has been old news for like a month or two alr",
          "score": 16
        },
        {
          "text": "Why the hell would you waste supposedly good meat in a hotpot",
          "score": 14
        },
        {
          "text": "i tried once, i would rate it around a4 wagyu so not very surprised with the price point",
          "score": 14
        },
        {
          "text": "i can't taste the difference between jeju black pork and regular pork tbh, except maybe slightly fattier",
          "score": 14
        },
        {
          "text": "Will try the Jeju Black Pork but I’m not expecting it to beat iberico pork.",
          "score": 10
        },
        {
          "text": "That's what Japanese do in sukiyaki nabe.",
          "score": 7
        },
        {
          "text": "You mean you don't want atas hotpot?",
          "score": 6
        },
        {
          "text": "Can confirm that",
          "score": 6
        },
        {
          "text": "Only if you choose the unhealthy stock.",
          "score": 5
        },
        {
          "text": "Some of it might be due to freshness. Just like Spanish mackerel which taste so good in jeju",
          "score": 5
        },
        {
          "text": "Yeah just make a nice chicken and ikan bilis stock with some dried seafood and plenty of aromatics. And some varieties of MSG.",
          "score": 3
        },
        {
          "text": "wtf",
          "score": 3
        },
        {
          "text": "nabe Now now, no need to swear. He was just expressing his opinion",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1quzvil",
      "subreddit": "singapore",
      "title": "Thaipusam Pics from Little India",
      "url": "https://old.reddit.com/r/singapore/comments/1quzvil/thaipusam_pics_from_little_india/",
      "score": 221,
      "num_comments": 8,
      "created_at": "2026-02-03T18:25:55",
      "selftext": "Camera : Nikon Z5II\nLens : Nikkor Z 24-120mm F4 S\n\nWent on the photowalk organised by Nikon\n\nIt was a unique experience witnessing the festival celebrated in full fledged manner. It was a show of faith, sacrifice and determination. The festival was organised well as to not disrupt the traffic, at same provide a safe path to the devotees. Appreciate all the volunteers who were present !!",
      "comments": [
        {
          "text": "This is great! Love learning more about different cultures",
          "score": 11
        },
        {
          "text": "Appreciate it. Thaipusam is a very grand and amazing sight to behold.",
          "score": 8
        },
        {
          "text": "Amazing!",
          "score": 2
        },
        {
          "text": "awesome! thaipusam should definitely be a public holiday and a key component of our tourism efforts as we celebrate what makes us singapore",
          "score": 2
        },
        {
          "text": "Weather in singapore is crazy",
          "score": 1
        },
        {
          "text": "Killer photos brother! Good stuff..",
          "score": 1
        },
        {
          "text": "I love the air of celebration but also devotion that you captured here. The colours and attention paid to the small moments are so great. Absolutely striking photos, outmatched only by the dedication of these devotees! thank you for sharing 🫶",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1quzuu9",
      "subreddit": "singapore",
      "title": "Foreign domestic worker, 43, secretly worked as prostitute in S'pore, earned S$108,000 in 4 years, client who became her pimp gets 6 months’ jail",
      "url": "https://old.reddit.com/r/singapore/comments/1quzuu9/foreign_domestic_worker_43_secretly_worked_as/",
      "score": 218,
      "num_comments": 54,
      "created_at": "2026-02-03T18:25:14",
      "selftext": "A Filipino foreign domestic worker in Singapore secretly worked as a prostitute, serving over a thousand clients and earning more than S$100,000 in the span of four years.\n\nOne of her clients later became her pimp and profited S$6,300 from the arrangement.\n\nAccording to Shin Min Daily News, the client, a 37-year-old man, faced six charges of violating the Women's Charter.\n\nHe pleaded guilty to two of them in court on Feb. 2, with the remaining charges taken into consideration during sentencing.\n\nHe was sentenced to six months' jail and fined S$6,300.\n\nA gag order has also been imposed.",
      "comments": [
        {
          "text": "Four years multiplied by 50 weeks per year (less 2 for Easter and Palm sundays) is 200 sundays. $108,000 divided by 200 Sundays is $540. Multiply by 4 Sundays and she  will earn $2160 a month, much more than what she receives from her domestic work.",
          "score": 171
        },
        {
          "text": "Ngl this pimp did kinda take care of his ho and only took like 5%, and I dont think she was forced into it as he would have taken way more.",
          "score": 125
        },
        {
          "text": "Working double shift to achieve financial security. A proper slayer right at home in Singapore.",
          "score": 112
        },
        {
          "text": "Did she willingly do this? What happens to her? Get deported and that’s it? Over 100k can be life changing money in the Philippines",
          "score": 91
        },
        {
          "text": "It's good change even in SG",
          "score": 75
        },
        {
          "text": "This is the kind of OT salary we are talking about! \nGrayce did it faster though. Guess we can be proud that we still have the,” locals first”mindset",
          "score": 47
        },
        {
          "text": "It wouldn't surprise me if the money she earned from prostitution (S$27K/year) was more than she made as a maid",
          "score": 44
        },
        {
          "text": "When the job doesnt pay well, do a side quest!",
          "score": 39
        },
        {
          "text": "These maids meet up and talk.. sure someone jelly or just doesn't like her. Pao toh to police.",
          "score": 34
        },
        {
          "text": "Very interesting that he would willingly choose to assume all that risk, when he would have probably be scott free if he just remained a regular paying customer",
          "score": 28
        },
        {
          "text": "The real question here is who bao toh?",
          "score": 26
        },
        {
          "text": "Yeah.. she was arrested at MOM services centre somemore. Was probably there for some admin and got ratted out",
          "score": 26
        },
        {
          "text": "If only she worked at a property firm. More money less 'work'",
          "score": 22
        },
        {
          "text": "He probably got romantically involved with her. He's not earning much taking just 5% as a pimp.",
          "score": 20
        },
        {
          "text": "he took like 6 bucks per client - maybe less if 1 client returned multiple times. like how is that worthwhile lol",
          "score": 18
        },
        {
          "text": "Definitely, she may be sleeping through the day as well to make up for the lost hours",
          "score": 18
        },
        {
          "text": "Penalty for work permit holder to have second job is fine up to 20k and/or up to 2 years jail time, besides deportation. I suppose court process still going on.",
          "score": 14
        },
        {
          "text": "to be that high demand at 46...  beauticians hate her secret...",
          "score": 12
        },
        {
          "text": "Maybe some disgruntled client.",
          "score": 10
        },
        {
          "text": "Plus he himself was also a client.",
          "score": 9
        },
        {
          "text": "Illegal entrepreneur.",
          "score": 7
        },
        {
          "text": "6.3k across 1k+ customers is like 6 dollars lol",
          "score": 5
        },
        {
          "text": "most likely also his side quest",
          "score": 0
        },
        {
          "text": "from the article, she found her own pimp when her first pimp returned back to his own country, she had more initiative than her pimp",
          "score": 0
        },
        {
          "text": "the shinmin article has way more details 女佣也曾将两名同样从事卖淫的朋友介绍给被告，由他协助招揽顾客。 the maid recommended 2 friends also doing sex work (also maids?) to the pimp and got him to help them find customers (presumably he profited from that as well?) “龟公”被告上网招客，还让嫖客到自己家中交易。 the pimp advertised online and let the customers do the deed in his home",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1quuy7y",
      "subreddit": "singapore",
      "title": "Nipah virus: Singapore requires daily temperature checks for new migrant workers who travelled to West Bengal",
      "url": "https://old.reddit.com/r/singapore/comments/1quuy7y/nipah_virus_singapore_requires_daily_temperature/",
      "score": 123,
      "num_comments": 20,
      "created_at": "2026-02-03T15:29:19",
      "selftext": "",
      "comments": [
        {
          "text": "For precautionary measures all office workers shall now wfh but can go out after work. YAY",
          "score": 65
        },
        {
          "text": "Here we go again",
          "score": 55
        },
        {
          "text": "...... I like the world you live in. lol.",
          "score": 22
        },
        {
          "text": "3 *reported so far*",
          "score": 16
        },
        {
          "text": "Chill. Do you know how many people were infected in India? 3. This emergency is because of 3 cases only in a disease that is transmitted mainly by waste products. It really isn't going to be spreading.",
          "score": 13
        },
        {
          "text": "And 190 tested around them with no positive results. Nipah is spread by waste. Do you comprehend what that means in terms of infectability? In reality it is only ONE case, the 2 that were additionally infected were medical staff that did not observe proper PPE. Unless you decide to bathe in a river where people shit in, you're not at high risk. The initial patient only got infected because he ate a fruit that had infected bat saliva on it.",
          "score": 13
        },
        {
          "text": "Everybody's giving \"it won't spread and is harder to transmit because...\" but then I think about how people here don't wash their hands properly, ever. Just see them after using the toilet then go around touching everything and everyone. (No, just water doesn't count).",
          "score": 7
        },
        {
          "text": "You made me click into the article to Ctrl+F to see if its actually a statement LOL",
          "score": 4
        },
        {
          "text": "If its that difficult to transmit and the case count so low, why are so many different countries imposing measures on screening specifically for this virus? There are weird viruses in Africa that are much more lethal infecting more people that we don't actively screen for",
          "score": 4
        },
        {
          "text": "It counts. Just the mechanical action of flushing with water removes about 80% of contaminants on your hands, not to mention have you checked up on the number of cases for previous \"pandemics\"? 2001- 66 cases in the whole of India. 2018 - 18 cases in the whole of India. These are your \"outbreaks\". 66 cases worst case scenario in a country of a billion is hardly pandemic material. This time, it is 3 cases for now.",
          "score": 3
        },
        {
          "text": "The r0 is only 0.4 and it has a 40-70% mortality rate, both of those things will make it harder to spread compared to covid",
          "score": 0
        },
        {
          "text": "woll those migrant workers, truthfully declared their past travel history?",
          "score": 0
        },
        {
          "text": "Exactly. That's the \"power\" of media. Do you know where Nipah was first discovered? Malaysia. And in that same outbreak which did make its way to Singapore, a grand total of ONE Singaporean died and that was because he worked as a butcher that was slaughtering infected pigs.",
          "score": 0
        },
        {
          "text": "Yay, then can outsource work even more. I love wfh also, but I also see that significantly reduce the need for companies to based/hire in singapore",
          "score": -5
        },
        {
          "text": "May this not be as serious as Covid. We had it enough, we just want a normal life..",
          "score": -13
        },
        {
          "text": "Oh dear god I really hope this doesnt become another pandemic. Nipah is much lethal than Covid.",
          "score": -14
        }
      ]
    },
    {
      "id": "t3_1quh5ua",
      "subreddit": "singapore",
      "title": "LumiHealth programme to end on May 31 after six years",
      "url": "https://old.reddit.com/r/singapore/comments/1quh5ua/lumihealth_programme_to_end_on_may_31_after_six/",
      "score": 120,
      "num_comments": 49,
      "created_at": "2026-02-03T03:35:14",
      "selftext": "",
      "comments": [
        {
          "text": "It was good while it last 😢 despite the complains about the nerf, the interface is much better than healthy365",
          "score": 92
        },
        {
          "text": "There goes my free vouchers 🥲 it was so fun to hit everything every week",
          "score": 89
        },
        {
          "text": "Was getting so much money from this. One good thing I felt that kept me active 😭",
          "score": 28
        },
        {
          "text": "They revised it recently and I’ve been earning $4 a week so not bad. Overall earned $340 🫶🏼",
          "score": 27
        },
        {
          "text": "It was good before they reduced the rewards",
          "score": 26
        },
        {
          "text": "I wonder why they had to shut down the entire program. So much effort done to develop it over the years, and just to shut it down so abruptly? If it were a matter of not having the budget to sustain the rewards, I would rather they lower the rewards but continue with the program. It was really fun and motivating to complete the various quests, and I would say they are pretty creative about it.",
          "score": 22
        },
        {
          "text": "Wonder how much LumiHealth with the 2 revamp. The good news you can double dip both program till end may.",
          "score": 15
        },
        {
          "text": "Not really, like if you clock your steps and sleep it takes a long time to get points. MVPA is the way to go, but low-key annoyed on sat my jog got registered but my jog yesterday didn't.",
          "score": 12
        },
        {
          "text": "a lot. ad agency takes a pie.apple takes a pie.cash prizes take a pie.app developer takes a pie. civil servants, contract or not, has been roped in too.",
          "score": 11
        },
        {
          "text": "I think they slowly killed themselves, it was fun to use during the first version, then they slowly made it harder and laggier.\nFinally introduced points expiry which ultimately made ad hoc users quit and delete the app as they have no reason to continue as they can’t earn enough points to redeem anything",
          "score": 11
        },
        {
          "text": "Noooo whyyyy",
          "score": 10
        },
        {
          "text": "Been a LumiHealth user since last year … Healthy365 that good ?",
          "score": 8
        },
        {
          "text": "They revamped some time last year. Very easy to earn $4 a week",
          "score": 7
        },
        {
          "text": "waa that very sad I need the voucher",
          "score": 6
        },
        {
          "text": "I’ve got so many vouchers through this app to offset my monthly groceries especially with my family onboard. This app really incentivized all of us to keep working out. I downloaded 365 and immediately deleted cos of its bad UI compared to this. So upset now.",
          "score": 5
        },
        {
          "text": "Yeah most likely there's not enough active users to justify the upkeep of the app itself.",
          "score": 4
        },
        {
          "text": "Must you track the sleep to get points? Cos I don’t want to wear my watch when sleeping. Very annoying",
          "score": 3
        },
        {
          "text": "Depends on the user Some demographics easier",
          "score": 3
        },
        {
          "text": "6 years, but feels like it has been through many changes and wasn’t it just revamped not too long ago? The first version was the best with no weekly caps and interesting backgrounds referencing other countries. Then I recall the awards got nerfed to like $1 a week and I quitted the app.",
          "score": 3
        },
        {
          "text": "They upped it to $4 a week last year",
          "score": 3
        },
        {
          "text": "Sadly yes, hmm I would say you get used to it tbh",
          "score": 2
        },
        {
          "text": "I remember seeing somewhere in the app saying it only counts if the increased HR is more than 10(or 20?) minutes but not sure where to see it now. Could that be the issue?",
          "score": 2
        },
        {
          "text": "No leh my jog alone was 12 mins, but oh well maybe wear tighter next time",
          "score": 2
        },
        {
          "text": "Healthy 365 do about the same thing I believe...",
          "score": 1
        },
        {
          "text": "Feel more like their budget run up and they don’t gave more vouchers to give sia",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1quhdc4",
      "subreddit": "singapore",
      "title": "RSAF upgrades C-130s and other air force hardware",
      "url": "https://old.reddit.com/r/singapore/comments/1quhdc4/rsaf_upgrades_c130s_and_other_air_force_hardware/",
      "score": 94,
      "num_comments": 55,
      "created_at": "2026-02-03T03:45:02",
      "selftext": "The “new” C-130Hs are reportedly ex-Spanish ones which arrived in late Jan, according to various online sources.\n\nhttps://breakingdefense.com/2026/02/singapore-acquires-used-legacy-c-130hs-to-replace-even-older-c-130s/",
      "comments": [
        {
          "text": "we don't this is a prudent move. we just need to be better than our neighbors and upgrades need to be inline with our other capabilities and doctrines no point pay premium for the latest n greatest",
          "score": 54
        },
        {
          "text": "but why do we need brand new cargo planes?",
          "score": 28
        },
        {
          "text": "I remember boarding a C-130B model at PLAB during my first year in NS.",
          "score": 27
        },
        {
          "text": "The actual reason they stick to the same model is because changing it will render that army song useless.",
          "score": 24
        },
        {
          "text": "so we upgrade to the 10 years ago c130 pro max while the ang moh buy new one ?",
          "score": 24
        },
        {
          "text": "Production line tutup lo. Fly where. Fly what Got mrtt for everything else unless U suddenly need to lift a 70 ton MBT somewhere in a hurry",
          "score": 20
        },
        {
          "text": "Yup. 4 C130s from Spain. First one arrived on 11 Dec 2025 https://alert5.com/2026/02/03/rsaf-acquiring-4-ex-spanish-c-130s/",
          "score": 15
        },
        {
          "text": "A400m rolling down the street... Yea doesnt roll off the tongue well",
          "score": 12
        },
        {
          "text": "Wen C17 Globemaster III",
          "score": 12
        },
        {
          "text": "In terms of tactical transport planes the C130 really has no equal, most of our neighbours are running the “H” models too. Indo and MY run the A400m but it’s not a direct competitor to the C130 anyways and they’re both larger countries that would have more use cases for a larger transport plane. For a small country like us the C130H model is good enough since our C130s are mostly used for humanitarian and commando/SF paradrop, I know there was some speculation that RSAF would buy the C390 especially when Embraer set up shop here but the C390 is a jet-engines aircraft so doesn’t have the STOL and ability to land in rugged terrain like the C130 can, plus the production line is filled for years with multiple European customers.",
          "score": 9
        },
        {
          "text": "*ONE* MBT. lol. Not sure if that is even worthwhile.",
          "score": 9
        },
        {
          "text": "somebody makan the new plane depreciation and we get a good deal here. Just like 2nd hand cars prices.",
          "score": 8
        },
        {
          "text": "IIRC, in 2007 ST Aerospace re-winged the Bs and brought the whole Hercules fleet to a common standard. The cockpit avionics was changed to Collins Flight2™ system ATM/CNS glass cockpit. Guess the C-130B fuselages must be clocking close to EOL hours. Now restricted to local and short leg flights only. But still ready for one last burst if things hot up. The Spanish C-130Hs(if not wrong, one of them is the longer -30 variant) is a good strategy to buy time cheap. In effect SAF airborne transport capacity up ~50%, Don't know if the cockpit will be upgraded or not. I would like to read this move as waiting for the KC-390 Millenium(cheaper than a new C-130J?) to mature and hopefully it lives up to their expectations. Next RSAF might be interested I think if C-27J are available to fully replace Fokker 50s.",
          "score": 7
        },
        {
          "text": "Here are the key technical and operational differences between the RSAF'sC-130BandC-130Hbroken down into points: Source: Google Gemini",
          "score": 5
        },
        {
          "text": "Bruh our Fokker 50 MPAs are being replaced with the Poseidon P8… https://www.asianmilitaryreview.com/2025/09/p-8a-acquisition-to-enhance-singapores-maritime-domain-awareness-foc/",
          "score": 5
        },
        {
          "text": "No, I was in the Air Force. Visited 122 SQN (the ones who operate C-130s) as part of my NS Milestone.",
          "score": 4
        },
        {
          "text": "I sat it once coming back from Kachananburi as part of the \"cargo\" since they needed umpires for one of the units doing ATEC there. Most comfortable plane ride I ever had. They had those orange cargo netting that you can sit in instead of seats and it was so damn comfortable, like a hammock and since it wasn't really a passenger flight, we had so much space to ourselves. You really have to experience it to believe it. On the way there though, we ended up taking a Fokker 50, I suspect because we were such a small numbered odd group that they ended up throwing us on whatever transport that happened to be going in that direction.",
          "score": 4
        },
        {
          "text": "Why not consider A400?",
          "score": 3
        },
        {
          "text": "Laughs in usaf c17 airbridge",
          "score": 2
        },
        {
          "text": "*US President cries seeing the bill* lol.",
          "score": 2
        },
        {
          "text": "Heng... still the same model name. Else have to change the song.",
          "score": 2
        },
        {
          "text": "But there's no replacement for the F50 UTA yet.",
          "score": 2
        },
        {
          "text": "Is it commandos or what did you board it for?",
          "score": 1
        },
        {
          "text": "A-Four-Zero-Zero rolling down the strip!",
          "score": 1
        },
        {
          "text": "Maybe for Singapore's need, C130H and being a well know workhorse. Here is the breakdown of theAirbus A400Mvs. theLockheed C-130H: Source: Google Gemini",
          "score": -12
        }
      ]
    },
    {
      "id": "t3_1qur20m",
      "subreddit": "singapore",
      "title": "Govt supports further institutionalisation of Leader of the Opposition role: Chan Chun Sing",
      "url": "https://old.reddit.com/r/singapore/comments/1qur20m/govt_supports_further_institutionalisation_of/",
      "score": 85,
      "num_comments": 38,
      "created_at": "2026-02-03T12:49:21",
      "selftext": "",
      "comments": [
        {
          "text": "LoL, NMPs are a threat to democracy. Illegitimate Puppets with zero votes under the service of the PAP, what a disgrace",
          "score": 201
        },
        {
          "text": "Mr Chan said in a written reply to a parliamentary question filedby Nominated MP Neo Kok Beng. Whatever you think of the LO and how (if at all) it should be institutionalized ... I think NMPs should not be getting involved in politics or anything regarding the constitution (which is the one thing they cannot vote on). Even if it's just the a parliamentary question. It is simply not their place to do so. As unelected members, their legitimacy is already one that is extremely questionable. As it stands, I already have the perception that this Neo dude is using this as a backdoor to influence politics in Singapore without having to go through the democratic process. And I suspect I'm not the only one who feels that way.",
          "score": 96
        },
        {
          "text": "Nothing concrete I guess?",
          "score": 63
        },
        {
          "text": "NMPs is like the pipeline for pap candidates, who would still think they are creditable.",
          "score": 56
        },
        {
          "text": "Their ideal situation is 12 ncmps… that’s their idea of guaranteed opposition presence.",
          "score": 56
        },
        {
          "text": "Kaki gong kaki song",
          "score": 43
        },
        {
          "text": "So do it. Make it an offical position at the confidence of the opposition party, like the prime minister is. Do a shadow cabinet too. All talk no action? Want to follow British Westminster system but only when it benefits you?",
          "score": 43
        },
        {
          "text": "Become like China. Other parties get a quota in congress, but your existence is at the mercy of the CCP. But really, if you do not constrain the development of the opposition, then naturally there would be a stable opposition presence.",
          "score": 40
        },
        {
          "text": "That’s what they probably think in private.",
          "score": 28
        },
        {
          "text": "Should dispense with NMPs, make room for actual representation.",
          "score": 26
        },
        {
          "text": "What was he supposed to say to the question? “No we don’t support institutionalizing LOTO, it should just be a role that we suka suka give”?",
          "score": 26
        },
        {
          "text": "But as it is a relatively new institution, the LO’s roles, responsibilities and operating arrangements continue to be shaped by parliamentary practice, experience and the conduct of those who occupy the office, Mr Chan said in a written reply to aparliamentary question filed by Nominated MP Neo Kok Beng. Dr Neo had asked if the office will be institutionalised in Singapore’s Constitution and, if so, what the criteria will be for an elected MP to assume the office. Wow this NMP takes a very keen interest in the LO position hor? On an related note: Three NMPs – Ms Kuah Boon Theng, Mr Mark Lee andDr Neo Kok Beng– participated in the debate, and called on Mr Singh to voluntarily relinquish the title of Leader of the Opposition. https://www.straitstimes.com/singapore/politics/parliament-deems-pritam-singh-unsuitable-to-continue-as-leader-of-the-opposition Hmm.....",
          "score": 19
        },
        {
          "text": "Gaslighting",
          "score": 14
        },
        {
          "text": "The UK does have officie recognition of the shadow cabinet, although all members other than 4 (LO,  chief whip, 2 assistant whips) do not draw additional salary (or allowance lol). Shadow cabinet members also get \"short money\" for office and staff cost https://members.parliament.uk/opposition/cabinet Fair to say that WP has rejected the shadow cabinet due to lack of members. But I think it's also reasonable to offer the seats and allow them to take up as many as they want. It will also be good to have a shadow budget if the opposition picks it up",
          "score": 13
        },
        {
          "text": "Seeing as this is Mr \"Mdm President\" (Halimah) i won't be surprised at all",
          "score": 12
        },
        {
          "text": "In the UK, the shadow cabinet does not have official recognition. And to be fair, it is up to WP to form one but they declined as the timing was premature. And in the UK, the deputy leader of the opposition is officially recognised with a salary from parliament. Pretty sure Sylvia Lim would hold this position if it existed here.",
          "score": 11
        },
        {
          "text": "It's up to us to either vote in more oppositions or let PAP mocks us with the NMP system.",
          "score": 9
        },
        {
          "text": "Honestly this seems to be an arranged question to appease the masses that, yeah, the govt would still keep the LO position",
          "score": 5
        },
        {
          "text": "They talk we listen",
          "score": 5
        },
        {
          "text": "It’s already known when the PMO announced that the position would remain open if WP changes its mind and nominates an LO.",
          "score": 3
        },
        {
          "text": "Talks of WP forming a shadow cabinet is too premature I think. There are 18 cabinet ministers now with 16 ministries including PMO, but only 12 WP members. To form a real opposition that has a sufficiently sized shadow cabinet (perhaps leaner than the govt’s) and backbench, they will need at least 20 MPs imo.",
          "score": 2
        },
        {
          "text": "Since PAP hates the oppo so much might as well just go all in and set it in constitution to remove all opposition. No need waste time election and fix oppo, they literally have the power to do it, and have already done it before",
          "score": 1
        },
        {
          "text": "Yeah, and if you see the disparity in salaries between constituency MPs and NCMPs, there’s no way an opposition of 12 NCMPs can function properly.",
          "score": 1
        },
        {
          "text": "I always thought the NMP is meant for maybe speaking upon on issues about the arts, culture, sports, sustainability issues, hawkers, minimum wage, disadvantaged members of the population etc or similar topics that have often been overlooked.",
          "score": 0
        },
        {
          "text": "Ya exactly. The original crop of NMPs did just that. Walter Thesiera. Anthea Ong and the like. Even Eugene Tan, despite being highly partisan today behaved professionally when he was still a NMP. You couldn't tell if he was actually for or against more opposition presence. It's been what, a month? And Neo Kok Beng has already made 2 \"appearances\", one blatantly a partisan issue (Pritam and the LO position) and now about the constitution. Presumably Neo Kok Beng was selected to be an NMP because of his engineering and entrepreneurship accomplishments. I don't really see that expertise being highlighted now that he is actually in parliament.",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qulbda",
      "subreddit": "singapore",
      "title": "No intention to scale central kitchen model to all schools: MOE",
      "url": "https://old.reddit.com/r/singapore/comments/1qulbda/no_intention_to_scale_central_kitchen_model_to/",
      "score": 83,
      "num_comments": 73,
      "created_at": "2026-02-03T07:12:18",
      "selftext": "",
      "comments": [
        {
          "text": "For now but as the pool of people willing to set up a canteen shrinks, the central kitchens will become more and more attractive.",
          "score": 127
        },
        {
          "text": "Central kitchen can honestly work if they cook it on location like our saf cookhouse or school canteen in japan. The issue with the current model is the central kitchen is off-site. Food has to be cooked early and sent to the school then placed in a warmer. Previous article talk about issues like cold food, missing or wrong order. If the kitchen is in school, there would definitely be no issue about missing food since they would have to cook some extra. Off site means any wrong or missing order you cant possibly ask the off site kitchen to send a new one before the recess finish.",
          "score": 79
        },
        {
          "text": "only until no one wants to be a canteen vendor as it becomes impossible to earn a living from as they are expected to keep prices low but ingredients only get more expensive. maybe should allow students to use cdc vouchers /s",
          "score": 43
        },
        {
          "text": "\"We want to avoid putting students in these schools that were at risk of not having good access to affordable, nutritious and balanced meals.\" looking at the photos of the meals, the students are still at risk",
          "score": 20
        },
        {
          "text": "is not really about parents, vendors only can earn during recess, no income during school holidays and controlled food items. Thats why vendors unable to sustain.",
          "score": 19
        },
        {
          "text": "Also means no choice in food though. And food waste if kids don't want to eat the menu of the day. See SAF cookhouse.",
          "score": 19
        },
        {
          "text": "Maybe parents do have to realise that food cannot cost $2 a meal in 2026.",
          "score": 16
        },
        {
          "text": "There is another point of view. Unlike Singapore in the 80s and 90s, Singaporeans have more career choices now, so much so that running a school canteen might not be that worthwhile for them.",
          "score": 9
        },
        {
          "text": "Well in western countries that’s how their school canteens work so I think we will have to go to that model soon",
          "score": 7
        },
        {
          "text": "From the article, students choose 6 to 14 menu per day instead of A or B.",
          "score": 7
        },
        {
          "text": "But central kitchen meal allowed to sell for significantly higher cost than canteen vendors? Where is the supposed efficiency at",
          "score": 6
        },
        {
          "text": "Or the van kenna accident. Then no lunch?",
          "score": 5
        },
        {
          "text": "Exactly it seems that the current govt doesn’t seem to be willing to double down on this (rather low stakes) policy and explain that even if not all schools currently have issues with stall holders, the model WILL have to be expanded and scaled to plan for less people taking up the canteen stall role. Either the govt scales now and helps to iron out the issues or face scalability problems in the future. Alternatively more can be done to support canteen stall owners to keep that model alive - the middle ground approach now to appease everyone doesn’t rly seem to make sense imo.",
          "score": 5
        },
        {
          "text": "The advanced order would be Choice A or Choice B. So what happens if they don't like either?",
          "score": 4
        },
        {
          "text": "Cafeteria-style is a possible alternative: it provides students choices and food is prepared on-site. Main issue I foresee is manpower, since you'll need more cooks/servers in each school as compared to an off-site kitchen",
          "score": 4
        },
        {
          "text": "Correct. It always come down to cost which is why the off-site kitchen is used",
          "score": 4
        },
        {
          "text": "Yes what u say is most likely happening as old gen hawkers/vendors wont really want their offspring to slog as hard as them when u can just find an office job somewhere. But now even office jobs also drying up (sigh)...,",
          "score": 3
        },
        {
          "text": "It can still be like the current system where students order in advanced among a selection of menu and the school just cook accordingly instead of strictly follow the saf cookhouse with only 2 menus (x2 for halal and non-halal). It is more of the manpower allocation of the kitchen (but surely school will pick the cheaper option 🥲)",
          "score": 3
        },
        {
          "text": "if you let them do grab ghost kitchens or something, i think still possible, just that delivery driver got to go into school to collect the food, introduce more risks",
          "score": 2
        },
        {
          "text": "Not just holidays but some are not even told when large portions of the students are out on field trips, causing them to prepare too many items and they're left unsold.",
          "score": 2
        },
        {
          "text": "That is cookhouse not central kitchen",
          "score": 2
        },
        {
          "text": "This ! I want to see the Ministry white papers about using central kitchens with an option NOT to scale to believe what MOS said. F&B consultants - please comment - what is the point of central kitchens if not scale ? 13 schools (assume 500 students each) is barely 10k students. I know Sg enterprise like to do National Service but I want to know what the CEOs of SATS and the like think of “no intention to scale” .",
          "score": 2
        },
        {
          "text": "the efficiency went to their pockets",
          "score": 1
        },
        {
          "text": "I imagine it'll work similarly to most other countries (Japan, US, China etc.) There will be some school-based stores and cafes where students can buy more atas food, like burgers and smoothies. However this will be dependant on the school as these are private stores that open on school grounds",
          "score": 1
        },
        {
          "text": "I think end of day this is still a matter of $$. Cost to fund central kitchen while ensuring taste and balancing nutrition and aesthetically pleasing may end up incurring more cost that will be associated with increasing school fees which then call for more tax to support education budget on top of salaries for teachers. Soon increase income tax or 10% gst will be justified. Far fetch? I think plausible.",
          "score": -2
        }
      ]
    },
    {
      "id": "t3_1quks9p",
      "subreddit": "askSingapore",
      "title": "Any idea why is Novena forever under construction?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1quks9p/any_idea_why_is_novena_forever_under_construction/",
      "score": 344,
      "num_comments": 76,
      "created_at": "2026-02-03T06:41:49",
      "selftext": "Just curious , I long long come one time like it has been under construction since decade ago",
      "comments": [
        {
          "text": "I had my kids at Thomson medical center. 2 kids + primary school age alr - the construction still there when I drove by recently lol",
          "score": 279
        },
        {
          "text": "Yio chu kang\nBugis Those areas also since forever construction",
          "score": 238
        },
        {
          "text": "the area outside Sim Lim Square also since been under some construction for nearly 6/7 yrs.",
          "score": 161
        },
        {
          "text": "I work there. TBH it is one of the fastest contract amongst North South Corridor project.. It will only finish somewhere around end 2028 than reinstatement may start.. Sorry for this.. but it will be worth the wait. Edit: If you have any complaints of noise , dust, traffic due to trucks, let the contractor Public relations know. They are quite sensitive and taking action quickly. If cant get a result, you can PM me here, I will try to help .",
          "score": 156
        },
        {
          "text": "Rumor has it Novena was already under construction when Sir Stamford Raffles landed.",
          "score": 97
        },
        {
          "text": "North south corridor. Being surrounded by high rise buildings, they probably have to tunnel deeper, so they need to prepare the land and reroute any underground services first. Then do the prep and tunneling. Same like yio chu kang where they had to relay new roads at the empty patches of land which itself was a huge construction behind yck mrt first before starting on the actual ns highway construction",
          "score": 84
        },
        {
          "text": "Bugis is the end of the “South” of the North-South corridor. Also, Shaw Tower and Guoco Midtown construction.",
          "score": 76
        },
        {
          "text": "first was for the downtown line then now is the north south corridor",
          "score": 52
        },
        {
          "text": "If i may add … it is a technical engineering marvel, given how tight and congested the place is. If the ground sinks by more than 5-10cm due to say, boring a hole too quickly, buildings above are at risk of collapsing. So they have to go REALLY SLOWLY. Then again every time i go to that area i am lost because it looks so different.",
          "score": 50
        },
        {
          "text": "Junction of Serangoon Road / Selegie Road / Bukit Timah Road has been under construction since the 90s - Refurbishment of the Rochor Canal then North East Line then Downtown Line and now this North South Corridor. God knows what's next they'll do to that junction.",
          "score": 25
        },
        {
          "text": "When I stayed there in 2017, there wasn’t construction, not too bad la 😅🙈",
          "score": 24
        },
        {
          "text": "Nah… since before Sang Nila Utama saw the lion.",
          "score": 22
        },
        {
          "text": "Um... I meant you're true to your username of being nice. Don't read too much into it. Have a nice evening",
          "score": 19
        },
        {
          "text": "If you dig deep enough, you can still find the bones and tools of the dinosaurs that first worked on Novena.",
          "score": 16
        },
        {
          "text": "True to your username",
          "score": 11
        },
        {
          "text": "Novenasquarus",
          "score": 6
        },
        {
          "text": "Since before the lion was a tiger and haven’t grow his mane.",
          "score": 5
        },
        {
          "text": "Aplogies.. misunderstand..",
          "score": 3
        },
        {
          "text": "🙌🏿🙌🏿🙌🏿",
          "score": 2
        },
        {
          "text": "Edit: i misundersand it seems.. apologies",
          "score": 2
        },
        {
          "text": "OMG SAMEEEE! Hahaha I laughed seeing this comment coz it feels like coming from me. My first is also in primary school liao. During contraction in a grab, passing those construction, my gran driver took a wrong turn. LOL",
          "score": 1
        },
        {
          "text": "It actually is an engineering marvel, in my humble opinion... A method of construction, which was first at SEA area was conducted succesfully. A part of big highway tunnel placed couple of meters above running NSL mrt lines. No distruption has happened to NSL.. still intact (we regularly keep going in NSL tunnels at night and checking) Another highway tunnel (northbound) is being constructed below NSL Mrt lines.. Some works as close as 2meters below running NSL tunnels done. All good without any issues at NSL.  But still ongoing.. Addition to above, area's geology is a mess. Has been altered several times during geologic time scale and human has made so many interventions to the area..",
          "score": 1
        },
        {
          "text": "Imagine, all traffic from north to south is transferred underground.. All traffic you see at Novena, on bukit timah road (between KK to Beach road turn) now is people trying to go to their work from north to CBD.. All those shall be underground and surface shall have much less traffic, cars,trucks busses... That will give opportunity to build more green areas, bicycyle paths and recreation areas. I have no doubt that govt. shall use that opportunity to improve areas for people of Singapore.",
          "score": 0
        },
        {
          "text": "Isn't it just a highway that is being green washed into being a \"travel corridor \" ? Not really carlite isn't it.",
          "score": -1
        },
        {
          "text": "Hope by then humans wont get wiped out by some super virus pandemic 😂",
          "score": -14
        }
      ]
    },
    {
      "id": "t3_1qv70j4",
      "subreddit": "askSingapore",
      "title": "Looking for some scolding or advice while i’m grieving over the cancellation of BTO",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qv70j4/looking_for_some_scolding_or_advice_while_im/",
      "score": 165,
      "num_comments": 63,
      "created_at": "2026-02-03T22:51:00",
      "selftext": "i know it’s on me, i allowed it to drag on for too long… growing up, i’d always yearn to have my own family, i idealise the idea of dating to marry, applying for BTO, settling down as soon as possible. maybe it’s because being abandoned by my own mother, when she left my elder sister and i at the children’s home, or maybe it’s the feeling of uneasiness when my father remarry, i just want to find someone who love me, settle down, and just be happy.\n\nfirst rs at 19, he’s older than me by a few years, probably think we were still young to settle down. so eventually we part ways.\n\nsecond rs, we applied to a bto almost a year into our rs, but then he suddenly decided that rs is haram, and at that point in time, i know i wasn’t ready to convert, so again it ended. we even got our queue number on our first try, not quite a bad number, but he cancelled the bto application. at least the loss here is only $10 application fee.\n\nand this third rs, we both agree that our goal is towards marriage. so about 8 months in, we applied for our bto and again, we got a queue number on our first try, we paid for unit selection. 4 days after we selected the unit, he cheated. things got bad, but idk why i thought i can forgive him and he promised he will change, so i believed. so eventually we signed the agreement of lease as well. but of cos, he didn’t change. he went on a bali trip in dec with his friends, but almost every night after 8pm, he claimed his battery died. right after he came back from that trip, he tell me he intend to go again in jan/ feb, with or without me, as i kept telling him that idw to travel because i wanna save money. things happened, we argued and i asked him to agree to sign the bto cancellation form. he signed it, he wrote a letter to me telling me that he hope i will not cancel it because he love me and he hope i give him another chance. he sent me this letter on 24 Jan.. but on 28 Jan, i found out that he flew to bali and i saw signs on high heels and manicure on his social media. eventually i saw a photo of him and that girl. so it proved all my suspicions right.\n\nit feels so painful, and i honestly rather going through the phase of being abandoned by my mom, rather than to go thru this phase… now im 27, back to square one. whereas both my sisters have kids alr… i can’t help but compare myself to them… idk, i hope that you can either give me advice on how to move on or just scold me for staying too long..",
      "comments": [
        {
          "text": "Sometimes love and one's desire doesn't come easily. You will eventually come to terms with that. This is just another chapter in your life, do not worry. You do not always need to find a person with the exact family goals as you do at the start of a relationship. My worry is your fixation of BTO. You're grieving a property, not the relationship, which to me ot may indicate that deep down you feel that anyone can be the person you're going to BTO with?",
          "score": 275
        },
        {
          "text": "You're still young and have your entire life ahead of you. Look at it this way. At least you didn't move in to the BTO then find out your partner cheated on you. Some people have to find out their married partner cheated on them via local news. Less than a years marriage somemore.",
          "score": 87
        },
        {
          "text": "1) don't compare to your sisters 2) consider therapy to deal with this, it's not easy 3) spend some time thinking about why you chose these men and what didn't work in the rship... then when you are ready to date again, using this info you can make a wiser choice and different decisions in handling the rship 4) don't rush. Better be single than waste your time on poorly formed rships or guys who aren't worth it or small boys who just wanna play",
          "score": 78
        },
        {
          "text": "Move on, girl. Cheaters are like leopards, they will never change their spots. Good that you found out earlier than after you have a kid or kids. It’ll be much more complicated Focus on your own financial independence. You can buy a flat yourself after 35. Better alone than to be with wrong person who drains your emotion and finances Girl, you sound like a very thrifty and financially prudent person. Keep at it and focus on yourself rather than for a guy to marry to get a flat.",
          "score": 68
        },
        {
          "text": "First and second read through and I agree the fixation was on the bto",
          "score": 29
        },
        {
          "text": "\"Forgive yourself for not knowing what you didn't know before you learned it.\" the quote comes to mind. Look forward to new beginning and leave the trash behind.",
          "score": 28
        },
        {
          "text": "Focus on loving yourself and don’t beat yourself up over this. You did things right and his actions do not define your self worth. You are still young and will come to the realisation that life actually has a lot of room for errors. Of course, that doesn’t mean you should keep making mistakes. It’s also not a competition with others to live your own life according to social norms. It is actually a blessing and admirable that you stand by your own principles at a young age to leave him for good (some people get stuck for life). Use this experience as a growth opportunity to reflect on how you can choose a better partner (don’t rush into it) and become a stronger person. Bad things always happen but you can choose whether it defines you or breaks you apart. Go for therapy session if you find it hard to get over things so that it doesn’t affect you too much mentally. I wish you all the best and I know you will come out of it stronger, stay happy and fulfilled!",
          "score": 22
        },
        {
          "text": "Focus on yourself for the time. Get therapy. Finding a partner and getting a bto plus kids comes with a lot of challenges. Marriage and setting up family is not an easy journey and you need a strong foundation to walk that well. 27 is not old at all. I had complex ptsd due to family abuse. Had to struggle with abandonment issues. Therapy helped a lot. Got married at 37. You need to reach a point where you are good with being alone, and also good with having your own family + all the challenges. But firstly, go for therapy and figure out your issues with attachment, security.",
          "score": 19
        },
        {
          "text": "haha of cos not grieving just about the BTO.. but more like.. it was a hope to me that he will change and we can work things out.. and i’ve invested a lot into this rs, supporting him financially while he’s job hunting for months, putting him above myself, travelling to him every time we planned to meet because he claimed he got no money to travel and that i have a bike, so it’s more convenient for me to go to him instead of the other way round.. im just feeling very lost when i decided to cancel the BTO because it meant, im not going to spend my life with this person who i wanted to spend my life with. he is a muslim, unlike my second ex, he didn’t force me into converting which was why when i felt ready, and at one point i was so sure that he’s the one, i converted. last ramadan which was my first ramadan as a muslim, it was lowkey scary for me because we were constantly still arguing about him and other girls.. but thankfully i found my own community to guide me thru ramadan",
          "score": 16
        },
        {
          "text": "People don’t change unless there are consequences. He showed you who he was the first time he cheated and you took him back. So no consequences of course he’s gonna continue. Focus on yourself being single and happy and you will attract the right type of guys. Don’t put yourself out or sacrifice your identity for someone else, it makes you easy to manipulate. Learn to not give but respond and reciprocate.",
          "score": 15
        },
        {
          "text": "Ladies like you are placing the cart before the horse. Before you BTO and start a family, you first need to know your partner so damn well as if you can predict what they will do or thinking at the point in time. This is the partner you want to spend the rest of your life with so you better be able to filter and grill them until you are satisfied that their values align with yours and they have no ill intentions. Bring them into the deepest waters with you and see their true colours.",
          "score": 12
        },
        {
          "text": "You are still so young. Am sure you will pick yourself up and go. This whole singaporean dream thing is not something that everyone has to do. Stay strong!",
          "score": 10
        },
        {
          "text": "No scolding, just sending you love and hugs. Its obvious you have a lot of deep seated family issues that you either need to work through yourself, or with therapy. I can relate, my parents divorced when I was young and both remarried other people. For a long time it felt like I was the unwanted the child, the uncomfortable reminder of a life they both choose to forgot. But I looked at their life choices (relationship wise), at the people they became, and I told myself that I never wanted to become like them. I was single for a very long time before I met my spouse, and we've been together for over a decade now. Ofc when you are young (and you ARE young!), it is easy to think that a relationship would become your shelter from the world. But that isn't the answer. Growing up, I spent a lot of time by myself. I think that's when you learn who you are as a person, when you develop your own inner world. Being by yourself forces you to be comfortable in your own skin.  So don't be afraid to be alone. You might be stronger than you think. Focus on healing yourself first. Focus on giving yourself space and time to process your upbringing. Going through what you did at a young age means you started life on hard mode - you gotta accept that and process it and move forward accordingly. Money can always be earned back, but a peaceful life is priceless. You've got this. Signed,\nOne traumatised kid to another.",
          "score": 10
        },
        {
          "text": "This was me previously: Dating to marry. Feeling of not good enough - nobody loves me. I met my now husband at 27 years old, married at 30. My younger sister also had kids (granted she was 21 years old then). I wanted at least a few years to assess the guy. If I’m gonna marry him for life, I need to ensure the dating phase is as healthy as possible, non toxic relationship. This is very important because I am deathly afraid of being divorced. I feel like you’re jumping to any guy that falls in love with you then straight away bto. If you’re dating to marry, you need to look at everything objectively and long term. How is the guy and his career (does he have goals) , how you guys quarrel (is it in a healthy manner), what is his value in religion and kids, how you guys deal with difficult conversations, what is his financial philosophy (does he not save), etc.. Because it’s not just about feelings anymore. I have a few criteria that the guy has to meet else I’ll drop them, even at the first date. My friends said going on dates with me is like going for an interview. Maybe I got serious fear of divorce, I need to 100% ensure my husband will be the right choice for me. I even went to pre marital course with my husband just for a third party to assess our relationship. Marrying the right one at a later age is better than marrying the wrong one early. Personally, I look at my own relationship and I feel so blessed to have met the one. I’m glad that I didn’t settle for any Tom, dick or harry. Bto wise…. Husband first. Logistic second. Everything will fall into place nicely once you find a good man, because he will be there with you, through thick or thin. You’ll never feel alone.",
          "score": 10
        },
        {
          "text": "Childhood trauma lasts a lifetime if they’re not healed. Saw this quote somewhere that says “ we accept the love we think we deserve “… so you have to want better for yourself. You have to know your mum abandoning you it’s HER problem, it’s not yours, you’re just a kid. My guess is you probably subconsciously carried a lot of guilt with you growing up thinking why she doesn’t love you enough to stay with you and your sisters. This deep rooted feeling might have leave you chasing love any opportunity you can get so you can prove to yourself you are worthy of love. My only advise it to love yourself more. You’ll be alright. I’m proud of you for not continuing the relationship w him because it WILL end up with him cheating again and your children will be the collateral damage to your divorce.",
          "score": 9
        },
        {
          "text": "Maybe I'm wrong about this, but it sounds to me like you feel as if you've let yourself down with the amount of time, energy and money you've commited into the relationship and believing that your partner would change. I think that maybe you might be feeling a bit of frustration right now about the position that you've put yourself in. But I want you to know that you probably also took a very brave and necessary step for yourself in leaving that relationship and having the self-respect worth more than how your partner was treating you.",
          "score": 7
        },
        {
          "text": "I think you're confusing 2 issues. \nSelf love (lack of it) and property purchase. Its dangerous to go into a marriage or any relationship without self-love, just like how it's dangerous to purchase property without a stable job and salary. I would rather you work harder and aim to get a flat/condo of your own. Hdb would mean you need to wait 8yr (and then some for queue), before you can get it. Enough time to build self love and a decent income + savings. On the journey to self love, you would definitely be attracting the right people. So who knows? Even before 35 you might already be hitched while being secure, with a secure person while having a very secure salary and savings. Win win win. Wish you all the best sister :)",
          "score": 7
        },
        {
          "text": "It's SOOO much cheaper to cancel BTO than getting a divorce. You saved years of watsed time, lawyer fee, and your mental state (rather than emotionally dying when ending a relationship, you will be mentally destroyed when divorcing). You did the right thing!",
          "score": 7
        },
        {
          "text": "I think you need to take some time for self reflection and first be content with yourself. A BTO is a big commitment. Know of many school friends who are now in trouble because they signed a BTO together too soon. A BTO represents a commitment to marriage. I am currently early twenties in a 1 year relationship/: I would not consider a BTO until i’ve been w the girl for at least 5 years.",
          "score": 6
        },
        {
          "text": "I know it’s stupid to say that getting married and getting a home in sg are two separate priorities. It’s a very sg dilemma and for most of us, we can’t have a HDB home without getting married. And because of this, most couples rush into getting married just to get a flat, sometimes with bad results of breakups. Think you need to change your strategy in finding a mate. It’s hard but don’t actively find one. Just hang back and be yourself. Love yourself first. Go on dates without any commitment, find friends first. Be friends first before being lovers. As friends, find the trust, find the integrity, find that comfortable zone. Commit as friends first. Don’t let him know you are interested. This way you know which guy just wants pussy or not. Close it, girl.",
          "score": 6
        },
        {
          "text": "My 2-cents is that you’re desperate for a happy ever after. And by being desperate, you’re ignoring red flags, giving chances to people who don’t deserve, etc. The guys are essentially taking advantage of you,m - they sense your desperation. I fear, if you continue down this road, you might actually get your partner and perhaps even a BTO, but it may not have the happy ending you desire. Sometimes or often times, depending who you read, family trauma and parents’ bad behavior has a way of repeating itself in the next generation. So thread carefully. As others have said, love yourself first, understand your self-worth and try to not settle too much - the fundamentals must be strong. Life will throw lots of crap at you - financials, loss of loved ones, loss of job, illness, etc. - so you need to be with someone true and genuine. On top of all that, there’s also the possibility that people change in the course of the relationship. So, if the foundation is weak, in all likelihood, the relationship may not be able to withstand the stress tests the future may throw at you. A BTO is important, but not the be all and end all. How will you maintain payments if you split up later? You may end up at square one all over again - wiser maybe but certainly older. And with age, it may be even harder to find a partner. Don’t rush, be happy and it will come to you.  Singapore trains you to plan and prepare for everything, almost as if you were a robot or an AI prompt. But not all things can be planned and prepared for to the nth degree. Alternatively, become more pragmatic and aim for a marriage of (BTO) convenience. That way, you may get your BTO but your relationship may be slightly non-conventional terms. Both are viable options - as long as you go into it with your eyes wide open and are aware of the consequences. There’s no right answer in life - to each their own, and by the same measure, to each their own consequence. Stay strong - love and the BTO will come to you when you least expect it! And this is not just a cliche, hard don’t to believe maybe, but there is some truth to it.",
          "score": 5
        },
        {
          "text": "Paying some money to cut short your suffering by 50 years is a small price. Did the same, 长痛不如短痛",
          "score": 5
        },
        {
          "text": "Would you rather:\n1) cancel your BTO now and grief over it, or\n2) cancel your BTO much much later meaning u may lose your deposit ($10k or more + 2k), or\n2) get married, have kids, and then your husband cheats on you and abandons you. If u cannot pay your mortgage alone means you will have to sell your BTO and move to a rental flat which will feel really damn bad. Ur kids will experience the abandonment and also watch u being a sad and useless mom. And when they grow up the cycle repeats, because then they will have their dream of having a complete family and BTO and they might feel influenced to make a rash decision and choose a bad partner because this is the role model u set for them. Nothing wrong with dating to marry and wanting to get your own BTO. In fact that is very much encouraged by the SG govt and most ppl who want to get married will follow this path. The problem is why are u choosing these bad partners? Ur logical brain is telling u to cut your losses and get out now so listen to that smart brain of yours and not the dumb heart.",
          "score": 5
        },
        {
          "text": "Be thankful that you broke up with him now. Imagine your miserable life with someone who cheats once you’re married and have kids. You’re saving yourself from this cheater, once a cheater, always a cheater.",
          "score": 5
        },
        {
          "text": "This is so true. I was not abandoned by my mother, by my mother was by hers. This led to some not great parenting to me. I’m sad to say that until pretty recently the things I would accept in relationships (all types, but romantic ones really being important for this one) was not good for me. I spent the last few years doing a lot of internal work and retraining my brain. The energy/mindset I bring to dating now is so different. How I feel with someone is so different. I echo this person for being good enough to yourself to leave him. Have faith in yourself that you just loved yourself in the best way you can",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1qukom7",
      "subreddit": "askSingapore",
      "title": "Have you ever met Singaporeans with a really unexpected accent?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qukom7/have_you_ever_met_singaporeans_with_a_really/",
      "score": 158,
      "num_comments": 93,
      "created_at": "2026-02-03T06:36:13",
      "selftext": "Have you ever met someone local whose accent really caught you off guard?\n\nLike race doesn’t match the accent you’d expect at all when speaking english\n\neg Chinese speaking with strong Indian accent, Malay speaking with Japanese accent etc\n\nWonder what their background is like for this to have happened",
      "comments": [
        {
          "text": "Kauboy",
          "score": 552
        },
        {
          "text": "Malay speaking with a Texan accent. My brain froze for a few seconds the first time I heard him talk. He moved there since 11 and came back for NS.",
          "score": 405
        },
        {
          "text": "Years ago when I was staying in Clementi, met a Chinese aunty wearing Sari and speaking Tamil fluently. I heard she was adopted by Indian family. Also one of my Singaporean Indian coworker speak Mandarin and Hokkien fluently. A lot of customer were surprised when they get her name & email or meet her face to face. She can speak Tamil (mother tongue) and can speak Malay quite well too. We all called her 'True Singaporean'.",
          "score": 183
        },
        {
          "text": "One Chinese NSF in HQ with mental illness insist he was from like the Deep South, and spoke with comical fake redneck accent. Only got pes E9 sad wouldn’t give him Pes F. apparently he went for 2 week holiday to the USA pre enlistment and then realised he was not Singaporean, reject NS",
          "score": 156
        },
        {
          "text": "LoL met a Indian girl in uni who took Chinese in school and got A for A levels. Meanwhile my full blooded Chinese friends fighting for their lives to get a D",
          "score": 120
        },
        {
          "text": "Indian speaking better mandarin than most Chinese",
          "score": 110
        },
        {
          "text": "i expelled air out of my nose. take my poor man’s gold",
          "score": 90
        },
        {
          "text": "Knew a guy who was half Caucasian half Chinese. Caucasian father was out of the picture from the start. Mom remarried a Chinese guy when he was young. He took his stepdad's sirname. But he looked more Caucasian than Chinese even though he had a Chinese name and seemingly two Chinese parents. Perhaps to overcome insecurities about all this, he developed a really strong singlish accent even more than his fully Chinese half siblings (he was not codeswitching, it was his natural accent).",
          "score": 90
        },
        {
          "text": "I had a classmate in poly (we were all like 18-19) who spoke in a really bad American accent. Turns out, he spent a month visiting relatives in the US when he was 10 and he claims the accent stuck to him.",
          "score": 76
        },
        {
          "text": "Indian encik, speaks fluent Hokkien, can't speak Tamil.",
          "score": 75
        },
        {
          "text": "I went on a tour to Turkey with a Russian lady with Singapore PR who acted as our Singapore tour chaperon. Blue eyes, blonde hair and speaks English with a strong Singaporean accent. Close your eyes and you'll really think you're speaking to a local auntie.Turns out she learned her English while living here.Took me awhile to get used to it, haha.",
          "score": 68
        },
        {
          "text": "Damn sus. I had a Korean classmate that apparently speaks English with an American accent. She claimed that she visited relatives in US too and after a few months of staying there, she also got stuck in that accent. I find it weird that she got stuck with that accent after living there for a few months but she didn't get stuck with Singaporean accent after living here for a decade. Turns out she just idolises the American culture and moved there after she graduated.",
          "score": 40
        },
        {
          "text": "I have a classmate in uni who went for a 3 week exchange to USA and came back with a fake American accent that she claims is from being there for “so long”.",
          "score": 40
        },
        {
          "text": "Eh I copy my Indian classmate's Chinese homework before",
          "score": 19
        },
        {
          "text": "A clear case of seperti kacang lupakan kulit",
          "score": 15
        },
        {
          "text": "Many like that",
          "score": 9
        },
        {
          "text": "more to tak sedar diri",
          "score": 8
        },
        {
          "text": "Lmao I can’t even imagine. My family moved from SG to Texas when I was 10, but I never really adopted the southern drawl.",
          "score": 4
        },
        {
          "text": "Like decades ago everyone cringe when Fiona Xie spoke",
          "score": 4
        },
        {
          "text": "Ni Howdy! just like @jakesing_(Frm instagram 😅)",
          "score": 3
        },
        {
          "text": "Reeks of one of those kids that wanted to start fresh post-O's and went in too deep on a personality",
          "score": 3
        },
        {
          "text": "LOL i seen q afew",
          "score": 3
        },
        {
          "text": "Yes but that’s probably because he’s not Tamil (Note not all Indians are Tamil)… could be Hindi, Punjabi, Malayali or Bengali (or something more exotic).",
          "score": 2
        },
        {
          "text": "HAHAHAHAHAHAHAHHAHAHAHA NAHHH IM DEAD",
          "score": 1
        },
        {
          "text": "Lol, I have schoolmates like that too! But the course I did tends to attract posers.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qvayo1",
      "subreddit": "askSingapore",
      "title": "What is the most out of touch statement you've heard regarding the bad job market?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qvayo1/what_is_the_most_out_of_touch_statement_youve/",
      "score": 97,
      "num_comments": 79,
      "created_at": "2026-02-04T01:35:48",
      "selftext": "I know many people are struggling with job hunting in this horrible market. On top of that, the out-of-touch statements we keep hearing can be incredibly discouraging. I thought it might help to pool them together so we can at least laugh at them together.\n\nWhat’s the worst thing you’ve heard? I’ll start.\n\nSomeone once told me that fresh grads and Singaporeans are just too picky because we refuse to work for SMEs. According to them, if all unemployed people simply worked in SMEs, there would be no job crisis.",
      "comments": [
        {
          "text": "“Just tell the company you are SINGAPOREAN they will hire you” From a well spoken retiree lady stranger.",
          "score": 125
        },
        {
          "text": "\"huh how do you survive on 6k a month in Singapore\" Got this from a Nepo hire who's dad landed him a job right after graduation",
          "score": 112
        },
        {
          "text": "Someone once told me that fresh grads and Singaporeans are just too picky because we refuse to work for SMEs. According to them, if all unemployed people simply worked in SMEs, there would be no job crisis. Tell me you're a LPPL SME boss without telling me you're a SME boss",
          "score": 101
        },
        {
          "text": "Up skill with AI. Even if you know 101 way to use AI, it's not going to help you get a job when you no job. Anyone that says the market is not that bad needs to to quit their job with no backup and see how long they take to get a new job. Is not even about skills anymore, just feel like playing the lottery on whether will get hired.",
          "score": 55
        },
        {
          "text": "The amount rich, sheltered kids who don’t know our mrt system is astounding. Stay landed and never took the mrt before even at 16 years old",
          "score": 50
        },
        {
          "text": "A career advisor look at my resume and say “you should go and get a degree if you want a job” as if it’s something that I can get it within 3 months and also won’t get me in tens of thousand of debt in the first place",
          "score": 39
        },
        {
          "text": "This one not only out of touch, out of the wrong era sia.",
          "score": 25
        },
        {
          "text": "People who cannot self reflect are truly the best bosses to work under /s",
          "score": 24
        },
        {
          "text": "I was told that I was not hungry enough. But here lies a starving individual who is getting too tired to even function.",
          "score": 18
        },
        {
          "text": "Get a part time degree from SUSS. With grants, subsidies and my skills future and PSEA I think I spent less than 10k. I can't speak for everyone but I am in a way better position now and I don't think I'd have gotten here without a degree.",
          "score": 16
        },
        {
          "text": "The worst kinds are those who know nothing about AI and keep pushing people under them to learn AI and shoehorn it into the company. And then they themselves not willing to learn how to use AI.",
          "score": 11
        },
        {
          "text": "Yep spot on, SME boss who kpkb their own staff everytime we meet",
          "score": 6
        },
        {
          "text": "I know people who take MRT for the experience and they take it as a learning journey lol… seriously so out of touch and spoilt",
          "score": 0
        },
        {
          "text": "Their learning journey is my everyday life lmao. Hope they learn something",
          "score": 0
        },
        {
          "text": "There's too many of these fuckers around who will burn our country to the ground",
          "score": 0
        },
        {
          "text": "Someone asked me, “what is a polyclinic and where is it? I have heard of it but don’t really know how it works.” This person was 19 years old, was really kind but I was pretty shocked to hear this question.",
          "score": 0
        },
        {
          "text": "Apparently a lot of tech, semicon and AI companies are only hiring SC/PRs. From my friends in the industry.",
          "score": 0
        },
        {
          "text": "The employer who hires someone for being Singaporean may also be running some kind of local quota scam too.",
          "score": 0
        },
        {
          "text": "Only in companies where they use your citizenship status to hire foreigners lol. This is nevertheless giving \"Just give the girl a flower and she will love you.\"",
          "score": 0
        },
        {
          "text": "this might not be true, but the opposite is almost 100% true - my non-PR/SC friends found it almost impossible to get company sponsorship in the current tech job market",
          "score": 0
        },
        {
          "text": "Meanwhile my ex boss only seem to hire fresh grad foreign women staff. I can’t believe there’s no male applicants suitable. Non tech, professional role.",
          "score": 0
        },
        {
          "text": "If your family not well to do, every year can get around 6.3k + if you’re lucky enough got private donated bursary that’s another 6-7k for your school fees… my uni fees were basically paid off from these",
          "score": 0
        },
        {
          "text": "Go SUSS for a part time degree! A few thousand per semester should be very manageable!",
          "score": 0
        },
        {
          "text": "Ur search will be over, one way or another.",
          "score": 0
        },
        {
          "text": "“You should allow boss to be take advantage of you”",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qup1j5",
      "subreddit": "askSingapore",
      "title": "Couples in Singapore with ~$25k combined take home monthly income, what’s life actually like for you?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qup1j5/couples_in_singapore_with_25k_combined_take_home/",
      "score": 49,
      "num_comments": 105,
      "created_at": "2026-02-03T11:02:52",
      "selftext": "Just genuinely curious about the lifestyle at this level\n\nWhat type of housing do you live in? (HDB/condo/landed, own or rent)\n\nRoughly how much do you spend monthly?\n\nBiggest expenses?\n\nDo you feel “comfortable” or still budgeting carefully?\n\nIs there still anything that surprised you about this income level?",
      "comments": [
        {
          "text": "HDB, we won the BTO lottery. Biggest expenses are the kids childcare, enrichment classes, and travel. Spend roughly ~5k monthly. Comfortable enough to not feel the pinch when you're spending, but wise enough not to splurge. Nothing surprising at this income level. We are still taking the public transport, eating at hawker centres, shopping at shengsiong, and still feel it's a waste of money to splurge 10k on a bag/watch.",
          "score": 293
        },
        {
          "text": "Fully paid off hdb with two kids no car no helper Biggest expenses would be kids related stuff Don’t track how much we spend monthly Feel comfortable in the sense that weekly dtf (and the likes) meals are ok but ask me pay for biz class with cash I still will not If we were to upgrade to private property then need to budget more le We came from lower ses background, so the increase in general goods prices still surprises us some times. Like wtf is a $7 breakfast set at Toast Box",
          "score": 131
        },
        {
          "text": "That is the life. Respect.",
          "score": 40
        },
        {
          "text": "I’m not at that income level yet but nearly there, and i feel the same. Takashimaya has good muah chee which i’ve been eating since poly days, but now its $6 per container. Wtf not going to spend that amount. It’s a matter of principles",
          "score": 20
        },
        {
          "text": "My brain understands inflation but the cheapskate in me just says no. Freaking ridiculous. Teh o peng large cup at toast box $4.70 wtf they think they are chagee meh",
          "score": 18
        },
        {
          "text": "Random comment but I like how Singaporeans can instantly get the 'hor?' 🤣🤣",
          "score": 16
        },
        {
          "text": "suspect you are the exception rather than the norm. at such income, it's easy to splurge on everything branded and premium and business class etc.",
          "score": 14
        },
        {
          "text": "One fresh earthling one going Pri sch next year Only pay for art and piano class so far",
          "score": 12
        },
        {
          "text": "Yea, usually lifestyle inflation creep in to most folks out there that are earning high income. It's not easy to keep simple lifestyle despite earning much more than median income.",
          "score": 11
        },
        {
          "text": "Sometimes, it comes down to self-control. While my income and bonuses have grown, I’ve kept my spending at the same level as the past eight years. When I go shopping with friends, I often return empty-handed or just with groceries ( never unnecessary snacks). Deep down, I find more joy in watching my investments grow than in accumulating clutter at home.",
          "score": 8
        },
        {
          "text": "Hor? Like ok I get it prices rising, rental rising, but I just.. can’t",
          "score": 6
        },
        {
          "text": "That is very low with kids and children as well as personal spend. Do you cook or eat out more often?",
          "score": 4
        },
        {
          "text": "Hor? LMAO",
          "score": 4
        },
        {
          "text": "Wah seriously bro, this type of life should be saving at least $15k/month no?",
          "score": 4
        },
        {
          "text": "Honestly no idea since we don’t track, whatever we don’t spend is either channeled to savings or investments. We still provide allowance to our parents so that’s that too",
          "score": 4
        },
        {
          "text": "Adorable ! But what a big gap!",
          "score": 2
        },
        {
          "text": "Which makes it respectable to me",
          "score": 1
        },
        {
          "text": "There should be a study on this, but most people I know personally who have combined income of around 20k and more (including us), live pretty simply (HDB, no branded goods, travel economy if at all, we don't travel at all, taobao furniture). The only splurge is going to eat more expensive food more often (e.g not batting an eye for $30 per person restaurant as a casual dinner a couple times a week). I think it depends on your social circle as well. The only ones I know who actually buy luxury goods are my cousins who grew up very show off-y despite not having a high income (dad was a single income taxi driver). Their current incomes are at best 10k/month, but they received a big inheritance from a passed grandparent which I think funded a lot of their lifestyle.",
          "score": 1
        },
        {
          "text": "i swear i was thinking the same. lol...",
          "score": 1
        },
        {
          "text": "How old are your kids? And how much do you spend on their enrichment and tutors.",
          "score": 1
        },
        {
          "text": "Ya same, there’s always things that I want to buy but I try to wait it out to see if I really still wants it 2-3 weeks later. It’s all about self-control.",
          "score": 0
        },
        {
          "text": "I think it's easier to spot people who splurge than high earners who don't. As a single myself earning high 5 figure, the last time I travelled was in 2011 and I do not even have a passport. I take mrt, eat simply and spend little. As another poster  pointed out, I prefer to invest and watch it grow and plan for retirement instead.",
          "score": 0
        },
        {
          "text": "not sure the proportionality. but I see a huge number of singaporeans into branded and luxury too.",
          "score": 0
        },
        {
          "text": "The most expensive thing you will spend is when you buy back your time.",
          "score": 0
        },
        {
          "text": "Yeah toastbox charging a ludicrous $4 for iced Kopi and I’m like F off",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qun6eh",
      "subreddit": "askSingapore",
      "title": "Has anyone had their job offer rescinded after a pre-employment check?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qun6eh/has_anyone_had_their_job_offer_rescinded_after_a/",
      "score": 41,
      "num_comments": 32,
      "created_at": "2026-02-03T09:07:34",
      "selftext": "As part of a job hiring process, I’m required to go for a pre-employment health check up. I was previously diagnosed with a mental illness and was on medication but I have weaned off for more than a year and am now stable. Has anyone who declared their mental illness in a pre-employment health check up had their job offer rescinded? I’ve never had to go for health check ups in my previous jobs so I’m not sure how this might jeopardise me…\n\nEdit: Thanks everyone for sharing your input. I’m surprised I didn’t get any response from someone who has had their offer rescinded from declaring. On the contrary, I know of a friend who declared their mental health history and their employer still offered them the job. Anyway, I’ll still be transparent about it because it’s in my nature to do so (yknow that kid who will tell the teacher they mark them incorrectly and now has to go down a grade lower, that’s me). I’d like to think we’re becoming more inclusive and progressive as a society so I’m putting my good faith in this potential employer and even if I don’t get the job, I know things that are meant for me won’t pass me by :)",
      "comments": [
        {
          "text": "Don’t declare. Your medical info is supposed to be private and let’s be real, mental illness is still extremely stigmatized in Singapore. The odds of you having your offer rescinded is significantly greater than you not declaring and being found out. \nIn fact, most people don’t declare and have been in their roles forever.",
          "score": 92
        },
        {
          "text": "Since you're stable and presumably don't need any concessions, just don't declare.",
          "score": 39
        },
        {
          "text": "In Singapore, you generally do not need to declare your mental health condition during a pre-employment checkup, as Tripartite Guidelines on Fair Employment Practices (TGFEP) advise against requiring this information unless it is directly relevant to job safety or performance. Employers should not ask for it unless the role involves high-risk, safety-critical tasks. Are you planning to work as Police Officer or other frontline roles instead of office jobs?",
          "score": 25
        },
        {
          "text": "Errr if you’ve bipolar type of mental illness,it is ill advised to wean off the medication yourselfunless it has been approved by your doctor. Still, I think best to declare IF you were asked. There are medical records so if you lie and get caught, you could be seen as dishonest and that is a red flag",
          "score": 24
        },
        {
          "text": "Why would you declare lol",
          "score": 19
        },
        {
          "text": "You can declare and gamble they won't withdraw their offer and won't look at you sideways while you're there. Or you can gamble that they won't find out while you're there. Your choice lor.",
          "score": 16
        },
        {
          "text": "My doctor is aware and I still see him every now and then so he can check in on my progress. And no it’s not bipolar type of mental illness lol",
          "score": 12
        },
        {
          "text": "Hi OP. I have had depression and ocd ever since I started work years ago. I have never declared any of my mental illness on a form. I suspect you may be struggling with your internal compass on whether or not to tell the truth and get it out of the way beforehand, rather than hide it and have to worry they might figure out everyday. Its important to remember that whatever advice people can give you here, the choice is ultimately yours. There have been people who declared their conditions and the company is very supportive, even allowing them to claim from company insurance when visiting mental healthcare providers. That said here is my take. I initially also was uncomfortable hiding my condition as I have an unhealthily strict moral compass. But I have learnt that despite the rubbish that our government spews about making it inclusive, I can assure you that you will not be getting that job if you declare. Here is my reasoning. Most of the time, they ask you to fill up this questionnaire declaring your mental conditions even before the first interview. If they really do not stigmatise and hire purely based on ability and knowledge, shouldn't this questionnaire come AFTER you have been offered? Just some food for thought. My advice is, if you can hide it, don't declare. If you can't hide it, then I would suggest not finding a job right now. Focus on a goal. That goal is not to be cured of your mental illness, but reaching a point where you can hide it reliably. Don't worry about the medical checkup. You just have to stick with your lie. According to my psychiatrist, they can't detect your psychiatric medication from a simple blood sample. I would know, as I am on 5 medications and have gone for numerous pre-employment and free health screenings. So yeah. I am sorry that I do not have good news for you, but this is Singapore. You want to declare, be prepared to not only not get the job, but also registered in whatever company's database that you have a mental health condition. And they are surprisingly well linked. Whatever you choose, wishing you all the best, and take care",
          "score": 12
        },
        {
          "text": "Any suppression of info or false declaration in the health check up can render me liable for dismissal or legal proceedings lmao so if they find out after I’m hired it won’t look good either",
          "score": 12
        },
        {
          "text": "IMO, bipolar type of mental illness (during manic episodes) have a more disruptive effect on the person and his/her surroundings than depression and anxiety. Singapore still lags behind other nations in terms of mental health awareness and support, but there has been progress. People esp Gen Zs are more open to discussing it",
          "score": 8
        },
        {
          "text": "Do not declare since ur cured. It will be used against u in the selection process.",
          "score": 8
        },
        {
          "text": "Legal proceedings? What rubbish. People lie all the time, even our minister lie about trace together to 5 million people and they are still employed.",
          "score": 6
        },
        {
          "text": "Here’s a shorter, clean reply: If it’s semi-public and not safety- or security-sensitive, the risk is generally very low. Health checks in those roles focus on current fitness for work, not past diagnoses. A treated, stable condition on its own usually isn’t an issue. Aren’t  medical information part of personal data act and supposed to be P&C? \nHmm I will say don’t\nDisclose",
          "score": 6
        },
        {
          "text": "This can depend a lot on the role. Can I ask which industry this is in, whether it’s private or public sector, and whether the job is considered safety or security sensitive?",
          "score": 4
        },
        {
          "text": "Lol youre free not to declare it but dont go surprised pikachu once your insurer informs your employer thr very moment you use your company's medical plan for anything related to mental health .",
          "score": 4
        },
        {
          "text": "Semi public sector. Job isn’t safety or security sensitive",
          "score": 3
        },
        {
          "text": "just out of curiosity, why is bipolar of being singled out, is it that common nowadays? because last i know, it wasn't that well known",
          "score": 2
        },
        {
          "text": "icic, thanks for the insight",
          "score": 2
        },
        {
          "text": "Then just don’t get caught lor. If you’re well enough and confident that there won’t be a relapse. It’s your own confidential info don’t don’t need to tell anyone.",
          "score": 2
        },
        {
          "text": "Exactly!",
          "score": 1
        },
        {
          "text": "Hi there, were you diagnosed with depression and ocd before or after you started working? I could hide it and most people could not tell, including past colleagues until I told them verbally. Also, the company has offered me the job so it wasn’t that they made me fill in the form before I attended an interview - that would have been discriminatory I think.",
          "score": 1
        },
        {
          "text": "Well, I just finished a job search exercise and many companies have asked me that question before the interview, so... Anyways, it was before I started working",
          "score": 1
        },
        {
          "text": "IMO any company that asks that is a red flag unless the job explicitly definitely requires sound mental health like being a pilot",
          "score": 1
        },
        {
          "text": "You are reading this too naively. Don't fall for it.",
          "score": 0
        },
        {
          "text": "Any suppression of info or false declaration in the health check up can render me liable for dismissal or legal proceedings lmao so if they find out after I’m hired it won’t look good either",
          "score": -12
        }
      ]
    },
    {
      "id": "t3_1qukus1",
      "subreddit": "askSingapore",
      "title": "What’s the unofficial minimum hourly wage in Singapore?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qukus1/whats_the_unofficial_minimum_hourly_wage_in/",
      "score": 38,
      "num_comments": 51,
      "created_at": "2026-02-03T06:45:47",
      "selftext": "Just curious because 10 years back, it was $7/hr to 8/hr.",
      "comments": [
        {
          "text": "Look up Mc Donald's hourly rate. That's the unofficial minimum.",
          "score": 161
        },
        {
          "text": "a back and forth bus ride is already $4.40.",
          "score": 110
        },
        {
          "text": "I miss the times when it showed less than $1 fare when I tap my card.",
          "score": 45
        },
        {
          "text": "I know 2015-ish McDonald’s was $5.50 per hour with free lunch (under a certain value). Now idk how much",
          "score": 38
        },
        {
          "text": "idk what’s with the comments here but the unofficial min $12/h. just search on platforms like fastjobs for basic fnb jobs with little to no commitment and it’s usually $12-15/h. Even mac’s is $12.5/h now if i’m not wrong",
          "score": 31
        },
        {
          "text": "10-12 i believe. wont work anything lesser than that and i rather be broke",
          "score": 29
        },
        {
          "text": "$7.50/hr for very low tier jobs like cleaners. And $10/hr for most jobs $15/hr for jobs that require a certain skills set",
          "score": 27
        },
        {
          "text": "I think the mcdonald at my kampung pays around 11-12 bucks per hour",
          "score": 19
        },
        {
          "text": "I know of part time work that is still at $10/hr tbh, so not absolute minimum, but hard to find part timers with that price",
          "score": 19
        },
        {
          "text": "Idk why you're being downvoted but if you're actually spending $4.40 on bus rides or more per day, the monthly card is more worth it.",
          "score": 15
        },
        {
          "text": "If McDonald’s pay is the real baseline, that says everything.",
          "score": 15
        },
        {
          "text": "its $10.xx/hr for cleaners right now",
          "score": 11
        },
        {
          "text": "Yes my company is still 10/hr, but wfh and flexible hours. Targeting uni students with free time lor. You can think of it as the same thing as data entry",
          "score": 9
        },
        {
          "text": "Saw a bakery shop paying $15.5 per hour for 6 hour part time job. Which I think is decent.",
          "score": 6
        },
        {
          "text": "Lol\nI worked at burger king in 2008 and it was 4.20",
          "score": 5
        },
        {
          "text": "For bus and mrt!",
          "score": 4
        },
        {
          "text": "There are 10/hr jobs out there.",
          "score": 4
        },
        {
          "text": "currently the pay hourly is $11.32 -Mcd employee",
          "score": 3
        },
        {
          "text": "hi, can i ask what job/company that is?",
          "score": 3
        },
        {
          "text": "Not everyone goes out everyday and not every trip is $2.20.",
          "score": 2
        },
        {
          "text": "12/hr minimum for uni work",
          "score": 2
        },
        {
          "text": "I didn’t know this was a thing, thank you btw",
          "score": 1
        },
        {
          "text": "Also check your typical monthly spending on simplygo to make sure you’re getting your money’s worth. Can see monthly spending there. Mine is hovering at 70+ since my work week is 3.5 days so on average I commute 15.5 days per month",
          "score": 1
        },
        {
          "text": "122 for bus only right?",
          "score": -1
        },
        {
          "text": "If it bothers u that much you should buy the unlimited adult monthly travel card for $122 and ride to your heart's content. Its very worth it",
          "score": -9
        }
      ]
    },
    {
      "id": "t3_1quoiwe",
      "subreddit": "askSingapore",
      "title": "what happened to KFC mushroom twister? (breakfast menu)",
      "url": "https://old.reddit.com/r/askSingapore/comments/1quoiwe/what_happened_to_kfc_mushroom_twister_breakfast/",
      "score": 35,
      "num_comments": 18,
      "created_at": "2026-02-03T10:32:02",
      "selftext": "just silently disappeared since a few months ago and don't see any mention of its removal (either by KFC or social media)...was it that unpopular? shame cos it was one of my favourite breakfast options 🥲",
      "comments": [
        {
          "text": "KFC just loves removing their best items don’t they. Roasta, Fish Ole, Meltz, rice bowls…",
          "score": 43
        },
        {
          "text": "They slowly removed the mushroom items from the menu since a few years back. Miss their mushroom burger lunch value set.",
          "score": 40
        },
        {
          "text": "and Shroom burger… my favourite. Haven’t returned to KFC since.",
          "score": 26
        },
        {
          "text": "yeah, and the removal of rice buckets too... 🥲",
          "score": 21
        },
        {
          "text": "I miss the $5 rice bucket from…. 10 years ago. Wow time flies lol",
          "score": 20
        },
        {
          "text": "mushroom also too exp?? Dang kfc going downhill like 📉😔",
          "score": 16
        },
        {
          "text": "Shrooms burger was legit. But I really miss their grilled spicy chicken and fish zinger.",
          "score": 16
        },
        {
          "text": "I may be wrong, but I vaguely remember someone saying they removed mushroom because it was harder to get or became more expensive. Something along those lines.",
          "score": 12
        },
        {
          "text": "Oh wow this brings back so much memories! I love getting their fish ole and meltz. When they brought the meltz back again in the past few years, it doesn't taste the same anymore :(",
          "score": 8
        },
        {
          "text": "i see...thats a shame...i wont mind paying a dollar more for the mushroom twister tho tbh",
          "score": 6
        },
        {
          "text": "Personally I love their American twisters. Which is ironic because I now live in America but the KFCs here don’t have it (in fact, the U.S. KFCs all suck). So whenever I visit home I always make it a point to eat it at least once",
          "score": 5
        },
        {
          "text": "I miss the shrooms burger meal too. That's part of my childhood. Neighbourhood had a small KFC outlet, I'd always order that while admiring at the chicky club freebies.",
          "score": 3
        },
        {
          "text": "And their roasted chicken leg. 🙁",
          "score": 2
        },
        {
          "text": "I mean it's extra ingredients and prep compared to... tenders burger lmao. Literally slap 2 breads and some sauce around chicken tenders and charge you double for the 'burger'.",
          "score": 2
        },
        {
          "text": "That was great. I also really liked McDonald's grilled chicken mcwrao. People think I am crazy but their grilled chicken was delicious. Now it's all just more fried chicken batter which is inferior to me.",
          "score": 1
        },
        {
          "text": "Me too! It was the only thing I’d get from there",
          "score": 1
        },
        {
          "text": "KFC for breakfast. Wild.",
          "score": -30
        }
      ]
    },
    {
      "id": "t3_1quhq8a",
      "subreddit": "askSingapore",
      "title": "Has anyone heard of Red Alpha Cybersecurity?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1quhq8a/has_anyone_heard_of_red_alpha_cybersecurity/",
      "score": 23,
      "num_comments": 41,
      "created_at": "2026-02-03T04:01:49",
      "selftext": "They have earn and learn programs although there is a selection process. They guarantee a job placement after the training as well. I would like to know if anyone has heard of them? If yes, what do you know and what are your thoughts?",
      "comments": [
        {
          "text": "They used to only do network security and OSCP cyber security. Now it looks like they have expanded to other disciplines as well. It’s good if you need a foot in the door, as they take care of placements for you. Otherwise if you’re confident of landing something by yourself, you can always opt not to take the bond.",
          "score": 22
        },
        {
          "text": "I’ve explored it before but they couldn’t answer me placement at what salary after the course. It’s like a 3 year bond without in knowing what, where and how much.",
          "score": 15
        },
        {
          "text": "I’d say trend carefully with them. I went to their interviews and did their assessments, they are definitely looking for ppl with some IT background, like wireshark and programming. I won’t say their program is for those looking for career switching. Having said that, I’ve heard many bad stories where graduates without any IT background able to get OSCP and GCIH certificates, which are definitely no walk in the park, even with the “intense” training. For reference,https://pauljerimy.com/security-certification-roadmap/, these certs are above beginner level. And these graduates enter the companies unable to perform the work that they are “trained” for. To top it off, the CEO is from Israel cybersecurity industry, so, it’s just sus.",
          "score": 11
        },
        {
          "text": "Have a friend in there. They want some basic understanding first, then they will send you for training. Training is by professionals, some flown in from overseas, then get some minimum certs like OSCP. You will be tied under something like a bond as part of the training cost and be sent to work with their clients, or they will apply to roles on the market for you and will take a cut of the salary. Your bond period will not start counting down until you get a role, meaning you can be put on bench and not working off your bond.",
          "score": 10
        },
        {
          "text": "they legit. if u gotten your p200 or web300 already I got employment waiting for u",
          "score": 6
        },
        {
          "text": "heard getting accepted was difficult. went to the interview myself; can confirm i think they were either looking for people who were already cybersec literate or a prodigy. assessments leading up to it are cakewalk because they claim to accept applicants without a cybersec background. in reality i think the students they bring on might be the ones making the school. 🤷‍♀️ if you want to know more about my experience my dms are open!",
          "score": 6
        },
        {
          "text": "I went to their interview as well and can confirm, these guys are grepping for unicorn. Suspect they will only accept those who very likely could get hired even without their placement support.",
          "score": 6
        },
        {
          "text": "Yes it is. Although the subcon company can also raise the salary slightly after some time.  Source: 1st hand info.",
          "score": 3
        },
        {
          "text": "Just go take it yourself no need RA",
          "score": 3
        },
        {
          "text": "You dont need to have cyber background but need to show interest and the ability to understand concepts. Salary depends on the job you get, they can help place you using their connections. They get a cut from your salary. If you are already in IT, its not worth but if its a career switch then maybe its a good idea.",
          "score": 2
        },
        {
          "text": "That explains why, when I went for the interview, 90% of the staff I saw including the interviewer appeared to be Israeli. (I played a bit cb and convinced a random person to walk me right into the working area where all the monitors were visible from the entrance. Social engineering LOL) I was pretty surprised because I had applied for CCTP under CSIT. Had not expected Mindef to use foreign trainers to such an extent.",
          "score": 1
        },
        {
          "text": "Does a bond mean the salary remains the same for 3 years?",
          "score": 1
        },
        {
          "text": "Did your friend get paid during the trainee period too? Cause that’s what’s stated on the website",
          "score": 1
        },
        {
          "text": "You get an allowance but not very high",
          "score": 1
        },
        {
          "text": "Ahh okay.",
          "score": 1
        },
        {
          "text": "not easy, unless you have experience as software developer and a nack for stirring shit.",
          "score": 1
        },
        {
          "text": "Sorry what’s p200 & web300 💀",
          "score": 1
        },
        {
          "text": "But also, it’s not their security program I am looking at. It was their software engineering",
          "score": 1
        },
        {
          "text": "I went to their interview and received riddles as part of their interview. The interviewer also seemed not interested. Didn't have a good experience with it.",
          "score": 1
        },
        {
          "text": "AMA is ask me anything session?",
          "score": 1
        },
        {
          "text": "Alright. Thank you for the info!",
          "score": 1
        },
        {
          "text": "I’m not sure too but they have a support email that’s helpful.",
          "score": 0
        },
        {
          "text": "Thank you for the info :)",
          "score": 0
        },
        {
          "text": "that is the cert from oscp that red alpha trains you to pass. yes the skull icon indeed if you had to ask. you not so ready for this industry",
          "score": 0
        },
        {
          "text": "Yea I have loads to learn",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1quqzed",
      "subreddit": "askSingapore",
      "title": "Advice on handling difficult working dynamics",
      "url": "https://old.reddit.com/r/askSingapore/comments/1quqzed/advice_on_handling_difficult_working_dynamics/",
      "score": 21,
      "num_comments": 12,
      "created_at": "2026-02-03T12:45:44",
      "selftext": "Seeking advice if you’ve been through something similar. I’ve only been working for 3 years with 1 job change, so I’m not too experienced in this realm.\n\nContext: I moved to this new company in Dec 2024, hired by my current boss. My boss and I get along very well, we think the same way, operate similarly, and it’s overall been a good experience.\n\nToday, my boss told me that he’s looking to retire early and planned to leave in early 2027. Taking over him will be one of my senior colleagues in our team.\n\nMy senior colleague is by no means a bad/toxic person, but our working styles are just totally totally different. They’re more on the micro-manager & perfectionist side, and don’t really tolerate minor mistakes.\n\nThis has led to occasional scoldings by them, which doesn’t really make me feel too good. I also can’t shake the feeling that maybe because we’re so different, they wouldn’t actually want me to work for them when they take over, but yet they can’t just fire me, and that whole situation stresses me out, because I know I’m not wanted there.\n\nIssue: I promised my current boss that I’d stay at least 2 years when I took the role, and I also intend to abide by that as I want to work with him in his final year, but that also leaves me a very very tight window to secure a job, which isn’t the easiest.\n\nIn the event I can’t secure another role before my senior colleague takes over, anybody has any advice on how they would deal with it?\n\nI know tahan is one way, but just fills me with anxiety.\n\nAlso, I can’t just leave my job without securing another job due to financial needs.\n\nTIA!!",
      "comments": [
        {
          "text": "What if your boss is nice to you cuz he knows the senior is keeping you in check. Like last time bmt the enciks always nice nice play the good cop to the recruits but actually behind the scene always fk the sergeants upside down.",
          "score": 26
        },
        {
          "text": "You will encounter plenty of micromanagers in your career, so you might as well figure out how to work with one now. One way to deal with a micromanager is to micromanage upwards. Proactively communicate your tasks, plans, schedules, progress, etc. Set up reoccurring meetings to review/approve work and expectations. This may feel like unnecessary busy work, but it takes very little effort/time and could have major benefits. Sometimes, this kind of meticulous behavior will build up trust and they will pull back from micromanaging you. Or, they will appreciate the effort and value your contributions more. Having said that, often times when someone gets promoted to a higher role, they don't have the time to micromanage anymore. They are too busy learning their new responsibilities, so you might be stressing yourself out over nothing. Instead of worrying needlessly, you should probably focus on your own quality of work and position yourself to fill the senior role that your colleague will be vacating in his promotion.",
          "score": 14
        },
        {
          "text": "Been in a similar situation, also 3+years of working experience with 1 job change. My ex-boss/mentor is someone I looked up to, competent and excellent leadership with patient guidance to his subordinates. Delivered results, handled difficult problems, won awards and gave me many learning and exposure opportunities throughout the 2 years. However, he wasn’t selected for promotion despite being the best performer in the department because he was relatively “new” while there were old birds around. In the end, his exit was inevitable and that prompted me to look for my way out even before his eventual departure. New department in the same company, but this time the supervisor is the exact opposite. I recalled my 6 months being so terrible as I often just broke down without even being able to pin-point a reason. I hated going to work every single day and eventually called it quits after the bonus deadline. When you got to leave, you got to leave. In every workplace there is bound to be an asshole or two, just start looking for a job now and exit when the time is right (even before your current boss retires). Give him a good explanation and I am sure he will be understanding if it really means well for you. People come and go in life. Don’t let it affect what you think you need to do.",
          "score": 7
        },
        {
          "text": "Maybe u can try communicating and finding common ground w him. He might understand u better Many a times, lots of incidents occur out of lack of communication and proper conveying of the messages. If it really affects u that bad u can always take leaves and hold out until u find another job. It’s not even that bad of a situation from what I see. U can also ask for other colleagues for help if ur company culture allows for that or other bosses idk if u only have 1 but I guess I have seen a quite a number of a lot worse situations younger than 22",
          "score": 5
        },
        {
          "text": "Sorry bro, i dont know where u from but everyone is bad cop in my army exp",
          "score": 4
        },
        {
          "text": "I had a similar situation before. In the end, I never expected to learn so much from the senior colleague who took over my ex boss, who retired. Either you keep an open mind, or leave for another job. It's just a job, don't stress over it. 5 years down the road, you won't remember this day.",
          "score": 3
        },
        {
          "text": "itll be a good learning experience and make you a better person. always double check your work and not make small mistakes. if you behkan, just leave.",
          "score": 2
        },
        {
          "text": "Why you mind he scold you? Who is he? He can talk like damn cheebye but it is his mouth and my ears. Just auto-process out all the kpkb parts. Who cares if you are not wanted as long as the check cashes in every month. Then you know he going to fuck you for performance review already, so you just lanlan suck thumb and start finding a new job.",
          "score": 2
        },
        {
          "text": "If they can’t fire you, and if you’re drawing a decent salary, stay and learn to be indifferent to people with different opinion or working style. Good bosses can be hard to come by.",
          "score": 1
        },
        {
          "text": "Leave bah. It’s every man for himself",
          "score": 1
        },
        {
          "text": "Even if you change job you’ll still end up having to deal with micromanagers unless you get an Ang Moh boss.",
          "score": 1
        },
        {
          "text": "When you made your promise, you didn't know your boss will be retiring in early 2027. I would say it's fair game to not keep to it. That aside, your senior colleague doesn't sound like a bad person to work with. It's also not a guarantee that you'd find a different manager who will totally fit your style, and you'd benefit from working with very different people early on in your career to help you figure out what works for you, what you can adapt to, and what are strictly no-gos. I'd suggest for you to give it a try, but start looking out if there's no hope of it turning out right.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qulii3",
      "subreddit": "SingaporeRaw",
      "title": "Our unbothered king 👑",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qulii3/our_unbothered_king/",
      "score": 471,
      "num_comments": 62,
      "created_at": "2026-02-03T07:23:46",
      "selftext": "",
      "comments": [
        {
          "text": "Kindergarten politics",
          "score": 341
        },
        {
          "text": "Still helping people regardless, all good",
          "score": 139
        },
        {
          "text": "Damn boliao exercise",
          "score": 126
        },
        {
          "text": "Because our leaders all have kindergarten mindset",
          "score": 123
        },
        {
          "text": "Can the government publish - cost of conducting the original COI, all the hearings in court, and the final 2 hours in parliament? I asked an AI chatbot, and they suggested that 2 hours of hearing in court would cost $2 million on its own! The true offense is how callous our government is in spending money for a non-issue.",
          "score": 69
        },
        {
          "text": "Same row, the view is almost the same or maybe even better. It's like sitting on the reserved seat and then shifting to one of the other non-reserved seats beside it when it's available at the next stop. Less stress but still seated.",
          "score": 56
        },
        {
          "text": "finally for PS  - dont need to keep seeing Useless Wong ugly face directly",
          "score": 53
        },
        {
          "text": "Imagine all the drama and cost, just to move him 2 seats away",
          "score": 34
        },
        {
          "text": "The whole saga itself makes this pale in comparison",
          "score": 32
        },
        {
          "text": "You say some more. I send you to the back then you know. Call your parents some more",
          "score": 22
        },
        {
          "text": "Not the same, now Pritam Singh is seated at an angle to the PM, easier to shoot staple bullets from the side",
          "score": 21
        },
        {
          "text": "I DON LIKE U EVEN MORE , u sit further away from me pls! --- PAP",
          "score": 18
        },
        {
          "text": "Petty",
          "score": 16
        },
        {
          "text": "And if Rayeesa is actually planted.",
          "score": 16
        },
        {
          "text": "Just pap",
          "score": 9
        },
        {
          "text": "It’s natural for children to behave childishly.",
          "score": 9
        },
        {
          "text": "dont insult our kindergarten kids",
          "score": 8
        },
        {
          "text": "Of course she’s planted, she‘s a plant, a vegetable",
          "score": 7
        },
        {
          "text": "They should have a kpi on growing tax payer money and publishing it annually like how corporation publish balance sheet,  income statement, P&L. They asked to be paid to private mnc CEO salaries, so they should act like one.",
          "score": 4
        },
        {
          "text": "My fellow Singaporeans",
          "score": 4
        },
        {
          "text": "More like My fellow fake Singaporeans…",
          "score": 3
        },
        {
          "text": "same with office politics. everyone becomes kids in the office.",
          "score": 1
        },
        {
          "text": "Actually you'll be surpised, international politics resembles more like kindergarten politics than rational reasoning",
          "score": 1
        },
        {
          "text": "\"Who who who\" are u taking about huh",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qup403",
      "subreddit": "SingaporeRaw",
      "title": "Got scolded for helping an uncle while in my gym clothes",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qup403/got_scolded_for_helping_an_uncle_while_in_my_gym/",
      "score": 288,
      "num_comments": 87,
      "created_at": "2026-02-03T11:06:50",
      "selftext": "I am shaken and super annoyed so i just need to rant here.\n\nSo i just finished my lower body day at the gym (was literally drenched in sweat lol) and was waiting for the bus home at the stop near novena.\n\ni was wearing my usual gym fit, active cropped tank top and high rise lined shorts. Anyway, this frail uncle comes up to me looking damn lost. He holds up his appointment card and asks me in Chinese how to get to tan tock seng. i could tell he was quite anxious so i spent a few mins checking the bus routes on my phone and explaining to him which stop to alight at.\n\nThen suddenly this middle-aged lady walks past, looks me up and down with the most disgusting face, and literally says out loud: \"Young girls nowadays no shame, dress like this come out and then still want to disturb old man.\"\n\nHUH??? i was literally just helping him? The uncle looked so confused and i was just stunned like vegetable. i didn't even have the energy to fight back cuz my legs were jelly from the workout, so i just ignored her, but she kept tsk-ing until she boarded her bus.\n\nLike i’m literally just existing in my gym clothes and doing a good deed? Since when did wearing a tank top and shorts become disturbing people? i feel bad for the uncle cuz he wasn’t feeling well and couldn’t explain himself and he thought he did something wrong too.\n\nReally upset. Tried to be a helpful person and still get slut-shamed by people. Apparently wearing gym clothes in public and taking to an uncle at same time is a crime now",
      "comments": [
        {
          "text": "You should reply “Old ladies nowadays no shame, don’t know how to keep their mouth shut and only know how to talk.”",
          "score": 422
        },
        {
          "text": "Siao auntie venting her jealousy, thinking she is mina sue from singles inferno",
          "score": 144
        },
        {
          "text": "“Stunned like vegetable” what is this, 2011? 😃",
          "score": 90
        },
        {
          "text": "She just jealous. You should be proud of your body.",
          "score": 79
        },
        {
          "text": "Stop bullying us millennials T_T",
          "score": 59
        },
        {
          "text": "Just an auntie with issues, nowadays siao lang many many. Don't let her live rent free in her head.",
          "score": 58
        },
        {
          "text": "How about this version for a reply? \"Old ladies nowadays no shame, so old yet still don't know how to satisfy their old man and only know how to be jealous of young women.\"",
          "score": 53
        },
        {
          "text": "Ask her kp what? Jealous because her own are sagging?",
          "score": 41
        },
        {
          "text": "That's not too... wait that was 15 years ago wtf",
          "score": 19
        },
        {
          "text": "I second this comment. But I know how it feels la. Last time I went to a Toa Payoh coffee shop with my boyfriend and we were holding hands. Not even holding waist, but holding hands. Then got this siao lang cleaner auntie followed us all around the coffee shop accusing us of indecency, even after we stopped holding hands, found a table and started eating. She stood at her cleaning bay staring at us and shouted about how nowadays young people all indecent. Lol. All those other couples saw us kena tekan they also dont dare to hold hands. And from then on I didnt go back to the toa payoh coffeeshop to eat my favourite mee hoon kueh cos didn't want to see her. I was so aggrieved, so pekcek and embarrassed I wanted to find the contact of the coffee shop operator to complain lol. But life is liddat lor, sometimes suay to meet such people. Vent and let it go.",
          "score": 17
        },
        {
          "text": "Tell her to stfu stand up for yourself",
          "score": 16
        },
        {
          "text": "Savage, I was being very nice about it.",
          "score": 11
        },
        {
          "text": "Auntie is mad jealous. Sorry you had to go thru this and some of the comments here are not it!",
          "score": 10
        },
        {
          "text": "Hey - auntie also work out okay! She did all that mental gymnastics in a matter of seconds!",
          "score": 10
        },
        {
          "text": "Just ignore the auntie. Please continue to wear what u do i like to enjoy the view",
          "score": 10
        },
        {
          "text": "Bench her!",
          "score": 8
        },
        {
          "text": "nnp",
          "score": 7
        },
        {
          "text": "Singapore is turning into a dementia ward. Everyone’s lost or hostile.",
          "score": 6
        },
        {
          "text": "omg don’t let her stop you from eating your fav MHK!! :-((",
          "score": 3
        },
        {
          "text": "CB if me i will la ji with my partner right in front of her. LOL",
          "score": 3
        },
        {
          "text": "That old hag is just salty. Don't give a fk about her.",
          "score": 3
        },
        {
          "text": "Auntie no figure thats why jealous.",
          "score": 3
        },
        {
          "text": "Indeed",
          "score": 2
        },
        {
          "text": "Which coffee shop?",
          "score": 1
        },
        {
          "text": "What is sagging",
          "score": -16
        }
      ]
    },
    {
      "id": "t3_1quo36a",
      "subreddit": "SingaporeRaw",
      "title": "Yar call out the riders",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1quo36a/yar_call_out_the_riders/",
      "score": 106,
      "num_comments": 49,
      "created_at": "2026-02-03T10:05:43",
      "selftext": "",
      "comments": [
        {
          "text": "so is anybody going to launch an investigation to verify if her story is true?",
          "score": 75
        },
        {
          "text": "Can she backed up her account of her story? Or its jus something she pulled out from thin air? MHA needs to check on all the cctvs to verify her story to prevent another lie being told in court. *I am not a pmd/PMA user. I walk fine. I am totally against the use of mobility devices by able bodied users. I jus want the rules to be applied equally to all parties.",
          "score": 42
        },
        {
          "text": "What she said might not be true but is something we see every day no. So she call out these idiots, you kp. Don’t call out, also kp. Diam la.",
          "score": 36
        },
        {
          "text": "she not opposition of course won't la.",
          "score": 23
        },
        {
          "text": "Yes please, need enforcement action on such riders. Another group of riders would be delivery riders - whom zoom in and out of traffic at their convenience and at traffic junction.",
          "score": 22
        },
        {
          "text": "Don't need cuz she never accused govt body. If she said she saw LTA officers not bothering them that one will kana",
          "score": 14
        },
        {
          "text": "Spent time and effort writing that crap down and i wonder how many times she practised in front of the mirror before. Lame. If only they bother to put actual effort into their MP duties instead of acting using well-rehearsed scripts.",
          "score": 6
        },
        {
          "text": "Oh man the timeline is so telling. She said she saw the incident a few years ago, I see YPs scooting in their mobility devices almost on a weekly basis with no regards to road safety and the pedestrian on the pathways.",
          "score": 5
        },
        {
          "text": "Lol. Well she didn't undermine trust in the law enforcement.",
          "score": 4
        },
        {
          "text": "So the question is why didn’t LTA step up their enforcement?",
          "score": 4
        },
        {
          "text": "Knn this one many wayang",
          "score": 4
        },
        {
          "text": "Circle fap in progress, just leave them to jizz huh. 🫠",
          "score": 3
        },
        {
          "text": "They should be banned",
          "score": 3
        },
        {
          "text": "I have also seen people who do not look disabled ride PMDs. Worse when they take their PMDs inside public transport, inconveniencing other commuters including people who are truly disabled.",
          "score": 3
        },
        {
          "text": "Lol it's true lah.i don't doubt. But what's the big deal of her seeing it \"personally\" or \"chase them down\"? Or the need to \"illustrate\"? She knows it's 1 example. She verified \"able bodied\"?  Don't need to make yourself look good. Don't need to say anything like that. This is not good quality.",
          "score": 3
        },
        {
          "text": "💀",
          "score": 1
        },
        {
          "text": "Nope",
          "score": 1
        },
        {
          "text": "only speaking up when it happened to her ? .hehe",
          "score": 1
        },
        {
          "text": "Reference to Reesah Khan and Pritam Singh case.",
          "score": 1
        },
        {
          "text": "Full enforcement only starts in 2029. Good luck. Haha she say it was fortunately the only time but also say witness many instances? Pick one.",
          "score": 1
        },
        {
          "text": "Talk in Parliament got use meh? Do something about it, take action.",
          "score": 1
        },
        {
          "text": "I like what is coming out of her mouth.",
          "score": 1
        },
        {
          "text": "Next up on the agenda should be tougher drug/traffic laws",
          "score": 1
        },
        {
          "text": "Hearsay Storytelling haha",
          "score": 1
        },
        {
          "text": "It is not uncommon to see overload PMD. Also 3 person on PMD few days ago",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qun5un",
      "subreddit": "SingaporeRaw",
      "title": "Prediction of the upcoming new-norm.",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qun5un/prediction_of_the_upcoming_newnorm/",
      "score": 98,
      "num_comments": 31,
      "created_at": "2026-02-03T09:06:37",
      "selftext": "",
      "comments": [
        {
          "text": "Blardy worse their dirty rag drips water into your other plate of food",
          "score": 29
        },
        {
          "text": "<image>",
          "score": 19
        },
        {
          "text": "wa i feel a bit peeved while making this meme. alot of folks will be gathering at hawker center trying to get your empty cans like vultures.",
          "score": 17
        },
        {
          "text": "If they ask politely sure. If they hover or are rude about it, I'll just keep the can.",
          "score": 11
        },
        {
          "text": "Sad af for the 2nd or 3rd richest country in the world doing this for 10 cents",
          "score": 7
        },
        {
          "text": "Blardy worse their dirty Rag drips water into your Other plate of food - Downtown-Top-6603 I detect haikus. And sometimes, successfully.Learn more about me. Opt out of replies: \"haikusbot opt out\" | Delete my comment: \"haikusbot delete\"",
          "score": 6
        },
        {
          "text": "What lj?",
          "score": 6
        },
        {
          "text": "Fucking worst their armpit actually DRIPS into the fucking drink as a combo to enhance the IncredibleTM taste",
          "score": 5
        },
        {
          "text": "all the uncles will be forming CAN DRINK TRIAD!! GIVE ME UR CAN DRINK ! MY TERRITORY!! bLABLA",
          "score": 4
        },
        {
          "text": "Remind me of the usual 喝完 喝完, except it’s elderly asking you.",
          "score": 4
        },
        {
          "text": "Only scholars can concoct this kind of lanjiao scheme",
          "score": 4
        },
        {
          "text": "They'll drip it on/in your can to make sure you ain't touching whatever is left. *inspired by that one time a cleaner grabbed the styrofoam plate with her plastic gloved hands while there were still chicken wings on it while asking us if we still wanted it.",
          "score": 3
        },
        {
          "text": "You will see folks hoarding the reverse vending machine like yesteryear. Some people are just too bored.",
          "score": 3
        },
        {
          "text": "bring own water bottle👍💓⭐",
          "score": 3
        },
        {
          "text": "I mean, most if not all of the EU is doing this, alongside the US, all 1st world country/regions This is definitely nothing new in general - but its new to Asia (to my understanding), and its 10 cents per can, so it does add up",
          "score": 3
        },
        {
          "text": "It applies to cans and bottles. So everyone is a target now. Just buy packet drinks.",
          "score": 3
        },
        {
          "text": "Really lousy implementation sia. Knn",
          "score": 3
        },
        {
          "text": "Ill tell anyone asking me for mine before I finish drinking to kindly fuck off",
          "score": 3
        },
        {
          "text": "One of the best from this haiku bot",
          "score": 2
        },
        {
          "text": "Or some old birds with no real life experience apart outside of government environment.",
          "score": 2
        },
        {
          "text": "What happen i am lost",
          "score": 2
        },
        {
          "text": "knn rly zuo bo",
          "score": 2
        },
        {
          "text": "Starting 1 April 2026, Singapore will implement a Beverage Container Return Scheme where consumers pay a 10-cent deposit on plastic bottles and metal cans (150ml to 3L). The 10¢ deposit is fully refunded when empty, marked containers are returned to over 1,000 designated machines at supermarkets and public areas.",
          "score": 1
        },
        {
          "text": "I predict there will be fights.",
          "score": 1
        },
        {
          "text": "10 cents leh, dont play play",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qvcf2m",
      "subreddit": "SingaporeRaw",
      "title": "Oh my ...... You know, you know ..... (shocking)",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qvcf2m/oh_my_you_know_you_know_shocking/",
      "score": 52,
      "num_comments": 21,
      "created_at": "2026-02-04T02:40:15",
      "selftext": "",
      "comments": [
        {
          "text": "Tharman in the middle?",
          "score": 21
        },
        {
          "text": "Epstein was super influential. Nothing surprising. You have Bill Clinton in this image",
          "score": 18
        },
        {
          "text": "Yes, seated right next to paedo Jeffrey Epstein",
          "score": 11
        },
        {
          "text": "Wa not bad jin satki even the ang moh standing.... If only he the PM , sg get another golden age.",
          "score": 8
        },
        {
          "text": "Clearly didn’t help GY. lol",
          "score": 7
        },
        {
          "text": "Is that who I think he is?",
          "score": 7
        },
        {
          "text": "No need to worry. Only white Caucasians were invited to Epstein island.",
          "score": 7
        },
        {
          "text": "Exactly. Unless they have incriminating images like what Prince Andrew has, a lunch or dinner isn't anything surprising.",
          "score": 3
        },
        {
          "text": "Epstein actively seeks people of influence all over the world. Even those who are still in school and have great potential. This is a nothing burger",
          "score": 3
        },
        {
          "text": "\"Tan Kia Gan left me completely alone. Except coming to think of it, he did try to interfere and influence me in giving a tender contract to one... or trying to get me to agree to one of his friends coming in as a tenderer and give special concession to him. Well, under false pretext, he brought me to lunch and (I) met with these people. After the first meeting, I told him, \"Next time, if you want to bring me to lunch and you are having with these people, tell me\". I refused to go because I knew they were up to no good. And then, there was an instance where he wanted me to award a certain contract, and I said, \"No, my recommendation is this, and if you don't like\" (Now, coming to think of it), \"as a minister, you have the right to override it\". But it never occurred to me he was up to something fishy. Only maybe well, as a friend, he was helping you see. That's all\" Lim Kim San, Oral History Interview — HDB Chairman and Minister for several portfolios during his tenure.",
          "score": 3
        },
        {
          "text": "JE is everywhere \nThat man must have been so busy that I wonder how he had time to play with young ladies too",
          "score": 2
        },
        {
          "text": "Dont think too much lah. One of my reservist mate was convicted of being a loanshark runner a few years after we had a dinner. We even took a group photo. Does that mean anything? LMAO",
          "score": 2
        },
        {
          "text": "There are non-white Caucasian eh?",
          "score": 1
        },
        {
          "text": "Those mix type lor.",
          "score": 1
        },
        {
          "text": "Will there be an enquiry into tharman if he is being brought up in the Epstein files?",
          "score": 1
        },
        {
          "text": "Will there be a comittee form to investigate this? Or is that only reserved for opposition?",
          "score": 1
        },
        {
          "text": "More than likely tharman will lawyer up and the rest of the parliament will make it difficult to look into these scandals.",
          "score": 1
        },
        {
          "text": "Is this pic from the epstein files?",
          "score": 1
        },
        {
          "text": "Epstein island better than tekong right?",
          "score": 1
        },
        {
          "text": "<image>",
          "score": 1
        },
        {
          "text": "Need a lesson from NCM",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qusbs0",
      "subreddit": "SingaporeRaw",
      "title": "Personal mobility scooters to be restricted to those with a medical need or above age 70 from June",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qusbs0/personal_mobility_scooters_to_be_restricted_to/",
      "score": 42,
      "num_comments": 5,
      "created_at": "2026-02-03T13:46:03",
      "selftext": "",
      "comments": [
        {
          "text": "Nothing will change by this time next year. Everyone will learn how to evade the rule.",
          "score": 29
        },
        {
          "text": "https://mothership.sg/2024/03/speed-limit-of-pmas-in-spore-to-be-lowered-from-10kmh-to-6kmh-around-2025/ https://www.channelnewsasia.com/singapore/pma-regulations-medical-certificate-speed-limit-pmd-4977986 initially, tell us to be around 2025, then extended to Q1 2026, then delay to jun 2026... can PAP gov be trusted? on top of that, you can still use the pmd / pma till end of 2028 (as long as you don't get caught), who is going to enforce it?",
          "score": 17
        },
        {
          "text": "Stop beating around the bush and ban all PMA/PMDs except electric/motorised wheelchairs, aiding the mobility needs of sufferers.",
          "score": 5
        },
        {
          "text": "“After that on the 4th they say on the 5th start. Then what’s the name? Lam Pin Min ah? LAM PA!”",
          "score": 1
        },
        {
          "text": "instead of banning, create infrastructure for it. Other countries ride scooter, we ride PMA/PMD. We will solve the high COE and congestion issue",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1quwgpa",
      "subreddit": "SingaporeRaw",
      "title": "🤣🤣🤣🤣🤣🤣",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1quwgpa/_/",
      "score": 37,
      "num_comments": 5,
      "created_at": "2026-02-03T16:25:09",
      "selftext": "",
      "comments": [
        {
          "text": "Number 1 priority - fix oppo complete ✅ Best part of this whole nonsense is that it’s finally over, dumb as fuck",
          "score": 5
        },
        {
          "text": "She already waive her silver passion card at the election, and stop dying her hair. She already telling them she's retiring and being Mrs Quah.",
          "score": 2
        },
        {
          "text": "Indranee pissed off that oppo still so happy go lucky",
          "score": 2
        },
        {
          "text": "It is? I thought they wanna go after Sylvia?",
          "score": 1
        },
        {
          "text": "Seriously, and I mean seriously. WTF for? How about stripping Pritam of his MP seat and calling for a by-election? Let's see how far it will go. Parliament has better things to do.",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qul43h",
      "subreddit": "SingaporeRaw",
      "title": "“Distance-based charging is something that we will continue to study and explore after motorists have gotten more used to the new system and the situation is more stable,” he said.",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qul43h/distancebased_charging_is_something_that_we_will/",
      "score": 29,
      "num_comments": 58,
      "created_at": "2026-02-03T07:00:48",
      "selftext": "Wa now if you just anyhow drive around also will cost money? so not just you pay for the petrol or the EV charging, u also have to pay of distance drove ?",
      "comments": [
        {
          "text": "This govt is certainly trying their best to increase the cost of living. Distance based ERP doesn't affect only private cars. PHVs, buses, last mile delivery vehicles are going to be the worst hit since they clock the most mileage. Everyone ready for another round of transport fare hike? Or even more expensive delivery charges?",
          "score": 71
        },
        {
          "text": "i don't know why pple still support the G after so many moves that didn't make sense but heap hardship on pple. the double gst hike, useless obu, simply go back, crazy rise in property prices and hawker rental, the education tuition rat race, the 10c recycling hike, carbon tax, Temasek and GIC dismay performance, health care crunch, transport breakdown.",
          "score": 54
        },
        {
          "text": "Going all out to milk Singaporeans out of every cent. To do this means driving up transportation and logistics cost, further adding to cost of living. A opposite direction to what they promised to manage cost of living.",
          "score": 36
        },
        {
          "text": "A opposite direction to what they promised to manage cost of living. Never judge the government by what they say but what they do",
          "score": 16
        },
        {
          "text": "Not all of us, but at least 65%",
          "score": 14
        },
        {
          "text": "I don’t want to sound like a anti establishment person but how the F is this going to control congestion? \nSo if I am stuck in the congestion, can i magically teleport my car to non congested road? \nHow about traffic jam due to incidents or accidents. I think we need more clarity to this. The ERP did not stop the traffic congestion, it just created another income stream for government that’s all.",
          "score": 14
        },
        {
          "text": "Well, don't complain- we get the govt we deserve. Surely, at GE,  everyone knew that all prices will go up & that the one thing all the scholars know best is to create new methods to milk us.   After all, isn't that what we are - a herd of money cows to be milked continually till death? Singapore Inc.",
          "score": 13
        },
        {
          "text": "'What's wrong with collecting more money'??? INTENSIFIES!!!",
          "score": 10
        },
        {
          "text": "65% would gladly bend over to get banged hard over and over again",
          "score": 9
        },
        {
          "text": "\"The ERP2 system allows the authorities to introduce new toll charging points without having to install large and expensive physical gantries, he said, adding: “We can also spread out ERP charges in smaller amounts across several locations, rather than at one location. This will be fairer.”\" > Leaves carpark> BEEEEEEEEEP siao liao",
          "score": 9
        },
        {
          "text": "Yet most people don’t get it, blinded by the short term voucher solution.",
          "score": 7
        },
        {
          "text": "Next step is to penalise the basic stuff too. Perhaps even taking the lift also gotta pay ERP charges, as per Mr Brown’s infamous satirical piece that got him dropped byTODAYback in 2006. I understand the cost of building these roads is high, and the Government is relooking the financing of these big road projects. Silly me, I thought my road tax and COE was enough to pay for public roads. Maybe we can start financing all kinds of expensive projects this way in future. We could build upgraded lifts for older HDB blocks, and charge tolls on a per use basis. You walk into your new lift on the first floor, and the scanner reads the contactless casheard chip embedded in your forehead. This chip would be part of the recently-an-nounced Intelligent Nation 2015 plan, you know, that initiative to make us a smart nation? So you, the smart contactless-cashcard-chip-enhanced Singaporean would go into your lift, and when you get off at your floor, the lift would deduct the toll from your chip, and you would hear a beep. The higher you live, the more expensive the lift toll. Now you know why I started climbing stairs for exercise, as I mentioned in my last column. I plan to prepare for that day when I have to pay to use my lift. God help you if some kid presses all the lift buttons in the lift, as kids are wont to do. You will be beeping all the way to your flat.",
          "score": 5
        },
        {
          "text": "a lot of the older generation vote for PAP out of gratitude for what they have done in the past or out of fear of the unknown, but if you ask them what their thoughts about run away property prices, the cost of living, they are unhappy, yet they choose to vote this way. i tell them to vote on what they think the current trajectory or what is happening now or going to happen in the future, who we vote now dictates what happens in future, but sometimes it's very difficult as they have been brainwashed for so long.",
          "score": 4
        },
        {
          "text": "we get the govt we deserve <image>",
          "score": 4
        },
        {
          "text": "65% agree lor",
          "score": 3
        },
        {
          "text": "its not that 65% agree oh please dont keep blaming but other than a few candidates in WP which other opposition members in SG inspire any confidence? You look left look right ah",
          "score": 3
        },
        {
          "text": "The idea is to discourage you to drive at all (even when you have a car). ERP doesn't work because it is only for certain roads.",
          "score": 3
        },
        {
          "text": "Frog kena boil very happy haha",
          "score": 2
        },
        {
          "text": "Most don't bother reading the news unless it directly affects them. I'm on my journey to share more of such articles to my elders",
          "score": 2
        },
        {
          "text": "like US saying no choice but trump as competitor is a black woman?",
          "score": 1
        },
        {
          "text": "actually elections is a numbers game, there is virtually no way for the opposition to form the next G or take up important roles based on the way boundaries are drawn by EBRC, the number of candidates contesting. i understand fully that pple will void their vote or not vote for the oppo if they feel the candidate is not capable and that is correct philosophically, but probability and numbers wise, it's just endorsing the current G as elections is a pure numbers game, that is why the G can back door candidates in via the GRC method. in the 2011 election, even though the current G gained majority but the way they won was the lowest in a long time and it sent a signal to the G that pple are unhappy and it did made them rethink about their policies more. i think that's the point of the election, even if there are good or bad candidates inside, the current G will still form the majority, the current G will still push through their policies because they vote according to the party whip: ie. one voice, one outcome. even in the vote on the population white paper in 2014 on the push to 6.9mil, long time PAP MP (whom i respect a lot) Mr Inderjit Singh who disagreed to it, only dared to abstain from voting, with the majority, you guessed it, PAP voting for it with Party whip, one voice. the infinitely wise LKY was not sold on the population hitting 6.5mil, https://lkyspp.nus.edu.sg/docs/default-source/ips/st_mm-not-quite-sold-on-idea-of-6-5m-population_020208.pdf 'I have not quite been sold on the idea that we should \nhave 6.5 million. \n'I think there's an optimum size for the land that we have, to preserve the \nopen spaces and the sense of comfort.' look at what happened to us now.",
          "score": 1
        },
        {
          "text": "Maybe the quality of opposition is getting shittier too?",
          "score": 1
        },
        {
          "text": "There are also many hidden ways for pap to increase taxes and fees. For instance, Annual Values of properties are based on the estimate of the gross annual rent a property can command. Which then become the property tax payable. So when the govt brings in more foreigners and the rentals go up... Your owner occupied property tax goes up as well?? Like Wtf? Oh that's why they throw out a scrap by giving 10% off... Lol.",
          "score": 1
        },
        {
          "text": "Taking more from you so voucher man can do his thing.",
          "score": 1
        },
        {
          "text": "i still remember the trace together days. Go to the mall then need to scan QR code for what fuu--",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qujahf",
      "subreddit": "SingaporeRaw",
      "title": "Jail for ex-watch shop employee who cheated 14 people of nearly $495k for luxury watch purchases",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qujahf/jail_for_exwatch_shop_employee_who_cheated_14/",
      "score": 29,
      "num_comments": 9,
      "created_at": "2026-02-03T05:19:57",
      "selftext": "",
      "comments": [
        {
          "text": "What I've learned from these white collar theft cases -- if your salary/earning potential is <$150K/year, it's a solid tradeoff.",
          "score": 9
        },
        {
          "text": "500k for 50 months. Worth it?",
          "score": 7
        },
        {
          "text": "More like 33 mths with good behaviour which is often the case for white collar crimes.",
          "score": 5
        },
        {
          "text": "Might as well go in for something big right... Come out can do tiktok and get a chance to become influencer.",
          "score": 3
        },
        {
          "text": "Pui Pui going in to Changi chalet for dieting",
          "score": 2
        },
        {
          "text": "Time seems kind of weak though",
          "score": 2
        },
        {
          "text": "输贱困",
          "score": 1
        },
        {
          "text": "He paid off all the money back to victim? Cos the sentence are not too harsh..",
          "score": 1
        },
        {
          "text": "already get caught. If i am him, i wont even pay. The reduction at most 1 yr.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qvbwi8",
      "subreddit": "SingaporeRaw",
      "title": "What in the crossover episode",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qvbwi8/what_in_the_crossover_episode/",
      "score": 28,
      "num_comments": 15,
      "created_at": "2026-02-04T02:17:11",
      "selftext": "",
      "comments": [
        {
          "text": "Why does this gives the same vibe as the photos of some ministers with the Fujian gang? But inside there are Tharman, Prof Tommy Koh, George Yeo and Bill Clinton too if I saw correctly??",
          "score": 13
        },
        {
          "text": "They have the money. Plus you can't get any info on Epstein that he was committing crimes. Even he commit crimes, it did not align with Singapore laws.",
          "score": 10
        },
        {
          "text": "This was in 2002 before when Epstein was convicted (2008) for sex trafficking. Other than that he was a pretty well-connected fixer in political high society and an alleged Mossad agent. Until we actually see GCT, George Yeo and Tharman on Epstein Island themselves, this was probably just Epstein tagging along withthen U.S.Former President Bill Clinton for adiplomaticprivate(?) visit.",
          "score": 7
        },
        {
          "text": "Yeah same can be said for the fujian gang leader",
          "score": 4
        },
        {
          "text": "This is just a picture.",
          "score": 3
        },
        {
          "text": "yall gotta understand this was a dinner. Nothing was proven that GCT was involved in what Epstein and Co did.",
          "score": 2
        },
        {
          "text": "his the best blackmailer of all time for Mossad. Most connected guy of all",
          "score": 2
        },
        {
          "text": "Any idea which restaurant was this photo taken?",
          "score": 1
        },
        {
          "text": "Read somewhere it was at The Fullerton. https://radaronline.com/p/photos-bill-clinton-jeffrey-epstein-ghislaine-maxwell-resurface-secret/",
          "score": 1
        },
        {
          "text": "Because he got wood",
          "score": 1
        },
        {
          "text": "Wtf how?? President and Epstein sitting side by side some more. Anyway why is Epstein in this photo is he some kind of political figure...",
          "score": 1
        },
        {
          "text": "\"Serial pervert\" is...talk about understatement of the century He is the kingpin of pedophilia lmao",
          "score": 1
        },
        {
          "text": "Mostly just like the fujian gang",
          "score": 0
        },
        {
          "text": "oh shit you're right",
          "score": 0
        },
        {
          "text": "Now watch as 0 charges are pressed against him...what a disgrace",
          "score": -4
        }
      ]
    },
    {
      "id": "t3_1qukxwv",
      "subreddit": "singaporefi",
      "title": "Car ownership: How do you guys do it? It's like a mystery to me.",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qukxwv/car_ownership_how_do_you_guys_do_it_its_like_a/",
      "score": 136,
      "num_comments": 259,
      "created_at": "2026-02-03T06:50:40",
      "selftext": "40+m here. My family, we have a car. It's kinda old now, paid most of it in cash (gift from FiL). Bought it at 90k in 2018. We're now shopping around for a replacement. But everywhere I turn, the prices are just ridiculous. After doing some calculations, we simply can't afford it, even though our combined income is at the HDB ceiling already. I thought of doing some of those 0 downpayment, driveaway deals. But the monthly payments are INSANE. We have to pay for ABCDEFG, tuition, bills, etc... There's nothing left to pay for car.\n\nTLDR; How do y'all afford a car in SG on a regular white collar salary?",
      "comments": [
        {
          "text": "alot of people who bought their cars in 2018-2020 pretty much accepted that they won't be getting a new one once coe ends",
          "score": 229
        },
        {
          "text": "Either be rich or be saddled with debt",
          "score": 74
        },
        {
          "text": "sure but it's more of the shock that the price you paid for the entire car back then will be a fraction of the current coe alone. had a good run time to take public transport lol.",
          "score": 41
        },
        {
          "text": "Can extend the COE for another 5-10 years? (Even that is crazy)",
          "score": 33
        },
        {
          "text": "Dont worry, most people like you. Car expiring liao cannot afford to get new one. Or buy 1 year left hope price drop next year. Truth is unless your salary increased as much as car prices from 2018 to now, you probably cannot afford it anymore.",
          "score": 33
        },
        {
          "text": "Working professional can afford 2",
          "score": 30
        },
        {
          "text": "Or be a working professional",
          "score": 19
        },
        {
          "text": "SL_ plater here. We are also entertaining the thought of going carless after coe expiry",
          "score": 18
        },
        {
          "text": "Yes imagine my coe was only 25k in 2018/2019.. The down payment was ok ok.  My monthly payments were only about $500. Now the cheapest new car model is about $150k. Downpayment is about 60? And monthly payments $1.2. .. omg",
          "score": 13
        },
        {
          "text": "Mostly in debt. Don’t be fooled by their outlandish lifestyle in social media.",
          "score": 13
        },
        {
          "text": ":(",
          "score": 11
        },
        {
          "text": "this is classic, can never forget that...",
          "score": 11
        },
        {
          "text": "Blame all those car sharing and car leasing . These company hoards cars make money by renting them back to ordinary ppl who cant afford cars now. Should put a cap on car ownerships for companies maybe upto certain amount of car or something.",
          "score": 8
        },
        {
          "text": "Even that working professional will need a side gig to afford a car nowadays; that's how much COE prices have increased since that remark.",
          "score": 8
        },
        {
          "text": "Yeah I thought of that also. Our car is actually in very good condition. But dat COE is like... bleargh",
          "score": 6
        },
        {
          "text": "well, you know the condition. renew for 10 years is the answer. unless you feeling rich and itchy then by all means. but the price is clear and you choose what you want to pay",
          "score": 5
        },
        {
          "text": "if its a japanese car, just renew COE. it brings down the overall depreciation by a ton and its like almost a guarantee it will survive the next 10 yrs",
          "score": 5
        },
        {
          "text": "truth bomb there man.",
          "score": 5
        },
        {
          "text": "my first coe was 500 😭😭 shelling out 40k to extend the next car into its 2nd coe for 5 yrs was 🫠🫠🫠🫠🫠",
          "score": 3
        },
        {
          "text": "“Everybody has a car, we have two…We are professionals, we need to travel.”",
          "score": 3
        },
        {
          "text": "yah man...",
          "score": 2
        },
        {
          "text": "This is the problem in sg. \"coe was only 25k\".\nNo bro. It's not monopoly money. That's cash that is literally burned n u get a piece of paper in return. As a parent that's money for my children, old age that's gone.\nThat's why I never bought in sg.",
          "score": 1
        },
        {
          "text": "I bought a 2nd hand car in 2020. I sold it in late 2024 at the same price. Essentially suffered zero depreciation, only paid operating costs the entire time.",
          "score": 1
        },
        {
          "text": "What was COE then (have been away from SC for a long time).",
          "score": 1
        },
        {
          "text": "basically double 🤔 someone on a salary of 6k in 2018 could possibly afford an altis. i do suppose someone on a salary of 12k in 2026 could also do that. yeah you're right",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qun9cq",
      "subreddit": "singaporefi",
      "title": "Is 1.3M SGD enough for a Singaporean to semi-retire at 40YO",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qun9cq/is_13m_sgd_enough_for_a_singaporean_to_semiretire/",
      "score": 84,
      "num_comments": 104,
      "created_at": "2026-02-03T09:12:47",
      "selftext": "This year 30, Just thought about retirement from corporate job after 10 years. I should be able to accumulate 1.3m SGD by 2036 if not early.\n\nAt withdrawal rate of 4.6% (60k SGD) yearly to cover expenses while letting the balance to grow at 7-8%. Mathematically it will last for the rest of my life if maintaining the same lifestyle. Did i miss anything here?\n\nI believe many have achieved this 1.3m milestone much earlier than the standard retirement age of 65Y, but not many choose to retire from corporate job as far as I know. Why not? Did I miss any perspective?",
      "comments": [
        {
          "text": "> Did i miss anything here? > letting the balance to grow at 7-8% This is probably the main issue. Are you able to withstand volatility, depending on the risk you take with your portfolio? > Did I miss any perspective? The perspective you are missing is that of the perspective of 'never having enough'",
          "score": 99
        },
        {
          "text": "7-8% is very high to assume. It's safer to assume 4-6% returns with withdrawal rates of 2-3%. This is on assumption that you are going for diversified investment and won't panic in crisis.",
          "score": 57
        },
        {
          "text": "60k today is not 60k in 10 years... You need to account for inflation. In 10 years you might need 80k to live the same way you did with 60k for example. It's not that simple. Also is house paid off or will be by then?",
          "score": 23
        },
        {
          "text": "Not just inflation, the older you are, especially 70 onwards you’ll need more supplements, wheelchair, better nutrition, dentures, helper. Also, contingency plan. Idk about you, but I don’t feel secure with today’s uncertainty in the world.",
          "score": 17
        },
        {
          "text": "Is 60k SGD enough for your needs in 10 years, time including 10 years of inflation? Assuming 3% p.a. inflation, that's more like 45k SGD in today's money. Do you have property to live in for the rest of your life? Buying property can put a big dent in your plans. Even if you can pay the mortgage entirely from CPF while you are working, once you stop working, the mortgage is going to have to come out of your 60k SGD withdrawal. And if you are renting, I doubt 45k SGD a year is going to be enough for expenses.",
          "score": 17
        },
        {
          "text": "Does your 1.3m SGD include or exclude a house? If exclude, can you live with the net amount after buying a flat? If you are 30 now, you need not ask the question on whether you can retire with $1.3m when you are 40. Just work hard, save more and invest your savings. Then when you are nearer to 40 e.g. 38-39 and evaluate your situation again.",
          "score": 15
        },
        {
          "text": "Don't be too anal about plans for the future because nothing about the future is guaranteed including reaching the future. I have a couple of peers that have large nest eggs because of their high paying jobs. Where are they now? Dead because of cardiac arrests before they can retire and enjoy their savings. My suggestion, enjoy what you have now, do what you can about the future without sacrificing your loved ones and your health, and sing Que sera sera.",
          "score": 12
        },
        {
          "text": "Correct, it's not enough",
          "score": 11
        },
        {
          "text": "Bro, s&p500 index is not linear. Some years could be +20 some years could be -20. When -20, what you gonna eat? Grass?",
          "score": 10
        },
        {
          "text": "The main problem is sequence of returns risk as your 8% growth probably means all-in at equities. You can probably do it if your expenses are elastic. That is you can go for a much lower withdrawal rate at downturns.",
          "score": 9
        },
        {
          "text": "I believe it could be enough for one person. However, it depends on lifestyle. You need to consider inflation. First, the projections need to factor in inflation. Second, inflation rate is not actually equal for everyone. For the first point, you might need to relook at whether 1.3m in 2036 (11 years from now) is actually enough. For the second point, you will need to see what you are actually spending on. If you envision owning a car, multiple properties and frequent visits to hospital, those are things that are inflating at a very high rate in Singapore. So, inflation rate will be high. If you envision taking public transport, eating more hawker and having a relatively healthy life, inflation is not as high. Another thing people ignore is CPF. CPF is a bond-like instrument. Whether you like it or not, 37% of your income goes there so remember to factor it in. Assuming you have hit FRS, all excess above FRS can be taken out from 55 onwards. This means from 55 onwards, the interest from OA of 2.5% is perpetually available for you to take out and amount never goes down as long as you only take out the interest. From 65 onwards, CPF pays out around 6% of your RA annually. This means it is like a 6% perpetual bond (note it does eat into the RA amount but otherwise, it functions just like a perpetual bond). So in reality, you don't actually need as much to retire, provided you are ok to see your cash-funded assets go down before 55 before being supplemented later by cashflow from CPF. It does make calculations much more complicated but those are things that are usually ignored for a simpler 4%SWR. Also, the 4% SWR is already inflation-adjusted. Some people miss this point and even the researcher who came up with it says that people can actually draw up to 4+% (can't remember exact % but I guess you already know this) because again, another point people ignore is that in retirement, you usually spend less. No more travels, no more funding of kids' education, no more mortgages, etc. That said, the SWR is meant for a 30-year retirement based on the research. So nobody knows how it performs for longer period but in theory, you can just reduce the SWR for higher success or start with more. In any case, it is always good to err on side of caution but do also note that there are many people who retire on less than this amount TODAY in Singapore, granted the lifestyle will not be a glamorous 1. I suggest you first calculate the present value of 1.3m in 2036 then see if it meets what you feel would be enough today.",
          "score": 9
        },
        {
          "text": "Your withdrawal has to be less than annualized growth. Or inflation will eat you alive. Ive got 3m USD, my plan is to withdraw 2%. In 20 years that 3m will be closer to 7m from the 5% i’m not withdrawing. And my 2% will be 140k.",
          "score": 8
        },
        {
          "text": "No kids. I’ll likely increase my spending as I get a more concrete view of my finances. The first few years I’ll have to be disciplined, after that it’s boats and hoes. Unless I have some bastards in Thailand or the Philippines, they’ll get some money.",
          "score": 4
        },
        {
          "text": "You also need to include emergencies in your plan.",
          "score": 4
        },
        {
          "text": "\"Taking sp500 average annualised returns\" - not wise words",
          "score": 4
        },
        {
          "text": "Yup plan to all in equities and withdraw by selling at time. I see, good consideration 👍🏻",
          "score": 3
        },
        {
          "text": "You plan to leave your assets to your children?",
          "score": 1
        },
        {
          "text": "I’m not sure if he said he is spending  60K now….or he is just projecting thst he will need 60K ten years from now",
          "score": 1
        },
        {
          "text": "This. Its incredible that people here think that a person seeing -20% stock market decline will continue spending like they did. Someone who has the foresight and discipline to plan 10 years ahead is likely gonna take remedial action when faced with a stock market downturn. Cutting spending, tapping on emergency fund, finding odd jobs etc.",
          "score": 1
        },
        {
          "text": "Yes, it is better to be conservative when it comes to estimates.",
          "score": 1
        },
        {
          "text": "This.",
          "score": 1
        },
        {
          "text": "How much would be enough leh?",
          "score": 1
        },
        {
          "text": "-20% still leaves him with $1m to continue drawing 60k while waiting for it to recover back to baseline and eventually grow again",
          "score": 0
        },
        {
          "text": "then will not enough, need a bit more time until it can self sustain",
          "score": -23
        },
        {
          "text": "I’m taking sp500 average annualised return as reference. Wise words 👍🏻",
          "score": -88
        }
      ]
    },
    {
      "id": "t3_1qv1uvl",
      "subreddit": "singaporefi",
      "title": "Thinking about FIRE. What will you do if you were me.",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qv1uvl/thinking_about_fire_what_will_you_do_if_you_were/",
      "score": 36,
      "num_comments": 23,
      "created_at": "2026-02-03T19:37:47",
      "selftext": "Seeking for different perspective.\n\nI’m 40 years old, recently widowed, Singaporean female. No kids. Parents are self-sustainable. Before he passed away recently, my late husband was a provider and paid for everything. My own income was only to pay for my own insurance & investment.\n\nPreviously had plan to work lesser from age 54 onwards to travel the world with my husband but situation changes and I am now too depressed to deal with all the stress at work and business.\n\nCurrent Situation:\n\nLiabilities:\n\nI’m feeling tired from everything that has happened lately and wish to stop working after I move into my new BTO, approx 2028-Q1. I wish to take time to complete the things/goals  which my late husband and I had plan to do even if he isn't around anymore.\n\nMy concerns:\n\nhappy to hear from people from all walks of life.",
      "comments": [
        {
          "text": "If your costs and travel costs remain the same until you die, you definitely can't retire in 2 years... you are spending too much... However, you are in a position to take a few years' break to grieve and console yourself over your loss. The decision is up to you.",
          "score": 55
        },
        {
          "text": "Sorry to hear of your loss. May I suggest therapy ahead of holidays? It will also give you the space to sort out what your life and financial goals are, then investment and spending will follow. This is a period of transition and change and doing nothing while working on yourself is also doing something.",
          "score": 32
        },
        {
          "text": "I think a mindset change is needed. That late husband was provider and OP's own income was only for insurance and investment (hence able to just load into risky tech) means all other expenses were basically \"free\". Yes, 30-40k/year travel is exceedingly luxurious for the current level of assets and income. All I can advise is not to squander what husband has left her.",
          "score": 26
        },
        {
          "text": "Ditch the car. Once you stop working, a car seems unnecessary. 5k per holiday trip is also quite a splurge. Assuming there is no car and if the holiday budget can be halved, stopping work seems doable with 1.3mil invested in high dividend stocks or REITs.",
          "score": 20
        },
        {
          "text": "Sorry for your loss. Your assets and housing situation are enough to retire, but not at the lifestyle you describe. Unless you mean that when you “retire”, you will still run your business and you can count on that to fund your luxuries like car and travel. And if the business doesn’t do well, you will drop the luxuries.",
          "score": 14
        },
        {
          "text": "Continue to work. Don’t isolate yourself. Time will heal you",
          "score": 8
        },
        {
          "text": "Sister I’m sorry for your loss.\nPersonally I think you should go to work.\nHaving that routine will keep you busy.\nYou get to dress up and do something and talk to people, it will be a better distraction than being alone with your own thoughts.\nYou have no kids so what is going to keep you busy in the meantime?\nTake a sabbatical for a month/a year if it is possible. After a while, you may meet someone else somewhere, pick yourself up. You still have a purpose, every morning your eyes still open, there are still many possibilities.",
          "score": 5
        },
        {
          "text": "Oh dear. So sorry for your loss. I strongly would recommend that you do not move in alone. I think it is way harder to be alone and grieving. And I noticed that with each incident of emotional upheaval , I have  a strong urge to abandon my work. My mom passed I almost quit. My husband had a heart attack I was  desperate to quit. It could be the same for you.  Work does help to distract a bit or be a punching bag for your feelings. Being alone is way harder. Your expenses is about 112k a year? I think that is hard to fully not work but you have business and a side hustle. Perhaps  input your assets and numbers in a coast fire calculator and see how it is.",
          "score": 5
        },
        {
          "text": "Sorry for your loss and what you are going thru. Suggest:\n1. Check if the BTO flat is fully covered by insurance. AFAIK if one spouse die, the HDB flat will be fully paid off (some insurance/conditions). Move stocks to a well diversified one. E.g. SP500 (CSPX), MSCI (IWDA) or all world (VWRA). Take a few years off to decompress and grieve. This is super important. Your mental well being is paramount to whatever money you can earn. Take care and wish you the very best.",
          "score": 3
        },
        {
          "text": "Very sorry about your loss, sounds like your late husband was an important pillar in your life. I’d echo the comment by another redditor to really consider grief therapy, counselling or even a sabbatical to. In very trying times like you’ve described, a mental rest and reset is much needed. In terms of your finances, it’s sufficient for now and even for a sabbatical. You can review the situation after you’re feeling better.",
          "score": 2
        },
        {
          "text": "Sorry about the loss. Can feel the stress seeing the post coming at around 4 am. Will you continue business after stopping your FT job? It will determine the income you have which also shows if your lifestyle is ok. Start tracking your monthly / yearly expenses now and after 2 years, see if there are changes. Things can actually change when you start paying the bills yourself. You hold too much cash and waiting for down cycles might mean lost opportunity although volatility is higher than normal these days. Most of your investment in tech is also a sector risk. Regardless, better keep at least 12 months expense as cash or cash like. Regarding BTO payment, your OA might have a bit of shortfall depending on when you stop work or how your CPF contribution goes. Also, SA is not FRS yet so maybe consider working and topping up at least till FRS so when you hit 55, you have 1 less worry. Have a short break and clear the mind. Take care.",
          "score": 2
        },
        {
          "text": "You hold too much cash Be mindful of where that cash might have come from. It probably newly arrived and OP already has plans to deploy the insurance payout and inheritance.",
          "score": 2
        },
        {
          "text": "Actually if you are not taking a full time job and no kids and have flexibility - then don’t buy a car, rent from grab, do 2-3 trips a day, it’s overall everything settled (maintenance, road tax, insurance etc) net positive. If you s&p500 your cash, your positive cash flow from equities each year conservatively 5% on 1.2mil should be 60k. Your side hustles and business continue even without full time work? Many of them said it’s about controlling expenditure. Absolutely. But remember that 1 person expenditure likely lower than 2, so holidays might be cheaper too. It really depends how you holiday. IMO it’s v possible to take a slower pace of life and FIRE. If you intend to travel the world for a year or two for example, you can rent out your hdb and the rental income can be additional cash flow for you to take a 2 year break from rat race hamster wheel Singapore.",
          "score": 2
        },
        {
          "text": "Sorry to hear your loss. Main advice lose the car.",
          "score": 1
        },
        {
          "text": "Check if key collection is still possible.",
          "score": 1
        },
        {
          "text": "It is definitely possible. OP is over 35, and HDB is not going to be a massive jerk and force her to change to a smaller singles flat or give up the flat when this kind of disaster strikes.",
          "score": 1
        },
        {
          "text": "We know that the eligibility has change. Hdb may have the discretion to continue the key collection, but may request a change of name or may just allow 1 person. Is there precedent on this? It’s not shared by anyone so far tbh. Edited: I think Hdb may allow, according to AI. 1 less worry for OP.",
          "score": 1
        },
        {
          "text": "HDB is not going to be so mean to a grieving widow lah. Here is one example I managed to find. Specifically before key collection too. https://www.reddit.com/r/askSingapore/comments/18v664v/comment/kfotx5r/",
          "score": 1
        },
        {
          "text": "Your husband probably thought the same, but kept moving the goalpost until he died. You witnessed this firsthand, you should really seriously think if you should merely \"wish to stop working\", and you know, just do it. Or *straight up no bullshit time* do you want to also meet an untimely death while still pontificating about what you wish you had done after your husband passed, who probably also thought the same? For 1 person you have enough. Really. I have 2 cars and now that I'm in FIRE mode, I never use them. My wife drives 1, the other sits there 95% in the car porch. Seriously you do not need a car at all. Not in Singapore. It's also alot more fun to not have a car in Singapore once you're retired / FIREd, you can walk around and experience the new sights and sounds you'd never experience driving from smelly carpark to smelly carpark. Also, the 1 important thing I thihk you should do, is to stop thinking the way you think based on what you have typed. Instead of thinking about how much you need to live a life based on some random numbers like 6x trips, $300k car, etc, you really should be thinking about living a good life with what you have. Seriously, 4 trips instead of 6 is not going to ruin your life. And is not just the number of trips. Really, in the past, you maybe flew SIA, stayed in 5-star hotels. Now that you're all alone, do you really, I mean really need to keep doing that? A really sinister thing to say, but that big king-sized bed isn't getting any warmer.",
          "score": 1
        },
        {
          "text": "I’m sorry for your loss. \nYou’re ok financially to take time off to grieve. \nMy 3 cents:\n1 Does your current situation include what your late husband has left behind for you, (both his assets and any insurance payouts)? If not, add that into the post. You might find that the situation changes.\n2 It makes sense to invest but it is less taxing to just set and forget with regular scheduled investments into a broad based fund to balance your tech stocks\n3 Do you want to follow through with the BTO or stay in your current place? Weigh up the value of memories and servicing a mortgage again",
          "score": 1
        },
        {
          "text": "Bto key settled. Next is how to best plan for op. Main job, lie flat, gain max income till you leave. Or nego with company to give you a parting gift. (Nothing to lose since she prefer to stop this) Side hustle, maintain. Business, what is it? Care to find someone to manage and get some passive income off it? Can dm me on this as im an op pro to make business very passive.",
          "score": 1
        },
        {
          "text": "Sorry for your loss. Would you share what your side hustle and business consist of? I would like to learn from you.",
          "score": 1
        },
        {
          "text": "Holiday alone?",
          "score": -16
        }
      ]
    },
    {
      "id": "t3_1quqvat",
      "subreddit": "singaporefi",
      "title": "38M | Barista FIRE by 45 | Portfolio $500k+ | Seeking Insurance Advice (DII vs. Self-Insuring)",
      "url": "https://old.reddit.com/r/singaporefi/comments/1quqvat/38m_barista_fire_by_45_portfolio_500k_seeking/",
      "score": 16,
      "num_comments": 12,
      "created_at": "2026-02-03T12:40:04",
      "selftext": "Hi everyone, I’m looking for a \"lean but safe\" insurance review. I just started riding a motorcycle, and as I approach 40 with increased health risk, I’m considering my insurance strategy to ensure my spouse isn't burdened if I'm sidelined by a road accident or health issue.\n\nProfile:\n\nCurrent Insurance Stack:\n\nThe Dilemma:\n\nIncreased Risk ProfileI recently started commuting by motorcycle. As I age, I am increasingly concerned that a road accident or health issue could lead to a disability that prevents me from working. My biggest fear is becoming a financial burden on my spouse.\n\nProtecting the FIRE TimelineI currently invest $4k–$5k/month to hit Barista FIRE by 45. If I lose my ability to earn, I don't just lose my lifestyle; I lose the ability to compound my investments. I want to \"insure\" my investment contributions so that my retirement goal remains on track even if I can't work.\n\nSpecific Questions for the Community\nHow much to insure? My current DII payout is only $1,200/month. Should I insure for my full income (~$10k/month), or just enough to cover expenses + my monthly investment target?\n\nHow long should the coverage last? Since my goal is Barista FIRE at 45, does it make sense to get a policy that covers me until:\n\nAge 45: The moment I \"retire,\" and cancel my plan\n\nAge 55: When I can withdraw CPF OA/SA\n\nAge 65: When CPF LIFE payouts begin",
      "comments": [
        {
          "text": "Your saf insurance probably can max out amount. Disability insurance best to get at the very least your expenses amount. Think about it if you are unable to work you have to pay for your current expenses and maybe more (extra helper etc) that's not accounting for inflation. Careshield life gives you 600+ inflation but that's probably it. Hospital probably can change to private cover. If you are not a senior citizen or suffering from life threatening diseases it can be a pain to deal with. Max out accident plan as well if you are worried. Losing a hand probably means you can't work but can't claim disability insurance as well , only accident plan will payout in this case. The rest is honestly up to you.",
          "score": 7
        },
        {
          "text": "Distribution, but it will require significant effort and resources to match my day job earnings. It's worth exploring when I FIRE and have more time available.",
          "score": 5
        },
        {
          "text": "Why would you get rid of insurance? In the event of any misfortune / illness / accident, wouldn’t the insurance kick in and prevent your savings / financial reserves from being eroded by unexpected expenses? If not, your FIRE amount would have to be much higher to be able to absorb / account for such ‘what ifs’",
          "score": 3
        },
        {
          "text": "What’s your side hussle? Can it be your main hussle? Assuming you FIRE it is something worth considering (assuming it’s better to do that than your main job)",
          "score": 2
        },
        {
          "text": "max out mindef group insurance",
          "score": 2
        },
        {
          "text": "this is what I did before I FIRE @ 38yo.",
          "score": 2
        },
        {
          "text": "Is your Barista Fire 1.4m for yourself or for both of you?\nIf it's for both of you, increase your accident + death + TPD by 1mil for the next 7 years, as that's your investment shortfall.",
          "score": 1
        },
        {
          "text": "Just for me",
          "score": 1
        },
        {
          "text": "Can consider adding term ECI since you do not have it as it can replace your investment and liabilities if anything happen",
          "score": 1
        },
        {
          "text": "Hi OP, well done for your amazing portfolio. Good that you worried about the loved one if unfortunate encountered unfortunate events. If you worry about the increased risk events (I.e. riding bike), you can increase the personal accident sum assured. I think your dilemma more into what's enough for your wife especially facing long term disability. Personally, here's my thought process:\nTerm life/TPD insurance sum assured: I covered till 65 only and I don’t have dependent when my kid grow up. Sum assured is based on 15 years of expenses. Post that will be covered by the investment portfolio if live longer. Critical illness: I covered only 6 years of expenses as I do some research and majority late stage illness can live only 3-5 years. If unfortunate to encounter early CI I checked with insurance agent the cost is about 100k, then i just have to pay from the emergency cash/investments portfolio as the cost of ECI and benefit is not justified. You can consider the short term disability income insurance covered till 45 or 50 whichever you deem is the critical period in the event doc certify you are unable to work for regardless of illness/accident. The long term care insurance is underrated though we have careshield life. Given that both you and wife dont intend to have kid, you might need to think who going to take care of you if face long term care? Hence, I buy the enhanced careshield life fully pay by CPF. My thought about insurance is I wouldn't know how much is enough, but I will buy some to cushion the impact and the rest to be covered by investment portfolio. If you care so much about the loved one, remember to do the Last Power of Attorney (it's free till March this year), do the nomination for CPF and insurance, and lastly the will. This will minimise the hurdle to be faced by your loved one.",
          "score": 1
        },
        {
          "text": "impossible to give any reasonable answer without any sense of what your expenses and your wife's expenses are",
          "score": 1
        },
        {
          "text": "Personal expenses about S$40k annually",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1quidv6",
      "subreddit": "singaporefi",
      "title": "Taking max car loan with low interest rate",
      "url": "https://old.reddit.com/r/singaporefi/comments/1quidv6/taking_max_car_loan_with_low_interest_rate/",
      "score": 14,
      "num_comments": 27,
      "created_at": "2026-02-03T04:34:19",
      "selftext": "Car loans are typically seen as a bad type of loan to be avoided as much as possible, mainly because a car is a depreciating asset, and effective interest rates are higher than what they seem. The case studies / examples I’ve come across use interest rates of 2.5-3%, translating to EIR of 5+%, and in these cases I agree that the interest rates are high enough that I’d want to take a smaller loan.\n\nHowever, in my recent car shopping journey, I am coming across lower interest rates (as low as 1.5%, and EIR <3%) due to the current low interest environment. So I’m wondering if the usual advice still applies, or if I should consider taking max loan amt and tenure, since opportunity cost should be higher (estimating 4-6% returns if invested).\n\nAs a first time car buyer, I would like to hear how this community thinks about this. Not sure if I missed any calculations or considerations, all advice is welcomed!",
      "comments": [
        {
          "text": "Pay in cash as much as possible and avoid taking a loan. Many clause like early repayment fees, processing fees if you intend to sell the car after a few years. I just encountered this a few months back when I was trying to sell my car. As mine was in-house loan, there was early repayment fee of 1% of loan amount, additional 1% because it was less than 12 months, another 2% processing fee. Sibeh dulan. Had to call the dealer to F them hard and they agreed to drop the total 4% fee to just 1% if I purchase my car insurance for next car with them. So I didnt take a loan for my next car(another dealer) and just paid in cash, + insurance from previous dealer, which was actually cheaper than I was quoted outside.",
          "score": 15
        },
        {
          "text": "4-6% returns if invested is something I see many people throwing around, but do remember that we're in an unprecedented bull market – who knows how long this run can last? Also, your car loan will count towards the assessment of your financial situation should you take up any other loan (e.g. housing) in the future.",
          "score": 5
        },
        {
          "text": "Felt \"bored\" of my precious car since it was just a BnB Korean car with no Turbo. Reliable workhorse, but i wanted something \"faster\". Decided to sell the car instead of trading in to dealer since the price is usually better. If you really plan to drive for 10 years, then yeah no need to worry about early repayment fees. But what car are you currently looking at? Btw Tesla SG probably has one of the lowest loan for brand new car at only 1.28%, EIR 2.46%.",
          "score": 4
        },
        {
          "text": "Ah, I don’t think I will be changing car for funsies, not that much of a car person :) yes was looking at the Tesla rates! I was offered 1.5% only, they dropped the rate after I put my deposit 🥲",
          "score": 4
        },
        {
          "text": "Check early repayment. You dont wanna take the loan and be stuck when u wanna sell ur car.",
          "score": 4
        },
        {
          "text": "This is so true. I thought i could game the dealer loan rebate by redeeming early since they offered a 5k discount if I took up their loan. In the end the bank still took a huge chunk of the saved interest amount through early redemption charge. Bank and salesman commission sure win, not me.",
          "score": 4
        },
        {
          "text": "Eeks! If you don’t mind sharing, what was the reason for selling your car early and buying another? Our current plan is to drive the car for the full 10 years (unless we are forced to sell for unexpected reasons), so early repayment isn’t a huge consideration for us",
          "score": 2
        },
        {
          "text": "Have you secured a coe? Deposit means nothing to tesla, you still have to secure a coe before applying for a loan. You can always re-negotiate with the banks that tesla works with.",
          "score": 2
        },
        {
          "text": "I can see your perspective, peace of mind is hard to quantify in numbers and would have a different value for everyone :) thanks for the advice!",
          "score": 2
        },
        {
          "text": "Might want to check the admin fees for early repayment of car loan, the low interest rate is just 1 part of the story",
          "score": 2
        },
        {
          "text": "Yup keep the options open and evaluate carefully !",
          "score": 2
        },
        {
          "text": "And yes the car is under his name.",
          "score": 2
        },
        {
          "text": "Yep, we got a COE in Jan but because order was placed last year, we did not qualify for the current loan rate. Do you think it’s still possible to negotiate with the bank? The advisor told us no when we checked with Tesla",
          "score": 1
        },
        {
          "text": "We have a hdb loan that is pretty manageable, and are tempted to take more loan for the car considering EIR is just slightly higher than hdb’s rate, so against this benchmark it doesn’t sound that bad?",
          "score": 1
        },
        {
          "text": "I hear you. Personally, I lean the other way around – my partner and I took the lowest 60% loan, and squeezed it down to 5 years, just to have less uncertainty. On paper I think it looks fine; as long as you have sufficient buffer, I think neither option will make/break you in the long term.",
          "score": 1
        },
        {
          "text": "Not expecting to sell unless forced by circumstances! Good advice still, I will double check 👍🏻",
          "score": 1
        },
        {
          "text": "1.5% means they earn so much from the car they don’t need to earn from ur loan. Profit has to come from somewhere no?",
          "score": 1
        },
        {
          "text": "I assume the low interest is also due to overall low interest conditions on the market. Anyway, since you are saying they are not earning from my loan, should I interpret that as you consider 1.5% a good rate (and would make sense to max out loan and tenure)? Whether they earn so much from the car is kinda a moot point since I’m gonna pay for it regardless of high / low loan amt",
          "score": 1
        },
        {
          "text": "The question here is are you confident enough in your investing discipline and approach to maintain a 4%-6% avg return. If you are confident with that and you don’t intend to sell the car early (which will incur fees like others mentioned), then i’d reckon it’s fine with taking max loan assuming the loan interest is as low as you’ve stated.",
          "score": 1
        },
        {
          "text": "When we bought our car, my husband and I decided on a 40/60 split. I don't like car loans so I decided to make the down-payment in cash while he services the loan for next 7 years. 3+ years into the loan, his home mortgage is due for refinancing. We realise the ppty value has grown about 50% which allowed him to take out an equity loan on the ppty at low mortgage rates. I suggested he take out extra to pay off the car loan as well, only to realise that prepayment fees essentially no different from paying the rest of the loan according to schedule. Tldr, it's the loss of flexibility with a car loan. You can't pay back early if circumstances changes and make it more beneficial to do so.",
          "score": 1
        },
        {
          "text": "That’s an interesting way of splitting the payment. I suppose this implies that the car is under his name? Depending on the interest rate you got, I guess you could also invest the amount that you were planning to repay early and earn back the interest",
          "score": 1
        },
        {
          "text": "yep he did take out early last year and was lucky to catch the bull run which was the original/main intention. The car loan was just a small amount but the car installment he could have saved was a nice way to offset the additional mortgage he needs to pay on taking out the equity to invest, making it almost like free money.",
          "score": 1
        },
        {
          "text": "Nice! Then the early prepayment penalties should be small change to you considering gains you made on the investments + property 👏🏻",
          "score": 1
        },
        {
          "text": "For FI centric minded people like me, no such thing as small change haha. Every bit helps in the accumulation process. Also, doesn't make sense paying penalty equal amount of interest to pay for rest of loan. Might as well slowly pay off the loan.",
          "score": 1
        },
        {
          "text": "Not planning to sell unless something unexpected happens (eg extended employment), although it’s definitely still a possibility. But yes good point to still be aware of the potential penalty even if likelihood of paying it is low 👍🏻👍🏻",
          "score": -3
        }
      ]
    },
    {
      "id": "t3_1qvbf93",
      "subreddit": "singaporefi",
      "title": "Which bank account to stash 500k",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qvbf93/which_bank_account_to_stash_500k/",
      "score": 12,
      "num_comments": 16,
      "created_at": "2026-02-04T01:56:15",
      "selftext": "I'm considering options to stash 500k in the long term without withdrawals.\n\nMy requirements:\n\nAccounts I'm considering:\n\n1) OCBC Bonus+ Savings\n\n2) CIMB Preferred StarSaver\n\nAny other accounts which I've overlooked?\n\nEdit: Just to add some context, this sum is my future inheritance, I'll be holding this in joint name with my parents until they pass away (not so soon, maybe in another 30 years or so)",
      "comments": [
        {
          "text": "My bank account is the best",
          "score": 18
        },
        {
          "text": "If this is for your kid, you can actually dump it into their cpf. Best risk free interest%. Sure they can't use it directly for a long time but it pretty much sorts out their housing purchase by the time they need to buy a house. And i'm guessing you are probably wealthy enough that locking this up for decades isn't an issue.",
          "score": 4
        },
        {
          "text": "If you are going to SDIC then i suggest you split to 5 different accounts. Why not SSB though?",
          "score": 4
        },
        {
          "text": "What's the point of SDIC if you gonna put it all in one account?",
          "score": 2
        },
        {
          "text": "I'm sorry I havn't been clear. I need it to be in a joint account as I don't own this amount yet. Edited my post to clarify",
          "score": 1
        },
        {
          "text": "I mean the point remains the same. By wanting SDIC I assume you have concerns the bank will close down. Coverage is 100k per pax, for 500k it won't be sufficiently covered regardless",
          "score": 1
        },
        {
          "text": "$500k long term why not bond",
          "score": 1
        },
        {
          "text": "I'm sorry I havn't been clear. I need it to be in a joint account as I don't own this amount yet. Edited my post to clarify",
          "score": 1
        },
        {
          "text": "Ocbc Premium dividend account (1.6%).\n$8k monthly deposit required, not sure if joint acc allowed.",
          "score": 1
        },
        {
          "text": "Thanks, I came across this but 8k monthly seems too much, especially if this isn't \"my\" cash yet",
          "score": 1
        },
        {
          "text": "How long term is long term? 10-20 years? Dump all into a world index fund.",
          "score": 1
        },
        {
          "text": "U only want savings account? Maybank privilege plus savings for 50 and above.\nComes with free PA insurance too",
          "score": 1
        },
        {
          "text": "Why not bond funds?",
          "score": 1
        },
        {
          "text": "I'm sorry I havn't been clear. I need it to be in a joint account as I don't own this amount yet. Edited my post to clarify",
          "score": 1
        },
        {
          "text": "If there is a 30 year time horizon, you can hold it in an IBKR joint account and buy bonds or an all world ETF",
          "score": 1
        },
        {
          "text": "I'm sorry I havn't been clear. I need it to be in a joint account as I don't own this amount yet. Edited my post to clarify",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qvbwk6",
      "subreddit": "singaporefi",
      "title": "Considering becoming SAHM after BTO — is single-income household viable?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qvbwk6/considering_becoming_sahm_after_bto_is/",
      "score": 10,
      "num_comments": 45,
      "created_at": "2026-02-04T02:17:15",
      "selftext": "Hi all, looking for some perspectives.\n\n37F, husband 31M, 1 preschool-age child. Both of us are currently working full-time with unstable hours, frequent OT and occasional weekends. We’re staying with parents now but will be moving into our BTO soon, which is far from family support.\n\nDue to childcare constraints (often reaching home past 8pm), I’m considering stepping away from full-time work to be a SAHM after we move out. I’m conscious that this would likely be a one-way decision — I’m in tech and stepping away for several years would make returning extremely challenging.\n\nHusband’s role is more stable and it’s not ideal for him to quit, even though my income is currently higher.\n\nFinancials:\n\nIncome (current):\n\nWe’re expecting upcoming expenses for renovation, insurance, and higher household costs once we move out, so I’m cautious about liquidity.\n\nQuestions:\n\nAppreciate any advice, especially from those who’ve gone through a single-income or SAHM phase.",
      "comments": [
        {
          "text": "I think this would be dangerous as the higher earner, and in tech so no U-turn. And your husband is much less established in his career. I would strongly suggest you just hire a helper to cover childcare constraints. Or even find a babysitter to cover the childcare pick-up and feeding dinner. At the same time, establish your boundaries at work. I mean, what's the worst that can happen, you get fired? Then you still end up with the original plan, only that you have had more time to build up a $ buffer and maybe get a retrenchment payout. If you resign now, you also lose your working mother childcare subsidies.",
          "score": 43
        },
        {
          "text": "Ur post lacks crucial imfo on ur expenses and lifestyle and expectations...........",
          "score": 22
        },
        {
          "text": "You already have a helper? Then is this really about childcare constraints? Or is it that you feel burnt out?",
          "score": 9
        },
        {
          "text": "80k a year is tough ngl. Gives very little buffer for emergencies and also significant cut back on lifestyle.",
          "score": 9
        },
        {
          "text": "talk to employer if able to accommodate fwa first before moving out and become sahm. unless you already sick of work thats another discussion topic. reason being. yes. you can do with 80k/pa, but isnt 190k/pa better? that is if you are able to do it. else just chill and concentrate on kids first, after all they will be child (and required care) only for a \"short\" while. baseline, single income is doable. definitely.",
          "score": 8
        },
        {
          "text": "Get maid \nDon’t quit",
          "score": 8
        },
        {
          "text": "The problem is you got a helper that is not the right fit for your child. I always advise folks looking to hire a helper, especially if never done so before, to not hire one that is completely inexperienced. It’s like blind leading blind. And you quitting your job now is like youre quitting to help the helper. How does that make sense? These are my recommendations:\n1) hire a new helper, be very selective and deliberate when you interview. Make sure you get someone with the right experience and attitude (as much as you’re able to discern from an interview at least).\n2) Find a job with better hours, then quit current job. \n3) Get husband to quit. As the one who earns less, him being a SAHP would have less of an impact on your family.",
          "score": 7
        },
        {
          "text": "Single income is possible. Live with what you have, not what you think you need.",
          "score": 7
        },
        {
          "text": "Assuming you want to maintain or increase your existing net worth - meaning prudent not to touch your golden nest at all. To rely solely on husband income is maybe slightly on the edge even without a car. Im drawing around your husband and similar age band. No kids though but have a car and bto. Bto is fully paid by CPF. Have to understand the basic housing expenses just to live in HDB keeps increasing every year. HDB conservancy fees, utilities, season parking, insurance, internet, Netflix, Spotify etc. Unless you are content with living a minimalist lifestyle then maybe just on your husband income, it will work. At one point I was the sole breadwinner in my household as wife is not working. Can see my monthly savings(after expenses) deep dive even without the kids or car.",
          "score": 6
        },
        {
          "text": "Still not helpful. I notice u didnt factor in ur husbands annual spending either. U also didnt put in the numbers for parents, mortgage and others line items. All in all, the drop from dual income means u need to drastically adjust expectations in ur current lifestyle. Ur husband dont earn enough to sustain Crunch ur numbers. reflect on ur lifestyle. No pt asking for opinions on this sub unless u do some accounting in $ and life",
          "score": 5
        },
        {
          "text": "Is your husband agreeable to you being a SAHM, you are trying to drastically change the family dynamics to below medium income household. No offence but you are the \"husband\" in this relationship being the older and higher earning one and should be responsible for the family financial",
          "score": 5
        },
        {
          "text": "Then hire a Filipina or other experienced and English-speaking helper. Look for another job or opportunity to move to a less demanding support role in the same company. Don't throw away ~10k salary when you could instead pay $300 more for a better helper, or step down 2k salary for a more manageable job.",
          "score": 4
        },
        {
          "text": "Are those net worth numbers just your numbers or including your husband? Kind of hard for anyone to advise without your expense numbers, especially the largest one - monthly mortgage. Don't forget while you are working, your CPF monthly inflows will be able to help cover at least half of the mortgage, however this has to be paid in cash once you stop. But off the bat, 80k seems low, highly doubt you will be able to save anything if at all.",
          "score": 4
        },
        {
          "text": "Hire a helper?",
          "score": 4
        },
        {
          "text": "U intend to burn thru ur assets for how long?",
          "score": 3
        },
        {
          "text": "My personal annual spending averages around $30k. Our main discretionary spending is on overseas travel; which we could vastly reduce. otherwise, we try to invest as much as possible. I only started investing last year and built the current portfolio over that period. For our child, monthly expenses are approximately:\n    • School fees: ~$300\n    • Enrichment: ~$500\n    • Helper: ~$700 Parents are largely financially independent, though I still contribute monthly when possible. I expect household expenses to increase after moving out (utilities, groceries, transport), and I’m factoring that into the decision.",
          "score": 2
        },
        {
          "text": "It is due to our first time hiring a helper and we hired one who is not fluent in english. Personally I feel our child discipline got worse with a helper and due to helper too young and inexperienced we can’t trust her to solely care for him. Definitely my job doesn’t allow me fwa arrangements and OT/weekends is a must.. is really tough to handle and manage family commitments and work.",
          "score": 2
        },
        {
          "text": "Thanks that's very true too. \nI think the hardest part for OP is adjusting from living on a combined income of 180k to 60k a year.",
          "score": 2
        },
        {
          "text": "Ok question time R u willing to downgrade ur lifestyle severely? How much u expect in money from hubs? When u quit, r u gonna have a say in the money, or separate as per now? Have u even raised this up with him? Gd luck but i think u have long ways to go",
          "score": 1
        },
        {
          "text": "Second this. Can even offer to take a pay cut in exchange for flexible working arrangement.",
          "score": 1
        },
        {
          "text": "May I ask no kids no car how your monthly savings deep dive? Conservancy fee is $70 a month. If you're earning close to 80k that's like what less than 2k a year?",
          "score": 1
        },
        {
          "text": "80k after take home not that much. 60k at best. Internet, utilities, insurance, parents allowance etc. it all adds up. It looks low on the surface but your daily expenses keeps piling up and going up due to inflation silently and at one point, you can see your credit bill at the end of the month just... You don't even know you spend that much. It's totally insidious.",
          "score": 1
        },
        {
          "text": "Wahlao don't like that. It's not healthy for marriage. He needs to be on board too. He needs to see the meaning and purpose behind this great privilege. It is already a privilege that:",
          "score": 1
        },
        {
          "text": "We keep our financials quite seperately. Thus whatever we earn spend and invest is separate. Thus the post to ask about single income doablity and perspectives on how to shift to this.",
          "score": 0
        },
        {
          "text": "Those are net worth of my assets. I’m trying to see if it would be possible to rely on just my assets to minimise burden on my husband.",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1quvn4j",
      "subreddit": "singaporefi",
      "title": "How do I buy insurance without going through an agent?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1quvn4j/how_do_i_buy_insurance_without_going_through_an/",
      "score": 5,
      "num_comments": 9,
      "created_at": "2026-02-03T15:55:02",
      "selftext": "I have a finance degree and work in finance, so I can read up on products and their fine print myself. I've also been handling claims on my own. The agent seems to have no use except to try and sell me more.\n\nI handle my own financial planning and am likely more knowledgeable than most insurance agents.\n\nSo, how can I buy insurance without going through an agent? Can I get it at a lower price if I don't pay agent fees?",
      "comments": [
        {
          "text": "life insurance - can look for direct purchase (DPI), keyword is direct. can add on CI rider personal accident - depends on the insurers, you can go to their websites and see if you can get a quote online. if cannot means have to go through agent hospitalization plan - this one has to go through agent if you have served NS - singlife mindef group insurance",
          "score": 12
        },
        {
          "text": "https://www.comparefirst.sg Search for your desired product under the \"Direct Purchase Insurance Products\"",
          "score": 7
        },
        {
          "text": "Some types of insurance can be bought directly, others cannot. If you use the insurer’s website form to say that you want XYZ plan, they will still send down an agent. You may be pro at finance, but doesn’t mean you know how to answer the health declaration questions. For ISP, NTUC Income is the only company I know that can accept applications online without talking to an agent. But then they hand out exclusions and rejections freely.",
          "score": 4
        },
        {
          "text": "Buy from agent if you already know what you want. It’s the same price anyway, you don’t get any savings. Choose a pretty female agent if your a guy lo at least can have eye candy But the main reason is this-\nI am sure you can handle claims but You don’t want to be half sick and handicapped and handling claims on your own if you do need to claim",
          "score": 3
        },
        {
          "text": "Yeah this anyways, not all are dirty scumbags, some are decent. But regardless they are just sales people and if you have already done your research, and they know you can't be swayed, they will do the insurance for you regardless because a bad sale is better than no sale.",
          "score": 1
        },
        {
          "text": "U can buy direct on simple insurance , those originally is already cheap insurance but not for insurance like hospitalisation or so . The money saved is just meh Edit : direct purchase insurance be it term or wl , sum assured is gonna be a joke so they will somehow force u to buy from agent still",
          "score": 1
        },
        {
          "text": "I am not sure if there is a known way to public on determining lower priced insurance, and in most cases that relates to critical illness, accidents or hospitalization coverage, they go by your age group. So these will require some health checks or declaration before you can get them. Those that you can purchase direct are likely term insurances, life insurance, car and travel insurance. Some known ones that you can check if they provide direct purchase could be FWD, DirectAsia, Singlife, Income. Others like Great Eastern or HSBC can be done via the bank too. That being said, unless the company has some sort of an app, like Great Eastern, AIA, Singlife etc. you may still require your agent to assist with some claims. Another way is to see if your company provides insurance, and check with the agent or account person to extend a personal insurance to you. This could be better value, but again unless you have the numbers across others to cross-check...",
          "score": 1
        },
        {
          "text": "There are limits to the sum assured you can buy direct from insurers without going through an intermediary agent. So you may need multiple products/policies to truly meet your planning needs/gaps which may not be truly efficient use of your money. If you already know what you want, work with an agent that has access to the products you want from the insurers you prefer. He/she can give you quote and you can still decide. However, where an agent/consultant’s value comes in is being able to offer insight and offer perspective in planning your finances. Many also have access to products/solutions that aren’t available “off-the-shelf” to public, I can understand you feel you know better and more than most others and that you’re smarter than all the agents around. But, you’re still here on this Reddit chain asking for answers, and also, another opinion won’t hurt you. For eg, I’ve done a comparison on FWD’s term plans available on their website; and compared the total premiums spent, and coverage vs other plans in the market - the difference is very clear. If someone bought direct from the FWD website, they end up spending 20-30% more in total premiums, the coverage was also less comprehensive with fewer critical illnesses covered. So…. Not always beneficial for the customer to go direct. Easier doesn’t mean better.",
          "score": 1
        },
        {
          "text": "No offence but your post sounds like u r v v knowledgeable and independent and even claiming u r more knowledgeable than most agents, yet u have to ask this qn on reddit. All i did was copy paste your title into google / chatgpt and i got the same answers as most comments here. Not sure if u truly are capable of handling it on your own. Disclaimer: im not an agent nor defending them",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qusubo",
      "subreddit": "singaporefi",
      "title": "SGX RegCo rolls out public consultation to support wider adoption of broker custody accounts",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qusubo/sgx_regco_rolls_out_public_consultation_to/",
      "score": 4,
      "num_comments": 10,
      "created_at": "2026-02-03T14:07:08",
      "selftext": "https://www.theedgesingapore.com/news/eqdp/sgx-regco-rolls-out-public-consultation-support-wider-adoption-broker-custody-accounts\n\nIn Summary, SGX is trying to shift away from the dated CDP model and move towards the brokerage custodian model\n\nPersonally, I am for this decision as CDP are only supported for SGX listed equities and their transaction cost are much higher. Foreign listed equities are normally held in custody in brokerages such as IBKR, tiger etc, thus they are are not consolidated into one account.\n\nBut of cos, I believe those who are still holding onto their equities in CDP should be of the older gen.\n\nFor myself, I am using FSMOne for SGX listed equities and IBKR for my NYSE equities.. much neater this way :)\n\nWhat are your views?",
      "comments": [
        {
          "text": "Then where will my ssb go to?",
          "score": 3
        },
        {
          "text": "I would say no because this means brokers will start charging custody fees to customers. Nowadays brokers are skipping charging fees in order to make themselves attractive to SG stocks buyer when versus CDP. Didn't tiger brokers when they started, was charging CDP fees? And only if you constantly trade then they will  waive the $2 per quarter. We can't really compare SG stocks to US stocks brokerage, US stocks are usually waived or not charged because there are so many competitors out there. But SG market is so small. Pretty sure once one broker start charging, the rest will do. As an individual I use CDP for SG stocks, so yeah, I rather stick to cdp",
          "score": 3
        },
        {
          "text": "I mean, you can already do this if you want right? You don't need to use cdp.",
          "score": 2
        },
        {
          "text": "They mentioned ssb stays with cdp custody.",
          "score": 2
        },
        {
          "text": "As a whole, it is probably the right move. Eliminate CDP and consolidate the channels. As an individual who holds SG stocks via CDP, I’d much rather status quo. In the absence of drastic public outcry (which I think is unlikely), my guess is that CDP will eventually cease. Question is when.",
          "score": 2
        },
        {
          "text": "There is no risk when our stocks are with CDP. However, the same cannot be said the same for brokerage account. Holding with DBS vs Moo or FSM present different risk.",
          "score": 2
        },
        {
          "text": "Yes u are right..I think they are trying to do away with the whole CDP concept",
          "score": 1
        },
        {
          "text": "Yeah but op says they wanna do away with cdp entirely",
          "score": 1
        },
        {
          "text": "Banks perhaps? Since you need to apply thru them anyway.",
          "score": 1
        },
        {
          "text": "Doing away with cdp fees encourage people with less deployable funds to start younger or eariler. Wished the removed the round lot restrictions. There is absolutely no reason to keep it in this day and age",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qurls8",
      "subreddit": "singaporefi",
      "title": "I do not know what I want to work as",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qurls8/i_do_not_know_what_i_want_to_work_as/",
      "score": 3,
      "num_comments": 8,
      "created_at": "2026-02-03T13:14:26",
      "selftext": "I’m 27(m) have been in the navy as a mechanical technician equivalent for about 5 years, I pursued a part time degree in mechanical engineering in NUS in my 3rd/4th year in the navy, but after 1 year I’ve unfortunately come to realise that this is not what I want to do anymore. When I first joined the force it was tiring but I was willing to put in the work to be a decent worker and fulfil my duties, but as the years went by I realise more and more that I do not want to do this anymore. I am still interested in the Marine field but I’m not sure what exactly I would like and it’s really stressing me out. I’m not even sure if I want to continue in the marine field per se. In this economy now I’m not sure I feel very lost for the first time in my life and I’m just looking for any advice on anyone who’s been in a similar situation to mine. I’m planning to leave the force this year around May/June. I’m thinking of like just taking maybe a one month break before trying out different jobs per se. I guess I’m also here to find out what jobs I could apply for with my experience or jobs that will hire me for my lack of experience. My highest qualification is a diploma in marine engineering. I’m passionate about music so maybe I’m thinking of applying for sound engineering course?? This just some of my ideas I have in place right now\n\nEdit: I dropped out of uni after a year because I really didn’t enjoy it and I was very burnt out\n\nThank you for listening to my rant and contributing if you did.",
      "comments": [
        {
          "text": "Look, you're going at this a bit the wrong way. Very important - degrees do not shoe-horn you into a specific discipline, they're door openers. Not sure if this ship has sailed (no pun intended). But I would try the following: - shortest route to a degree, whatever it is. Of course doing a MEng degree with naval experience fast-tracks you to a naval engineer role. But lots of other doors are open too. Navy is high availability, do are data centres. And so on. Often, the only _hard_ requirement is must-have-degree. So get this sorted - Military experience is very valuable from an ops and reliability perspective. Tons of fresh grads only understand how to score high in exams and get rewarded. Real world is different. Results don't happen under controlled exam environs but uncontrolled, random situations. Track those experiences. You can be anything from a hotel manager to a data centre operator to a cruise ship captain - just overlay their requirements to your experience. - don't stress yourself trying to optimise stuff. At the beginning of your career, everything is about opening doors (degree, see point 1). You're thinking as if you were a 40 y old middle manager:) Don't. Best of luck!",
          "score": 12
        },
        {
          "text": "Go SMU to study law as a JD and become shipping lawyer.",
          "score": 6
        },
        {
          "text": "I agree with original poster - get a degree. Since you have been studying and in the forces, let me just share this - almost all career entry positions have this clause - \"Minimum Bachelor Degree or equivalent\". You are having a tough time as you are juggling work and part time study.  Maybe take a year off to focus on your degree full-time.",
          "score": 2
        },
        {
          "text": "Normal , even now I don’t even know what job suits me and losing my job soon",
          "score": 2
        },
        {
          "text": "Thanks for this!! But I forgot to mention that I dropped out of uni after that 1 year because for 1 year I was extremely burnt out and I also realised doing a degree in mechanical engineering was not what I wanted. I had to sail and manage studies which made the experience so much worse. I guess it’s just scary because I’m not only leaving my job but also planning to try out something entirely new and I’m not sure what that is",
          "score": 1
        },
        {
          "text": "this is very normal. many people dont do the job they love actually. some lucky ppl gets to do what they like till they cant move. i was forced into my current job 15 years ago and cant wait to get out. i think the world is really taxing now cuz burnt out at 27 year old used to be rare but ive been reading it off quite frequently from young ppl. just stay chill while your finance is able to support. the boat will straighten itself at the bridge",
          "score": 1
        },
        {
          "text": "i went through something similar in circumstances as you; army regular, did my part time studies and left the force after bond period was up. Initial career transition period may be slightly difficult depending on job market and also the change of work pace (the pace in the outside world vs in the SAF was a culture shock lol). I took an almost 50% haircut on my salary to get into a job i was interested in back then. Eventually i landed myself in another job in another industry and grinded through the years, did okay income wise but it was tough work. Looking back, i’d say it is important to able to establish yourself early in a forte that you can push on with motivation and have interest in. Paper qualification gets you through the door for employment however the experience and skills you accumulate will be your trump card for your career moving forward. Focus on the value you can gain and create for others and yourself in your job, a job that pays a decent enough income to sustain your savings, investments and lifestyle. Study some investing concepts and build up financial literacy along the way and start your investing journey as early as possible (after learning the basics and knowing what to do) and let compounding work it’s magic for your wealth building. Don’t worry too much. As long you put in the work and maintain some discipline (in life, expenditure and investing), with the right mindset, things will eventually work out and fall into place. Good luck!",
          "score": 1
        }
      ]
    }
  ]
}