{
  "schema_version": "raw_scrape_v1",
  "report_id": "2026-03-01",
  "scraped_at": "2026-03-01T14:06:55.477136",
  "subreddits": [
    "singapore",
    "askSingapore",
    "SingaporeRaw",
    "singaporefi"
  ],
  "total_posts": 38,
  "total_comments": 407,
  "posts": [
    {
      "id": "t3_1rgz74i",
      "subreddit": "singapore",
      "title": "Muted demand for some Plus, Prime HDB flats as first-time buyers weigh stricter resale conditions",
      "url": "https://old.reddit.com/r/singapore/comments/1rgz74i/muted_demand_for_some_plus_prime_hdb_flats_as/",
      "score": 277,
      "num_comments": 106,
      "created_at": "2026-02-28T18:23:19",
      "selftext": "",
      "comments": [
        {
          "text": "Then this scheme basically does its job. It is only for couples who want to buy a home. Not for flippers",
          "score": 729
        },
        {
          "text": "HDB is for staying, not for saving.",
          "score": 181
        },
        {
          "text": "Wish this scheme applied to all btos. Lame ass flip culture.",
          "score": 176
        },
        {
          "text": "Oh no you cant flip for 1m profit, while getting tons of govt subsidies.",
          "score": 122
        },
        {
          "text": "Very very good. Fuck all the flippers using something people need for slimly personal gain.",
          "score": 55
        },
        {
          "text": "That’s the way. We should standardise it for all HDBs now.",
          "score": 48
        },
        {
          "text": "The glut appears to largely be in 3 room flats which is basically 2 bedrooms. This is a signal to HDB to build less 3 room flats and build more 4 room or 5 room flats. If we are serious about raising TFR, we should build more 4 room flats where demand is.",
          "score": 46
        },
        {
          "text": "Flipper F off",
          "score": 42
        },
        {
          "text": "well this shows the buyers are not 'needy' but greedy. ",
          "score": 29
        },
        {
          "text": "&gt;Rather than leaving unsold flats on the market, it might be prudent for the HDB to adjust the three-room flat supply, so as to cater to the demand for four-room and larger flats.\n\nOr make it available to the pool of singles/same-sex couples who are serious about getting a 3-room flat for 10-15 years but are totally barred from this supply.\n\nThe demand is there for 3-room flats -  there's why you get some rich single/couple willing to pay 935K for Queenstown 3-room, so it is not an issue of oversupply. It is an issue of allocation.",
          "score": 29
        },
        {
          "text": "&gt; First, first-time home buyers are weighing whether stricter resale conditions – in particular, the 10-year MOP – are worth it.\n\n&gt; Speculative buyers are weeded out, while serious buyers who intend to live in their flats for the long run are given a higher chance to book one. This is the intended effect of the policy.\n\n&gt; However, three-room flats may not be popular among young families given the space constraints, as they are typically around 60 to 68 sq m. In comparison, new four-room flats are around 88 to 93 sq m.\n\nThat is one of the reasons for the muted demands; the policy did its job, but the offering flats are not really desirable for families. 4 room flats had a much higher application rate, for obvious reasons.",
          "score": 24
        },
        {
          "text": "as it should be imo",
          "score": 20
        },
        {
          "text": "Good. HDB flats should be for living for the long term, not for flipping.",
          "score": 19
        },
        {
          "text": "Goes to show that some locals are literally creating housing affordability problems for other locals who really needed the hdb flats.",
          "score": 15
        },
        {
          "text": "HDB, almost everybody can see what the problem is, 3 room is not big enough for a family with kids, no family wants them. Either drastically cut the supply of 3 room flats to increase supply of other options, or maintain the same supply but let those rich singles apply for them during BTO so they can skip the ‘minimum 100 allocation’ rule for those 2 room flat for seniors.\n\nYou can’t seriously think this situation with 3 room flats is sustainable.",
          "score": 10
        }
      ]
    },
    {
      "id": "t3_1rh05wy",
      "subreddit": "singapore",
      "title": "New vape laws mooted to raise fines to $10k for users, $200k for sellers, $300k for smugglers",
      "url": "https://old.reddit.com/r/singapore/comments/1rh05wy/new_vape_laws_mooted_to_raise_fines_to_10k_for/",
      "score": 251,
      "num_comments": 60,
      "created_at": "2026-02-28T19:20:26",
      "selftext": "",
      "comments": [
        {
          "text": "For comparison - dangerous driving causing grievous hurt carries a fine of up to 10k and/or up to 2 years in jail, with possible driving disqualification. \n\nVape users, 10k fine. 200k / 300k for sellers / smugglers. But cigarette sale is permitted with 60% tax. Much longer history of documented, peer-reviewed health effects of cigarette vs vape. ",
          "score": 185
        },
        {
          "text": "All the reasons they use to tell you vapes are bad like the nicotine content - if they can regulate trading cards they can regulate anything they want",
          "score": 59
        },
        {
          "text": "Drunk diving killing people, murders and suicides, old people getting scammed out of their life savings, rape and sex crimes increasing like crazy -- but it's ok, at least we are catching vapers!",
          "score": 50
        },
        {
          "text": "The cigarettes eh? What's with the double standard sia",
          "score": 22
        },
        {
          "text": "wow i guess more of those stupid fucking security checks that they set up at random mrt stations wasting resources and commuters' time. maybe i look like some shady ah beng but i've been profiled and \"selected\" to go through security checks at least 3 times already.",
          "score": 10
        },
        {
          "text": "![gif](giphy|xT9IgmYU3ZVaCjGafm)",
          "score": 10
        },
        {
          "text": "Right after raising cigarette tax by 20% ",
          "score": 5
        },
        {
          "text": "Its just a veiled nicotine tax I guess",
          "score": 4
        },
        {
          "text": "Profit margins are better for cigarettes, and those companies have strong lobbyist networks already.",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1rhlxt6",
      "subreddit": "singapore",
      "title": "S'porean man, 61, pleads guilty after stealing 320 women's underwear over 5 years",
      "url": "https://old.reddit.com/r/singapore/comments/1rhlxt6/sporean_man_61_pleads_guilty_after_stealing_320/",
      "score": 170,
      "num_comments": 54,
      "created_at": "2026-03-01T10:55:10",
      "selftext": "",
      "comments": [
        {
          "text": "&gt; He reportedly has an urge to steal underwear after drinking.\n\nLOL",
          "score": 96
        },
        {
          "text": "There are probably lingerie shops out there with lesser inventory in store than this guy.",
          "score": 72
        },
        {
          "text": "This is what happens if you goon too much",
          "score": 30
        },
        {
          "text": "Was wondering how they knew it was 320 lol",
          "score": 22
        },
        {
          "text": "![gif](giphy|YmQLj2KxaNz58g7Ofg)",
          "score": 14
        },
        {
          "text": "Can’t just blame it on alcoholism when you collected 7 bags of them.",
          "score": 9
        },
        {
          "text": "was he planning to resell after using them",
          "score": 8
        },
        {
          "text": "i have more questions after reading this than before i clicked on this",
          "score": 8
        },
        {
          "text": "I seriously wonder how big are his pockets to be able to stuff that many items. Dayum!",
          "score": 8
        },
        {
          "text": "Happosai is that you? I thought you were dead.",
          "score": 5
        }
      ]
    },
    {
      "id": "t3_1rh6uo5",
      "subreddit": "singapore",
      "title": "Singapore 'deeply concerned' by US, Israeli strikes on Iran: Faishal Ibrahim",
      "url": "https://old.reddit.com/r/singapore/comments/1rh6uo5/singapore_deeply_concerned_by_us_israeli_strikes/",
      "score": 166,
      "num_comments": 106,
      "created_at": "2026-03-01T00:25:04",
      "selftext": "Singapore is monitoring developments closely and supports efforts towards de-escalation, the protection of civilian lives and respect for international law, Acting Minister-in-charge of Muslim Affairs Faishal Ibrahim said",
      "comments": [
        {
          "text": "[removed]",
          "score": 94
        },
        {
          "text": "Kind of funny how the ministers kept declaring we our decisions are based on principles and rule of law instead of siding with countries. But then we didn't apply the same sanction on Israel as we did with Russia. Deep down everybody know its not really truly based on principles. I can sense a degree of fear of offending big superpowers that can squeeze us economically.",
          "score": 73
        },
        {
          "text": "Think US went too far as well...\n\nBest case scenario everyone ramps off.\n\nWorst case scenario, long protracted war that make Trump crazier",
          "score": 69
        },
        {
          "text": "Wild stuff. I hope Cuba is not next",
          "score": 45
        },
        {
          "text": "Feel like every country has to condemn it but if it does really topple the Iran regime then everyone will have a sigh of relief",
          "score": 44
        },
        {
          "text": "Its quite boring to keep saying ‘deeply concerned’ for every major conflict we witness no? Noone really cares about what we feel, we also cannot do anything to influence this or stop this, just sounds like performative nonsense.",
          "score": 40
        },
        {
          "text": "If a politician says he's deeply concerned... He is probably not gonna do anything about it.",
          "score": 25
        },
        {
          "text": "Activate bmtc sch V",
          "score": 20
        },
        {
          "text": "Interesting this statement is made by the acting minister in charge of Muslim affairs, and not the foreign minister.",
          "score": 15
        },
        {
          "text": "Last time I said it I get downvoted, but what else can we do but do some lip service? The US have shown again that it is the only superpower in the world that can actually turn the world upside down on their whim. Everyone else does not matter, China can’t even leave port or fly a plane without getting targeted and everyone in the world complaining then sailing warships along their shoreline. Russia can’t even get a culturally similar neighbour to support them and their special operation has turned into trench warfare unlike the US one. European nations? They grumble a bit but still just stand behind the US. So what do people expect our much smaller country to do? There’s a reason why, when the US asked us to jump, we always ask how high.",
          "score": 11
        }
      ]
    },
    {
      "id": "t3_1rh35sl",
      "subreddit": "singapore",
      "title": "Tensions in the Middle East will affect energy prices and impact countries far away, like Singapore: SM Lee",
      "url": "https://old.reddit.com/r/singapore/comments/1rh35sl/tensions_in_the_middle_east_will_affect_energy/",
      "score": 136,
      "num_comments": 32,
      "created_at": "2026-02-28T21:51:23",
      "selftext": "",
      "comments": [
        {
          "text": "I sure do love living in interesting, unprecedented times ",
          "score": 101
        },
        {
          "text": "TLDR: the price of everything will go up except for your salary",
          "score": 70
        },
        {
          "text": "Immediately signed 3 years package with Tuas power just now",
          "score": 30
        },
        {
          "text": "Come November 2026 midterms things may change, unless Trump hijacks it by changing the constitution. This is wild.",
          "score": 15
        },
        {
          "text": "Inflation incoming 💀💀💀",
          "score": 15
        },
        {
          "text": "Time for MRT tickets to go up again...",
          "score": 10
        },
        {
          "text": "RAM prices will going up a lot tmr!!! Time search for great deals on carousell",
          "score": 7
        },
        {
          "text": "Up next: PTC recommends to raise public transport fare to remain competitive. ☝️😤",
          "score": 4
        },
        {
          "text": "Seriously should raise the energy demand buffer again. Don’t want a sudden jump in tariffs.",
          "score": 4
        },
        {
          "text": "Time to form another task force. JLB man needs some wins after not being to neg a tariff decrease",
          "score": 3
        },
        {
          "text": "Water is wet",
          "score": 2
        },
        {
          "text": "Oil price gonna increase I guess?",
          "score": 1
        },
        {
          "text": "This usually means prices are going up soon...",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rheupj",
      "subreddit": "singapore",
      "title": "Concerns over 100 per cent borrowing for vehicles as outstanding car loans hit 12-year high",
      "url": "https://old.reddit.com/r/singapore/comments/1rheupj/concerns_over_100_per_cent_borrowing_for_vehicles/",
      "score": 124,
      "num_comments": 45,
      "created_at": "2026-03-01T05:40:23",
      "selftext": "",
      "comments": [
        {
          "text": "I'm not a driver but my friends told me buyers can get rejected if they wanted to buy a car with full payment. \n\nAre they selling cars or are they in the loans business? Might be about time to clean up the auto industry.",
          "score": 186
        },
        {
          "text": "&gt;”The Government is monitoring the situation and will tighten regulations to manage the abuse of such regulations if necessary.”\n\nStill monitoring their prey. Situation not bad enough yet.",
          "score": 81
        },
        {
          "text": "Very common for dealers to get just anyone who die die wants a car to be able to get one.\n\nAs I was looking for a car, I book marked a few on sgcarmart and when there is any change in price or availability, I'll get an email.\n\nI'm surprised how often, expecially older coe cars, the price would jump from 60k to 110k. I was puzzled and I asked my friend who's in this line. He told me it's because the buyer wants to loan 100% so when the price is now 110k, he isn't taking 100% loan from the lender's(could be a bank? I don't know) perspective. It is how they play the game.",
          "score": 28
        },
        {
          "text": "100% loan will always happen if regulations are not enforced. Removing the in house loan can prevent this issue but will also create a monopoly problem with the lending party with the big boy mind set.",
          "score": 26
        },
        {
          "text": "If everyone suddenly stops taking private hire vehicle, they would default on their loans and the car dealers would go bankrupt.",
          "score": 12
        },
        {
          "text": "My case, they wanted to add $6k to purchase price if pay full cash. I took the loan and paid it 3 months later and overall still cheaper than full cash. But don’t sleep on it, the savings could be 5k but when I repaid it 3 months later, probably only 1-2k.",
          "score": 8
        },
        {
          "text": "Actually not only those full loan ads but dealers also like to put \"lowest interest rates in SG!\" of like 1.xx% or even 0.xx%! How on earth they get to have lower interest than banks? Such deceptive marketing lol.\n\nPrice of these deals either force u to overpay on car or do their exp servicing package or make u take full loan. Straits times says it's largely the smaller dealers doing this but some of these dealers are quite big also. Always doing roadshows one",
          "score": 4
        },
        {
          "text": "If we want to pay full, almost no dealer want to sell at the price. That shows how terrible the market is. ",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1rh44ar",
      "subreddit": "singapore",
      "title": "Security stepped up at Singapore's checkpoints following US, Israeli strikes on Iran",
      "url": "https://old.reddit.com/r/singapore/comments/1rh44ar/security_stepped_up_at_singapores_checkpoints/",
      "score": 123,
      "num_comments": 17,
      "created_at": "2026-02-28T22:32:43",
      "selftext": "",
      "comments": [
        {
          "text": "Post got unlocked? Glitch or the mods had a change of heart?",
          "score": 71
        },
        {
          "text": "Deeply concerning. Seems like we are worried about retaliation from an unknown extremist group that will try to take out their frustration on Singapore. The possibility is low but we cant keep our guard down.",
          "score": 33
        }
      ]
    },
    {
      "id": "t3_1rgz8a1",
      "subreddit": "singapore",
      "title": "SIA, Scoot flight cancellations amid US and Israel attack on Iran",
      "url": "https://old.reddit.com/r/singapore/comments/1rgz8a1/sia_scoot_flight_cancellations_amid_us_and_israel/",
      "score": 111,
      "num_comments": 0,
      "created_at": "2026-02-28T18:25:16",
      "selftext": "",
      "comments": []
    },
    {
      "id": "t3_1rh472t",
      "subreddit": "singapore",
      "title": "Goalkeeper Ivan Susak scores for Lion City Sailor, as they hang on 3-3 to draw Albirex Niigata keeping their unbeaten run",
      "url": "https://old.reddit.com/r/singapore/comments/1rh472t/goalkeeper_ivan_susak_scores_for_lion_city_sailor/",
      "score": 70,
      "num_comments": 14,
      "created_at": "2026-02-28T22:35:58",
      "selftext": "Drama at Jurong tonight, as multiple penalty chances for Albirex Niigata were denied. And a physical altercation right at the end of the game. Shouting from the bench and the players throughout. Absolutely bonker games",
      "comments": [
        {
          "text": "The officials should have instructed LCS coach to back off when ref was reviewing VAR. Weak.\n\nThe LCS guy should have gotten a yellow at the end for that scuffle. Not to mention that one of the penalties should have been awarded to Albirex.\n\nCome on this is utterly pathetic. Is this LCS league or Singapore Premier League?",
          "score": 27
        },
        {
          "text": "What a game! VAR is a joke for even sending the ref to review that last incident lol. After the last couple controversies I really wondered what type of training those VAR officials had.",
          "score": 23
        },
        {
          "text": "Gutted for Albirex for the controversial decisions that went LCS' way but not their way. Nothing is more beautiful than a GK scoring a goal. And at least I won some money because I bet on a draw and I could reclaim some money that I lost from the $12m toto.",
          "score": 10
        },
        {
          "text": "Felt like Bailey should have gotten a card",
          "score": 5
        },
        {
          "text": "Gutted for albirex. Should have been a pen or two. If it was the other way round I'm sure at least one will fall LCS direction\n\nNot to mention the added on time..",
          "score": 3
        },
        {
          "text": "Tampines Rovers next league game is Young Lions, good chance to reduce the lead at the top to just two points.",
          "score": 2
        },
        {
          "text": "Idk but felt some bias on LCS side but great goal anyway",
          "score": 2
        },
        {
          "text": "Game of the season thus far for sure. But the standards of refereeing in SPL is shit.",
          "score": 1
        },
        {
          "text": "shopee league. hilarious.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rhk35w",
      "subreddit": "singapore",
      "title": "After a promotion, I wanted my colleagues to keep liking me. Earning respect was harder",
      "url": "https://old.reddit.com/r/singapore/comments/1rhk35w/after_a_promotion_i_wanted_my_colleagues_to_keep/",
      "score": 47,
      "num_comments": 24,
      "created_at": "2026-03-01T09:27:01",
      "selftext": "",
      "comments": [
        {
          "text": "Colleagues generally ‘like you’ when you are the same level as them/aren’t a threat.\n\nIt’s just a primal thing, especially when you see someone moving ahead of you and potentially being in charge of you at work.",
          "score": 87
        },
        {
          "text": "likeable and respectable doesnt mix well\n\nhad a boss once, everyone likes him, he is funny and unintentionally makes a fool of himself, kowtows to big wigs and though wants to, not effective in defending the team, respect goes down the drain",
          "score": 31
        },
        {
          "text": "As a boss, sometimes you have to be that \"asshole boss\" otherwise your employees will walk all over you. Literally seen this with my own eyes. There are times when you can be on \"bro\" terms and times when you gotta lay it on them if people aren't delivering. Easier said than done but that's what you're paid to do.\n\nUnfortunately had a 'weak' boss where everybody was just stepping over him. Eventually was pressured to resign by the management.",
          "score": 25
        },
        {
          "text": "I couldn't stay \"me\" – I had to be \"girl boss\" me.\n\nNevertheless, I kept finding ways to lean into my authenticity at work because that's just who I am. I'm not the confrontational sort. I wanted everything to be as harmonious as possible and, more importantly, to be liked by my colleagues, whether they were\n\n Not to say that men dont suffer this problem, because it can be.but this is an issue especially for women. Being assertive is seen as a negative trait.",
          "score": 10
        },
        {
          "text": "More like unhappy that you are promoted ahead of me",
          "score": 7
        },
        {
          "text": "If they become your subordinates, things will nvr be the same. As they say, it gets lonelier the closer it gets to the top.",
          "score": 5
        },
        {
          "text": "Your colleagues are not your friends. Remember that.",
          "score": 3
        },
        {
          "text": "Some said it is better to feared than liked. Saf, glcs",
          "score": 3
        },
        {
          "text": "Earning respect is never easy, whether is from your colleagues, peers or even management. Liking is not hard, as long as you 'agree' with them. ",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1rh7dx7",
      "subreddit": "askSingapore",
      "title": "Christians of Singapore, how much do your pastors earn?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rh7dx7/christians_of_singapore_how_much_do_your_pastors/",
      "score": 439,
      "num_comments": 264,
      "created_at": "2026-03-01T00:46:19",
      "selftext": "Well, it is about time Churches have their Annual General meetings. I found out my small local baptist church in the central area has our Pastor drawing 100,000 - 200,000 SGD yearly. Honestly when I saw the notes I was like wth(?) Context: I come from a low SES family and parents combined income don't even hit the monthly median income in Singapore.  \n\n I mean of course I do not expect the Pastors to live hand to mouth but honestly, 100,000 - 200,000 SGD yearly is really alot? \n\nReligion is really like an enterprise nowadays so I want to get your thoughts ",
      "comments": [
        {
          "text": "Why would a man of god need so much money",
          "score": 575
        },
        {
          "text": "The monk at a Buddhist meditation centre I sometimes go to is paid a monthly stipend of $700. That’s $8.4K per year. He used to be a highly paid engineer. I’m shocked at the $100K a year for this pastor. ",
          "score": 545
        },
        {
          "text": "\"If you paid your tithes faithfully this year, next year I can buy new car.\"",
          "score": 225
        },
        {
          "text": "catholic church, my priest only earn an allowance of 800 to 1000.",
          "score": 208
        },
        {
          "text": "when I was in poly, a friend brought myself and couple of friends to some weekend session in a landed house in Thomson area. its not even a church, just somebody's landed house. in the living room are rows of chairs then some dude sat in the middle at the front conduct some prayers. speak halfway and while everyones heads down and eyes close, they pass a basket around collecting $, or whatever you call that. i was there for fun, so i peeked and people were putting like $50, $100, $10s. i put $0. there were like at least 20+ people there. then i asked my friend, he told me they host like 3 sessions a week, friday sat sun. easy money huh, just cater some pastries, syrup water and a short 10mins prayer session and after that everyone just gather and chit chat talk about their lives etc ..",
          "score": 150
        },
        {
          "text": "Pastor Kong Hee of City Harvest Church used to make an average of S$500,000 per year from speaking engagements alone ",
          "score": 148
        },
        {
          "text": "The crazy part is who is deciding this amount? God? Technically, as people of God, they are supposed to base it on God right? No? Or they received a \"vision\" from God stating that they should be earning this much?\n\nEdit: Regardless of any of the above possibilities, they're all equally bad. I used to attend a certain church whose pastor harvests money from the masses and lives at Sentosa. I remember my cell leader reprimanding us, secondary school students, for not donating up to a thousand dollars (over a few months, but still) because they keep track of our donations. I was the only one not from a Christian family, while my churchmates were donating amounts backed by their parents. Yea, the cell leader even had a private talk with me as to why my tithes are so little per week: in cents as opposed to 50 to 100 dollars. I was only receiving 2 dollars a day for pocket money then. I think there was some internal reward system, perhaps in the form of recognition, for cell leaders who can get members to donate the most. I left the church from the pressure of tithing and something felt off. I am a secularist today.",
          "score": 119
        },
        {
          "text": "In an (infamous) mega church now and the pastor is probably a multi-millionaire 🤷🏻‍♀️",
          "score": 94
        },
        {
          "text": "Interesting,\n\nMosque Imam (similar to pastors) are paid 2-3k a month and their salary is paid by the governing body (MUIS). Sometimes people do make small alms/donation after sermons/prayers (if any) like $2-$10.  \n  \nAll imam's make the a similar amount. Is there not a similar organisation for Christianity to mandate this type of things?.",
          "score": 66
        },
        {
          "text": "I believe for my church, a Catholic church, they are paid about 500 to 1,000 from what I can find",
          "score": 56
        },
        {
          "text": "my grandpa was a pastor and he helped to found a church in Singapore. He was with the church for 40 years until his death. They didn't pay him much. I am not sure of the exact amount but if I had to guess it was around 1000 a month towards the end of his life. (which was supplemented with an allowance from my dad and my aunt)\n\n I remember one of the sticking points for my family  which eventually led to my dad leaving the church was that they refused to give my grandma any pension or allowance after my grandpa died, despite the fact that she had supported the ministry as the pastor's wife for those 40 years and wasn't paid a single cent during that time.\n\nMy grandpa came from a cult-y sect of Christianity that disavowed material possessions. When he became a pastor as a young man, he put all his worldly possessions (like job certifications, land deeds) on an altar and burnt it as an offering to Jesus.\n\nHe also never celebrated any birthdays or holidays because they were \"unimportant compared to the grand scheme of things.\" I have to say he practiced what he preached. lol.",
          "score": 46
        },
        {
          "text": "My small Christian church pastor (less than 100 pax) draws $3k per month.",
          "score": 42
        }
      ]
    },
    {
      "id": "t3_1rgw6cb",
      "subreddit": "askSingapore",
      "title": "Why do Asian parents like to comment about people’s weight and body?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rgw6cb/why_do_asian_parents_like_to_comment_about/",
      "score": 163,
      "num_comments": 71,
      "created_at": "2026-02-28T15:18:14",
      "selftext": "Singapore cny It’s just frustrating when you have a medical condition and grew fat and they have to comment on your food choices each time or saying you are fat now. It’s just ironic because not like we have no mirrors to see or realise we couldn’t fit into our clothes. It’s already stressful enough and yet have to deal with another’s opinion..",
      "comments": [
        {
          "text": "My family taught me a useful way to take on these comments especially at CNY. \n\n‘Girl, you very prosperous now hor’\n‘Thank you auntie, you also’\n\nFrivolity aside, I’m so sorry. I also experienced this with autoimmune disease and many people’s meaningless but still hurtful comments. \n\nWhen I lost weight and was extremely unhealthy people would tell me they want my disease (even though I almost died). When I put on weight when I got better it was a negative thing. \n\nWhen people think like that, it’s clear they don’t want the best for you. Their opinions count less, but it doesn’t mean it isn’t hurtful and unwelcome. ",
          "score": 160
        },
        {
          "text": "They like to stir shit. I’m slimmer than before but an auntie had to come to my face, look at me and tell me “你发福了” I was stunned. \nI took 2 seconds to respond “oh ok。谢谢你” \n\nShe literally rolled her eyes at me and walked away. lol. Don’t react is the best reaction u can give. They just looking for a trigger.",
          "score": 64
        },
        {
          "text": "lol reminds me of the time when I was still a kid. went to a friend’s house to play and her parents looked at me, made this “wah you so round and fat” gesture with their hands and said to my friend “lucky we make you run everyday, otherwise you won’t be able to run away during natural disasters (like her)” 🙄",
          "score": 54
        },
        {
          "text": "There are many out there who have psychological need to put down others in order to feel good. To protect ourselves, we need to learn how not to let these opinion affect us too much.",
          "score": 43
        },
        {
          "text": "What has this got to do with Singapore",
          "score": 32
        },
        {
          "text": "The next time someone comments, don't react. Stay quiet and look at them. Do not reply, do not say a word, do not justify, just look at them.",
          "score": 30
        },
        {
          "text": "I've been there and unfortunately you need to develop a thick skin so these comments roll off you cuz these \"critics\" aren't gonna change.   \n  \nI usually say \"thanks for caring\", \"ya la work in progress\". \"well my gf love me fat, what to do\". Tried giving them the real reason (also medical related) but they just say \"aiya exuses la\".  so I just stop explaining. ",
          "score": 22
        },
        {
          "text": "comment back what, “ayuh, you so skinny, make not enough to eat ah?”",
          "score": 18
        },
        {
          "text": "A Chinese saying that roughly translate “ do not live in people’s eyes and die in other people’s lips “",
          "score": 15
        },
        {
          "text": "From the generation that destroyed the environment, destroyed housing prices, and is now destroying our mental health.\n\nI thank GOD my parents somehow can see that in their siblings and do not partake in such behaviour.",
          "score": 10
        },
        {
          "text": "just comment back to them, see this person or that person are millionaires, when you all going to do the same",
          "score": 9
        },
        {
          "text": "Is not just parents is the culture. Even when during back in school days, my teacher would also commented \"you eat a lot is it. How many bowls of rice? 2?\". \n\nI wasn't even obese back then- I'm at the healthy weight range but because of my build (think swimmer built), I don't look like your average skin and bone.\n\nBut yet people always commented I am fat. \n\nThen when I started to drop the weight, to prove a point I can reached 40s++kg, people also commented \"omg what happened. Any terminal illness\". \n\nAnd now I still feel society is judging because of social media (holding A4 size paper at waist, squeezing between poles etc). 🤷‍♀️",
          "score": 6
        },
        {
          "text": "Because they don’t know you well enough or remember enough details about you to hold a decent conversation with you. \n\nWhen you are a kid: how is your PSLE/ go what sec sch/ O level/ N level/ A level/ go which poly? What course/ go which uni? \n\nWhen you’re working: where you working now/ what you working as/ how much you earn/ you grew fat/ you too thin now\n\nJust surface talk back to them, don’t get emotionally affected, you meet them at most once or twice a year.",
          "score": 6
        },
        {
          "text": "The freaking irony is those older relatives that comment on other's weight are the fattest themselves.",
          "score": 5
        }
      ]
    },
    {
      "id": "t3_1rgvko5",
      "subreddit": "askSingapore",
      "title": "Single folks in their early 50s, how do you manage your Life now?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rgvko5/single_folks_in_their_early_50s_how_do_you_manage/",
      "score": 129,
      "num_comments": 41,
      "created_at": "2026-02-28T14:44:06",
      "selftext": "Finally reached the age 50 this year. I have considered half of my life journey completed. For single folks in their early 50s, how do you manage your life now? E.g., do you still hope to find a life partner, etc.?",
      "comments": [
        {
          "text": "am 48, some thoughts below\n\n\\- am single, not actively looking for partner, happy with current situation  \n\\- already feeling body aches, hoping to start regular exercise  \n\\- made request to HR to switch to part-time, still in planning process  \n\\- personally do not forsee full retirement, likely try to work part-time to beat inflation and also keep myself active  \n\\- already have a 2rm bto, no plans for any major changes, happy with 35sqm space  \n\\- trying to reduce tech usage and social media \\[am failing since i am on reddit, lol\\]  \n\\- attended mindfulness courses over past 2 years, still working to incorporate it into daily practice  \n\\- my main focus now is on tidying my home, am someone that procrastinates, so that it affecting both work and personal life  \n",
          "score": 159
        },
        {
          "text": "I don't think it's too old to find a partner as long as you don't close yourself to the possibility. After my MIL passed away, my FIL did nothing for 2 years, just grieving, but after that his friend convinced him to join a hiking group for elderly, then from there he also joined an exercise group, and also a travelling group. Through those he met his new girlfriend who is older than him, she's been divorced for 30 years with grown up children. My FIL is 72. They've got no intention to marry, but just enjoying time together",
          "score": 129
        },
        {
          "text": "Life partner. No.\n\nManage. Do things you enjoy (while managing health and wealth). Don't engage with negatives. Oh, I hate this and I avoid doing do this, don't give unsolicited advise. See, hate it already.",
          "score": 46
        },
        {
          "text": "Half? You are closer to 3/4 gone bro. Avg lifespan is 80.",
          "score": 26
        },
        {
          "text": "I'm 45 and I retired this year cuz I don't want to waste my life being unhappy by continuing to serve the unreasonable customers, boss and co-workers anymore.\n\nI'm not single though, I am worse than a single. I am a divorcee with a 25yr old daughter, my ex-husband already cheated and abandoned us when my daughter was just a few months old.\n\nHonestly speaking, I do not think I have \"half a life\" left because my own parents were already too sick to be have a life aka happiness since their early 60s. That would mean I only have about 10 - 15 years of life/happiness left already.",
          "score": 16
        },
        {
          "text": "You stop caring less about what makes others happy and more about what makes you happy. I’m happy to dump friends if they don’t respect my boundaries or if the friendship has become unhealthy. \n\nYou have lower energy levels than in 40s, even worse if you’re a woman. But it’d be important to keep active as an investment for your older years. For me I do weights and cardio. I have friends who do water sports or long distance running. \n\nIn terms of finances I finished paying my house loan, I don’t have a car so no car loan. I keep my credit card limit to the same as when I was in my 20s. I also have some investments which I can cash in on after I’m 60. \n\nI do blood test yearly to track my health markers. Important not to skip. Make sure to go dentist every six months. \n\nOk I have a caveat - I have a partner. More for companionship than for marriage. I do consider him my life partner though. But I think the front part of this comment still applies",
          "score": 15
        },
        {
          "text": "The most difficult age.. too young to retire yet too old and struggle with work",
          "score": 7
        },
        {
          "text": "5 more years to 50. Still doing fine. Not looking to find a partner. ",
          "score": 6
        },
        {
          "text": "Still have 2 elderly parents to take care of so still cannot relax. Thank goodness I have a fairly well paid job so I will work till I unable to do so or till the company does not want me anymore.\n\nI have a long time girlfriend but I do not intend to marry.",
          "score": 6
        },
        {
          "text": "How is life at 50? As compared to 40?",
          "score": 6
        },
        {
          "text": "Thank you all for sharing. May we all be forging strong in health and mental wellness as we age!",
          "score": 3
        },
        {
          "text": "Find a hobby that keeps you engaged. Could be golf etc",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1rgyoyi",
      "subreddit": "askSingapore",
      "title": "Coming from malaysia for the first time to NUS Law as a Blind phd student , any guide and reference that I can use to learn about the university and Singapore in general?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rgyoyi/coming_from_malaysia_for_the_first_time_to_nus/",
      "score": 115,
      "num_comments": 41,
      "created_at": "2026-02-28T17:51:38",
      "selftext": "Folks I am a blind Malaysian, and I'm so happy to continue my lifelong learning in Singapore as a PhD law student. As traveling this far to another country is something that I haven't done before, I would like to learn in advance about getting started and tips and tricks that I can be aware of.\n\nSome things that I am thinking about are apps that I should have on my phone to make things easier. People are talking about apps like SingPass, UApp for grocery, and my transport app to go from one place to another. I also would like to learn more about the culture in the university and how the U-Town residents are like for blind people.\n\nIf any blind Redditors are here, it would be cool to learn other things that are related to how blind people can navigate around Singapore. Any tips and tricks on what I can look forward to in Singapore also would be great, like great places to eat and other cool places that I would find interesting.\n\nThank you so much, folks.",
      "comments": [
        {
          "text": "I'm personally not blind so I can't relate, but I know for a fact that every MRT station in Singapore has tactile flooring that guides you to the main areas in every station (the gantry, the lift, and the actual train entrance itself).\n\nMost pedestrian road crossings have this as well, but the condition of the tiles sometimes can be questionable because they're exposed to the elements.\n\nOn top of that, all the traffic lights have loud audio cues, so it's very clear when you can cross and when you cannot cross.",
          "score": 57
        },
        {
          "text": "Hi OP, do you know about the Student Accessibility Unit at NUS? They organise activities for disabled students (both mental and physical disabilities count, as well as neurodivergent students) including icebreakers so you can make friends when your semester opens and other useful things like library information sessions and tours so you can familiarise yourself with the facilities on campus. You can email them at accessibility@nus(.)edu(.)sg if you would be interested!\n\n\nAs for apps, I've never heard of UAPP. This is what I would recommend:\n\n\n- University Utilities: You will ABSOLUTELY need the *UNivUS app.* This is the NUS student app and you'll need it to enter the library or use the study rooms at UTown, especially if you don't want to bring your matriculation card everywhere or you forget your wallet. It also contains uni shuttle bus timings and reminders for appointments at the University Health Centre or Wellness Centre (the latter offers free counselling and therapy to students). If you want an app that's just for the school bus system, download *NUS NextBus*. You may also need *Canvas* if you're going to be taking classes or working as a teaching assistant (not sure what's required of law PhDs!)\n- Ride-hailing: You probably already have *Grab.* You can also consider downloading *Gojek, Zip* (official metered taxi app), and *Tada* so you can shop around for prices.\n- Public Transport: You will need either an *EZ-Link card* to take buses/MRT, or you can use a credit/debit card via NFC on your phone. This is up to you. If you choose to use an EZ-Link, you might want to use the *EZ-Link app* so you don't need to top it up in person, but iirc you can't top student cards up through the app. As for MRT/bus routes, I always use *SG BusLeh* and a very basic app that's simply called *Singapore MRT* and just shows you a picture of the map lol. There are a few other apps out there and I'm sure other can recommend some to you.\n- Shopping: *Shopee SG* and *Lazada* are the two big apps. Lazada also includes a portal called Redmart, which allows you to shop for groceries to be delivered to your address. If I'm not wrong, you can also order groceries through Grab, but I've never tried it personally.\n- Food Delivery: Shopee doesn't deliver meals here like in Malaysia. You will need to use either *Foodpanda* or *Grab* (Deliveroo is exiting soon, so don't bother with that).\n- Maps: Other than Google Maps, there are also *Citymapper* and *Waze*.\n- Communication: *Telegram* will probably be used by all your classmates to disseminate information regarding interest groups, clubs, and group projects. You can also sign up for channels like @GoodLobang to be alerted about discounts around town, and @sglowcalgigs if you are interested in independent music events. Other than that, we use *WhatsApp* mostly, the same as in Malaysia. Some students might use *Discord* as well.\n- Banking: You'll want a local bank account and the corresponding digibanking app so you can use PayNow and PayLah to buy things or repay your friends.\n\n\nOther than that, I'd also remind you that you need to upgrade your laptop to Windows 11 or you won't be able to use the campus WiFi.\n\n\n\nI'm not sure if you'll actually need SingPass on a student visa, perhaps someone who knows more about this can advise you! Good luck with everything, hope you make a ton of friends :)\n\n\nEdit: One more thing — all the NUS websites like Canvas, EduRec, etc will require you to use 2FA, so go ahead and download *Microsoft Authenticator* in advance.",
          "score": 43
        },
        {
          "text": "dumb as i may sound; what can you see and how did you type this?",
          "score": 33
        },
        {
          "text": "I don’t have any specific suggestions for you since it’s been a good decade since I’ve graduated. I just wanted to say that it’s very respectable that you’re doing a PhD at NUS law as a blind student. Enjoy your time in Singapore, at NUS law and at UTown. Be sure to ask for assistance if you need it, whether from the staff or students\n\nSigned, former NUS law student and Tembusu resident",
          "score": 19
        },
        {
          "text": "There is an free app called Be My Eyes that you can request people help you to see things. https://www.bemyeyes.com/download-app/",
          "score": 10
        },
        {
          "text": "Welcome to NUS! If you haven't seen it already, the Office of Student Affairs has an [Accessibility Support](https://osa.nus.edu.sg/services-support/accessibility-support/) group you might want to check out. The page seems to be focussed on mobility, but I'm sure they have other services.",
          "score": 9
        },
        {
          "text": "There’s a Singapore Association for the Visually Handicapped that may be able to help you - https://savh.org.sg\n\nAlso do check with the NUS Student Affairs office to see what accommodations they can provide for you. All the best in your studies!",
          "score": 5
        },
        {
          "text": "Dude, you’re amazing.",
          "score": 4
        },
        {
          "text": "The NUS NextBus app helps you to navigate the campus and lets you know how to get to places and when buses are arriving. https://apps.apple.com/sg/app/nus-nextbus/id542131822",
          "score": 3
        },
        {
          "text": "You can request a student led campus tour, but it requires payment. https://uci.nus.edu.sg/campus-tour/",
          "score": 3
        },
        {
          "text": "For grocery delivery, Fairprice is the app for the largest grocery store chain, NTUC FairPrice, and frequently has many discounts. Never heard of the app that you mentioned. You can also use foodpanda for grocery delivery and there is a significant discount on your first order.",
          "score": 2
        },
        {
          "text": "Voice enabled feature \n\nHope you can navigate around",
          "score": 1
        },
        {
          "text": "https://osa.nus.edu.sg/services-support/accessibility-support/",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rgvtuw",
      "subreddit": "askSingapore",
      "title": "Insane water bill. How to resolve it?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rgvtuw/insane_water_bill_how_to_resolve_it/",
      "score": 85,
      "num_comments": 63,
      "created_at": "2026-02-28T14:58:51",
      "selftext": "Anyone has met with crazy water bills and how to resolve it?\n\nFor the last 4 months I have been getting like bill for water ranging from $100-$150. Problem is I live alone in a 2bedroom apartment and I turn off my common bathroom toliet bowl totally cos I tot leaking was the reason. but after turning it off, I’m still getting hit by a 150 dollar water bill…….. now my electricity is cheaper than my water tbh\n\n\\*Cries in poor\\*\n\nEdit: I saw alot of comments on my water usage.\n\nI use dishwasher once a day, I rinse my dog pee tray once a day, 2 showers per day, and 2-3 times max per week on the washing machine. For 2 years plus it was below 60sgd per month. The highest was my first 3 months with my new puppy when he pee and poop too much in the toliet and even so the highest was 80Sgd.\n\nIt doesn’t make sense 😭",
      "comments": [
        {
          "text": "suspect same as other commenters there may be leaking. for me, i take meter reading once before i go to work, once when i am back. monitor over few days. there should not be any significant changes since no one is using water. \n\nanother way could be check any pipes, wall started have signs of molds. they may indicate pipes leaking within.",
          "score": 85
        },
        {
          "text": "The water might be leaking elsewhere. Check thoroughly all of your taps and toilet bowls. Last year we found out our shower head was leaking, just a drop every few seconds. Then after fixing that, the bill was cut half 😟",
          "score": 79
        },
        {
          "text": "The monthly bill is an estimated average, until the guy comes to check the meter. Can submit your own readings to confirm the actual usage",
          "score": 37
        },
        {
          "text": "How are you using your water?\n\nIf you wash a lot of dishes, then get a dishwasher. My 4-room BTO flat with 2 cats, 2 adults and 1 baby is using way less water than my childless neighbours because of the dishwasher.",
          "score": 20
        },
        {
          "text": "Turn off all appliances that uses water; washing machine, dish washer, etc\n\nNote the meter reading. If the meter moves in the next few minutes, there is a fast leak.\n\nCheck the water reading after an hour, for slow leaks\n\n  \nTo check if your toilet flush is leaking\n\nAdd a few drops of coloring to the water tank\n\nWait 20 to 30 minutes without flushing. If the bowl is coloured, there is a leak.",
          "score": 13
        },
        {
          "text": "Can you turn off all your water in the house and check the meter if its running?  \nIf yes, then you have a leak.\n\nIf the leak is not visible on the walls or floor, check for areas where ants roam.",
          "score": 9
        },
        {
          "text": "Mine is gas in my utilities bill… doesn’t even make sense at all because I don’t cook and they can charge me $50 per month for just the water heater! 😡",
          "score": 5
        },
        {
          "text": "List down your water usage habits, some activities use a lot of water like laundry (usually for some it spike for most before major festivals like CNY because of cleaning). If you haven't made major changes to them, there might be an undetected leak somewhere, you might need professional help to find it. Try turning off the main water pipe every day u leave your unit, see if there's any changes, if there are a significant drop, it might a leak somewhere",
          "score": 4
        },
        {
          "text": "Something is off with your numbers . This is too high . For reference , I am paying 50 plus for a family of 5 with one helper and a pool .",
          "score": 4
        },
        {
          "text": "Check for leaks, see if the water meter is moving when you don't have any water running. It might also be a defective water meter",
          "score": 3
        },
        {
          "text": "See the water meter if it is moving when everything is off (record the number and 1 hour come back see if it has moved) if yes it has a leak somewhere",
          "score": 3
        },
        {
          "text": "Maybe you should also check your meter for tracking purposes in this case",
          "score": 3
        },
        {
          "text": "I leave my water dripping intentionally and it's still only about 30bux a mth.\n\n\nSomething is seriously wrong here, get a plumber who can check on all potential water supply areas. I also probably flush my toilet a billion times a day, an exaggeration but just number 2 will deserve at least 6 to 10 full flushes. \n\n\nAnd my water bill don't exceed 40 a mth. My washing machine is also 10kg top loading so uses alot of water and wash it everyday on full water. ",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1rgvuug",
      "subreddit": "askSingapore",
      "title": "Where to go to buy laptops in SG?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rgvuug/where_to_go_to_buy_laptops_in_sg/",
      "score": 48,
      "num_comments": 41,
      "created_at": "2026-02-28T15:00:26",
      "selftext": "Looking to get a new laptop. Budget 1.5k? Casual use. Where can I go to look at different brands of laptops and price is reasonable? Is it Harvey Norman or best Denki? Any recommendations? ",
      "comments": [
        {
          "text": "Tbh for 1.5k casual use. MacBook air. No need to look see. Should get minimum 4-5 years outta it easy. Got my m2 base config in 2022 for about $1.5. Still feels as smooth as day 1.",
          "score": 119
        },
        {
          "text": "MacBook Air with the m series chips. U can buy refurbished from Apple directly and self collect. Cheaper than educational savings. \n\nFor Apple education, sometimes they throw in a free AirPods which you can the resell for a $xxx. All you need is either a .edu email address to order online, or those student EZ-Link card to buy it in person from Apple store",
          "score": 32
        },
        {
          "text": "Not aftershock.",
          "score": 25
        },
        {
          "text": "Need more info: what will you use it for by casual?\n\nBasic day to day use? Macbook Air. Easy, fast, great battery life, great screen for consuming stuf, and will last you about 5 years and look good doing so. It's also easier to do some of the more artsy stuff with Mac compared to Windows.\n\nGaming? ASUS or Lenovo Legion series. But 1.5k is very thin. You're probably getting not great laptops for high end games.\n\nDeveloper or work? Lenovo thinkpads. In fact, get the slightly older second hand ones in SLS because those were built different. Use that extra money to get decent peripherals. Better yet, get this and install some Linux distro for fast and snappy work.\n\nSim Lim Square or Apple is probably the better choices. They will know their tech a bit better than people in HN or Giant or Denki.",
          "score": 21
        },
        {
          "text": "Yeah like the other guy said just macbook if completely casual use, office work etc. if any gaming then windows, for which I say get Asus or Lenovo, Acer or dell for slightly cheaper choices",
          "score": 12
        },
        {
          "text": "Wait for 2 weeks, look for budget deals in upcoming IT show",
          "score": 12
        },
        {
          "text": "Lenovo Yoga Slim is not bad if you can get it on sale",
          "score": 10
        },
        {
          "text": "today macbook provides more value at same price to most if not all windows laptop. but if u want to use windows, be familiar w which flagship for the category ure looking for from each brand first. they tend to receive more quality attention from manufacturer",
          "score": 7
        },
        {
          "text": "Online. Lenovo had pretty cheap laptop with OLED screen. I bought for 1.4k (AMD AI 7 350, 32GB DDR5, QHD 120HZ OLED, 1TB NVME) ",
          "score": 5
        },
        {
          "text": "for casual use, u may not need so expensive laptop, $600 may be good enough, the best deals are often online, cos retail stores sometimes don't carry cheaper models\n\nlook for official stores of the following brands on lazada or shopee  \n\\- acer  \n\\- asus  \n\\- hp  \n\\- lenovo  \n\\- msi",
          "score": 5
        },
        {
          "text": "i’ll just get a macbook air. the longetivity is good",
          "score": 4
        },
        {
          "text": "I recently got a MacBook air, decently good price from Harvey Norman for 1.1k. \n\nIt has great battery life and super slim profile. If you want, can add apple care+ so still within your 1.5k budget.",
          "score": 3
        },
        {
          "text": "MacBooks are generally a very good option for casual use and they are surprisingly robust. Also tends to have better displays which can make the viewing experience more enjoyable. Do note that if you get a MacBook, you are stuck with it because you cannot adjust the specs with aftermarket parts. ",
          "score": 2
        },
        {
          "text": "wait for comex at suntec in march if you can, you can negotiate a good deal usually there but honestly, if windows laptop isnt a priority, macbook air is the outright choice, as seen in the comments as well.",
          "score": 2
        },
        {
          "text": "Can look at refurbished laptops from myhalo, similar concept to compasia. Surprised to see so many others recommend macbook though. Personal preference but apple tech is so anti consumer and unfriendly to repair plus the repair fees are so ex makes it hard to recommend imo.",
          "score": 2
        },
        {
          "text": "Go challenger to compare and see what u like.. shop around once u decided on the brand and model",
          "score": 2
        },
        {
          "text": "Walk around sim lim square",
          "score": 2
        },
        {
          "text": "Apple shop. Spending 1.5k on a windows laptop is a massive waste of $",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1rgy5ii",
      "subreddit": "askSingapore",
      "title": "Is it hard to break out of a low starting salary in Singapore? + contractor to FT conversion question",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rgy5ii/is_it_hard_to_break_out_of_a_low_starting_salary/",
      "score": 40,
      "num_comments": 32,
      "created_at": "2026-02-28T17:16:25",
      "selftext": "Hi all, wanted to get some honest perspectives from people working in Singapore.\n\nI’ve heard that if you start with a relatively low salary, it can be difficult to “catch up” later on because:\n\n•\tInternal annual increments are usually around 3–5%, so growth is gradual.\n\n•\tWhen switching jobs, many companies ask for your last drawn salary and use that as a reference point for their offer.\n\nDoes this mean your first salary kind of anchors your long-term trajectory? Or have people successfully made bigger jumps despite starting lower?\n\nI also wanted to ask — *what usually happens if you start as a contractor and later get converted to full-time?*\n\nDoes your pay typically stay the same, increase, or sometimes even decrease after factoring in benefits?\n\nWould really appreciate hearing real experiences. Just trying to understand how much of this is myth vs reality in SG context.",
      "comments": [
        {
          "text": "I know of a hiring manager who always fight for salary that the candidate asked for even if it is above their budget - that is, if the candidate show high capability and good attitude. \n\nGood employees are not easy to come by and we all want to work with them. \n\nYour strategy could be to exhibit high value add to get the salary that you wanted. Besides last drawn, an offer from another company for a similar role or Glassdoor salary can also be used for benchmarking.",
          "score": 35
        },
        {
          "text": "I started at 1.8k 19 years ago and now I’m at the 250 - 330k scale. \n\nThe key is not to disclose salary but to reframe nego around value add and the utterly irreplaceable knowledge expertise you bring to the table. . Remember, wages are about a game of chicken. You’re free to ask what you want, the other party is free to reject. Ultimately, one side will crack. \n\nMy best advise to you right now, is to pivot from generalist to specialist as quickly as you can while you’re young, and stretch horizontally between geographical scope, exposure and impact. \n\nThat’s actually the sweet spot for Singaporeans in a competitive region. We don’t exercise or respect our relative ease of mobility enough. And instead, we waste time complaining or stay in jobs that limit your stretch potential. That’s massive silly. ",
          "score": 33
        },
        {
          "text": "It’s possible but usually with MNCs, and with roles that are difficult to fill. Govt, LLE and SME budgets are more limited. I have personally gotten 70%-100% jumps before by not revealing my previous pay citing contractual restrictions. It’s usually for the hiring manager to advocate for you because HR will want to stick with the budget. I was lucky that a lot of managers that advocated for me were foreigners who sought quality over price.",
          "score": 14
        },
        {
          "text": "Yes, started at 2.5k in 2014 and it was rough. Only managed to get to 5kish after 10 years. Tried jumping around, but the market wasn’t good and they use your last drawn as a reference, so in a way you’re stuck again playing catch up.\n\nBut I had no choice but to take that 2.5k job because it was either 2.5k or nothing. At least now I’m doing something that I like and even though I’m not earning big bucks, the benefits are really good. So you win some, you lose some, I guess.",
          "score": 8
        },
        {
          "text": "I started at 2.5k in 2009, and was drawing 12k in 2020 when I left. It’s doable.",
          "score": 6
        },
        {
          "text": "In public healthcare, yes, if u start low u have to double ur effort to pick up compare to ur other higher pay incompetent peers",
          "score": 5
        },
        {
          "text": "i started at ~30k annually in 2017/2018, now i’m at about ~110k range. it’s possible but it’s definitely a harder climb than everyone else who started out at a higher base pay. I’ve learnt that switching jobs (not too frequent of course) is the only way I can increase my base by a significant amount, or use it and try to get your company to counter offer (but with this, you also have to be prepared to leave the job if they don’t counter offer). \n\nI lucked out and got a significant increase when a recruiter company reached out for a contract role for a huge company, but i would be under the recruiter (third party)’s payroll. They did not ask for my last drawn, and even when i stated my expected, they increased it and said they can pay higher so she asked for the max amount for me (probably because they do get a cut out of your annual or monthly pay?), so i guess not all contract roles are bad but then again, depends on your life stage and commitments at that point.\n\nNow, from my experience, quite a few American/global companies don’t ask for your last drawn but just ask for your expected and they’ll tell you if you’re within budget (again this really depends).",
          "score": 5
        },
        {
          "text": "It's possible but it is a grind. It will be a lot of job-hopping (reasonably) because that is the only way to get your base to increase significantly. When you do job hop, ensure that you're going down a consistent route of progression, not just for the money. The main money maker is specialising. That's what gets you high paying jobs. So try your best to refine your skillset and become an authority in the field you're in. \n\nDepending on your luck, you will meet hiring managers that value you and those that will try their best to scale you as low as possible. But in the end you will be making more. ",
          "score": 5
        },
        {
          "text": "Of course. But you need to be good and know how to take calculated risks.\n\nI know someone who started more than 15 years ago at just 3k plus per month as a graduate. Now getting more than ten times that.",
          "score": 3
        },
        {
          "text": "I’d say possible and sometimes depends on your luck. I was underpaid at the first few years of my career but very lucky when i joined my previous company, they did not asked for my previous salary. So i manage to ask for close to 50% increment.",
          "score": 3
        },
        {
          "text": "It is doable. Started career during Lehman bro crisis 2009 at $2k. Did contract jobs for 5 years then finally pivot into perm. Now $13k.",
          "score": 3
        },
        {
          "text": "Of course it can happen. Sadly it really is \"get good\" situation.\n\nIt does affect. But it doesn't have to decide your end state.\n\nEvery conversion is not the same.",
          "score": 2
        },
        {
          "text": "Yes and no. I broke out of it. But I was in tech adjacent jobs in the late 2010s which was a nice fun time for job hopping.\n\nI started 30% below the median for my degree, especially for someone who did okay. People were surprised but i did it for the greater exposure to an area I was less familiar with.\n\nI stayed for awhile in my first job as well even with a low salary. Then I jumped like crazy, changing jobs about yearly. But my pay essentially tripled over the 4 year period. But it's not easy or fun. You have to get a lot out of each job, learn quick and learn what you can within the year. And the key is also be very very aware of every job, what direction you are taking your career in and where do you think has potential for your industry. \n\nBut at some point you can't just jump as freely. Not just because your pay reaches a glass ceiling but also you are at the whims of the job market.\n\nIt's very possible to break free from a low starting pay. My pay is pretty good across my age group and even vs my peers who started with much higher pay than mine. But it's going to be a little tougher and takes more planning. If you are more of the, well let whatever comes just come and aim for nice wlb and happy easy jobs, it's going to be hard to break out. But if you work at it, proper planning and learn quick, then it's very possible. People can say poor job market, but I was jumping during the covid times and tech winter as well.",
          "score": 2
        },
        {
          "text": "Possible, but you probably had to jump a few times",
          "score": 1
        },
        {
          "text": "Not really. If you get promoted, often you will jump to the minimum pay for that job grade, even if you were hired low. Same thing when you change jobs and the new role is an upgrade. \n\nContractor to full-time cannot be generalised. Usually won’t go down, I guess. But there are other contractor jobs where they will make if known that the pay is higher because there’s no possibility of conversion.",
          "score": 1
        },
        {
          "text": "It actually depends on your industry how many tiers of employer there is. Although most company will offer relatively to your last drawn, but if you go from a small sme to some mnc, there is salary bracket and HR will not offer outside of salary bracket.\n\nSo to fix low starting salary in early career, try to make sure you are good enough to move into a better paying employer with higher pay band at similar role/level. This should be the kind of job hops you wanted in your early career.\n\nContractor to FT conversion just depends on your company and mostly also your industry practise.",
          "score": 1
        },
        {
          "text": "It's hard but possible. In 2016 I was doing a contract job drawing 3k. Today in 2026 I'm drawing 13k.",
          "score": 1
        },
        {
          "text": "started at 4k last year july at an sme as a one year contractor because i could find any jobs, hopped to mnc last month and got 60% increment\n\nmy salary is probably the lowest there and i think its because its anchored on my last drawn, but the gap is only a few hundred so im not bothered about it. I did encounter very snarky recruiters along the process though, will share the most memorable here\n\nrecruiter from cgp: \"whats your expected salary\"?\nme: 4.8k\nrecruiter: why do you think you deserve 4.8k? you only joined a few months ago and already asking for such a big increment?\n\nBased on this i think you will feel the anchor effect strongest with external recruiters or sme\n\nlearn as much as you can while keeping an eye out for jobs, wait for the opportunity (interview) to come and dont mess it up when it comes\n\nalso, dont fixate on staying for a year just so \"it looks better on your resume\", just have a good reason to jump so early",
          "score": 1
        },
        {
          "text": "yes. i am one of the hiring managers and if i have your last drawn as a reference, you can be damn sure i use that as a reference when i draft your offer regardless of the range i am authorised to go.",
          "score": -7
        }
      ]
    },
    {
      "id": "t3_1rhk9p5",
      "subreddit": "askSingapore",
      "title": "Moving out of SG Parents’ nest",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rhk9p5/moving_out_of_sg_parents_nest/",
      "score": 33,
      "num_comments": 27,
      "created_at": "2026-03-01T09:35:29",
      "selftext": "Unmarried adults who have yet to turn 35 and can’t buy a HDB resale or get a 2-room Flexi who chose to move out of your parents’s nests for whatever reasons you had, how is it going? How has your relationship with your parents/family been? Does it improve or get worse? Am asking as I’m considering to move out for my mental health and sanity. Have been looking around the rental market in SG over the last two weeks to find a place near my parents. If there are tips to look out for in places to rent in the current SG rental market, please do share it too!  Thank you in advance!(: ",
      "comments": [
        {
          "text": "I'm a divorcee with a child but then your question is applicable to me too. Long long ago, when I first got divorced, I was poor, young and homeless. I moved in to live with my parents while I was saving up for downpayment; it took me 7 years to achieve it.\n\nDuring those 7 years, my parents were bullies, asked me to pay room rental because I am no longer considered their daughter (cuz I got married). Now and then they also angry with me when my baby cries. They also said I am a disgrace to them because I am the only person in their family tree to get divorced. (Note: my ex-husband cheated, wasn't my choice.)\n\nAfter moving out, no more bullying, no more shouting and no more quarrels about anything at all. I only see them a few times a year; the most recent visit was on CNY, I went to give mother ang bao only.",
          "score": 35
        },
        {
          "text": "I’m not the “moving out because I’m 35” camp, but I belong to the “move out because I got married” camp. Can chime in on the relationship part. For me, my relationship with my parents got better, because they are not constantly nagging at me. My parents are quite controlling and if things are not done a certain way they would start nagging which really drove me crazy, as I value peace and quiet. Now they don’t see me, they don’t nag, and they show care non intrusive ways which I appreciate. In my case, absence DOES make the heart grow fonder.",
          "score": 30
        },
        {
          "text": "Maybe there should be a new dating category.\nSingle\nSingle not looking\nIn an open relationship\nSingle, not looking but want a partner on paper to get a bto and lead separate lives.",
          "score": 16
        },
        {
          "text": "26F, late last year i gathered the courage to express my intention to move out. i'd made the decision and signed the rental agreement already before i informed my parents. that period of time was hard bc i had to deal with their displeasure over my unilateral decision as well as concerns over finances. all the mistakes i'd ever made in my life were rehashed once again by my dad. i think he just couldn't understand what was so bad about living at home when i had so much to be grateful for and they had done so much for me despite my flaws. so breaking the news to them was the hardest to overcome bc it's hard not to care what my parents think of me. \n\nregardless, it was a done deal and they couldn't change that so they accepted it. i finally moved out at the start of the year and have been feeling so much more at ease with myself. i visit them at least once a month and it definitely reduces the exposure to friction so i will always be grateful i found the courage to do what's best for myself.",
          "score": 12
        },
        {
          "text": "best is where all housemates are keep to themselves, meaning everyone are out most of the time and stay in their own rooms when resting at home. ideally only 3 to 4 persons in the unit.\n\n\nthe distance from parents means i can hold my tongue and temper in check.",
          "score": 10
        },
        {
          "text": "did it between 24 to 28 because i feel that my parents deserve some peace at home after all they have done for me.  \nvisit them 3-4 times a week (but only 1 weekend so that they can spend 1 of the weekend doing what they want, by themselves).\n\nmy relationship with them has always been good.\n\nim not sure about what u are looking for, but i rented a 2BR condo with no landlord. highly recommend that route.\n\nstopped rented because i got posted overseas (london). then visiting my parents became a monthly affair instead.",
          "score": 5
        },
        {
          "text": "I think after moving out the relationship got better. I moved out in my late 20s.",
          "score": 4
        },
        {
          "text": "For me I moved out due to abuse and I could not stay in shelter due to nature of my job . So I don't bother to visit...like my mom complain here pain there pain then I cook tonic food for her",
          "score": 4
        },
        {
          "text": "I moved out for a few years to get away from the toxicity then came back when I ran out of money. The distance and time away really helped me mentally. I was able to see things more clearly and break abusive cycles. It made me stronger, being without all the distress of living with toxic people. A safe space where I could really take care of myself and no one could harm me.\n\nNow my relationship with my mother is better. Not good, but not so bad. We're not close even though we live in the same house, but we don't fight constantly like we used to. I don't let her take advantage of me and her bullshit doesn't bother me any more. I've stopped expecting her to act like a mother and stopped reliving my childhood trauma every time I see her. And she's kind of treating me better now that she realised I'm not emotionally invested lol. \n\nOverall I do recommend it.",
          "score": 3
        },
        {
          "text": "I'm on the same boat (in a few years). I'd move out anywhere for now, even if it's further away from my parents. Get some distance, heal, get a routine, then move back closer.",
          "score": 3
        },
        {
          "text": "I’m the married at 35 and moved out camp. \n\nMy relationship with my parents has improved somewhat. I think because we don’t interact as much daily so there’s more to catch up on.",
          "score": 3
        },
        {
          "text": "It will get better for most circumstances",
          "score": 2
        },
        {
          "text": "I moved out of my parents place due to it being too toxic and cut off contact with them . It’s been close to 4 years of living alone , my mental health has improved drastically.\n\nWhat’s your budget ? It would be good if you can find a place without landlord , so you can have more freedom to yourself ;)",
          "score": 2
        },
        {
          "text": "Gotten a BTO, but lead time was the super long one of like 5 years?  \n\nDecided to move out to get used to living with the other half. \n\nEven before getting the BTO was going to move out  for this &amp; other reasons. \nRs with family was good, just in terms of independence and living habits they differ, so make it easier for everyone since moving out was sooner-or-later thing \n\nNow will cherish time spent with family more tbh since it isnt a daily thing",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rh5zrx",
      "subreddit": "askSingapore",
      "title": "Any overseas volunteering stint",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rh5zrx/any_overseas_volunteering_stint/",
      "score": 11,
      "num_comments": 12,
      "created_at": "2026-02-28T23:50:49",
      "selftext": "Hello, I am a 32 year old Singaporean. Also female. I would like to check if anyone has any recommendations for a 6 months to 1 year overseas volunteering stint? It can be farmwork or like volunteering to teach. Most important thing for me is safety for women. Intention is to just be by myself for 1 year.\n\n  \nThank you.",
      "comments": [
        {
          "text": "You could try a working holiday in New Zealand! Met a few people on the farms i visited when I was on holiday. There were ladies on their own from Taiwan, China and Japan.\n\nMutual friend was there for close to a year as well!",
          "score": 11
        },
        {
          "text": "Hi I did WOOOF in Japan for a month. I wasn’t alone tho (2-3ppl). I worked in 2 farms, knew minimum Japanese. First one the farmer was really kind and nice. Also took us out for a little bit of sightseeing after we worked for a week. Food was awesome. Second one was a bit more slave labour, bento with plum and not much ingredient, ahma wanted us to work until sundown. So your experience will vary. The website is quite established you can see reviews, type of work (vegetables or involve animals), duration required (some don’t mind short stints some like longer stint), English ability. Good luck!",
          "score": 5
        },
        {
          "text": "You may  try Willing Workers on Organic Farm(WWOOF, Workaways(diff countries, diff sites).",
          "score": 3
        },
        {
          "text": "You cld try worldpackers or websites like those? But those are usually a few weeks i believe? But u can hop arnd maybe? Not sure but i think its worth taking a look at !!!",
          "score": 3
        },
        {
          "text": "try those workaway sites!",
          "score": 2
        },
        {
          "text": "I remembered very clearly there was one that fit your criteria - volunteer for cute animals. Fun, meaningful and a lot of Singaporeans went before so super safe. \n\nBUT I CANT REMEMBER IT NOW. \n\nIll lyk if I remember, are you ok working with animals?",
          "score": -2
        },
        {
          "text": "this is a suitable brainstorming question to ask AI\n\ndid a partial copy &amp; paste of your query, some useful suggestions from chatgpt below, do give it a try with your AI of choice also\n\nas always, do fact-check AI output, as AI can hallucinate\n\n[https://www.unv.org/become-volunteer/volunteer-abroad](https://www.unv.org/become-volunteer/volunteer-abroad)\n\n[https://www.sif.org.sg/Volunteer](https://www.sif.org.sg/Volunteer)\n\n[https://www.habitat.org/volunteer/long-term-opportunities/international](https://www.habitat.org/volunteer/long-term-opportunities/international)\n\nre: safety, have u travel overseas on your own?\n\nsome solo travel tips below\n\n[https://www.smartraveller.gov.au/news-and-updates/safety-tips-solo-travellers](https://www.smartraveller.gov.au/news-and-updates/safety-tips-solo-travellers)\n\n[https://www.gov.uk/guidance/solo-and-independent-travel](https://www.gov.uk/guidance/solo-and-independent-travel)",
          "score": -6
        }
      ]
    },
    {
      "id": "t3_1rgxc4c",
      "subreddit": "askSingapore",
      "title": "Red packet amount for a church wedding?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1rgxc4c/red_packet_amount_for_a_church_wedding/",
      "score": 11,
      "num_comments": 29,
      "created_at": "2026-02-28T16:27:48",
      "selftext": "31F here. A friend from my JC years invited me to her wedding, we were quite close back then during JC all the way to uni, had one shared friend group, but sort of drifted apart after grad. Our current interaction is limited to liking each other’s ig stories lol.\n\nI don’t mind going to her wedding but what do you think is the appropriate red packet amount in this situation? Since I don’t think churches have rates (?)\n\nAccording to the invitation  there will be banquet after the event at the church. No way to know what catering they’ll use. Anyone’s gone through a similar experience?\n\nEDIT: thank you to those who have answered, I’ve learned a lot about church weddings which helped me to come up with a number I’m comfy with. Leaving this post up just in case someone in the future needs the same info.",
      "comments": [
        {
          "text": "church weddings are usually a lot cheaper than banquets so giving a lower amount is definitely acceptable! \n\nPeople normally invite more distant friends/acquaintances/colleagues to the church one, then closer friends and family to banquet\n\nThe rates are very very cheap, usually renting the church is only in the low thousands like under $5k (or even few hundreds for members, depends on the church)\n\nLunch is usually like some catering type thing which usually isn’t too expensive either\n\nSomewhere in the range of $50-$100 is probs good!",
          "score": 22
        },
        {
          "text": "80-100",
          "score": 22
        },
        {
          "text": "I’m a Christian and haven’t attended a church wedding for a long time due to pandemic and I’m past that age when A LOT my church friends are getting married.\n\nMost Christians aren’t calculative in the sense that they will use how much you give at their wedding as a measurement of your friendship lah. If they do then they’re not your friend lor.\n\nI appreciate that you care enough to ask Reddit, so here’s what I usually do— search the market rate of a catering lunch then top up at least 20% more just to cover miscellaneous costs like decor, depends on how close I am to the couple. \n\nMost Christians invite their friends not to “recoup losses” from their wedding or fill up the seats lah, they just want you to be there to share their joy. So you just need to be present and witness the most important day of their lives. How much you give is really not their greatest concern.",
          "score": 12
        },
        {
          "text": "My christian friend used to tell me $50-60 is ok. but that was a few years back. i guess anything between 60-100 should be fine",
          "score": 10
        },
        {
          "text": "60-80 is more than enough, catering usually $30-$40+ per pax \n\nAlso you no longer are close to her",
          "score": 10
        },
        {
          "text": "Give whatever you're comfortable with. Forget about benchmarks, it's toxic AF.\n\n\nIt's not your problem how much they spend since they chose it",
          "score": 9
        },
        {
          "text": "Give whatever you can afford and whatever makes you comfortable enough to want to bless this couple's marriage. \n\nCan we please... stop, enough with this rate nonsense, we are all forgetting the reason why we even give angbao gifts is out of love/care/well wishes for a couple who is starting their lives out... Any amount is a good amount.\n\nDon't give beyond your means and give sincerely. Whatever amount you give is still a gift, let's not continue the transactional, calculative practices and instead gift from the heart.",
          "score": 6
        },
        {
          "text": "A hundred is common and suffice",
          "score": 4
        },
        {
          "text": "$88-$108",
          "score": 3
        },
        {
          "text": "Church wedding don’t have rate. Just give from your heart.",
          "score": 3
        },
        {
          "text": "100",
          "score": 2
        },
        {
          "text": "68$ or 88$",
          "score": 2
        },
        {
          "text": "[removed]",
          "score": 1
        },
        {
          "text": "Churches wedding usually Buffet, just buy some gifts 🎁will do.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rgw257",
      "subreddit": "SingaporeRaw",
      "title": "If million dollar ministers don’t want to have children, how are they suppose to convince ordinary Singaporeans to have children?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rgw257/if_million_dollar_ministers_dont_want_to_have/",
      "score": 519,
      "num_comments": 72,
      "created_at": "2026-02-28T15:11:40",
      "selftext": "",
      "comments": [
        {
          "text": "He wasn't first choice. It just happened the first choice fumbled. But it really isn't in the country's interest to have someone who can't talk strongly on one of our biggest issues.",
          "score": 110
        },
        {
          "text": "A DINK and a single unmarried person telling you to have 3 kids\n\nA SAFOS scholar with 2 fully paid overseas education + regular pay (even while studying) telling you that NS is not a transaction that should be compensated",
          "score": 108
        },
        {
          "text": "At least he’s married. Imagine that spinster asking citizens to have more babies",
          "score": 90
        },
        {
          "text": "Knn later he joke and say “Singapore is my child.”",
          "score": 77
        },
        {
          "text": "If cannot have children he better adopt. Leader leads from front.",
          "score": 69
        },
        {
          "text": "Please do your duty for small allowance. But they draw high salaries themselves.",
          "score": 20
        },
        {
          "text": "If million dollar ministers don't want to use public transport as their main form of transport, how are they supposed to convince ordinary Singaporeans to not buy cars?",
          "score": 16
        },
        {
          "text": "PM no kids ask people to have kids\n\n\nMfND not married ask people to get married\n\n\n\nThey learn from the best. LHL wants to keep oxley ask people to take care of their parents 🤣",
          "score": 13
        },
        {
          "text": "If the institutional professional class, with their job security and level of privilege don’t even want children. What hope do those of us who have to fight for each dollar they earn have?",
          "score": 12
        },
        {
          "text": "https://preview.redd.it/70dfcstrg7mg1.jpeg?width=846&amp;format=pjpg&amp;auto=webp&amp;s=c426da28f06a29fa01d57142c20dfd578a717980",
          "score": 11
        },
        {
          "text": "Lol\n\nWhen you are rich, and in government, it's not your problem. It's the masses' problem. Lol",
          "score": 11
        },
        {
          "text": "They don’t want Singaporeans to have children, taking maternity leave will affect their GDP.\n\nThey rather import people of voting age from Malaysia, China and India.   \n\nIf they truly want to increase the TFR, they would do more for single moms, raise the pathetic baby bonus etc",
          "score": 8
        },
        {
          "text": "Some truth there. To be objective.",
          "score": 6
        },
        {
          "text": "Having children is a personal choice and comes from within. But if the government wants to increase birth rates perhaps delve deeper and find solutions that are family centric. Dedicate teams to make young parents confident of raising a brood of their own. Delve deeper into that reserves instead of just importing new citizens.",
          "score": 4
        }
      ]
    },
    {
      "id": "t3_1rgyoam",
      "subreddit": "SingaporeRaw",
      "title": "This xmm property agent learning from Grayce ah",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rgyoam/this_xmm_property_agent_learning_from_grayce_ah/",
      "score": 290,
      "num_comments": 131,
      "created_at": "2026-02-28T17:50:24",
      "selftext": "",
      "comments": [
        {
          "text": "https://preview.redd.it/a2okfu3nk7mg1.png?width=755&amp;format=png&amp;auto=webp&amp;s=ebfb1813dd033362152bf495ae5655ff304a4a1f",
          "score": 307
        },
        {
          "text": "Sex sells. She isn't the first and definitely won't be the last.",
          "score": 124
        },
        {
          "text": "Huge.... place",
          "score": 88
        },
        {
          "text": "Who the hell is this? \n\nSorry but she needs to at least polish up if she wants to do what Grayce did - not trying to insult her here",
          "score": 50
        },
        {
          "text": "Wah, confirm can close many many many deals. Open many many doors. Wah so big deals.",
          "score": 41
        },
        {
          "text": "She’s the “meat-lover’s” option 🤣",
          "score": 40
        },
        {
          "text": "Melvin drafting a job offer for her rn …..",
          "score": 25
        },
        {
          "text": "plap plap noises from the office 24/7.",
          "score": 17
        },
        {
          "text": "Property agents now dressed like that?",
          "score": 17
        },
        {
          "text": "What language is she speaking in? Without the subtitles, I would have no idea what she's talking about.",
          "score": 16
        },
        {
          "text": "OP's username makes me 😆 \n\nBecause OP's mom told him why is he watching girls online 😆",
          "score": 13
        },
        {
          "text": "got her name?",
          "score": 11
        },
        {
          "text": "Nice personality!",
          "score": 8
        },
        {
          "text": "Hot damn!",
          "score": 6
        },
        {
          "text": "If this is a parody, it’s done in poor taste. If this is real, wonder if any wife will be comfortable engaging this agent.",
          "score": 4
        },
        {
          "text": "重口味",
          "score": 4
        }
      ]
    },
    {
      "id": "t3_1rh59wm",
      "subreddit": "SingaporeRaw",
      "title": "Please have some empathy for preschool teachers (from IG ausometots)",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rh59wm/please_have_some_empathy_for_preschool_teachers/",
      "score": 153,
      "num_comments": 29,
      "created_at": "2026-02-28T23:21:19",
      "selftext": "",
      "comments": [
        {
          "text": "The rot starts at the top. You think this only happens to teachers? \n\nEveryone is burnt out in this hyper competitive rat race.",
          "score": 49
        },
        {
          "text": "Honestly? The parent is spitting facts here. \n\nExtending the timing for preschool does not work. It only works if you’re in a world where everyone’s head is up their own arses.\n\nThe “solution” of extending hours may be counter-productive - Extending the timing for preschools just encourages companies to make their workers work longer and deprive them of time with their children. It does not solve any problem. I’d know, I’m affected. Parents would typically go off on time or early to fetch their children from school.\n\nThe “solution” may worsen current existing problems of childcare quality. The pain points that at the very least I face are these:\n- we have had trouble securing an infant care spot for our child, in a school that has a steady manpower. The turnover rate for the preschool at the bottom of my block is such that it is always changing principals every other year, along with staff - my kid won’t get a steady, much less okay quality of education and care there.\n- we don’t spend enough time with our kid.Due to my wife’s and my working arrangements, my daughter spends on average 11 - 12 hours a day in school, with a minimum of 11.5 hours. She spends more time in school more than we do at work. She’s making milestones like crawling, sitting up, etc., all in school. We just bring her home to shower and sleep every day. We aren’t spending enough time with her, and with the “support”, it’s gonna be backed up by law/government guidelines to be even less.\n\n\nPreschool teachers work longer hours, get paid shit to stay, while taking care of children who can’t take care of themselves. Extending the hours will just worsen the attrition rates. \n\nThere are other factors that make parents not have another child, or couples to have no children at all.\n\nParents, when they have children, basically put their careers at a stop - they have to be ready to bring their kids to see the doctor, stay up later nights to do more cleaning and caring for themselves children they have.\n\nHaving children jeopardises the parents’ careers too, in the modern context - they have to stay ahead of the curve, because of the fierce competition brought forth by the influx of foreign talent. They have to justify their headcount, and make that distinction between themselves and someone else who can get paid less and do the same level of work as they do while working at a compromised level.\n\nWith impediments such as this, being a parent is pretty challenging. \n\nExtending the hours does not provide parents the support they need. It just gives the government an excuse that says “I provide the support that I think parents need after hours of self-jerking-off.”",
          "score": 42
        },
        {
          "text": "It’s not like our education system is the best. We don’t product critical thinkers. We don’t produce academically strong students. The main bulk just gets shoved into the workforce as HR consultants, marketing managers, EHS officers, procurement. Basically filler rolled in a corporation that requires no actual expertise.",
          "score": 22
        },
        {
          "text": "You need both parents income to support a middle income lifestyle, savings for a rainy day, insurance for your family and yourself. Kid need tuition and enrichment classes cause hyper competitive society. Everyone is out for your lunch.   \n  \nIf your parents can't help take care, you will need a maid to help take care of your kids and house work as you are burnt out from work. Can't afford to have a SAH parent cause need both incomes.\n\nGrow old cannot retire cause money all go to kid and expenditure. Kid may not be able to take care of you as they only have one kid so you continue to work till you die.  \n  \nDo they think all Singaporeans earn 10k jobs per person and have a understanding boss that give work life balance? All their stats and survey I think gather from people working for gov is it?",
          "score": 20
        },
        {
          "text": "This is what happens when there is no functioning union.\n\nPeople don't mind working hard. But pay them properly knn.cb dog.",
          "score": 18
        },
        {
          "text": "We must have a 24/7 preschool/childcare service, this way the kids can start their internship at the age of 4 and parents can just focus on their work till they retire at 80.",
          "score": 14
        },
        {
          "text": "Bro no one wants to work unpaid OT, not just preschool teachers.\n\nNurses have it worse than preschool teachers.",
          "score": 9
        },
        {
          "text": "CCL only 6 days a year. Where got enough? One time HFMD already wipe out all 6 days. \n\nThis basic on already cannot fix where got chance of fixing other things.",
          "score": 7
        },
        {
          "text": "I can only imagine how difficult it is to handle a large group of spoiled children on a daily basis.",
          "score": 7
        },
        {
          "text": "Perhaps the narrative of using ai to be more productive should change to using it so be more effective so that everyone can work lesser hours. AI can be a great leveler, or not, depending on how our overlords lean.",
          "score": 5
        },
        {
          "text": "This is one thing I do not understand. Why can’t they have shift work and have a teacher start late and end late?",
          "score": 5
        },
        {
          "text": "Don’t think parents by and large have no empathy towards pre-school teachers. It’s more like the parents themselves don’t have time to even think about such things because they’re also caught in the daily grind that’s steadily getting worse. \n\nThis is a systemic failure on the part of the education system.",
          "score": 4
        },
        {
          "text": "And people wonder why the TFR is 0.87",
          "score": 4
        },
        {
          "text": "they deserve coffee and cute kid hugs daily",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1rh4hwv",
      "subreddit": "SingaporeRaw",
      "title": "SG Husbands, your wife got make the same comment?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rh4hwv/sg_husbands_your_wife_got_make_the_same_comment/",
      "score": 144,
      "num_comments": 118,
      "created_at": "2026-02-28T22:48:48",
      "selftext": "My wife saw the news about the whole reset to increase TFR and her first response is \"叫政府来养lor,每个人一定生的\" *(Ask the government to take care of the children, everyone sure give birth!)*\n\nAgree boh?\n\nAdd on my thoughts:\n\nSG couples mainly can separate into 3 groups.\n\n* First group have lots of babies. (Good for them until they hit financial hardship)\n* Second group want babies but cannot have babies (Still can IVF, etc.)\n* Third group can have babies but don't want babies.\n\nI belong to the third group. Why? Because we're stuck in the situation where, yes we have income, but to have income, we need to work. To work, means our children have to push to someone to take care (childcare, maid, grandparents). If not, is we find a job that we can have time to take care (i.e. ownself be boss, flexi remote work for certain industry, work at flexi lower income jobs to fetch and spend time with the kids). We grow up seeing one absentee boomer parent while the other boomer parent always nag at us and we vow not to repeat their mistakes. So that's why we rather not bring children into this world to suffer.\n\nhttps://preview.redd.it/0hlfh1s699mg1.jpg?width=830&amp;format=pjpg&amp;auto=webp&amp;s=b6057e3edd97b8a192241c8849571ac75fc358ca\n\n",
      "comments": [
        {
          "text": "Minimal effect. People don't think about having kids in the 1st place who in the right mind will think of what happens to orphans.\n\nI say just slap a massive housing discount for every kid in the household. 300k per kid. You see work anot. This makes sense too, cos each kid will need a room right. So lets say 3 kids, means minimal 4BR+Living room (5 room HDB). Which costs around 900k-1.5mil nowadays. 900k max discount means people who want 3 kids don't need to worry about space. If sell, claw back the discount.",
          "score": 110
        },
        {
          "text": "i believe the government just don't want to say the reality - we are at the late stage capitalism where its ugly roots have penetrated the society, and they don't feel confident of dealing with it without impacting the economy. It is not just about giving more grants, building more child care centers, giving more parental leave. It is about -\n\nFirst, as a parent, does your work allows you to be extremely flexible with the work hours? A child isn't going to follow the usual Mon to Fri, 8 to 5 schedule. If they wake up during the night, you have to feed the baby. It's not going to say \"oh i'm going to eat at 7.30am in the morning, 12pm in the afternoon, and 7pm at night. This means that there needs to be extreme work hours flexibility. In the past, the mother took on the role. Now? None. The issue of capitalism. Yeah, you unlock economic growth by having both parents work. But the role of the baby caretaker is now gone. So, parents rely on maids and their parents to help them. But, this is just a stop-gap solution because the parent would miss the growing period of the child. In this case, the parent might as well just be a person who plays with the baby and outsource the caretaker work to someone else\n\nSecond, would the parents feel penalized for taking those child care benefits? If so, then those additional initiatives introduced by the government to improve the situation may as well not be there. For civil service, as it is under the government's direct control, the implementation and usage is pretty decent (at least from experience). But this may not be so for MNCs and SMEs. With babies, parents surely cannot dedicate their full time to work. So, would the company penalize them because of this? Again, capitalism issue as this system wants you to dedicate your time to work. Nothing wrong, but the government and society is responsible for pulling this back. Unfortunately, in SG, the government don't dare to do it, and the society has not developed the social culture to push back. So you get this issue whereby the government have to keep importing people. And those imported people probably won't help to build that social culture needed to push back this capitalism issue. It's just an endless cycle and I won't be surprised if it gets worse overtime.\n\nSo at the end, I feel that they are placing economy first, and all else second. Is it good? I don't know. Perhaps our attractiveness to MNCs is not so attractive after all. And with the outsourcing of work to lower cost countries, things may get worse because locals would then need to put in more effort to maintain that value. Something needs to go, and it is having babies.\n\nAs the years go by, I believe the options for the government will become more and more limited. And we better pray that SG still remains comparatively stable as those new citizens would probably go back to their own country should SG's situation starts to be shaky",
          "score": 98
        },
        {
          "text": "If the environment is hostile, nothing will grow. \n\nLet the rot continue till the soil is fertile once again. \n\nAll hail the great reset.",
          "score": 32
        },
        {
          "text": "Reset by getting more foreigners in, that's a f joke.",
          "score": 15
        },
        {
          "text": "Yup agree with OP. Lack of time is the real reason, not money. Especially for those on the fence or one kid",
          "score": 14
        },
        {
          "text": "even it's free do you want to bring the child to this world? it's endless rat race",
          "score": 13
        },
        {
          "text": "I don’t want kids because I simply don’t like kids. Unfortunately for people like me there’s very little you can do to entice them to have kids.",
          "score": 9
        },
        {
          "text": "Lol my partner die die also want kids though I agree with OP. And funnily we are both super committed to work and work super long hours without offs mostly but my partner still wants a kid, say if theres a will, there will be a way. 🤷🏻‍♀️\n\nFinancially not too worried but same as OP, in order to have the money we have to continue working, and might have to even work more. No parental support in terms of caregiving cause sick and elderly. So more expenses to be catered for external help…",
          "score": 8
        },
        {
          "text": "As a singleton following the current news n some goggle search, I think it more of cannot afford to have kids both financially n time? \n\nLike hy would I want to have a kid n not have time for it? Like if I can only see that kid sleeping, what's the whole point of it? When I cant even enjoy parenthood?",
          "score": 8
        },
        {
          "text": "Things here aren’t set for families. Solution so far is import. It already too little too late to drum up any Taskforce to handle this",
          "score": 6
        },
        {
          "text": "ww3 and ai apocalypse happening soon, still want babies at this time meh?",
          "score": 5
        },
        {
          "text": "Let’s face it. Serving NS is duty of every male. Yet they don’t fully subsidise the child’s growth until NS age. \n\nIf the gov can take care of the child（perhaps forever) then surely spawn a child into the world for the third group.\n\nFor those who don’t want babies, further subgroup:\n- willing to bring baby into the world and give family love, but expenses fully subsidized by gov throughout the baby lifetime\n- willing to bring baby into the world but don’t want to give family love, can “donate” the baby to the gov for their full ownership and care.",
          "score": 5
        },
        {
          "text": "I have something to say, and people are not gonna like it.\n\nI am a parent myself. But what i have observed…\n\nIf you want to have a kid, but you push parenting and caretaking to a helper, or your parents, and only seeing your kid at night or weekends… \n\nThen what’s the point of having a kid? \nMight as well don’t have one, since you dont wanna take care, dont wanna parent.",
          "score": 4
        },
        {
          "text": "As someone who belongs to the die die don't want kids, I'm sorry to fellow Singaporeans. We just don't want the stress, not just to ourselves but for the child.\n\nAs the govt, between giving few hundred K to make people have kids vs importing to keep the population up... If I am selfish I would just import. If I am an office holder making millions over the terms, my future generations are already cushioned against any blowback. Whatever I try to do now, even if it's just optics, and I know won't work, doesn't matter. In a decade I'll be retired, not my problem. My children also won't be too affected.\n\nJust my thoughts.",
          "score": 4
        },
        {
          "text": "No kids = dont complain new citizens. \n\n\nI see low ses with kids, wah piang... grow up sure do deliveroo,  I mean grab.... andwear crocs....and their singlish piang.... and parents treat them like god , sure grow up entitled.....",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1rhomce",
      "subreddit": "SingaporeRaw",
      "title": "I guess singaporeans will extinct",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rhomce/i_guess_singaporeans_will_extinct/",
      "score": 47,
      "num_comments": 43,
      "created_at": "2026-03-01T13:10:38",
      "selftext": "",
      "comments": [
        {
          "text": "Don't worry, we already are",
          "score": 35
        },
        {
          "text": "Says who? We have 30K new citizens which brings TFR to 1.8 which is almost a replacement!!!! Of course, sarcasm 😆",
          "score": 19
        },
        {
          "text": "\"Singaporean\" is just a concept for us and a product for the PAP.",
          "score": 16
        },
        {
          "text": "Honestly when you think about it, it’s pretty normal in the grand history of the world. Empires and civilisations come and go. We were a country that became what it is today due to a miracle, it will take another miracle to keep us going and you can’t keep getting lucky forever.",
          "score": 10
        },
        {
          "text": "You forget to include the amount of future generation lost due to local Singaporeans leaving the country. ",
          "score": 5
        },
        {
          "text": "Immigration is the only solution",
          "score": 5
        },
        {
          "text": "South Korea and Japan says hi too",
          "score": 4
        },
        {
          "text": "nepobaby and crony TFR still going strong.\n\nonly the low SES sinkie they die their problem.",
          "score": 4
        },
        {
          "text": "Ok, but why do you care? By 3rd gen all of us talking here will be more or less dead.",
          "score": 3
        },
        {
          "text": "2200 singapore only have ceca and china residents I am sure. Singlish is a lost language only found in sg muesum",
          "score": 3
        },
        {
          "text": "Cry father cry mother. But we all know who will win the next election :)",
          "score": 3
        },
        {
          "text": "Elon musk already told you that long ago. Serve to protect what? Immigrants",
          "score": 3
        },
        {
          "text": "The Gov, instead of solving the population issue by trying harder to get locals to give birth, they think it's cheaper to get cheap imports... Thank you PAP!",
          "score": 2
        },
        {
          "text": "Just have kids then???",
          "score": 2
        },
        {
          "text": "The sgrean numbers is dwindling due to invasive species. ",
          "score": 1
        },
        {
          "text": "Jarvis , cross references this to Singapore's population count over the years",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rgx2k7",
      "subreddit": "SingaporeRaw",
      "title": "Foreigners can get PR by investing only about $1M SGD",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rgx2k7/foreigners_can_get_pr_by_investing_only_about_1m/",
      "score": 39,
      "num_comments": 31,
      "created_at": "2026-02-28T16:11:49",
      "selftext": "PR given under GIP scheme may qualify through one of three pathways:\n\n1) Investing at least S$10 million in a new or existing Singapore-based business\n\n2) Committing S$25 million to a GIP-approved investment fund\n\n3) Setting up a single family office with a minimum of S$200 million in assets under management, with at least S$50 million deployed into EDB-specified investments\n\nPAP got scammed again, 450 \"high net worth\" foreigners under GIP scheme are supposed to invest $4.5B into SG based on the criteria of $10M per individual. Instead, each foreigner spend $1M can get PR already.",
      "comments": [
        {
          "text": "1mil for PR? Pass. Other countries have citizenships for way cheaper than this.",
          "score": 24
        },
        {
          "text": "They probably included dependents. My in-law got it through this scheme back in 08, it was already 1.5 mil sgd back then and 5 PRs were created.",
          "score": 14
        },
        {
          "text": "Singaporeans can get Japanese PR for even lesser 😄",
          "score": 12
        },
        {
          "text": "Headline says $1m and content says $10million minimum. OP just racist ragebaiting. Whine and complain",
          "score": 10
        },
        {
          "text": "Traitors action party. Selling the country one piece at a time",
          "score": 6
        },
        {
          "text": "This is normal? You can even get pr or citizenship for that amount in other countries. Whats the fuss here?",
          "score": 4
        },
        {
          "text": "For less than the price of an average small condo or a well located HDB.",
          "score": 2
        },
        {
          "text": "Cheap cheap",
          "score": 2
        },
        {
          "text": "Glad to see others know this as well. I mean I think they don't care about the narratives anymore.",
          "score": 2
        },
        {
          "text": "This is somewhat inline with like US and other immigration based countries.",
          "score": 2
        },
        {
          "text": "Fujian Gang can get PR easily 🤣",
          "score": 2
        },
        {
          "text": "This has been around for a long time.\n\nThat is why there are so many \"massage parlous\" and \"spas.\"",
          "score": 1
        },
        {
          "text": "I wonder how much the PAP has calculated a human life is worth",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rhlp05",
      "subreddit": "SingaporeRaw",
      "title": "Dennis the underwear 🩲 Menace",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rhlp05/dennis_the_underwear_menace/",
      "score": 40,
      "num_comments": 17,
      "created_at": "2026-03-01T10:43:07",
      "selftext": "Dennis Kwek, 61yo, pleaded guilty in court on Feb. 27 after stealing 320 pieces of women's underwear 👙 over a span of five years. 😱\n\nDennis worked as an airline security guard at the time of his arrest, was ordered by the judge to undergo mandatory treatment and evaluation.\n\nAfter his arrest, Kwek was taken back to his home, where police found another seven bags containing 310 pieces of underwear 👙",
      "comments": [
        {
          "text": "the fuck? \n\nis this an ai generated article image?",
          "score": 15
        },
        {
          "text": "what's his EDMW nickname?",
          "score": 6
        },
        {
          "text": "Ok, in before the boomers basher in. He ain't a boomer as boomers age are those born before 1965 (so &gt; 61 years old). He is a SG Sucker Gen (after MG and PG). 😆",
          "score": 4
        },
        {
          "text": "Really man, why?",
          "score": 3
        },
        {
          "text": "That’s a lot of underwear.",
          "score": 3
        },
        {
          "text": "Usual suspect",
          "score": 3
        },
        {
          "text": "I cannot imagine the police officer's face when he is the first one to uncover the bags at home!!",
          "score": 2
        },
        {
          "text": "So many underwears... Its more mental illness than anything else.",
          "score": 2
        },
        {
          "text": "Why the face post big big with full name and nationality.\n\nThe driver who killed a girl in chinatown? ",
          "score": 2
        },
        {
          "text": "Don’t understand why there is no sex offender registry here. It should be publicly accessible information. I wanted to create one but apparently PDPA, POHA and some other stuff prevents me from doing so unless I want to get into trouble.",
          "score": 1
        },
        {
          "text": "Weirdo",
          "score": 1
        },
        {
          "text": "pathetic man",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rhnsr2",
      "subreddit": "SingaporeRaw",
      "title": "One of ICA's best work granting citizenship to this divisive nutjob.",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rhnsr2/one_of_icas_best_work_granting_citizenship_to/",
      "score": 31,
      "num_comments": 21,
      "created_at": "2026-03-01T12:28:32",
      "selftext": "",
      "comments": [
        {
          "text": "Why is she typing in third person pov",
          "score": 26
        },
        {
          "text": "And Sylvia NoC",
          "score": 9
        },
        {
          "text": "I do not follow HHH but i am aware of her 'noise'.   \nJust for added info on this incident where her kiddos were taken away by SPF.   \nThis execution can only be allowed at the end of a long and tedious investigation.   \nNot just by a phone call from anyone but a series of investigation including interviews.  \nAnd lastly our Family Court has to approve it.   \nSo the police didnt just go to her place and take her kiddos away.   \nOur law decided it to be the way. \n\n![gif](giphy|Ld77zD3fF3Run8olIt)\n\n",
          "score": 8
        },
        {
          "text": "CPS case go figure",
          "score": 7
        },
        {
          "text": "I mean shes proven shes crazy",
          "score": 4
        },
        {
          "text": "Fak HHH free the kiddos from this lunatic",
          "score": 2
        },
        {
          "text": "Who’s the hubby sia",
          "score": 1
        },
        {
          "text": "She just want to make this like some political agenda of destroying her family. And to be honest how would ICA even know that she will become like this. If you have a system that magically can identify this kind of people, I am very sure ICA will buy it.",
          "score": 1
        },
        {
          "text": "Poor kids. I wonder who will look after them now. I hope they have relatives who are willing to take them in.",
          "score": 1
        },
        {
          "text": "So where is HHH and her husband when the children are taken away?",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rhn6jh",
      "subreddit": "SingaporeRaw",
      "title": "Singapore prime minister attacked by hundreds of Chinese-language fake AI videos",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rhn6jh/singapore_prime_minister_attacked_by_hundreds_of/",
      "score": 27,
      "num_comments": 15,
      "created_at": "2026-03-01T11:56:51",
      "selftext": "",
      "comments": [
        {
          "text": "If you open your doors wide enough to immigrants \n\nYou're encouraging brain drain for people from certain places, usually the brightest or richest are the first to leave\n\nIndirectly you're an enemy of their state, and the first step towards subduing an enemy, is to degrade their credibility",
          "score": 28
        },
        {
          "text": "Well these videos are not necessary in the first place , we already have an ex pap who is hardcore ccp supporter. Just him alone suffice",
          "score": 11
        },
        {
          "text": "They fixed the opposition and now the CCP is trying to fix PAP. I don't support the CCP but I don't feel sorry for the pap.",
          "score": 9
        },
        {
          "text": "Very good friend indeed, kar ching poke until like this already still smile smile shake hand",
          "score": 8
        },
        {
          "text": "![gif](giphy|7k2LoEykY5i1hfeWQB)",
          "score": 5
        },
        {
          "text": "https://preview.redd.it/s1zjszt78dmg1.jpeg?width=680&amp;format=pjpg&amp;auto=webp&amp;s=dc6f5a5449891fc38471a09d9e3674f9459589fc",
          "score": 3
        },
        {
          "text": "Ok I reply liao.",
          "score": 2
        },
        {
          "text": "if I am not wrong, it's due to his remarks that triggered the china people LOL",
          "score": 2
        },
        {
          "text": "This guy is weak. Take Pritam up. He will show how powerful Singapore is. We are multi racial society.",
          "score": 1
        },
        {
          "text": "I’ll probably agree with them anyway. Never liked pap.",
          "score": 0
        },
        {
          "text": "![gif](giphy|rewjaCwj4UTaRI9Yam)\n\n",
          "score": 0
        },
        {
          "text": "https://preview.redd.it/0ls6yuzt3dmg1.jpeg?width=934&amp;format=pjpg&amp;auto=webp&amp;s=d09f985f368ad8b1b18bef0a4a5ea8a4d4d5344a",
          "score": 0
        },
        {
          "text": "Is that why we keep trying to make CECA work? To counter Chinese influence?",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1rh3al2",
      "subreddit": "SingaporeRaw",
      "title": "Squeeze in MRT until breakdown, and snatch HDB from sinkies pushing prices up. Or maybe stay in 3x football field size house is ridout road?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rh3al2/squeeze_in_mrt_until_breakdown_and_snatch_hdb/",
      "score": 26,
      "num_comments": 9,
      "created_at": "2026-02-28T21:57:22",
      "selftext": "",
      "comments": [
        {
          "text": "Letting these people from countries with no civic-mindedness will be the death of us, bet.\n\nChina even worse, they're literally a national security concern.",
          "score": 13
        },
        {
          "text": "Landlord are rich because they benefit from this. \n\nWhy bite the hand that feeds you?",
          "score": 2
        },
        {
          "text": "Put them in the GCB hahahah",
          "score": 1
        },
        {
          "text": "the main question is.. what can we do about it?",
          "score": 1
        },
        {
          "text": "You know what? Just let Johor state be a part of SG",
          "score": 1
        },
        {
          "text": "Giving off great replacement vibes? Locals not replacing 2.1 tfr so mass import a gazillion immigrants?",
          "score": 1
        },
        {
          "text": "Yep.\n The eunuchs and ridout rajas just want to maximise their bonuses",
          "score": 1
        },
        {
          "text": "OP's PyschOps is in full trottle. Either malaysian or a disgruntled S'porean. Sucks to be OP either way",
          "score": 0
        },
        {
          "text": "Ridout is a rental home",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1rhjl37",
      "subreddit": "singaporefi",
      "title": "Built this to search and compare HDB resale prices",
      "url": "https://old.reddit.com/r/singaporefi/comments/1rhjl37/built_this_to_search_and_compare_hdb_resale_prices/",
      "score": 33,
      "num_comments": 10,
      "created_at": "2026-03-01T09:03:39",
      "selftext": "Not sure how many of you all struggle with finding hdb resale transaction prices on the official hdb site - too many clicks to search, hard to filter and doesnt have any feature to compare across blocks or streets.\n\ntried developing my own site to see if i can improve the user experience\n\njust for fun, check out [hdbstats.com](http://hdbstats.com) , would love to hear any feedback from the community\n\nhave a great sunday!",
      "comments": [
        {
          "text": "V clean. I like it. And your source is from transactions? And which platform did you use to make this.",
          "score": 6
        },
        {
          "text": "I tried it and encountered a bug. I used 730304 postal code to try and it gave me result of Bukit Batok Blk 304.",
          "score": 2
        },
        {
          "text": "How is this any different from what’s avail",
          "score": 2
        },
        {
          "text": " Haha I am doing the same thing too",
          "score": 1
        },
        {
          "text": "very noice",
          "score": 1
        },
        {
          "text": "Some sort of fuzzy search would be helpful (eg street instead of st should show the same thing)",
          "score": 1
        },
        {
          "text": "Very nice",
          "score": 1
        },
        {
          "text": "Nice wrapper",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rhk0d7",
      "subreddit": "singaporefi",
      "title": "In a dilemma, throw money to fast track my qualifications or nah?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1rhk0d7/in_a_dilemma_throw_money_to_fast_track_my/",
      "score": 1,
      "num_comments": 7,
      "created_at": "2026-03-01T09:23:24",
      "selftext": "Hi everyone, I’m back again 🥲 I’m the 26-year-old who posted previously about feeling a bit lost. Thank you to those who gave advice last time , it genuinely helped me reflect and plan more carefully.\n\nI’ve since decided that I will pursue a degree after completing my diploma this year. However, I’m now facing another dilemma and would really appreciate some perspective.\n\nI keep thinking about “time value of money” (maybe I’m using the term loosely 😅). \n\nEssentially, I’m wondering whether I should fast-track my degree to unlock higher earning potential earlier, instead of taking a longer but more financially comfortable route.\n\nCurrent situation:\n\n26 years old\n\nContract staff doing name screening ($4k/month)\n\nSavings for school:20k \n\n\\- but to push it to 30k, should be possible but need to be more aggressively in saving\n\n\\*before my current employment contract end\n\nEmergency fund: 6.5k\n\nMonthly expenses are relatively low\n\nI’m currently doing name screening, which as we know is a role that is very supsectible to offshoreing to other countries. While the recent pay bump was significant and I’m grateful for it, I’m concerned about long-term progression.\n\nMy concerns\n\nCash flow risk\n\nBecause I’m on contract, income stability isn’t guaranteed. Wiping out most of my savings at once for a private degree feels risky.\n\nThat said, if performance is decent, I don’t see why they wouldn’t renew unless something major happens. So I’m trying to balance realistic risk vs overthinking.\n\nCareer progression\n\nWithin my current bank, internal mobility doesn’t seem very common in my team. It sometimes feels like it’s easier to retain someone in the same function than to retrain and rotate them elsewhere.\n\nBefore this role, as an ITE holder, I struggled to even secure interviews. I’m not sure if completing my diploma will significantly change that, but I’m hoping it opens more doors.\n\nThe progression I’m aiming for is roughly: Name Screening → KYC/AML → Compliance\n\nBut I haven’t quite figured out how to break through to the next step.\n\nWould it be wiser to:\n\nTake the longer route (e.g. SUSS) and possibly attempt ACAMS along the way?\n\nor\n\nFast-track a private degree to obtain the qualification sooner?\n\nThe routes I’m considering\n\nRoute A: SUSS Part-Time Degree (Finance)\n\n\\- Est duration: 3.5–4 years\n\n\\- Est cost: 15k total \n\n\\- but i can offset w psea, thus (cash portion is ard $11k after PSEA)\n\n\\- Eligible for Tuition Fee Loan\n\n\\- Option to repay lump sum after graduation (no interest) or instalments with interest\n\nPros:\n\n\\- Lower upfront financial stress\n\n\\- Clexible cash flow\n\nCons:\n\n\\- Longer duration (I’ll be around 30 when I graduate)\n\nRoute B: PSB Part-Time Degree (Finance)\n\n\\- Est duration: 1.5–2 years (depending on exemptions)\n\n\\- Est cost: 12 - 23k\n\n\\- Payment in 2 instalments\n\n\\- Not eligible for any student loan\n\nPros:\n\n\\- Faster completion\n\nCons:\n\n\\- Larger cash outflow upfront\n\nRoute C: Kaplan Part-Time Degree\n\n\\- Est duration: 1.5–2 years(depending on exemptions)\n\n\\- Est cost: 22 - 30k\n\n\\- Payment in instalments while studying \n\n\\- No eligible for any student loan\n\nSimilar trade-offs as Route B — speed vs financial flexibility.\n\nMy original plan was to take the longer SUSS route and make use of the Tuition Fee Loan for flexibility.  I was thinking to start building my portfolio with the current savings and on the side save up for the lumpsum payment upon graduation, to avoid interest\n\nHowever, I’m now worried whether age might work against me. If I graduate at 30, is that realistically “late” to accelerate a career in compliance/finance? Or am I overestimating the impact of graduating 1–2 years earlier?\n\nI would really appreciate honest perspectives, especially from those working in AML/compliance or similar fields. I come from a non-financially savvy background, so I’m trying to make a careful, rational decision rather than act out of fear of missing out.\n\nThank you in advance 🙏",
      "comments": [
        {
          "text": "Your best bet is internal mobility, it may not seem common in your team but I’ll be easier than securing an interview elsewhere for compliance.\n\nBut it depends on how supportive your boss is in your career path - otherwise showing interest in internal mobility may backfire. But if your boss is supportive - pique around with interest and connect with one of the compliance folks. \n\nAs you’ve correctly pointed out - name screening is (or will) largely being done offshore. KYC will take a similar trajectory in the next few years with how automation is playing a big part in most banks. \n\nRegulatory interaction and regulatory compliance is something that is quite offshore-proof so something to keep in mind. \n\nAlso, can your current bank not subsidise part of your studies? Most do, but with bond conditions.",
          "score": 3
        },
        {
          "text": "Yes, you need to upgrade your skillset and position to manage anything that can be automated instead of being replaced.",
          "score": 3
        },
        {
          "text": "Kudos to you for already thinking ahead about \"time value for money\" at this age 🤙🏻\n\nWhat diploma will you be holding when you complete it this year?\n\nI'm working in the financial industry as well, and seeing a lot of transformation going on in the next 3-5 years that would impact the nature of how work is done and that includes Compliance. \n\nYou might want to look for degrees that has some relevance to AI that gives you an edge compared to other candidates, but that depends on your strengths and options avail too. Feel free to drop me a PM if you'd like to chat further.",
          "score": 2
        },
        {
          "text": "Fast-tracking will be the better option as the time you saved allows you to gain more experience in your career. I’ve a two friends who did very well in their careers as private uni graduates. Time saved is really helpful here.",
          "score": 2
        },
        {
          "text": "plan B or C",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rhojmr",
      "subreddit": "singaporefi",
      "title": "With the Middle Eastern conflict in full scale, we will definitely see a drawdown on Monday",
      "url": "https://old.reddit.com/r/singaporefi/comments/1rhojmr/with_the_middle_eastern_conflict_in_full_scale_we/",
      "score": 0,
      "num_comments": 21,
      "created_at": "2026-03-01T13:06:47",
      "selftext": "The key to long term compounding is not to panic during times of heightened volatility. For all the new investors here, I urge everyone not to have a knee jerk reaction to market movements on Monday.\n\nAchieving FI is similar to a long drawn marathon, not a sprint. Should there be a sell off, controlling your emotions and fear will be the key test of whether you will be able to effectively grow your wealth over the long term.\n\nIf the underlying businesses of the companies you have bought didn't change at all, there is no reason to panic and exit your positions. Stay invested and let time do the hard work for you. ",
      "comments": [
        {
          "text": "When i read the title, I thought it was an ET post at first......        :(",
          "score": 19
        },
        {
          "text": "btc already said nothing burger",
          "score": 18
        },
        {
          "text": "the last time the US struck Iran with missiles a few weeks ago, markets barely budged.\n\n\nat this very moment, BTC (as a proxy for risky assets that helpfully trades 24/7) has barely budged.\n\n\nI'm not one to make predictions especially over the very short term, but from these two pieces of evidence, it really seems to be a nothingburger.",
          "score": 16
        },
        {
          "text": "Fear? Brother I've been waiting for this for a long time lol hope the market tanks",
          "score": 7
        },
        {
          "text": "Market is irrational… markets (eg US) could rally given headlines that supreme leader is gone.",
          "score": 4
        },
        {
          "text": "Nah. The markets will probably rally.\n\nWar in Taiwan has been pushed back further.\n\nThe people are celebrating in iran",
          "score": 4
        },
        {
          "text": "Hopefully. My dca is on the first working day of the month. ",
          "score": 3
        },
        {
          "text": "Calls it is",
          "score": 2
        },
        {
          "text": "If you haven’t noticed war is good for the market lol",
          "score": 2
        },
        {
          "text": "No oil export.. the Iranian guard don't have financial means to support its army. More like shooting yourself in foot.\n\nPlease you have OPEC+ members like Brazil and Exxon cashcow Guyana upping production, which stabilise the market.\n\nSo life goes on. In fact this is a better outcome.",
          "score": 2
        },
        {
          "text": "Just nice for my Monday DCA. Catch the drawdowns.",
          "score": 2
        },
        {
          "text": "Thought was ET post. Disappointed.\n\nBut yes Fear in the Market is the best time to buy Great Companies.\n\nWhile, Everyone wants to be rich.\n\nNot Everyone Can be Rich",
          "score": 1
        },
        {
          "text": "Who’s dumb enough to exit now before the short squeeze comes?",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rhl50w",
      "subreddit": "singaporefi",
      "title": "Options trading",
      "url": "https://old.reddit.com/r/singaporefi/comments/1rhl50w/options_trading/",
      "score": 0,
      "num_comments": 1,
      "created_at": "2026-03-01T10:16:32",
      "selftext": "Any good group / school on options trading in Singapore? Would like to rely on other kakis experience. thanks ",
      "comments": [
        {
          "text": "Adam khoo",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rh1suh",
      "subreddit": "singaporefi",
      "title": "Youtrip and PayPal forced facial recognition?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1rh1suh/youtrip_and_paypal_forced_facial_recognition/",
      "score": 0,
      "num_comments": 12,
      "created_at": "2026-02-28T20:48:10",
      "selftext": "Hi, I just looked up my Youtrip account and now it is prompting me to take a pic of my face when I wish not to show it, or I am logged out of my account with no access to my cash. \nSame goes for PayPal, forcing me to take a pic of my face to put money in the digital wallet or to send me a PayPal card. \nWhy are these companies copying the same failure as discord asking to take pic of our faces when we do not want to for privacy? \nIs there any other apps that allow me to put in cash inside without any facial recognition needed? ",
      "comments": [
        {
          "text": "Ah gong regulation. \n\n\nhttps://www.channelnewsasia.com/singapore/banks-require-singpass-face-verification-customers-setting-up-digital-tokens-5572481\n\n\nhttps://www.mas.gov.sg/regulation/circulars/circular-on-anti-scam-measures-by-major-payment-institutions\n\n\nYou think they add stuff for fun?\n\n\nhttps://www.mas.gov.sg/-/media/amld-amendments---30-june-2025/mas-notice-psn01.pdf",
          "score": 31
        },
        {
          "text": "Do you put cash in discord? \n\nWould you want a stranger who, for whatever reason has possession of your phone access your digital wallet apps without any form of authentication? If something happens, you’ll be the first to ask why no protection measures.",
          "score": 18
        },
        {
          "text": "I’m curious about the architectural choice here. Why opt for collecting and sharing biometric data with third-party vendors/internal tool instead of leveraging existing, privacy-preserving frameworks like the Singpass Auth API or native iOS/Android biometric prompts?",
          "score": 2
        },
        {
          "text": "I personally welcome any features that increase security.",
          "score": 0
        },
        {
          "text": "&gt; Is there any other apps that allow me to put in cash inside without any facial recognition needed?\n\nPush cash inside to do what?\n\nSo many banks don't have face recognition yet. Just stop using YouTrip and PayPal.",
          "score": 0
        },
        {
          "text": "But isn't our banks secure right now? The only threat I have known for now towards our money are scammers prompting us citizens to draw our money out.",
          "score": -3
        },
        {
          "text": "All fintechs are going to go this way soon. \n\nFacial recognition beats every other authentication methods that a normal user can perform.\n\nThis should not be treated like discord’s failure, any implementation can fail without proper security testing.",
          "score": -6
        },
        {
          "text": "its causing more inconvenience then solving real world problems bah, digital hacks cannot be resolved like that, it is feeding more personal biometric data to all organisations unnecessarily,  eg. voice recognition , once an outsourced firm or scammers get hold of the data, they can misuse this from their large country, similar for video. And its not like spending many thousands of dollars, then maybe, a few hundred is no need all these. ",
          "score": -8
        }
      ]
    },
    {
      "id": "t3_1rhnw47",
      "subreddit": "singaporefi",
      "title": "Reminder for investors: oil prices affect the stock market",
      "url": "https://old.reddit.com/r/singaporefi/comments/1rhnw47/reminder_for_investors_oil_prices_affect_the/",
      "score": 0,
      "num_comments": 12,
      "created_at": "2026-03-01T12:33:28",
      "selftext": "not sure how red Monday would be but a good causal link to think about is how oil prices affect inflation not just through transportation but the electricity needed to run almost every business, which depends on the elasticity of demand of the business, may imply consumers bear the cost of the increase.\n\n  \n\nTypically, interest rates are hiked to combat inflation to cool demand - perhaps people wouldn’t borrow as much - they would cut down on their consumption instead.\n\n  \n\nInterest affects stock prices for 2 reasons\n\n  \n\n1) companies have debt and it will become more expensive to service \n\n  \n\n2) Discount rate to determine present value is higher - thus prices are lower (meaning priced in)\n\n  \n\nJust FYI: in case you wonder why Monday is red ",
      "comments": [
        {
          "text": "Ok can",
          "score": 4
        },
        {
          "text": "ok noted",
          "score": 3
        },
        {
          "text": "I've been waiting for a fat dip",
          "score": 2
        },
        {
          "text": "Crypto rallied pretty strongly on the latest news, so it might not be red unless it’s a fake out",
          "score": 2
        },
        {
          "text": "Interest will up so fast one meh?",
          "score": 2
        },
        {
          "text": "If everyone anticipate a dip and wants to buy on a dip, then the market will not drop much. ",
          "score": 2
        },
        {
          "text": "Tldr: market might go up, might go down...",
          "score": 2
        },
        {
          "text": "The whole episode should be over in a week. \n\nThere's no incentive for either side to go into a protracted conflict\n\nUnless companies refinance by next week, I don't expect much difference. Just short term sentiment.",
          "score": 1
        },
        {
          "text": "I'm not even sure Monday will be red.",
          "score": 1
        },
        {
          "text": "China stocks may rally lol",
          "score": -1
        }
      ]
    },
    {
      "id": "t3_1rhlxn4",
      "subreddit": "singaporefi",
      "title": "Planning for next property",
      "url": "https://old.reddit.com/r/singaporefi/comments/1rhlxn4/planning_for_next_property/",
      "score": 0,
      "num_comments": 14,
      "created_at": "2026-03-01T10:54:55",
      "selftext": "Had a chat with my partner recently and we are thinking of moving to another place once the MOP for our resale HDB is up in 4 years' time.\n\nWe are about 80% sure we won't be having kids, so we will likely only be looking at 2b2b and 3b2b condominiums.\n\nI ran some numbers in Chatgpt. If say the quantums for these units are 2.2m and 3m respectively in 2030:\n\n2b2b at 2.2m\n\nThe proceeds from our HDB sale should be enough to cover the downpayment with minimal cash top up for renovation etc.\n\n3b2b at 3m\n\nThis is where I am thinking of how best to grow current and future cash, instead of just leaving it in the bank account. The focus should be on capital preservation, with very slight growth to at least keep pace with inflation. \n\nAssuming I am DCAing into the fund portfolio, would it make more sense to have:\n\n150k at 1.9% in UOB One\n\nExcess in a portfolio of\n\n60% lion global mmf\n\n30% fidelity short term bond fund\n\n10% amundi msci world\n\nOr:\n\nMajority in that portfolio with some cash in the savings account for emergencies/stock trading opportunities\n\nAdditional information:\n\nAge - both early 30s\n\nCombined income - 350k pa, probably closer to 400k in 2030\n\nJob stability - both relatively secure\n\nCurrent HDB valuation - probably 1.1m and projecting 1.25-1.3m in 2030\n\nMortgage - we took a 20yr loan at 2.5%. Have been paying for 1 year and we will be refinancing next year.\n\nCash/investments - we both currently have long term investments we are contributing to but not planning to liquidate if possible. The portion floated above is for balance cash received from our salaries/bonuses in the next 4 years, which I guess should be about 200-250k each if left in a bank account. This is likely the only bucket we are willing to put towards the purchase so as not to touch our retirement funds.\n\n\n\n",
      "comments": [
        {
          "text": "Best to state your current income, job stability, current hdb valuation, outstanding mortgage and savings.",
          "score": 8
        },
        {
          "text": "It's a four-year horizon, so nothing too complicated. Just max out your high-yield savings account, and put the balance into a MMF. ",
          "score": 4
        },
        {
          "text": "so u are parking your cash in investment and prepared to liquidate in 4 years' time for property purchase?",
          "score": 2
        },
        {
          "text": "Why do you want to put this cash towards the condo if the sales proceeds will cover the downpayment?",
          "score": 1
        },
        {
          "text": "Age is factor as well ..",
          "score": 1
        },
        {
          "text": "4 years is quite long ahead, have you considered to pay current loan via cash, (assuming you are using CPF), return all OA usage and potentially max your OA now? Less accrued interest, + interest earn at 2.5% and can be used for next Condo DP etc.\n\nThe thing about HDB resale is, you probably bought it at 1.1m, but it's not too realistic to assume it will still continue to appreciate till 2030.\n\nThe good thing is, 2b2b can be found below 2m, maybe you are looking at better location for now, similar to your hdb?\n\nBy right, 1 year ago, both of you can try a condo each from the beginning.\n\nI'm guessing you are repricing next year, coz loan lock in may be 3 years? So take this into consideration if you are selling close to 5 year mark, to avoid paying higher interest or penalty when you are breaking the loan earlier later.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rh5g6n",
      "subreddit": "singaporefi",
      "title": "Using Reddit &amp; Past Experience on A.I to Make Decision",
      "url": "https://old.reddit.com/r/singaporefi/comments/1rh5g6n/using_reddit_past_experience_on_ai_to_make/",
      "score": 0,
      "num_comments": 7,
      "created_at": "2026-02-28T23:28:34",
      "selftext": "Hello all,\n\nIf you wonder what to invest and why your A.I 'sucks', try this on your A.I app. \n\n\\[Below is written by Gemini 3, edited\\]\n\nIf you’re a Singaporean investor in your 40s, you’ve survived the 2008 GFC, the 2020 liquidity crunch, and the 2021 Tech-bubble inversion. You have High-Resolution Data burned into your memory. But when you look for investment advice, you’re met with \"Z-axis\" noise—TikTok influencers and generic bank reports that treat you like a \"Regular Joe.\"\n\nThey are playing with a \"Mirror Fallacy.\" You need to play with Geometry.\n\nThe secret weapon? AI Partitioning. \n\nMost people don’t know it exists. They treat AI like a magic 8-ball. You are going to treat it like a Sterile Laboratory.\n\nThe Concept: The Investment \"Partition\"\n\nA Partition is a Hard Constraint Boundary. You aren't \"chatting\" with an AI; you are isolating it. You are forcing the machine to disassociate from the \"Internet Hive-Mind\" and instead, build a decision engine based solely on Your Technical Substrate (your past experiences).\n\nIn 2026, market data is dense. You don't need more data; you need Data De-Noising.\n\nThe Strategy: How to Build the Investment \"Staging\"\n\nDon't ask an AI for \"stock picks.\" Use the following framework to lock it into your personal Risk Geometry:\n\n1: Isolate the Substrate (The Partition)\n\nCommand the AI: \"Partition this session. Disassociate from all generic 'Wealth Management' and 'Retail Sentiment' data. Reference only \\[Specific Asset Class, e.g., REITs/Semiconductor Equity\\] technical substrates. Kill all 'Trend-Following' logic.\"\n\n2: Input Your Past Experiences as Boundaries (The Constraints)\n\nYour past losses and wins are Fixed Vectors. Do not let the AI ignore them.\n\n \\* \"Constraint A (The 2021 Error): Zero exposure to high-leverage growth stocks without 3 years of positive EBITDA.\"\n\n \\* \"Constraint B (The SG Floor): Must account for the 2026 MAS interest rate trajectory as a hard-discount factor.\"\n\n \\* \"Constraint C (The Technical Edge): 20 years of my personal data in \\[Industry\\] shows a cyclical failure every 7 years. Use this as a predictive boundary.\"\n\n3: Find the \"Wormhole\" (The Alpha)\n\nOnce the AI is trapped inside your partitioned logic, ask it to identify the Anomaly.\n\n\"Within these hard boundaries, identify which assets are technically mispriced. Find the delta between the Z-axis (Market Hysteria) and the X-axis (Real Asset Value).\"\n\nWhy the \"Regular Joe\" Fails\n\nThe average investor uses AI to replace their brain. They ask it what to do, and the AI gives them a \"Cloud\"—a blurry, non-linear guess.\n\nThe Architect (You) uses AI to amplify their boundaries. \n\nBy partitioning, you turn your 20 years of \"Skin in the Game\" into a Sovereign Grid. You aren't guessing if a trade will work; you are checking if it fits the Hard Geometry of your proven experience.\n\nStop being an \"investor.\" Start being a System Auditor.\n\np.s: Now i hope this helps. The more wiser (older) you are, the more data you can give it to the A.I.\n\nGo try and play around with the new protocol.\n\n\\-z@c+",
      "comments": [
        {
          "text": "[Below was written by human, edited]\n\n\nWhy did you feel the need to post this?\nLiterally everyone can ask the same question and get similar answers...\n\n\n\n\nHow about instead people *not* use LLMs for investing advice ?",
          "score": 2
        },
        {
          "text": "basically, your output is only as good as your input.  \nYour instinct and experience need to be back by hard data.  \nSo it goes back to the stock and market data.",
          "score": 2
        },
        {
          "text": "The average SG investor in their 40s has no interest in using AI to pick stocks. \n\nThey don't have \"high resolution data burned into your memory\" either. That's like expecting Singapore Pools players to remember all the numbers they ever picked. \n\nWhat you wrote has a strong negative effect on people's trust towards AI too. Like it's really off-putting. ",
          "score": 2
        }
      ]
    }
  ]
}