{
  "schema_version": "raw_scrape_v1",
  "report_id": "2026-02-20",
  "scraped_at": "2026-02-20T14:40:35.540289",
  "subreddits": [
    "singapore",
    "askSingapore",
    "SingaporeRaw",
    "singaporefi"
  ],
  "total_posts": 36,
  "total_comments": 486,
  "posts": [
    {
      "id": "t3_1r9003q",
      "subreddit": "singapore",
      "title": "Finally a cool reprieve from the last few weeks of heat and haze",
      "url": "https://old.reddit.com/r/singapore/comments/1r9003q/finally_a_cool_reprieve_from_the_last_few_weeks/",
      "score": 1083,
      "num_comments": 49,
      "created_at": "2026-02-19T22:02:16",
      "selftext": "",
      "comments": [
        {
          "text": "I wish our weather is like this all year round 😢",
          "score": 411
        },
        {
          "text": "Good news, it's cold ;u;\n\nBad news, it's *wet ;n;*",
          "score": 268
        },
        {
          "text": "Does anyone remember how Singapore truly felt like winter 5-7 years ago?   \n  \nIt was the Nov/December period and everyday it would be windy and cold with a lot less sun and humidity. ",
          "score": 135
        },
        {
          "text": "Was commenting to my friends after we left a gathering that this temp is like Taiwan's winter temp feels. So shiok and honestly missed it so much since Dec and Jan were such a disappointment.",
          "score": 117
        },
        {
          "text": "I love 22 deg temperature, free natural air con!",
          "score": 68
        },
        {
          "text": "I LOVE THIS WEATHER",
          "score": 58
        },
        {
          "text": "I hate to be the killjoy but the cool weather will likely end soon. This is because tomorrow we are expected to see fair weather due to strong winds. Then most rains coming after will likely be the short duration thunderstorms. Overall, I expect the rains to persist but be much less than now. ",
          "score": 46
        },
        {
          "text": "I wish our weather was 21 degrees celcius everyday. This cool weather wont last forever unfortunately.",
          "score": 37
        },
        {
          "text": "I think cool is an understatement",
          "score": 16
        },
        {
          "text": "I have lived overseas where it was -10C. I would go outside in shorts. Geniunely no problem. Yet, cannot tahan near Bugis today at 9pm haha... wasnt sure if I was falling ill cause the weather app said 27c",
          "score": 11
        },
        {
          "text": "This kind of weather always make me crave for soupy meals… I’m alr craving for potato and leek soup.",
          "score": 7
        }
      ]
    },
    {
      "id": "t3_1r9ll01",
      "subreddit": "singapore",
      "title": "Former Speaker of Parliament Tan Chuan Jin active on Instagram, claims to have \"accidentally\" deleted Instagram.",
      "url": "https://old.reddit.com/r/singapore/comments/1r9ll01/former_speaker_of_parliament_tan_chuan_jin_active/",
      "score": 241,
      "num_comments": 157,
      "created_at": "2026-02-20T12:23:00",
      "selftext": "\\[edit: typo - active on LinkedIn\\] The former Speaker has not addressed the event that precipitated him stepping down from his position as Speaker of Parliament. His full post as follows:\n\n\"I accidentally deleted my public Instagram page. 🥺\n\nJust like that. Gone.\n\nIt had been dormant for a while, along with my Facebook page since I stepped down. There was no longer a need for a public platform. I suppose I had already moved on in some ways.\n\nBut losing it still felt… significant. I’m still trying to understand what it is I’m feeling.\n\nIt wasn’t just a page.\n\nIt was almost 12 years of life. Conversations, disagreements, encouragement, banter, runs, fund-raising efforts, and celebrating so many everyday heroes.\n\nAnd yes, plenty of wuliao, whimsical nonsense along the way! 🤣\n\nI ran those platforms myself. It was never just communication. It was connection.\n\nThose interactions shaped how I thought, how I listened, and how I made decisions, big and small. It made me a better public servant, and I hope, a better person; though I remain deeply flawed.\n\nSo yes, there is a sense of loss.\n\nBut also something else.\n\nA quiet reminder, perhaps, of how little we really hold on to.\n\nSeasons change. Roles end. Much of what we build, even what we treasure, does not stay.\n\nAnd perhaps that is part of the point.\n\nNot everything is meant to be kept.\n\nThese are moments in time.  \nBut memories for a lifetime.\n\nWhat remains are the people, the conversations, and the shared journey.\n\nBeing a public leader was a privilege that I have never taken lightly. Thank you to those who had shared a part of your lives with me as our paths criss-crossed in the miracle that is life.\n\n(LinkedIn stays for now, because I suppose I still need to remain connected professionally 😊.)\"",
      "comments": [
        {
          "text": "This clown had every opportunity, every chance. He got the next best job aside from being a frontbencher.\n\nSalty dragon even personally gave him a second chance, and he squandered it because he couldn't literally practice what he preached\n\n\nEdit: \n\nBTW the second chance wasn't even on staying on as speaker. It was about not resigning in disgrace and not BLOWING UP HIS OWN FAMILY by airing the dirty laundry. \n\nLHL stated in the conference after the resignations, that when he found out and confronted/counselled him, TCJ offered his resignation which he accepted, but that the residents of his GRC needed to be taken care off.\n\nI.E PAP Exco won't put you up as a candidate next election, but dont resign because your GRC will be missing an MP. (Also PAP save face)",
          "score": 261
        },
        {
          "text": "Why does he type like chatgpt?",
          "score": 249
        },
        {
          "text": "&gt;a quiet reminder of how little we hold onto\n\nBuddy, I still remember your affair while supposedly being a politican of a party that claims its members are \"clean\" thats why you wear white\n\nDont worry, your things I will remember well",
          "score": 213
        },
        {
          "text": "Yeah, 'accidentally'.\n\nLook Ah Jin, I can totally understand that you shut down your SocMed accounts for the sake of privacy.\n\nCan you at least say that honestly instead of trying to throw sand in all our faces?!?!?\n\nGo fark a populist or something la.",
          "score": 47
        },
        {
          "text": "Don't even have the cahunas to admit he deactivated or deleted intentionally. What a cheat",
          "score": 43
        },
        {
          "text": "can ask instagram to un-delete. Still got time. i'm sure it's archived somewhere.\n\n",
          "score": 43
        },
        {
          "text": "Hmm how do you accidentally delete a Instagram account? These day all the social media platforms has complex rules and confirmations to prevent users from moving away from their platform, it cannot be accidentally in any sense. I just did a simple google search, Instagram has a 30 days grace period after deletion, that’s how difficult to fully removed from these social media platforms.",
          "score": 42
        },
        {
          "text": "Not everything is meant to be kept.\n\nLike mistresses i guess",
          "score": 36
        },
        {
          "text": "Dude sounding like something right off r/linkedinlunatics",
          "score": 33
        },
        {
          "text": "I’m sure if he realllly wants it back, he can always write in to Meta to get them to reinstate it. \n\nAlso, the irony of having 仁 in his name, but his actions immoral hahahaha",
          "score": 32
        },
        {
          "text": "Not in PAP anymore still need to wayang so much for what. Bro no one cares what happened to your Instagram page.",
          "score": 20
        },
        {
          "text": "Exactly the type of culture for the white party. One can do no wrong if not admitted.",
          "score": 19
        },
        {
          "text": "*\"What remains are the people, the conversations, and the shared journey.\"*\n\n![gif](giphy|FsUo1Qn895NS0)\n\n  \n",
          "score": 14
        },
        {
          "text": "But if I'm being honest, there's a deeper loss I haven't spoken about yet.\n\nThe follows.\n\nYou see, over the years — often late at night, sometimes between meetings, occasionally during particularly long parliamentary sessions — I had quietly, carefully, curated something precious.\nA followed list.\n\nNot just any followed list. A masterwork. A living, breathing tapestry of the finest mango and papaya content creators the Instagram ecosystem had to offer.\n\nWe're talking @MangoQueenSG. @PapayaWhisperer. @TropicalSliceDaily. \n\n\nAccounts that understood the craft. The cross-section. The seed-to-plate journey. The aesthetic of a perfectly ripe nam doc mai under golden hour lighting.\n\n\nGone. All of it. Gone.\n\nYears of careful curation. Of swiping past lesser accounts. Of discerning the serious papaya educators from the casual hobbyists. That algorithm knew me. It understood me. My Explore page was a cathedral of tropical fruit content, and I burned it down with one misclick.\n\nI won't pretend it doesn't sting.\n\nBut here's the thing about seasons.\n\nI have time now. Quite a lot of it, actually.\nAnd I am resolute.\nI will rebuild. Follow by follow. Reel by reel. I will find them again — the mango graders of Chiang Mai, the papaya farmers of Queensland, the controversial \"is green papaya a fruit or a vegetable\" discourse accounts.\n\nThe followed list is gone. But the follower?\n\n\n He remains.\n\nAnd he is ready. 🥭",
          "score": 13
        },
        {
          "text": "He fucked around and he found out",
          "score": 12
        }
      ]
    },
    {
      "id": "t3_1r8t0ti",
      "subreddit": "singapore",
      "title": "2 weeks’ jail for woman who slapped 73-year-old cabby while drunk",
      "url": "https://old.reddit.com/r/singapore/comments/1r8t0ti/2_weeks_jail_for_woman_who_slapped_73yearold/",
      "score": 199,
      "num_comments": 61,
      "created_at": "2026-02-19T15:38:40",
      "selftext": "",
      "comments": [
        {
          "text": "Oh she was drunk, it must have occurred at night.\n\n\n\"Shalini reeked of alcohol when she boarded the victim’s taxi at around 3pm on Nov 11, and fell asleep during the ride.\"\n\n\n\"Both Shalini and driver got out of the taxi near the NPC, and she slapped his left cheek once at around 4.20pm.\"\n\n\nDay drinking till the point of intoxication, falling asleep and committing assault is mad work. \n\n\nAll before 5pm. ",
          "score": 220
        },
        {
          "text": "Really smart of the cabby to drive to the police station, and even smarter for the accused to challenge him to go to the police station.",
          "score": 205
        },
        {
          "text": "Why the fuck would you attack an old person who simply asked you for what you owe him?",
          "score": 115
        },
        {
          "text": "“Deputy Public Prosecutor Adelle Tai said the fare remains unpaid.”",
          "score": 69
        },
        {
          "text": "Champion.. reach the NPC then slap him\n\nProbably in front of the police 🤣",
          "score": 64
        },
        {
          "text": "And she hasn’t paid the fare???",
          "score": 37
        },
        {
          "text": "All these for $24. Brainless pig",
          "score": 36
        },
        {
          "text": "I aspire to have the clarity of mind and rationality as the cabby in the face of such stupidity",
          "score": 28
        },
        {
          "text": "Shalini what is this behavior?",
          "score": 20
        },
        {
          "text": "How can she slap?",
          "score": 20
        },
        {
          "text": "big brain move by cabbie to report sick at hospital ",
          "score": 15
        },
        {
          "text": "Driver offered many options for her to pay up, and yet she refuse. Obviously, she had the intention to evade fare. She should be charge of fare evasion too. I believe this is not her first time, as she is so brazen to do this in broad daylight.....😎",
          "score": 13
        },
        {
          "text": "Your unemployed friend at 3PM on a Tuesday:",
          "score": 11
        },
        {
          "text": "With cameras everywhere.. haha",
          "score": 6
        },
        {
          "text": "The cab fare is still left unpaid. So, it clearly speaks of her real character.",
          "score": 6
        }
      ]
    },
    {
      "id": "t3_1r8s2jt",
      "subreddit": "singapore",
      "title": "TIL that we have the largest proportion of reclaimed land by percentage, but the Dutch have reclaimed more land than the entirety of Singapore.",
      "url": "https://old.reddit.com/r/singapore/comments/1r8s2jt/til_that_we_have_the_largest_proportion_of/",
      "score": 194,
      "num_comments": 52,
      "created_at": "2026-02-19T14:41:33",
      "selftext": "The other usual small country suspects are also there but I was surprised that a large country like the Netherlands has reclaimed so much land too.\n\nhttps://youtube.com/shorts/T-QUIbDLdx4?si=f8WVwekyUthX6oEc",
      "comments": [
        {
          "text": "Majority of NL is under water. If you landed at Schiphol airport (Amsterdam main airport) it is like 3m or so below sea level (1 storey).\n\nThe entire province of flevoland is mostly reclaimed land IIRC. The Dutch expertise in land reclamation is so renowned that we employ their expertise here in Singapore too.",
          "score": 156
        },
        {
          "text": "If you find this interesting, then you should know that we are currently using their poldering technique. We have reclaimed so much land using sand that we have become one of the largest importer of sand and many countries have banned exports of sand to us. So now we have to learn from the Dutch.",
          "score": 126
        },
        {
          "text": "God made the earth, but the Dutch made the Netherlands.",
          "score": 76
        },
        {
          "text": "Reclaim all the way to Tekong, no need ferry liao.",
          "score": 52
        },
        {
          "text": "I always wondered why there is such a double standard between European land reclamation versus asian land reclamation. When the dutch do it, we get BBC documentaries of manmade marvels and how amazing humans are to square off against nature. When Asian countries like us do it, we get western ngos criticising about habitat loss and ocean pollution.",
          "score": 52
        },
        {
          "text": "Singapore can fit between Central Tokyo and Narita Airport. We're very very small.",
          "score": 37
        },
        {
          "text": "I'm from Australia and struggle to find analogs on how small is Singapore in terms of Australia to explain to your average Australian. \n\n\nThe best I can do is explain that Port Philip Bay (the bay that Melbourne sits next to) is three times larger than Singapore. On a smaller scale, our friend's farm is about the size of Sentosa. Our own property is the size of the National Stadium complex (including the Indoor Stadium, Tennis Hub etc).",
          "score": 19
        },
        {
          "text": "Wonder what would it be like if we could reclaim an artificial island several times the size of Singapore at Pedra Branca. We would finally have the hinterland we have been thirsting over for 60 years. \n\nWe will have the space to build millions of cheap, spacious BTOs to breed the next generations of Singaporeans, and still have some spare for foreign talents. We can finally grow our own food. We can finally generate our own energy. Our NS boys can train at their doorstep and need not go overseas. We will have a large domestic market for local entrepreneurs to offset the collapse of global free trade. It will secure our future in this volatile world.",
          "score": 17
        }
      ]
    },
    {
      "id": "t3_1r8yofm",
      "subreddit": "singapore",
      "title": "Sentosa beach club Tipsy Unicorn closes down after operator is wound up by High Court",
      "url": "https://old.reddit.com/r/singapore/comments/1r8yofm/sentosa_beach_club_tipsy_unicorn_closes_down/",
      "score": 193,
      "num_comments": 65,
      "created_at": "2026-02-19T21:04:40",
      "selftext": "",
      "comments": [
        {
          "text": "Went to Zouk quite recently after a very long hiatus from the clubbing scene.\n\nYoooo, the drinks are crazy expensive. While getting a drink for my friends, I observed a group of youths ordering a jug of red bull vodka and then sharing it. And no, it wasn’t exchanged with complimentary drink coupons because I saw that they paid with their mobile wallet. Inside my head, I was thinking if youths can only afford such drinks nowadays.\n\nI then casually asked if they knew what a Flaming Lamborghini was. They looked at each other, and then back at me, shaking their head and all puzzled.\n\n“Well you’re about to find out”. I then proceeded to buy them a Flaming Lamborghini each.\n\nThe staff there was also stunned at the order. It seemed as if he hadn’t prepared the drink in a long time. His senior came and then showed him how it was done.\n\nWhen the drink was served, I showed them how it was drunk. “Everything at once! No stopping” before I sipped it all down with the fire.\n\nThey were so fascinated and amazed at that moment. I probably unlocked a core memory for them all. \n\nAfter the drinks, I looked at them and told them casually “This is what me and my friends used to drink every time we clubbed last time.”\n\nI then foot the bill and left them to party. It was like $45 a pop (after service charge and GST) so it ended up being around $200+. It used to be $28 or so and there was like 1-1 promo so probably $14 each.\n\nSo yeah, it’s expensive no shit. Not sure what got into me that night but I’m glad I made some kids’ night.",
          "score": 335
        },
        {
          "text": "I went to Clarke Quay last Friday night. \n\nFRIDAY night. \n\nAlmost like a ghost town.\n\nBut surprisingly the Fairprice there got quite a small crowd. ",
          "score": 213
        },
        {
          "text": "The people with the energy to party don’t have the money to keep drinking all night. \n\nThe people with the money to drink all night don’t have the energy or desire to party. \n\nLose-lose situation for clubs and bars.",
          "score": 134
        },
        {
          "text": "I’m shocked that this was closed within 2 years !! Rumours beach club also closed. What’s happening to the nightlife scene Sia ?? Even ZoukOut also closed",
          "score": 129
        },
        {
          "text": "This Tipsy chain has a lot of issues. Last time didn’t pay their employees on time too.",
          "score": 53
        },
        {
          "text": "I saw 1 DJ performing to just one table of people on a weekend night. I think people just ain't going there at all ",
          "score": 18
        },
        {
          "text": "So what do the wild Gen Z and teens do these days?",
          "score": 11
        }
      ]
    },
    {
      "id": "t3_1r8syqr",
      "subreddit": "singapore",
      "title": "‘Mental health has been absolutely destroyed’: Former MSW alleges bullying &amp; burnout at NHG hospital",
      "url": "https://old.reddit.com/r/singapore/comments/1r8syqr/mental_health_has_been_absolutely_destroyed/",
      "score": 191,
      "num_comments": 51,
      "created_at": "2026-02-19T15:35:03",
      "selftext": "",
      "comments": [
        {
          "text": "read it as \"Former Mao Shan Wang\" and was very confused",
          "score": 197
        },
        {
          "text": "Anyone got any idea which hospital?",
          "score": 38
        },
        {
          "text": "give MSW a hug❤️",
          "score": 36
        },
        {
          "text": "Nhg cluster has one of the worst glassdoor among the 3 clusters.\n\nIykyk",
          "score": 36
        },
        {
          "text": "\"I think you should see a MSW.\"\n\"But Doctor, I AM a MSW!\"",
          "score": 27
        },
        {
          "text": "Team lead deserves to get sacked.",
          "score": 27
        },
        {
          "text": "ok first and foremost have to be clear that her account of what she went thru sounds really horrible. honestly i want to believe her, but this is just one side of the story. \n\nits pretty weird that she doesnt bring up evidence of being ostracised when management say she cannot cope, cuz ive been at that level of burnout before and honestly atp you really fuck care consequences. if even the colleagues didnt say anything or tried to help, then there's probably another side to the story.\n\nNot saying that she deserved to be bullied ah, but i think MOH and IMH need to look into this and verify the facts since she basically put everything out there alr.",
          "score": 27
        },
        {
          "text": "Such is the life of medical/nursing staff",
          "score": 16
        },
        {
          "text": "it seems like there big differences between the healthcare groups, whenever i'm served by NUHS I feel like overall they do a much better job in managing things. in fact when all the polyclinics in the west were taken over by NUHS (previously NHG), there was a big improvement.",
          "score": 14
        },
        {
          "text": "Those who have been around the healthcare sector knows NHG is the worst cluster to be in. Incompetent management thinks about cutting costs all the time, especially the mgmt, with low regards to well being of staff. Mgmt mentality is \"not happy you can leave\". HR is practically having their own internal crisis with attrition rates just as high. If you have a bond with them, wish you all the best, invest something into your own mental health.",
          "score": 14
        }
      ]
    },
    {
      "id": "t3_1r8xis9",
      "subreddit": "singapore",
      "title": "Raining till got waterfall",
      "url": "https://old.reddit.com/r/singapore/comments/1r8xis9/raining_till_got_waterfall/",
      "score": 191,
      "num_comments": 25,
      "created_at": "2026-02-19T20:07:36",
      "selftext": "",
      "comments": [
        {
          "text": "Go round and round the carpark and it’s a free car wash",
          "score": 86
        },
        {
          "text": "got Changi jewel at home",
          "score": 57
        },
        {
          "text": "Free car wash",
          "score": 25
        },
        {
          "text": "I think we all know the last few days have been exceptionally rainy and I will say that the prolonged rainy weather will possibly end soon (Keyword being possibly). While there may be more rain, it will be more short duration ones compared to the ones like today. Looking at stats, the rainfall has been exceptionally great. As at 6:30 pm today,(It is still raining so it will take some time to compile)\n\n\nThere has been a grand total of 57 mm recorded in Singapore on average. To put this is perspective, the normal thunderstorm in Singapore delivers about 5 to 20 mm and anything above 30 mm is considered great (This excludes monsoon surges which are a whole other league)\n\n\nOver the last 4 days, we have recorded 139 mm which is very close to the average monthly rainfall of around 150 to 180 mm. This is after the terrible performance at the start of the month. Temperatures have also been tempered at around 29 for highs and the lowest was 21.8 at Newton.(It has been extremely long since a thunderstorm caused such a fall in temps without a monsoon surges)\n\n\nThe top 3 best performing weather stations for the 4 days, Ulu Pandan - 277.6 mm Clementi - 252.6 mm Kent Ridge - 196.4 All southwest/west Top 3 worst Paya Lebar - 66.2 mm East Coast Park - 70.8 mm Tai Seng - 73 mm Mostly eastern. I must say that even the worst did very well. Considering our daily average for normal rain is around 5-6 mm, these stations received 15 mm in a day in average, 3x normal",
          "score": 18
        },
        {
          "text": "Ain't this TB plaza?",
          "score": 16
        },
        {
          "text": "Lol CNY, chinese saying water got wealth. The car pass thru like got wealth falling on it",
          "score": 8
        },
        {
          "text": "Shiok car wash.",
          "score": 8
        },
        {
          "text": "Its not even the year of the water horse liao, its year of the drowning horse with the amount of rain over the last few days.\n\nLegit barely even stopped",
          "score": 5
        },
        {
          "text": "Wow 💦💦",
          "score": 4
        },
        {
          "text": "I for one am thankful for this cool weather",
          "score": 2
        },
        {
          "text": "is a feature",
          "score": 2
        },
        {
          "text": "merlion",
          "score": 2
        },
        {
          "text": "Now everyone with black car can pretend they are batman driving batmobile.\n\nI think must charge more for parking now.",
          "score": 2
        },
        {
          "text": "Free car wash oh",
          "score": 1
        },
        {
          "text": "This could have been a insta story",
          "score": 1
        },
        {
          "text": "Cause NEA ban gutters many years ago due to fear of mosquito breeding..now everywhere is waterfall",
          "score": 1
        },
        {
          "text": "Cold until I have to wear sweat pants and jacket at home. Great for new year visiting, preferable to too hot.",
          "score": 1
        },
        {
          "text": "That's the secret batman basement (the batmobile always comes out of a waterfall Cave which is its secret base)",
          "score": 1
        },
        {
          "text": "花果山水帘洞",
          "score": 1
        },
        {
          "text": "Such a wonderful thing, ain't it?",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1r8t83v",
      "subreddit": "singapore",
      "title": "Muslims can break fast with free snack packs on offer at 60 FairPrice outlets",
      "url": "https://old.reddit.com/r/singapore/comments/1r8t83v/muslims_can_break_fast_with_free_snack_packs_on/",
      "score": 182,
      "num_comments": 28,
      "created_at": "2026-02-19T15:51:23",
      "selftext": "The snack pack – containing a drink and fruits or biscuits – will be given out daily by staff and volunteers about 30 minutes before it is time to break fast, and for another 30 minutes after.\n\nMuslims can choose to get, for instance, an apple, dates or biscuits. Drinks they can choose from include lychee rose tea, milk or water.\n\nIn a statement on Feb 19, FairPrice Group said it is giving out 80,000 *buka puasa* refreshment sets in 2026, up from 75,000 sets in 2025. *Buka puasa* means break fast in Malay.\n\nThe initiative will run from Feb 19 to March 20, it added.",
      "comments": [
        {
          "text": "Amazing",
          "score": 65
        },
        {
          "text": "Do you need to prove that you are muslim? What if people abuse it?",
          "score": 8
        },
        {
          "text": "Karen non-muslim aunties: Assalamu alaykum",
          "score": 4
        },
        {
          "text": "[deleted]",
          "score": -52
        },
        {
          "text": "That is not what you get if you order a halal snack pack in Australia",
          "score": -85
        }
      ]
    },
    {
      "id": "t3_1r9kkqk",
      "subreddit": "singapore",
      "title": "You’re not imagining it: Singapore homes are getting smaller",
      "url": "https://old.reddit.com/r/singapore/comments/1r9kkqk/youre_not_imagining_it_singapore_homes_are/",
      "score": 166,
      "num_comments": 150,
      "created_at": "2026-02-20T11:33:58",
      "selftext": "",
      "comments": [
        {
          "text": "Everybody already knew this 25 years ago. ",
          "score": 365
        },
        {
          "text": "&gt;Falling birth rates, empty-nester seniors and more singles living alone have all contributed to **growing acceptance of smaller homes**.\n\nDaily gaslighting from ST continues in year of the horse",
          "score": 313
        },
        {
          "text": "Hello? They build so small we have other options but to accept? Live on streets is it?",
          "score": 112
        },
        {
          "text": "Waiting for some minister to gaslight me into believing that I’m actually getting bigger, not that homes are smaller",
          "score": 78
        },
        {
          "text": "\"trend\" that buyers have no control over, lmao. \"Growing acceptance\" aka lan lan suck thumb",
          "score": 62
        },
        {
          "text": "This article is about 2 decades too late. We have eyes and can perceive the space around us. Also, what's the point of this fucking article? Written just to piss people off ahead of the weekend? \"Growing acceptance\" my ass. ",
          "score": 31
        },
        {
          "text": "Now if you have say 1.5m, many would rather get a laokok big HDB and reno rather than get a tiny cramped new condo",
          "score": 31
        },
        {
          "text": "We had a three bedroom corner HDB in Bishan that was big enough that we could ride bikes inside (albeit not comfortably, but it was still big enough to do so).\n\n\nI just went to a friend's BTO and that's definitely not the case anymore.",
          "score": 30
        },
        {
          "text": "Who's... who's \"imagining\" this?? It's literally facts and figures you can look up online.",
          "score": 25
        },
        {
          "text": "That’s why those HDB built before 2000 are all humongous and there are certain value to it",
          "score": 24
        },
        {
          "text": "Too expensive to have kids. ",
          "score": 18
        }
      ]
    },
    {
      "id": "t3_1r9ici6",
      "subreddit": "singapore",
      "title": "Men in monk robes ask for money in Bugis during CNY, public calls police - Mothership.SG",
      "url": "https://old.reddit.com/r/singapore/comments/1r9ici6/men_in_monk_robes_ask_for_money_in_bugis_during/",
      "score": 153,
      "num_comments": 35,
      "created_at": "2026-02-20T09:51:18",
      "selftext": "The police were called to Waterloo Street in Bugis on Feb. 17 and 18, the first two days of Chinese New Year, after members of the public grew frustrated with groups of people asking for money by seeking alms.\n\nThe groups of people seen in monk robes were purportedly not local and only asked for money, but not food.",
      "comments": [
        {
          "text": "Happy to know that there are people who report fake beggars instead of going to Reddit to complain about fake beggars.",
          "score": 148
        },
        {
          "text": "Can we just deport these people",
          "score": 92
        },
        {
          "text": "People fly here as tourists to ask for alms? Lol",
          "score": 90
        },
        {
          "text": "&gt; According to Shin Min, a man in monk robes at Waterloo Street attempted to deflect the reporter's queries with S$2, but quickly left after it was refused.\n\nwhat the hell. $2?",
          "score": 26
        },
        {
          "text": "I saw a white guy in monk's robes do the same thing with an alms bowl at Ghim Moh. Near him was a somewhat embarrassed looking local who I think was his guide.",
          "score": 18
        },
        {
          "text": "came across 2 when i was at chinatown mrt during the eve, was going down a escalator and they purposely slammed their body on me a couple of times... thought it was very strange of a monk to do that.. they literally looked exactly like the picture..",
          "score": 15
        },
        {
          "text": "Cheebye they want to walk for peace also ah",
          "score": 9
        },
        {
          "text": "I came across such in china before. They wear monk robes, taoist outfit etc.",
          "score": 7
        },
        {
          "text": "Prison got free food",
          "score": 6
        },
        {
          "text": "We judge people base on how they present on the outside. What is on the inside we might not know until some things happened.",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1r8zewp",
      "subreddit": "askSingapore",
      "title": "What should you do if you see someone break down in public?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r8zewp/what_should_you_do_if_you_see_someone_break_down/",
      "score": 306,
      "num_comments": 55,
      "created_at": "2026-02-19T21:37:41",
      "selftext": "Earlier I saw this girl crouching and crying outside the train station on the way to gym. I felt so sad for her because I also regularly feel these waves of sadness to the point of wanting to cry (but not). And on Chinese New Year, no less. But I didn't know what to do...\n\nI went off to go find a pack of tissues to buy, but when i came back, I saw her walking off with her bf/another guy(? Idk). I didn't get to give her the tissues.\nIf it really is her friend, I certainly hope she has happier days ahead! \nThe only tinge of worry i have is that its *Not* someone she knows, and he's luring her off to get a coffee or something while she's down. Tho I'm probably ovethinking.\n\nBut yes, what should we do if we encounter such situations?? I'm not sure how to encourage someone...\n\nEdit: Guys i didn't manage to give her the tissues, she walked away when I went to buy them 😭",
      "comments": [
        {
          "text": "i did this once in a random hdb staircase. some guy had to walk past me to throw away rubbish but he came back with a box of tissues. didnt even manage to say thank you bc i was sobbing so hard\n\nbut ill remember that person forever. he didnt even say a word to me just offered tissues. so yea i think the best thing you could have done in that situation is just offer tissues",
          "score": 507
        },
        {
          "text": "Hmm there was once a middle aged lady who suddenly burst into tears when seated on the train...It was a little crowded and the people standing near her were looking at one another awkwardly (including me). I'm guessing most of us were clueless about how to approach the situation. \n\nA kind soul finally came to sit beside her to ask what happened. It was a little weird because from what I overheard about the conversation, she was blaming the gov for a lot of things and that nothing could be done. The nice guy tried to console her and told her to calm down.\n\nWhat happened next was really unexpected though. Two stops later, the nice guy was like \"EH oops reach my stop liao...sorry ah take care bye\"\n\nEveryone around her felt awkward once again.",
          "score": 213
        },
        {
          "text": "Once when I was doing Grab Hitch, I picked up a rider, who spent quite a bit of time texting furiously on her phone. She obviously was arguing with someone over text. About 3/4 through the ride, I heard the unmistakeable sniffling of a person trying to hide the fact that they’re crying.  I didn’t want to intrude so I didn’t ask, but just before I dropped her off, I passed her a packet of tissue, and said “Don’t let your tears fall for people who aren’t worth it, k?” She didn’t say anything, but she took the packet of tissues with her. \n\nI think about her from time to time. I hope things got better for her.",
          "score": 127
        },
        {
          "text": "hey OP first of all, salute you. you did know what to do; you went and tried to get some tissue to comfort her. you did well. don’t overthink it, prob her friend who came for her. but yes it means a lot for someone to actually ask if you’re ok. \n\ni remember my birthday few years ago, i was alone, walking my dog. my then partner, a complete asshole whom i’ve since broken up with made my day so sad. i felt so depressed, and was wearing my hoodie walking by dog in tears when a kind stranger asked if i was alright, and that really made my day. made me realise there are angels amongst us. \n\nso i guess next time, don’t hesitate to walk up to someone as say, “hey, all ok?”. just being ‘seen’ makes a huge difference. \n\nalso hope you’re ok.",
          "score": 118
        },
        {
          "text": "It is nice of you to offer the person tissue. Might be challenging to offer additional help. You don't know what she been through and counseling is an art.",
          "score": 85
        },
        {
          "text": "I once saw this lady on the mrt train sitting right opposite me and she was looking through a scrap book full of pictures and i only noticed her crying when she pulled tissue out of her bag to wipe her tears and her nose was red.. \n\nIt was like a collection of photos which she was flipping through... I didnt disturb her , just let her have a private space and like she got off in a few stops before me.. \n\nSo i guess we just have to analyse the situation and if it doesnt appear serious, just let them have their private moment..",
          "score": 41
        },
        {
          "text": "Many years ago, I cried on a bus after a breakup. After I got off the bus at mrt station (many people got off) and a guy came up, offered me tissues and asked did anyone bully me. \n\nThat was really nice of him and I remembered that kind act until now. It’s been almost 20 years and I still rmb",
          "score": 32
        },
        {
          "text": "I would ask a simple “Are you alright?” Or sth similar to check in on her. \n\nI remember when I was at the lowest point in my life, walking down a street feeling utterly hollow. A kind stranger noticed my sadness and asked me whether I was OK - I sobbed-laughed and said I was, but the impact was huge. It snapped me out of my bleak spiral and lifted my spirits enough to face the day. \n\nAll you kind people, just know even the littlest kind actions are seen, and greatly appreciated &lt;3",
          "score": 29
        },
        {
          "text": "I think it's always nice to ask whether the person is ok and then take their cues. Maybe they are having a bad day or need real help. You'll never regret extending compassion.",
          "score": 26
        },
        {
          "text": "have also broke down really badly in mrt/bus. and can tell that many ppl just stare at me. and no one has rly offered to help or what, which i dont mind honestly! in fact, would be more than okay if they just carry on without minding me, like just ignore that i’m there lol. cos im alrdy overwhelmed and wldnt have the energy to interact w anyone",
          "score": 25
        },
        {
          "text": "I was having a hard year and I was holding everything and trying a little harder every day and one day I fell down the stairs and immediately tears ran down my eyes not because I fell from the stairs but I felt like it was finally okay for me to cry and then a nice guy he was in the same class before saw me and asked me if I was okay, but in that moment I don't know if I was embarrassed or didn't want to tell him anything, obviously I am not a person who shares my problems and he was a stranger so I told him I was fine in a cold tone, I kinda regret it he was being sweet I could have atleast been polite I just wanted to push him away not because I didn't want to be bothered but because I don't want to bother other people",
          "score": 14
        },
        {
          "text": "Ohhh happened to me before when I was on the bus. A woman was sitting at the seat right next to the standing bay where I was. She was on the phone and her conversation was a bit loud and she ended up crying quite badly. I thought it was quite intrusive for me to ask what happened so I just passed her a pack of tissue quietly to minimize attention to her. She accepted it without saying anything back. Think it’s a mutual understanding that we acknowledge each other and no further words are needed especially when it was sensitive and vulnerable moment to have in public. Just gotta gauge the person’s reaction and take lead from there. That worked then so hopefully this helps!",
          "score": 14
        },
        {
          "text": "I usually leave them alone as I would want to be left alone. ",
          "score": 11
        },
        {
          "text": "I think that was a really sweet gesture! :-)\n\nI remember once when my moods were fluctuating really badly because I was going through a rough break up that I would break down and cry out of nowhere :')\nOn one of the days (this was during poly), I broke down and cried in the girl's bathroom, and some random girl came to me and gave me hug and comforted me until I stopped crying. That gesture really touched me till this day even though I don't remember her face. I hope she's doing well!!",
          "score": 10
        },
        {
          "text": "I was sobbing by myself in the mrt recently. It was pretty obvious but no one approach or asked if im okay. But, I guess offering a tissue or asking are u ok would be nice 🤭",
          "score": 10
        },
        {
          "text": "As someone who cried at work after my ex broke off with me on the phone text, i just wish people dont interact with me. Cus i dont want them to see my crying face or pity me. I just want to be alone. (Altho i would have offered tissues to someone else crying)\n\nOr maybe im just a tsundere 😂",
          "score": 8
        },
        {
          "text": "Just ask if they are okay, having a single piece of kindness when you are having a hard time, having someone ask if you are okay is good enough to start with.",
          "score": 6
        },
        {
          "text": "I would offer tissues. Nothing more than that.",
          "score": 6
        },
        {
          "text": "I once saw a man sitting alone on a bench, clearly overwhelmed, so I just sat down next to him in silence; sometimes, just being present can provide the support someone needs.",
          "score": 4
        },
        {
          "text": "I probably would ask the person, how can I help you?  Can I do anything for you?  Sometimes just sitting around and providing a listening ear to the person could do a lot for them!",
          "score": 4
        }
      ]
    },
    {
      "id": "t3_1r8sgrf",
      "subreddit": "askSingapore",
      "title": "HR said wife will be potentially laid off when she returns to work from maternity leave. Any advice?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r8sgrf/hr_said_wife_will_be_potentially_laid_off_when/",
      "score": 290,
      "num_comments": 148,
      "created_at": "2026-02-19T15:04:51",
      "selftext": "My wife 34F gave birth to our baby 2 months ago. She was scheduled to return to work in May after her agreed  maternity leave plus annual leave. She works for an mnc. Her HR contacted her today that they haven’t been able to find a role due to restructuring for her when she returns from ML. And that it  could lead to potential retrenchment. HR told her to start looking for other jobs. Though the role still exists and is being done by another person.\n\nThis was communicated by HR on a WhatsApp video call. No communication on email yet. HR said she will confirm  if they can find a role by end of next month\n\nWe are both shocked and confused on what to do next. Absolutely stressful as we bought a new house and have a new baby. Is this legal? What are our options? What should we do?",
      "comments": [
        {
          "text": "Yes I think it’s probably legal because the layoff will be done after her pregnancy. It is illegal to lay off during the pregnancy.\n\nOf course they cannot lay you off on the reason due to pregnancy, it should be due to position being made redundant due to business restructuring like what u mentioned but you should try to find out more. If this pregnancy is somehow linked to redundancy, I think there may be case to dispute this.\n\nIs the company unionized? You can contact the union to ask for help. Alternatively, you can write to TAFEP.\n\nOn a side note, if the retrenchment package is substantial with good $$, it may be good for your wife to take some time off and spend time with baby.",
          "score": 446
        },
        {
          "text": "As long as they pay the notice period, it's legal",
          "score": 126
        },
        {
          "text": "Nothing much. Start finding jobs",
          "score": 83
        },
        {
          "text": "Sorry about your situation. It is legal if they give the official notice after the ML is over. The HR is doing her a favour with a heads up. Unfortunately this is actually pretty common. I saw it happen in my US MNC that I got retrenched from as well. \n\nTake the money and spend this quality time with your newborn. Take it as extended ML for her haha. \n\nBefore her time is up, make sure she gets all her documentation from her  employer like payslips, contact bosses for references, note down impt emails for future contacts, exhaust all the freebies (like LinkedIn premium subscription).",
          "score": 74
        },
        {
          "text": "They alr very nice notify your wife before she returns, and let her go through the whole maternity. \n\nI hear cases people get fired right before maternity..\n\nAdvice is to find new job.",
          "score": 39
        },
        {
          "text": "It's not discriminatory if the company can show there are others being laid off or the restructuring affects her department, not just your wife.  They allowed her to take full maternity leave entitlement so there isn't any issue.. As long as they honour the notice period and or severance benefits ( mentioned in contract or employment handbook) , it is 100 per cent legal and also compliant with labour guidelines.",
          "score": 37
        },
        {
          "text": "job market is really bad.... better just to start looking for a job, which will be really hard...",
          "score": 24
        },
        {
          "text": "It isn't illegal to lay off someone after the maternity period. With the 3 months advance notice by the HR and the 5 months of retrenchment benefits, this sounds like a great outcome given the circumstances. ",
          "score": 17
        },
        {
          "text": "If company undergoing restructuring “documented” then is legal and layoff after  return from ML. \n\nStart looking for potential opportunities. \nJob market is bad",
          "score": 14
        },
        {
          "text": "It even happened in my stat board (all of us are on rolling contract basis). When there's a need to cut headcount, it is the easiest to aim the new mother who just came back from her maternity leave because her work has been redistributed amongst the remaining colleagues. She had to find somewhere else to transfer to but good thing she did because she is really good at what she does and is promoted at the new place. The so called pro family is all lip service.\n\nOn the bright side, your wife has a retrenchment package and she can take the time to find another job.",
          "score": 12
        },
        {
          "text": "Legal and very common with US MNCs.",
          "score": 10
        },
        {
          "text": "Its legal. There's nothing to say they cannot lay her off AFTER her return. In fact, I think the HR did her a favour by informing her early rather than last minute.",
          "score": 10
        },
        {
          "text": "And people still dare to hoot us for low birth rate while praising our labour laws for keeping us competitive.\n\nCan’t have your cake and eat it, dumbasses.",
          "score": 10
        },
        {
          "text": "Unfortunate &amp; sad, but ultimately we work for companies (for profit), so I don't think there's anything illegal about laying off people with a reason (&amp; you know, these days companies can come up with reasons). I feel we should all get used to this brutal reality that lay-offs are going to be the new normal. It sucks, big time.   \n  \nP.S: My wife was laid off in the 8th month of pregnancy. So, my two cents: start exploring new opportunities in the industry, which may take a while. I have built an application for my wife (&amp; people in a similar boat) [https://makemyresume.ai/](https://makemyresume.ai/)  Do try, hope it helps in some capacity. ",
          "score": 10
        },
        {
          "text": "Private company they can always come up with some reason. No point fighting it unless its a gov/stat board and an asshole manager. ",
          "score": 8
        },
        {
          "text": "ask for more pay package. sometimes to close of the case, the HR / leadership may have some leeway to give some to close the matter off. \n\nits distasteful but you know - companies are just like that. late stage capitalism, blood sucking monsters. \n\nthen look through your finances and cut every stupid shit out. ",
          "score": 4
        }
      ]
    },
    {
      "id": "t3_1r93ya6",
      "subreddit": "askSingapore",
      "title": "What’s something in Singapore that locals think is “normal”, but foreigners find shocking?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r93ya6/whats_something_in_singapore_that_locals_think_is/",
      "score": 112,
      "num_comments": 146,
      "created_at": "2026-02-20T00:35:09",
      "selftext": "I’m from Cyprus and Singapore feels very different in everyday habits — queuing, public transport etiquette, communication style.\n\nWhat’s something locals think is normal here, but outsiders usually find surprising?",
      "comments": [
        {
          "text": "A pack of tissue paper can reserve seat in the hawker centre or food court.",
          "score": 241
        },
        {
          "text": "Foreigners find it surprising when I tell them that if people want to protest, they need to get a permit and permission from the government and can only do it in Hong Lim Park",
          "score": 175
        },
        {
          "text": "That about 70% of the local population stays in government housing. Across the world, government housing is taken to be something for the lowest income families but in Singapore middle class families also stay in public housing. \n\nWe also have a racial quota for public housing which would be unimaginable in any country.",
          "score": 137
        },
        {
          "text": "That crime is very, very rare.. basically shoplifting makes it into news.",
          "score": 87
        },
        {
          "text": "You need to pay an amount in the region of S$100,000+ for a certificate that gives you permission to own a car for 10 years. [[Source](https://www.straitstimes.com/singapore/transport/cat-b-coe-rate-falls-by-8-8-to-110890-as-premiums-drop-across-the-board)]",
          "score": 59
        },
        {
          "text": "Using SingPass for everything.\n\nWant to get insurance? SingPass. Want to open bank account? SingPass. Get a credit card? SingPass. Buy a house? SingPass. Pay bills? SingPass.\n\nMy foreign friends think it's a bit of a government overreach. Like having private bank accounts, loans and insurance tied to government ID and how everything is linked so there's no privacy whatsoever. Except I tell them that in other countries they already need some sort of ID to do all those things anyway. Like a drvier's license or passport. So it's really not that different, and SingPass is just convenient because anyone who uses it has all the relevant information at their finger tips.\n\nLike when I apply for housing loan to buy by home, instead of having to compile all my pay slips and tax forms, I just use SingPass and it has all that information already. Most of them don't believe that we do a lot of bureaucratic stuff online, just because it's so convenient and the whole process can be super quick. Like a few days to get stuff done compared to the weeks they need for them.",
          "score": 58
        },
        {
          "text": "To be honest, in my line of work (front line), most of the foreigners whether visiting or working here would compliment about the convenience“to get help” or the accessibility “to get to somewhere”.\n\nWhether it is the hotlines, visits to the Govt offices, medical institutions, even the aplenty food places etc. Or just travelling out of SG from Changi Airport to any part of the world. Or we can choose to remain here and have artists who would gladly choose to hold concerts on our little red dot. \n\nWe live in a safe, compact and well planned city.",
          "score": 57
        },
        {
          "text": "Coffee/tea served in plastic bags at hawker centres/coffee shops.\n\nChope-ing (reserving) tables with tissue packets.\n\nNo chewing gum\n\nNot uncommon to see people leaving laptops/bags at the table while going to the restroom (but not recommended)",
          "score": 56
        },
        {
          "text": "My foreign colleagues always get tickled when they hear about BTOs:\n- Needing to ballot for a house\n- Needing to wait 3-5 years for a house\n- Needing to be married before collecting keys",
          "score": 54
        },
        {
          "text": "Ice cream on bread—my Japanese friend told me, \"Why mix ice cream with food?\" Seriously, I can’t explain, and I told her I have been eating this since childhood.",
          "score": 41
        },
        {
          "text": "Calling strangers auntie and uncle",
          "score": 23
        },
        {
          "text": "OP, elaborate please. Curious to hear how different and how you feel about the differences.",
          "score": 13
        },
        {
          "text": "That for the price to lease a Honda Fit in Singapore for 10 years, they can buy two Mazda 3 plus two Toyota Corolla and throw in a Hyundai i3 in their country for eternity. \nYou then watch their jaws dropped.",
          "score": 10
        }
      ]
    },
    {
      "id": "t3_1r9gi1u",
      "subreddit": "askSingapore",
      "title": "If you can change one law in Singapore what would it be?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r9gi1u/if_you_can_change_one_law_in_singapore_what_would/",
      "score": 113,
      "num_comments": 165,
      "created_at": "2026-02-20T08:28:24",
      "selftext": "For me, it would be to legalise euthanasia for people who are suffering from incurable or debilitating disease\n\nBut perhaps with very stringent guidelines for a start -  patient to be of sound mind, incurable/debilitating disease only, no third-party authorisation etc.",
      "comments": [
        {
          "text": "Mandatory english test for PR applications",
          "score": 256
        },
        {
          "text": "higher penalties for dangerous driving\nespecially for those resulting in death",
          "score": 147
        },
        {
          "text": "Make Thaipusam a public holiday. Long overdue.",
          "score": 119
        },
        {
          "text": "Ban smoking.",
          "score": 96
        },
        {
          "text": "I support you in legalising euthanasia. I have seen quite a lot of unnecessary suffering of patients but the the challenge to even to get it legalised and the framework to safeguard it may not be something our government will undertake.",
          "score": 76
        },
        {
          "text": "Penalties for grossly negligent driving that causes permanent disabilities and death",
          "score": 69
        },
        {
          "text": "Harsher sentencing on sexual crimes and compensation to victims whether it’s medical or therapy etc. public sex offender registry.",
          "score": 45
        },
        {
          "text": "Ban burning Joss paper in HDB estates. Restrict only to temples.",
          "score": 45
        },
        {
          "text": "Manatory Retrenchment benefits",
          "score": 37
        },
        {
          "text": "Dangerous driving of course. Too many people got off scot free from this. Need a harsher penalty to deter these reckless drivers.",
          "score": 32
        },
        {
          "text": "There should be a threshold for unruly neighbors where they may be removed temporarily before allowing them to return. Something akin to a forced mental wellness check.\n\nIt seems absurd that there aren’t enough means to handle folks who can hold an estate hostage with their actions.",
          "score": 13
        },
        {
          "text": "life/death sentences for scammers, money launderers and white collar crimes kingpins. orchestrating a big organization which focuses on destroying someone's life savings and family is evil, deserve much harsher sentences. its not just \"money\", its a person's life you took away. why should a white collar criminal who sits in a fancy office who facilitates the acceleration of evil scam deserve any less.\n\nnever gonna happen unfortunately",
          "score": 12
        },
        {
          "text": "If your action (e.g. careless driving) results in someone losing their ability to support themselves (e.g. causing them to be disabled or hospitalised), you not only serve your jail term and pay your fine, you also pay for their loss of income or maintenance until they are able to themselves again.",
          "score": 11
        },
        {
          "text": "[ Removed by Reddit ]",
          "score": 8
        },
        {
          "text": "penalties for cyclist and pedestrians who dont follow road rules",
          "score": 8
        },
        {
          "text": "Severe punishment for animals / child abuse.",
          "score": 7
        }
      ]
    },
    {
      "id": "t3_1r92jmo",
      "subreddit": "askSingapore",
      "title": "Is Public Sector Work in Singapore Really “Chill”? Seeking Career Perspectives",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r92jmo/is_public_sector_work_in_singapore_really_chill/",
      "score": 82,
      "num_comments": 50,
      "created_at": "2026-02-19T23:43:05",
      "selftext": "I’m genuinely curious about the common perception that public servants in Singapore have great work-life balance, light workloads, and are generally “cruising” on taxpayers’ money.\n\nFrom my experience working in the public sector, particularly observing colleagues in policy, communications, and strategic planning, the reality feels quite different. Work often extends beyond standard office hours, sometimes into weekends. Many of us are contactable after hours via email and WhatsApp, and there’s an ongoing sense of being on standby in case issues escalate. Mentally, it can feel difficult to fully disconnect, even during festive periods.\n\nI’m hoping to hear perspectives from others (both within and outside the public sector in Singapore):\n\n\t•\tAre there specific job functions within the public sector that genuinely have better work-life balance?\n\n\t•\tDo “chiller” roles typically come with significantly lower pay, or are there roles that still offer competitive compensation relative to age/experience?\n\n\t•\tFor those in high-intensity public sector roles, how do you manage burnout and maintain a positive outlook?\n\n\t•\tHow do you personally assess the impact or value of the work you do,especially when faced with large number of amendments from bosses for written work?\n\n\t•\tWhy do you think the stereotype of public servants having relaxed jobs persists over the years?\n\nWould appreciate thoughtful insights.",
      "comments": [
        {
          "text": "The idea that public service is a coast life usually stems from the notion that its almost impossible to get fired. Thats where the term ‘iron rice bowl’ comes from, meaning no matter what you do, you’re guaranteed a steady income. Thats why there isnt much consequence to laying back and chilling, which is what many people do, especially if theyre satisfied with their salary.\n\nI’d say alot of that notion also comes from the Army, everyone who has served national service will know that a large portion of army regulars do fk all. And people who are there for 20/30 years even though theyve practically given up on their careers and do basically the bare minimum.\n\nPub sector can be intense sometimes, sure, but I think it doesnt come close to some of the top private sector companies that squueze every last drop out of you while keeping your job stability hostage. These places pay insane salaries that you’ll never dream to see in the public sector, but it will also eat away at your soul.",
          "score": 111
        },
        {
          "text": "Some jobs in the public sector will work you like a dog. Any job with short timelines or at the behest of a senior public servant or political office holder who demands work round the clock can get tough fast.\n\nYou can’t really assess the value or impact of the work, not in the short term as public sector work often requires investment in systems which will pay off later. I suppose many public servants just learn to give their bosses what they want. \n\nThere are many jobs in public service which don’t impact the public, aren’t public facing or aren’t a priority of the government. Some coasters get away with slacking there.\n\nMany public servants find their job meaningful and downplay the tough parts of it, or present a simplified explanation of it to friends/family who then think public service work is very senang.\n\nI think many public servants are severely overworked, but there are also a lot of public servants who whine about how tough their life is  without experiencing how bad overworking can be in any other job.",
          "score": 93
        },
        {
          "text": "It's actually quite stressful because public service is under scrutiny all the time.\n\nAnd there's also a lot of fire fighting. When the top wants something done, it's usually in very short notice.\n\nThink about the various debacles by the government. It is usually the farmers that are under intense pressure to fix them.",
          "score": 61
        },
        {
          "text": "Lol.. we all know the stereotype of public servants being chill is pushed by private sector clowns who need to stoke their own tiny ego (when actually the real useless ones are them).\n\nFor the public sector guys who left for private pushing this stereotype, most obviously left for better pay/progression so naturally they feel public service is ‘slow’.\n\nSingapore is the one of the if not the WORLD’s most efficiently run country and all this is done by public servants mostly. If public service is cruising, then every other country’s public servants are more or less paid to do nothing in comparison.\n\nQuite obviously there will be cruisers everywhere. I know many private sector workers who have bosses overseas so they just start work at 10am and are not even ‘working’ because they can log on via phone to ‘show’ presence (reality is they are at the gym/shopping mall/relaxing at home). If public sector is so good why dont i see a queue forming for it? The so-called cruising jobs are probably lowly paid/bad progression which is the same as any other shitty white collar private sector job.",
          "score": 33
        },
        {
          "text": "You either pick $ or chill/slack job. I would say near impossible. Let me know if you find one. \n\nFind a job you don't hate and impossible bosses and you are good. \n\nJob is not your identity. Don't build your identity around a job. ",
          "score": 24
        },
        {
          "text": "In my experience, it all depends on the nature of your work, and the people you work with. My experience also showed me that in public service “optics” is the top priority. However, compared to my peers in other divisions where I currently work, I am lucky because my team is supportive and respects work-life balance. Some people may try to test those boundaries but when you present them firmly, they don’t push.\n\nWhat I have learned though is you have to fight for your own progression. It doesn’t have to be in the form of a promotion. It can be just solely on skills and experiences. This is applicable to anywhere you work IMO. If you don’t actively pursue improvements to your career portfolio in terms of skills and experiences, that’s where you get stuck and lose your competitive edge.",
          "score": 24
        },
        {
          "text": "No, public service work is not chill at all in my experience. No work life balance. Most of my customers are public servants and they still send emails at 2am, weekends and public holidays. The most frustrating thing for them (and I work with some 20 public service agencies) is that goalposts are always changing because some senior director comes up with a new smart idea last minute. Complete overhaul of specs last minute leaving project teams scrambling is a very common phenomenon. This is very demoralizing because you have officers working for months and suddenly a FYI presentation to senior management just sent all the hard work down the drain. Eg, a project I worked on for 6 months was close to completion and the mgmt just wanted to update the minister in charge. Minister asked some questions about the project which clearly showed he didn't understand the project background and had mixed up the agencies' portfolios. But instead of explaining the rationale for the constraints, the project scope expanded and became cross-agency to cater for the minister's requests and yet had to be delivered within the remaining 4 weeks. Such happenings are all too common.",
          "score": 17
        },
        {
          "text": "Yes. Give you example: Comms in LTA vs comms in SEAB; which is more stressful? Lol\n\nNo, no penalty. Some chiller jobs get paid more\n\nChange job\n\nNo value\n\nJob creation really",
          "score": 17
        },
        {
          "text": "1) I think typically govt services that have defined SLAs e.g. approval of submissions type of work or TOR e.g HR, technical depts can potentially have more work life balance. Not saying that their workload is low or easy but because there are pre defined safeguards and potential to plan out work, you might have more control over your time. This is a broad generalisation though as I’m sure even teams like the above are stretched. \n\n2) there is definitely a stratification of salary but I don’t think it’s as wide as the private sector. Civil service has the MX scheme that applies to all CS across ministries and stat boards will use that as a reference. The elite agencies like MFA/EDB will have their own scheme but at the working level I don’t think they can deviate too much as well. What probably makes an additional difference for superstars is the allowance that the PSLP scheme adds on and that the AO scheme is on a different salary tier.",
          "score": 15
        },
        {
          "text": "Not chill in most ministries as there is pressure from the top and from the public. \n\nStatutory boards - you will need to find one that deals less with the public.",
          "score": 13
        },
        {
          "text": "No. I don’t think any 9-5 is truly chill. It depends on the industry and job scope. Most importantly your boss.",
          "score": 11
        },
        {
          "text": "Not chill la everyday firefighting and cover backside",
          "score": 9
        },
        {
          "text": "Mostly busy work , aka work that keeps you busy rather than having any real impact operationally or strategically",
          "score": 8
        },
        {
          "text": "Depends on department and team. I was in GovTech for a while and I remember having to send emails on New Year, Christmas and Chinese New Year on top of having to eye ball quite a lot of things on many of my weekends.",
          "score": 7
        },
        {
          "text": "It definitely depends which department one is in. There is some truth to the stereotype but it's mostly perpetuated by older employees who already made their money in flipping and renting property, and feel their continued employment is just reward for their loyal service despite effectively doing a part timer's volume of work. \n\nUnfortunately, it is tough to get rid of deadwood unless they're significantly underperforming (or troublemakers). This makes it tough for newer employees to get emplaced (put on permanent roles) as most public agencies operate on strict headcount limits.\n\nWorse, others have to pick up their slack, resulting in burnout. In public sector, the maxim that good performers are rewarded with more work definitely applies.\n\nEnd of the day, especially at more senior levels, public sector pay is generally low enough (unless one is receiving PSL or AO allowance) that the salary to workload ratio cannot be what keeps one going, regardless if one is cruising.",
          "score": 4
        },
        {
          "text": "I don’t doubt that there are easy-cruising jobs in government where you will never be fired, but the only constant at work is change. Colleagues retire, bosses get promoted, and those who take over them might not necessarily be compatible with you or your values.\n\nNever got the point of staying at a job till retirement age that doesn’t even pay well. I’ve chosen to chase money instead because at the end of the day, all work is just to earn money.",
          "score": 4
        },
        {
          "text": "No. When bosses ask for things, they expect u to deliver yesterday. So on top of ur usual work, u have a lot of fire to fight, possible to work till 2-3am. Then progression is slow for farmers. The thing is the job can be meaningful, so people stay in spite of all the shit.",
          "score": 4
        },
        {
          "text": "If you lucky. Yes.\n\nIf you unlucky. No.\n\nSame for private.\n\nAge old bias silly opinion that holds zero water.",
          "score": 4
        },
        {
          "text": "Actually not true, whether it is chill or not depends on your portfolio. And this applies to every sector \n\nBut I won’t deny that there are some departments that are very chill in nature..\n\nAnother aspect is, personally I feel that working in a more shiong department doesn’t have any impact on your progression. \n\nThe progression and the increment is the same as those that are more chill or virtually just coasting through. And your colleague in a more chill department, she even gets to go on maternity leave while you’re here slogging it out and yet still be on the same terms as you \n\nBosses tend to treat us as the same even though there is vast difference in impact of work. \n\nAnd then when it comes to appraisal, totally hate it when they try to gaslight us when the lack of parity is so obvious. Honestly whether it’s good for my personal development or not has no bearing on how much food I can put on my table. \n\nTotally not worth it.",
          "score": 4
        },
        {
          "text": "Some stat board don't offer perm contract. So your performance have to be good otherwise they will also make you leave. Even if your performance is good, should they be required to cut headcount, people with contract renewal due first will be first on the chopping board, unless you are somehow irreplaceable (quite literally impossible)",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1r8z1pr",
      "subreddit": "askSingapore",
      "title": "What do you still consider relatively inexpensive or cheap in Singapore?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r8z1pr/what_do_you_still_consider_relatively_inexpensive/",
      "score": 44,
      "num_comments": 88,
      "created_at": "2026-02-19T21:21:28",
      "selftext": "Inflation is and cost of living remain cause of concern in Singapore. What do you still consider relatively inexpensive or cheap in Singapore?",
      "comments": [
        {
          "text": "A phone plan. You can easily get a number with a few hundred GB of data for less than $10 a month, some even with free roaming to neighbouring countries.",
          "score": 133
        },
        {
          "text": "- Hiring domestic help. A live-in housekeeper can easily set you back $5000 in other countries (with full employment benefits), and they won’t do childcare for which you have to pay a nanny separately. Might not cook for you either. \n- Part time cleaning. In Singapore you can expect to pay about $20-25 per hour for the service. In NYC I was paying US$50 per hour give or take, plus tip!\n- Clothes alteration services. The neighbourhood auntie tailor will charge you $15 tops for pants hemming and can probably turn it around within a day or so. Unheard of in many countries.",
          "score": 86
        },
        {
          "text": "Hawker food.\n\nTaxi. Have you seen how crazy taxi fares get in US or in European countries with similar income levels as ours?",
          "score": 76
        },
        {
          "text": "Hawker food",
          "score": 73
        },
        {
          "text": "Food is crazy cheap for a tiny island and relative to salaries.",
          "score": 65
        },
        {
          "text": "Hawker food and groceries",
          "score": 36
        },
        {
          "text": "Food is relatively cheap if we look at hawker food.\n\nPublic transport (bus and mrt) is relatively cheap in conjunction with close proximity of everything.",
          "score": 30
        },
        {
          "text": "I think almost everything one needs to live a simple, fuss-free life - clothing, public transport, food, phone plan, gym \nsports facilities (ActiveSG), community club classes.\n\nPolyclinic fees and subsidised medicine is not expensive for citizens. Income tax is super low. Capital gains tax is zero. Brokerage fee for investing in funds and trading shares have come down 80% in 15 years. Tech gadgets are relatively inexpensive, and people here sell good 2nd hand stuff on Carousell if you have patience. Flights cost the same as 20 years ago. Libraries and parks are free. There are places to buy toiletries and daily household items that are 15-20% cheaper than Fairprice, like Ocean, Swanson and Valushop. \n\nWhen I compare with Malaysian, Thai and Brazilian colleagues, our disposable income and savings rate is so much higher. Even if you’re like me, retrenched, middle-aged and jobless, living here is okay. The main concern is having a roof over our head. And there are other ways to leverage on lower cost overseas, like buying from Pinduoduo or Taobao, or JB. ",
          "score": 28
        },
        {
          "text": "Talk is really cheap here",
          "score": 26
        },
        {
          "text": "Primary and secondary sch education (heavily subsidised)",
          "score": 22
        },
        {
          "text": "Public Transport. ",
          "score": 17
        },
        {
          "text": "I agree with most of the people here - LOCAL food is relatively cheap. The occasional mid tier stuff like Fish&amp;Co or Poulet is also doesn't break the bank. I do think our fast food places need to bring back student prices though.",
          "score": 14
        },
        {
          "text": "Anything related to basic living with bare min standards are really affordable, from, food, grooming, medical care, etc. it is when we want anything more that's when costs escalate greatly, regardless of services or products",
          "score": 7
        },
        {
          "text": "Haircuts? We get $6.80 snip Avenue cuts",
          "score": 5
        },
        {
          "text": "Cars and housing!\n\nNah just kidding. Hawker food for sure. For &lt;$5, I can have a nice plate of Cai Png, or a bowl of Bak chor mee. A big thank you to all the hawkers for providing us with affordable meals 😁\n\nUnpopular opinion, but public transport is relatively affordable if I compare it to countries like Taiwan, Thailand and even Japan where the median income there is lower, but their public transport cost similar to ours or even more expensive.",
          "score": 5
        },
        {
          "text": "Public transport is cheap",
          "score": 5
        },
        {
          "text": "Hawker food ",
          "score": 4
        },
        {
          "text": "clean water, food, public transport, public healthcare (if u don't mind the wait), mobile plan, taxes, BTOs, FDW, public education, public gyms.  \n",
          "score": 4
        },
        {
          "text": "Govt childcare. Around $400 a month with basic subsidy. Heard of others paying like $25/month.",
          "score": 4
        },
        {
          "text": "Water",
          "score": 3
        },
        {
          "text": "Active sg gym, swimming pools, nlb membership, public transportation",
          "score": 3
        },
        {
          "text": "Mostly everything except vehicles and property.",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1r9ka54",
      "subreddit": "askSingapore",
      "title": "Taking MC during notice period?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r9ka54/taking_mc_during_notice_period/",
      "score": 32,
      "num_comments": 49,
      "created_at": "2026-02-20T11:19:54",
      "selftext": "Currently serving my 1 month notice period for resigning and today I legit sick and told my manager I'm going to see a doctor and take MC. But he told me to come afternoon instead and said that \"You can't take MC after resigning\" is it true??",
      "comments": [
        {
          "text": "Let me guess, SME?\n\nNo one can stop you from taking MC, what are they gonna do, fire you from a job you are already quitting?",
          "score": 124
        },
        {
          "text": "of course not true. If you are really sick and certified by a doctor, then regardless of whether you are on notice period or not, you should be home resting. ",
          "score": 44
        },
        {
          "text": "Send this link to your manager https://www.mom.gov.sg/employment-practices/termination-of-employment/termination-with-notice\n\nIf you are covered by the Employment Act, and you take sick leave (paid or unpaid) during the notice period, it is treated as part of the notice period. Your employer cannot extend your notice period or claim for any short notice from you.",
          "score": 35
        },
        {
          "text": "take the MC. if you kana HL, they also cannot do anything about it. Weird companies trying to be jokers. ",
          "score": 18
        },
        {
          "text": "You ask him to get MOM to confirm his statement\n\nIf he can produce MOM's confirmation on this, I give him 100% of my monthly salary, I earn 10k a month\n\nIf he cannot, ask him to give you 100% of his monthly salary",
          "score": 18
        },
        {
          "text": "What? How is that possible, humans are immune to any sorts of disease and sickness during probation and notice periods, no? 🤯",
          "score": 15
        },
        {
          "text": "HR here, as long as you work &gt;3 months, you *are* entitled to paid sick leave even if you are serving a notice period.",
          "score": 14
        },
        {
          "text": "U can",
          "score": 9
        },
        {
          "text": "Tell your boss you'll check with MOM first to see if MC is valid during notice. \n\nThen watch him pivot 180 degrees and say yes, use your MC.",
          "score": 8
        },
        {
          "text": "Siao",
          "score": 5
        },
        {
          "text": "Lol SMEs and their antics. I remember when I was an intern at SME, my boss asked me to extend another 3 months after my internship with the threat \"I have not submitted your internship grade to the school yet\". Also, he wanted to pay the same internship pay if I extended.",
          "score": 5
        },
        {
          "text": "Your body is yours but the company is never yours. Take good care of yourself.",
          "score": 5
        },
        {
          "text": "Go to MOM website search under medical certificate/reporting sick and then quote it to your manager and ask him/her are you contravening the law (Employment Act) ? If yes can you give me in writing/black and white for record purpose after which i will seek clarification from HR or MOM.",
          "score": 3
        },
        {
          "text": "It is an entitlement &amp; use it",
          "score": 3
        },
        {
          "text": "SME ah? \n\nLOL pls - MC is your entitlement until you work on your last day. \n\n",
          "score": 3
        },
        {
          "text": "Also if im not mistaken, you are entitled to a full year of MC quota as set out by your company, no need to pro-rate.",
          "score": 3
        },
        {
          "text": "Why not as long as you are a confirmed employee you are entitled to it.",
          "score": 3
        },
        {
          "text": "Bro, name and shame the company!!\n\nAny SME that is being fucked up to it's employees deserves to be named and shamed!!!",
          "score": 2
        },
        {
          "text": "As long as you have a legit MC from your doctor you can take.\n\n\nYou can expect to get docked one day of pay because you're not confirmed staff .",
          "score": 2
        },
        {
          "text": "Nonsense amateur HR trying their luck\n\nThere's no such thing as companies can force people to work when they are on MC or deduct their pay due to it even when they are serving notice.",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1r8zc6y",
      "subreddit": "askSingapore",
      "title": "My mother is nearing early onset Alzheimer's age. What are her options?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r8zc6y/my_mother_is_nearing_early_onset_alzheimers_age/",
      "score": 17,
      "num_comments": 34,
      "created_at": "2026-02-19T21:34:23",
      "selftext": "hi everyone, I'm looking to understand what are the screening and treatment options for my mother. She has been showing signs of neurodegeneration increasingly and I look to convince her to seek early screening and detection, and to reassure her I would like to be able to explain her options to her.\n\nI remember seeing SGH mention somewhere they have screening available, but would like to see if anyone knows more about local screening.\n\nHence this question seeks 3 primary pieces of information, but anything else that you guys know is also much appreciated.\n\n1. Where could we find local screening services for early onset Alzheimer's/dementia, and what are their costs? Also what is the procedure like? (because post lumbar puncture syndrome is annoying asf)\n\n2. If diagnosed, what are the treatment options available? My mother went through chemotherapy for several years a decade ago so she is more susceptible to ARIAs from small molecule DTTs like lecanemab and donanemab, so I look to find out about alternatives. \n\n3. What is the quality of care like for such cases? Are doctors generally more dismissive of our concerns or do they take it seriously? This is hard to generalise but I will admit that positive experiences will reassure me while negative experiences with this are discouraging.\n\nthank you!! ",
      "comments": [
        {
          "text": "Hello OP, the important task is to reduce the speed of descent into Alzheimer's. For my parent heading into Parkinson's, I had: \n- taken time to give writing and simple arithmetic exercises several times a week. These help to encourage mental activity. \n- daycare in homes. I got my parent on 2x a week with some occupational therapy and physical therapy. Then progressed to 5 days a week for daycare. \n\nThe reality is that the senior HATES all these. But these have been really useful in helping to slow the descent. \n\n- lastly, try to get a referral to the government hospital's geriatric department for a more holistic assessment and set of recommendations moving forward.\n\nHope these help!",
          "score": 21
        },
        {
          "text": "No one mentioned this.\n\nBut get a LPA done. Lasting power of attorney.",
          "score": 18
        },
        {
          "text": "**Polyclinics**\n\n**You can approach Polyclinics to provide the necessary assessments for diagnosis.**\n\n**You may also approach a Community Outreach Team (CREST) or Community Intervention Team (COMIT) for screening, intervention and caregiver support.**\n\n**A list of polyclinics, CREST and COMIT teams can be found in the** [**Mind Matters Resource Directory**](https://www.aic.sg/resources/Documents/Brochures/Mental%20Health/Mind%20Matters%20Resource%20Directory%20Listings.PDF) **by AIC.**\n\n**Helplines**\n\n**You can call the following helplines for more information.**\n\n1. **Dementia Helpline by Dementia Singapore: 6377 0700**\n2. **Agency for Integrated Care Hotline: 1800-650-6060**\n3. **HealthLine by Health Promotion Board (HPB): 1800-223-1313**\n\n  \n[https://www.dementiahub.sg/what-is-dementia/where-to-get-a-diagnosis/](https://www.dementiahub.sg/what-is-dementia/where-to-get-a-diagnosis/)",
          "score": 6
        },
        {
          "text": "Parent same case. Saw the specialist at sgh twice but doctor didnt diagnosed as early onset dementia as he passed the test. But recent memory lost /lost way quite evident from my pov. I heard from my friends there are medications/medical patch to delay the onset of symptoms which I like him to take.",
          "score": 3
        },
        {
          "text": "I think your questions are based on a few misconceptions. Either that or we’ll need a lot of clarification. \n\nYou mentioned screening vs diagnostics. Which one are you asking about? \n\nYou mentioned ‘signs of neurodegeneration’. What are they? \n\nDementia, early onset or not, is a classification of function and functional impairment. Alzheimer’s refers to one specific aetiology of said decline. Again, it’s difficult to know what you’re asking for - how to detect early cognitive decline or how to detect specific proteins that are associated with Alzheimer’s?\n\nWhat are you talking about when you reference ‘treatment options’? What are you looking to treat? Functional restoration? Slowing down cognitive decline? Behavioural and psychological symptoms?",
          "score": 3
        },
        {
          "text": "Book an appoinment with a geriatric doctor and get her to do an assessment for dementia at the hospital. That is what I did for my mum. The doctor did not give her any medications as they consider her case to be mild cognitive impairment and not dementia yet. To keep her active cognitively and physically, I downloaded Neuronation app and get her to do some activities on the app daily. I also remind my mother to do youtube exercises at home daily. She watch yes2next youtube exercise videos  because they have a modified version for the elderly",
          "score": 2
        },
        {
          "text": "Please start off at a polyclinic and they'd refer you to a specialist accordingly.",
          "score": 2
        },
        {
          "text": "OP and anyone else, you can join NTUC Health's \"DayCare+ | Dementia Programme for Elderly\". It's 30 mins/weekday, comes with prerecorded sessions you can play for elderly on weekends. PM me I can give you a preview.",
          "score": 1
        },
        {
          "text": "If you are a SG/PR, get a polyclinic appt and ask doctor for referral to hospital geriatric specialist. The polyclinic doctor may schedule you for the Memory Clinic at the polyclinic first, this is held only once a month. The Memory clinic will conduct a written memory test.\n\nIf she is referred to the hospital, the specialist will order a brain scan, a memory test (same as that done by poly).\n\nThe polyclinic route to the specialist will take about 3 months, so in the waiting period, do the LPA. After and if your mother is diagnosed, she will not be deemed fit to execute the LPA, so make sure to do it before seeing the specialist.\n\nIf you choose to see the specialist directly, then your mother will be treated as a private (Class A) patient, i.e. no subsidies.",
          "score": 1
        },
        {
          "text": "Maybe fish oil / plant DHA can help",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r8u60a",
      "subreddit": "askSingapore",
      "title": "UAT Tester career progression ?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r8u60a/uat_tester_career_progression/",
      "score": 13,
      "num_comments": 14,
      "created_at": "2026-02-19T16:50:39",
      "selftext": "so i’m looking to do UAT tester job in a bank since they accept no experience to get a start in tech, but it’s all contract roles. \n\nis there anyone doing UAT tester job and secured full time? or been able to progress into other full time tech jobs? ",
      "comments": [
        {
          "text": "Role is mostly outsourced to other countries with cheaper labour. Moving laterally to Tech roles is almost impossible since UAT testing requires no hard tech skills. The only possible pivot would be into Product Management but even that would be hard. You're better off looking for a Product Manager intern / fresh grad role if you want to somewhat break into Tech.\n\nOtherwise, if you're looking to pursue conventional tech roles, you can take up IT or Cloud certifications which may help in getting roles like System Administrators, IT Infra Engineers. Long term you can even look to become a DevOps and Cloud Engineers. \n\nOther roles like Software Engineers / AI Engineers / Site Reliability Engineers almost always require a Bachelors or Masters degree in a relevant field and are quite impossible to break into laterally in this job market unless you have REALLY extensive programming experience and the projects to back it up. 🙂",
          "score": 19
        },
        {
          "text": "Don’t lock into this dead end job since this is being outsourced, even for QA managers. Lateral transfer to other IT roles like PM is possible but with job market being shitty don’t think so unless you buddy buddy with the people there and there’s an opening available.",
          "score": 13
        },
        {
          "text": "Can become QA analyst -&gt; QA Manager.",
          "score": 11
        },
        {
          "text": "Don’t go into it. We use UAT testers from India, and even that will be cut. Now a lot of banks ask the end users to test themselves.",
          "score": 6
        },
        {
          "text": "Don't. It's a dead end role.\nSource: im in bank tech.",
          "score": 5
        },
        {
          "text": "UAT testing are mostly to support certain project, usually new system launch. So they are mostly contract basis until the project end. Chance of converting to perm is not very high since it is cheaper for them to get contractors.",
          "score": 4
        },
        {
          "text": "Vulnerable to being outsourced to South Asia",
          "score": 3
        },
        {
          "text": "I think you can take it if you can do your way to an internal rotation within the bank. Sometimes getting in is the hardest step.",
          "score": 2
        },
        {
          "text": "Damn sai kang one lol",
          "score": 2
        },
        {
          "text": "Actually y need uat tester? Dosent the team who are going use the programme are the best person to test and give feedback to engineers.\n\nSometime I dont know why there a need for uat tester team. You created the programme for my team than I am the best to test and see how it affects the team and out put. I dont see how a uat tester who has never work in that team are able to give true feedback on it.",
          "score": 1
        },
        {
          "text": "idk about banking industry but expect sibei boring monotonous testing scenariosssss i wouldnt suggest doing it unless no choiceeeeeee",
          "score": -5
        }
      ]
    },
    {
      "id": "t3_1r8uluh",
      "subreddit": "askSingapore",
      "title": "Clothes thrifting in Singapore?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r8uluh/clothes_thrifting_in_singapore/",
      "score": 11,
      "num_comments": 15,
      "created_at": "2026-02-19T17:18:08",
      "selftext": "How big is the clothes thrifting culture here in singapore? Is there any place to recommend to go for good quality secondhand clothes? Recently want to upgrade my wardrobe and would like to source more from ethical / sustainable sources, but I’m only finding places like refash which I’ve been a few times but the quality is usually quite bad.",
      "comments": [
        {
          "text": "carousell ",
          "score": 12
        },
        {
          "text": "I went to thrifting stores and the price is not at thrifting prices. So I ended up just buying brand new.",
          "score": 7
        },
        {
          "text": "Queensway top floor, Golden Landmark level 2 onwards ",
          "score": 4
        },
        {
          "text": "If you're going to Queensway Shopping Centre, check out Honsie Ponsie. They have a massive stock and prices are super friendly.\n\nLoop Garms at Jalan Besar is pretty popular for their Y2K fashun.\n\nAnd if you're ever in Haji Lane, you can check out Woofie's Warehouse (self-service store) and Kaeru Thrift Store (curated stuff sourced from Japan).\n\nCloop has a few locations (I scored a cute Mickey Mouse/Disney jumper from here!) and you can even take part in clothes swapping events.",
          "score": 4
        },
        {
          "text": "I’ve found some really nice things in refash but it is difficult, especially their smaller shops \n\nIf you are free weekdays near Telok Blangah crescent, the Down syndrome association have a thrift store worth visiting, it’s pretty small though. Charity too, so that’s even more ethical than refash or most vintage shops \n\nNightingale in Queensway has the best selection I’ve found in sg. Like DSA this one is also for charity",
          "score": 3
        },
        {
          "text": "Try instead The Fashion Pulpit or the SCWO New2u thrift shop. I've found good buys from both over the years.",
          "score": 2
        },
        {
          "text": "checkout luggage market at aperia mall",
          "score": 2
        },
        {
          "text": "Lucky plaza, 442 clementi Ave 3, Golden landmark, Queensway shopping centre, 2nd street to name a few",
          "score": 2
        },
        {
          "text": "something old something new? i donate my clothes there",
          "score": 2
        },
        {
          "text": "Licky plaza top floors",
          "score": 1
        },
        {
          "text": "Nightingale thrift and New2you are both great.",
          "score": 1
        },
        {
          "text": "Cloop",
          "score": 1
        },
        {
          "text": "Go to source, jb more fun",
          "score": -1
        }
      ]
    },
    {
      "id": "t3_1r9ilmc",
      "subreddit": "SingaporeRaw",
      "title": "Bring back the 90s vibes!",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r9ilmc/bring_back_the_90s_vibes/",
      "score": 295,
      "num_comments": 30,
      "created_at": "2026-02-20T10:02:38",
      "selftext": "",
      "comments": [
        {
          "text": "Go outside and play &gt; Stay at home and play games.",
          "score": 83
        },
        {
          "text": "Rare scenes in SG. When life was carefree",
          "score": 49
        },
        {
          "text": "Impossible nowadays. Parent helicopter around",
          "score": 40
        },
        {
          "text": "Quite fun leh! Loving the carefree vibes ",
          "score": 13
        },
        {
          "text": "This is what we do when we were kids in the 80s and 90s.",
          "score": 11
        },
        {
          "text": "You can still do it. Just don't do it at the same time people passing.",
          "score": 10
        },
        {
          "text": "Later someone will complain to TC. I work night shift. These kids make noise, I cannot sleep. ",
          "score": 7
        },
        {
          "text": "So wholesome",
          "score": 5
        },
        {
          "text": "We all did that as 90s kids!",
          "score": 4
        },
        {
          "text": "I’m actually really envious of these boys",
          "score": 4
        },
        {
          "text": "Before the bitter old aunties start complaining and calling police. This is the real reason our neighborhoods are dead.",
          "score": 4
        },
        {
          "text": "That’s nothing. Bring back the 90s prices is more important ",
          "score": 3
        },
        {
          "text": "How about kites and football",
          "score": 3
        },
        {
          "text": "The old style void decks are so essential for the vibes. I hate new bto void decks.",
          "score": 3
        },
        {
          "text": "Def missing those days",
          "score": 3
        },
        {
          "text": "If we could only turn back timee :((",
          "score": 3
        },
        {
          "text": "https://m.youtube.com/watch?v=tvFkBhOU6A8\n\nRemind me on this song",
          "score": 1
        },
        {
          "text": "Idea leh",
          "score": 1
        },
        {
          "text": "You can even catch those little black tadpole in those ponds.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r9jnv4",
      "subreddit": "SingaporeRaw",
      "title": "r/SingaporeRaw visitor numbers and contributions are catching up to the main sub",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r9jnv4/rsingaporeraw_visitor_numbers_and_contributions/",
      "score": 218,
      "num_comments": 57,
      "created_at": "2026-02-20T10:50:54",
      "selftext": "",
      "comments": [
        {
          "text": "They banning people so all migrate here. Not to mention edmw shutdown",
          "score": 121
        },
        {
          "text": "They use to call us the echo chamber..\n.\n\nNow they are the echo chamber because can only allow certain type of posts.\n\n\nSame as how tumblr died.",
          "score": 55
        },
        {
          "text": "No choice the other sub mods keeps banning people for any ridiculous “sensitive” wording. All these censorships probably forced everyone to move here where we can express our real, raw opinions.",
          "score": 44
        },
        {
          "text": "In a way we owe some thanks to uncle Vijay for making EDMW into such a shithole that we can welcome their refugees with open arms.",
          "score": 26
        },
        {
          "text": "raise your hand if you got banned in r/cecapore ",
          "score": 20
        },
        {
          "text": "That side should rename itself cecapore",
          "score": 15
        },
        {
          "text": "Of course, that place is the nazi racist north korea of singapore. You can also notice that more liberal-leaning users from there are coming over here to spread their angst, because there's hardly any comments there for them to get offended and angry about.",
          "score": 12
        },
        {
          "text": "One is like tourist version.. One is hard truth version..\n\nLike experiencing MBS versus one of the heartland precincts..",
          "score": 11
        },
        {
          "text": "R/SG is mostly a news aggregator.. quite useful if you wanna check out what’s happening in sg. \n\nOther than that.. nah.",
          "score": 11
        },
        {
          "text": "The main sub is trash. Raw is where it’s at.",
          "score": 10
        },
        {
          "text": "Unsurprising given they heavily moderate the sub. ",
          "score": 9
        },
        {
          "text": "Singapore sub is so heavily monitored and moderated ... crazy",
          "score": 7
        },
        {
          "text": "I havent gotten banned from the main two subs but I find it ridiculous that those two arent modded by true blue sinkies almost anything gets censored there, I wanna read what ppl are thinking here on sensitive topics and issues and lurk comfortably",
          "score": 5
        },
        {
          "text": "Cant wait for the day we overtake them",
          "score": 5
        },
        {
          "text": "Singapore r is for non citizens. Singaporeraw is for citizens nuff said.",
          "score": 4
        }
      ]
    },
    {
      "id": "t3_1r8z28g",
      "subreddit": "SingaporeRaw",
      "title": "Should PAP review all CECA graduates from Galgotias University?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r8z28g/should_pap_review_all_ceca_graduates_from/",
      "score": 164,
      "num_comments": 45,
      "created_at": "2026-02-19T21:22:05",
      "selftext": "",
      "comments": [
        {
          "text": "They have no shame, but our government loves them.",
          "score": 84
        },
        {
          "text": "Too late for PAP to do anything. They signed the CECA contract which probably heavily benefits the dark side with minimal benefits or even adverse consequences to Singaporeans, but hey that's PAP for you. Buy high, sell low.",
          "score": 42
        },
        {
          "text": "Only Galgotias University?",
          "score": 24
        },
        {
          "text": "Nothing surprising. They can even plagiarise our National Day song and claim it as theirs, calling it “We Can Achieve”.",
          "score": 23
        },
        {
          "text": "Jai ho?",
          "score": 20
        },
        {
          "text": "All of you have forgotten Ramesh and the legendary uptron. \n\nWhat is galgotias compared to that? Amateurs.",
          "score": 17
        },
        {
          "text": "Singapore Ministry of Manpower (MOM) have authorized a specific panel of 12 approved background screening companies that employers must use to verify educational qualifications for Employment Pass (EP) and S Pass applications.\n\nSince the introduction of the COMPASS (Complementarity Assessment Framework) in September 2023, employers are responsible for engaging and paying one of these companies to obtain \"verification proof\" for any diploma-level or higher qualification used in a work pass application.\n\nThe 12 MOM-Approved Screening Companies are:\n\n * Avvanz\n * Cisive\n * Dataflow (CrossCheck)\n * eeCheck\n * First Advantage\n * HireRight\n * Risk Management Intelligence (RMI)\n * Sterling (formerly Sterling Risq)\n * Veremark\n * Vero Screening\n * Verity Intelligence\n * Global Gateway Advisors (GPC)\n\nYou decide if the above is effective or if there are any loopholes.",
          "score": 16
        },
        {
          "text": "Of course not. The traitors action party love them.",
          "score": 13
        },
        {
          "text": "How about ban all",
          "score": 11
        },
        {
          "text": "Uni lie, job also lie, everythin lie 🤥🤥🤥🤥",
          "score": 9
        },
        {
          "text": "Kick all of them out la. Bring in so many for fuck.",
          "score": 6
        },
        {
          "text": "You should watch the interview with that university professor. True blue India culture. Exactly what I seen for the Indias working in Singapore. All talk a good show and can’t work for shit. Yet feel so proud and righteous even when they ain’t doing anything. Sorry to say it’s not just one university, i bet you there are tons of india universities which degree can be bought. Only sinkie government loves them. \n\n[Link](https://youtu.be/s9Nn36_0ppE?si=S9MpxefWm9lLRd_Y)",
          "score": 6
        },
        {
          "text": "PAP will rather blow them one by one",
          "score": 5
        },
        {
          "text": "Fake it till if u get caught",
          "score": 4
        },
        {
          "text": "They tried to bluff their way to Japan, too bad the new administrators kick them all out. Now they are en mass to here again, but oh well",
          "score": 4
        },
        {
          "text": "Ye boi they shd review",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1r91nhc",
      "subreddit": "SingaporeRaw",
      "title": "Is this a legal?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r91nhc/is_this_a_legal/",
      "score": 163,
      "num_comments": 49,
      "created_at": "2026-02-19T23:09:06",
      "selftext": "Credits: @ renaecjc",
      "comments": [
        {
          "text": "No, it is a person wearing a costume",
          "score": 118
        },
        {
          "text": "Willing buyer they weren't cheated into buying anything\n\nA scam would be like the tickets were fake and if they won they couldn't claim",
          "score": 103
        },
        {
          "text": "Sorry. It was me under the mask. I need the money to buy e cigarettes ",
          "score": 102
        },
        {
          "text": "Best business in the world is selling hope.",
          "score": 46
        },
        {
          "text": "Where's the scam?",
          "score": 46
        },
        {
          "text": "LOL. Wah, entrepreneurship.\n\nSurprised that there are many willing buyers.\n\nAn analogy of what is considered as a pest, are those mascots around California (US). When you take photos with them unwittingly, they will demand for a lot of $$$. If you don’t give, they will threaten you with their knuckles.",
          "score": 37
        },
        {
          "text": "of course the guy saying “is this a legal” would be asking stupid questions 🫩🫩",
          "score": 36
        },
        {
          "text": "I'm not arguing the morality of it, but this is the quintessential sinkie Karen culture.\n\nFind any grey area, write some long ass justification debating about definitions, choosing all the accusatory words, all that for their own self righteous, fart smelling rant.\n\nI'm not saying this guy is right or wrong. But if you wanna get FBI over stuff like that, then apply it to EVERYTHING around you. I'm sure you can find plenty of discrepancies in practices. Don't shrink at the face of people you know you can't bully.",
          "score": 10
        },
        {
          "text": "📞🚔on d spot la",
          "score": 6
        },
        {
          "text": "Always wondered what goes on in the mind of people who fall for this. Do they genuinely believe someone has the ability to predict winning numbers?",
          "score": 6
        },
        {
          "text": "Think its fine, ppl believe this guy acting as Cai Shen Ye gives better luck = good 4D number for the cost of $2 imo is no different then those handicap in orchard selling $2 for tissue.",
          "score": 5
        },
        {
          "text": "Common lah. Just this session, people dress like cai shen lor.",
          "score": 4
        },
        {
          "text": "Is an anomaly creature. Kill it",
          "score": 3
        },
        {
          "text": "they should have hired someone fatter",
          "score": 3
        },
        {
          "text": "God damn Singaporeans. Everything is a scam. Everything must have permit. \n\nIt is just a few dollars, that guy probably queued and picked some numbers before reselling to these folks. These folks knew what they were buying and chose to buy from him because he made them happy.",
          "score": 2
        },
        {
          "text": "Need to see got license to sell or not like tissue paper. Sometime you saw handicap sell this kind of stuff than tissue",
          "score": 2
        },
        {
          "text": "All fine and good until the insurance / MLM salespeople learn this trick next year.. 💀💀💀",
          "score": 2
        },
        {
          "text": "if so lucky why need 4x attempts?",
          "score": 2
        },
        {
          "text": "Willing seller willing buyer",
          "score": 2
        },
        {
          "text": "Donno legal or know but no one was scammed, they know what they were buying and did it willingly. Nothing compared to those insurance agents",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r9hyfl",
      "subreddit": "SingaporeRaw",
      "title": "Guy got scam for test driving | Classic Credit Pte Ltd beware.",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r9hyfl/guy_got_scam_for_test_driving_classic_credit_pte/",
      "score": 82,
      "num_comments": 57,
      "created_at": "2026-02-20T09:33:12",
      "selftext": "saw this on Facebook, kinda feel bad for the guy. I've uploaded the screenshots of the whole interaction. \n\nIn short - the guy was told to pay a deposit of $500 for a test drive, the company assured him on a refund if he does not continue with the purchase. But the company has other plans.\n\n",
      "comments": [
        {
          "text": "Cannot save stupidity - why anyhow sign a document",
          "score": 58
        },
        {
          "text": "The 2ndhand/parallel car dealers and also home renovation industries are so shady and full of shitty dishonest A holes.\n\nFrankly its has been going on for so long and yet nothing much is done against such cheaters, or extra protection for consumers.\n\nThey can just close shop and open another again and again",
          "score": 35
        },
        {
          "text": "Used car dealers can be pretty scum. \n\nMy friend went in, was undecided and wanted to shop around more. \n\nSalesman said they can place a deposit to “secure” the vehicle.. this is fully refundable. Reason for this is that if someone else want to buy, then the salesman will give them a heads up. \n\nNow you can say my friend stupid.. but some authorised dealers do this method also. Place deposit first (lock in promo, indicate interest for limited runout etc), if after test drive or further inspection you don’t want, will be fully refunded. \n\nAnyway my friend walked to another used car dealer and found the car they want at a better price and condition. So they proceeded to buy. \n\nThe first used car dealer MIA on their request to refund lmao.",
          "score": 18
        },
        {
          "text": "Is it an industry standard to pay deposit $500 for test drive? I know for AD do not need any deposit. Plus I see the message from dealer it says major accident and major gearbox issue. does that mean that car already got major issue? If still want to buy that car after those 2 lines, I think OP really desperate for a car",
          "score": 12
        },
        {
          "text": "I warned and highlighted about these scumbags 10 days ago.\n\n[Immediate\\_Wish\\_1024](https://www.reddit.com/user/Immediate_Wish_1024/)\n\n•[10d ago](https://www.reddit.com/r/SingaporeRaw/comments/1r0wcdn/comment/o4lmap5/)\n\nIDs or whatever they are called, it's still renovation contractors.\n\nIt's common knowledge that second-hand car dealers and contractors are slimy characters.\n\nEngage with care and precaution and at one's own risk.",
          "score": 6
        },
        {
          "text": "dealer is scum but buyer also not the brightest bulb in the box. who signs a blank agreement from someone who’s trying to squeeze every dollar from you la…",
          "score": 5
        },
        {
          "text": "Never paid any deposit for my test drives, direct dealers or 2nd hand.",
          "score": 4
        },
        {
          "text": "\"Sign first, fill the rest later\" lol... Lesson learnt, not very expensive at least. If you dumb Fuck sign things without reading what do you expect?",
          "score": 4
        },
        {
          "text": "wtf like that also can",
          "score": 2
        },
        {
          "text": "![gif](giphy|NPk9U8Z8mCc97NPT0d)",
          "score": 2
        },
        {
          "text": "$500 also want to cheat. Who know what else they are hiding and scamming consumer",
          "score": 2
        },
        {
          "text": "There's no cure for stupidity. \n\n1. If it's the standard practice, the company would have the customer signed tey agreement before the test drive already.\n\n2. Anything done retrospectively is a big red flag. \n\n3. Signing an agreement without reading and understanding it is the solely the customer's fault.",
          "score": 1
        },
        {
          "text": "What’s the car salesman trying to do ah? He thinks people gonna give up $500 without a fight?",
          "score": 1
        },
        {
          "text": "ownself stupid ownself problem",
          "score": 1
        },
        {
          "text": "Plot twist: Customer enters sales agreement. Loan fails to get approved. Now he wants his deposit back.",
          "score": 1
        },
        {
          "text": "When someone sends an agreement form with T&amp;C, I would usually upload it to ChatGPT to break it down in bullet points and ask it to explain to me. \n\nI would ask questions to confirm no hallucinations to understand the form.\n\nIt’s one way to safeguard yourself. Not fool proof cause u still need to do ur own due diligence.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r8v83m",
      "subreddit": "SingaporeRaw",
      "title": "Who regret not coming to this forum earlier?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r8v83m/who_regret_not_coming_to_this_forum_earlier/",
      "score": 58,
      "num_comments": 67,
      "created_at": "2026-02-19T17:56:17",
      "selftext": "Here really 0 censorship, post anything and they will not be deleted, as long as they are not harmful/virus. \n\nIrony is most members here actually less toxic and contribute constructive idea/criticism. Rather than blindly slamming every post. ",
      "comments": [
        {
          "text": "I came here because I got banned by r/Singapore regarding the CECA driver case, calling out the useless moderators for banning any discussion about driver.",
          "score": 78
        },
        {
          "text": "Cos the mods here are not CECA",
          "score": 71
        },
        {
          "text": "I think kagen and the other power ranger should be proud. This sub is now 300k vs main 400k",
          "score": 24
        },
        {
          "text": "I was once writing a post on another sub like on some relationship stuff and an advisory came like no rants allowed on that sub etc.. \nFollowed by list of other terms that they dont allow and one of it was talking about this sub hahahhh\n\nLike we cant mention sgraw , Singaporeraw in header or in the content... Like this entire sub is banned in that sub 🤣🤣",
          "score": 17
        },
        {
          "text": "If this sub tell you to take your medicine, means u really siao lang.  \nIt's like the joker calling someone else insane.",
          "score": 12
        },
        {
          "text": "Here we talk about real shit without holding back like mainstream retards.",
          "score": 12
        },
        {
          "text": "Censorship of opinions has no place on the internet.",
          "score": 6
        },
        {
          "text": "Suddenly its ok to have an opinion that is different from PAP",
          "score": 4
        },
        {
          "text": "Here censored n have to be politically correct already. U see the amount of removed posts everyday",
          "score": 4
        },
        {
          "text": "I feel like eventually, it will be flooded with the IBs.",
          "score": 4
        }
      ]
    },
    {
      "id": "t3_1r8wwij",
      "subreddit": "SingaporeRaw",
      "title": "Flaws in Singapore job market?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r8wwij/flaws_in_singapore_job_market/",
      "score": 56,
      "num_comments": 40,
      "created_at": "2026-02-19T19:34:12",
      "selftext": "33M here. Been working for 7 years in the field I studied (ComSci) in NTU so not ranting about my situation but more for our local fresh grads. \n\nRecently, I have been seeing more and more issues of companies in SG wanting to hire only senior roles. Even the company I am working in, is doing the same. This leads to many fresh graduate being unemployed and forced to work in fields (non-technical roles) they don’t specialise in. After years of working, they will never get hired for roles of their interest because they didn’t clock relevant work experience. 💁🏻‍♂️\n\nIf those fresh graduate are not given a chance, they will never gain work experience in those specialised field. This lead to the cycle of companies complaining there are no talent in SG and thus hire FT because the pool of local talents (those already had years of work experience) gets smaller and smaller as some move up to management or retire. \n\nMaybe there should be a policy to force companies to hire at least a few graduate per year? Otherwise, we will never break this cycle and it is just gonna get worse. 🤔",
      "comments": [
        {
          "text": "The 65% want more local grads to be unemployed n become grab delivery",
          "score": 55
        },
        {
          "text": "What you are seeing is only one side of the squeeze i.e. the beginning part. The part when grads joined the workplace. This is where the low balling, ridiculous job experience requirements and ghosting are now happening.\n\nThere is another squeeze i.e. at the ending part. This is the part where senior workers who had decades of experience but suddenly find themselves retrenched and unemployed; they had basically an impossible time trying to get back into a similar role as before.",
          "score": 23
        },
        {
          "text": "GRIT program lor, later not converted and recycle new batch.\n\nnow job market upgrade need 3- 5 years experience for junior role is common, some well-known company even ask for 8 years working experience",
          "score": 20
        },
        {
          "text": "Ruling party is biz friendly so don’t expect anything to change.\n\nAt most open up more subsidied roles where govt pay bulk of starting salaries. But that helps corporates even more. Sucks to be middle class or poor in SG.",
          "score": 18
        },
        {
          "text": "MOM does not care for trade workers. Minimum 7 days of AL. Wayang progressive wage model. OT payout is not mandatory for supervisors",
          "score": 16
        },
        {
          "text": "You know whats worse? Privilege people who are ignorant and unsympathetic, they think the job market is last time, very easy to get the role you want",
          "score": 10
        },
        {
          "text": "Actually it's not just fresh grads who are jobless, but also your peers with similar or more work experience.\n\nWhite-collar retrenchments started in around mid-2022. Since then, the number of Employment Pass + ONE Pass holders has increased, which displaced many Singaporeans from well-paid jobs. Number of PRs issued keeps going up every year except 2020.\n\n&gt;Maybe there should be a policy to force companies to hire\n\nSeveral policies come to mind:\n\n* Foreign quota and levy force companies to hire Singaporeans before they can hire more foreigners. However they only apply to Work Permit and S Pass, but not Employment Pass. So MOM is [protecting low-paid jobs that Singaporeans shun](https://www.reddit.com/r/SingaporeRaw/comments/1r2nd1d/comment/o4y6sjz), while allowing foreigners to compete for well-paid jobs that Singaporeans want!\n* PRs should only be issued to foreigners who have family ties with Singaporeans, or have created many well-paid jobs for Singaporeans. Far too many PRs were issued to foreigners who compete with us for jobs, rather than create jobs.\n* Impose higher taxes on companies or their senior managers if they fail to hire their fair share of native-born Singaporeans (as opposed to foreign-born Singaporeans), so that they [internalize the social costs](https://www.oxfordreference.com/display/10.1093/oi/authority.20110803100007230) of causing unemployment.\n\nAs u/turtle_spider- has [explained](https://www.reddit.com/r/singapore/comments/1pr3s53/comment/nuzaokr):\n\n&gt;If the ambition is to increase Singaporean participation in certain sectors... the govt needs to be strict on immigration, nudge pay upwards and punish companies with higher taxes if they aren't going to hire Singaporeans. They can already hire non-Singaporeans outside of Singapore; why should the citizenry subsidize the public goods that attract companies here without the benefit?\n\n&gt;Sometimes I wonder if these policy makers or news writers have touched grass.\n\nMOM has stubbornly refused to do so, essentially because it believes that foreigners create more jobs for Singaporeans than they take away from us. There's no proper justification for such a belief.\n\nThe mere fact that jobs for Singaporeans and foreigners have both increased over time doesn't show that foreigners created more jobs than they took away, because Singaporeans would have even more jobs if there were fewer foreigners. When the number of EP holders (and new PRs) tumbled in 2020-21, it was a fantastic time for local PME jobs, known as the \"Great Resignation\".\n\nLHL once said that [Singapore must not only protect its lunch but steal other people's lunches](https://www.todayonline.com/singapore/singapore-must-steal-other-peoples-lunches-stay-ahead-competition), but the PAP has allowed so many foreigners to steal our white-collar jobs.",
          "score": 9
        },
        {
          "text": "Young grads everywhere in every knowledge based field are fucked.  \n\nAI gets people to a baseline that is shit but still better than a completely fresh grad can produce.  And it does it without having to be taught how to behave in a workplace environment.  So how can an employer justify hiring fresh grads to train them, especially when the fresh grad will probably leave after three to four years max?  It just doesn't make economic sense, even though it leaves everyone worse off in ten years time when the most senior devs have all retired and no one can replace them.\n\nIt is a structural issue for all knowledge workers.  CS just gets the worst of it because it's the most vulnerable field.",
          "score": 9
        },
        {
          "text": "that sector will become like manufacturing sector . Keep complaining not enough engineers but dont wanna contribute to the pool . Later just ask gov for more quota ,and gov still open leg big big for them to play 🤦‍♂️",
          "score": 8
        },
        {
          "text": "Not only this but as a casual job seeker (i.e. employed but looking to jump), I find a lot of contract or temp roles offering short term tenures like 6-mth, 1 year. And what's ironic is perm positions of similar jobs are offered at lower (or some much lower) pay range. Job market is still bad especially for those who want to have a career and not just get a pay",
          "score": 8
        },
        {
          "text": "\\&gt; I have been seeing more and more issues of companies in SG wanting to hire only senior roles\n\nThis has been an issue for like 15 years now.",
          "score": 6
        },
        {
          "text": "Who did the fresh grads vote for?",
          "score": 6
        },
        {
          "text": "Fresh grads have high expectations, which is double wammy for them because of SGD + companies outsourcing to other SEA countries + AI takeover",
          "score": 6
        },
        {
          "text": "Ask yourself, you took comp sci cause you interested or for the hype?\n\n\nNow all like you, comp sci grads oversaturated. Seniors also looking for job. Why would ppl hire comp sci fresh grad expecting the sky, while seniors are expecting similar? ",
          "score": 5
        },
        {
          "text": "AI taking over.",
          "score": 5
        },
        {
          "text": "\n\nNTU latest rankings 2026 for its NTU NBS - MBA climbed 10 spots to #12 in the world, #1 in Singapore now.\n\nAbsolute beast of a dramatic rise for a 35 year old school.\n\nAlot of major transformation in its physical campus, upcoming train stations inside NTU, and curriculum structure transformation.",
          "score": 5
        },
        {
          "text": "totally agree with you.",
          "score": 4
        },
        {
          "text": "Why OP sounds as if this is the first time this is happening ?\n\nDoesn't he know why there is CBP ?",
          "score": 4
        },
        {
          "text": "It isn’t a Singaporean thing unfortunately, this is becoming a global phenomenon",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1r8u0qz",
      "subreddit": "SingaporeRaw",
      "title": "Taiwan trade surges $170b, overtakes China as Singapore’s top partner in 2025",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r8u0qz/taiwan_trade_surges_170b_overtakes_china_as/",
      "score": 46,
      "num_comments": 14,
      "created_at": "2026-02-19T16:41:16",
      "selftext": "Yes, we can do w/o PRC!",
      "comments": [
        {
          "text": "Guess where all those chips are going",
          "score": 31
        },
        {
          "text": "Taiwan numba one",
          "score": 16
        },
        {
          "text": "Can we trade twmm with kampung sinkiebu",
          "score": 15
        },
        {
          "text": "Hi, OP, this is what is happening.\n\nTaiwan Semiconductors ---&gt; Singapore ---&gt; PRC\n\nThank you attending my TED talk.",
          "score": 9
        },
        {
          "text": "For those who are not aware there are high value semiconductor factory in sg ship stuff there are in tens of millions per shipment.",
          "score": 6
        },
        {
          "text": "Best China.",
          "score": 5
        },
        {
          "text": "Why is taiwan considered seperate from China? Isnt all china counted as one?",
          "score": -18
        }
      ]
    },
    {
      "id": "t3_1r8y0ly",
      "subreddit": "SingaporeRaw",
      "title": "Why is the post on SG and Israel locked in r/singapore",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r8y0ly/why_is_the_post_on_sg_and_israel_locked_in/",
      "score": 15,
      "num_comments": 27,
      "created_at": "2026-02-19T20:33:12",
      "selftext": "Is it auto-locked for any content related to Israel? The post seemed to have 0 comments, also no mod message explaining why it was locked. Just seems a bit strange to me.\n\nCouldn’t post in r/Singapore because I don’t meet karma requirements and post taken down in r/askSingapire by mods\n\nIs the I-word off limits? How long has it been like that?",
      "comments": [
        {
          "text": "the mod sensitive af one. ",
          "score": 40
        },
        {
          "text": "Israel and Gaza will trigger auto-lock within 5 minutes",
          "score": 31
        },
        {
          "text": "Cause people will argue like no tomorrow and the mods don’t want to be responsible for it",
          "score": 19
        },
        {
          "text": "Because mods cannot trust you guys to keep it civil. Go post on HWZ CAL. There's existing thread.",
          "score": 6
        },
        {
          "text": "Because mods don't wanna mod, so auto lock",
          "score": 6
        },
        {
          "text": "Wont end well, so lock thread ahead of time",
          "score": 4
        },
        {
          "text": "I’m assuming it’s to do with the news that 2 singaporeans served in idf. \n\nIt’s been posted on fb as well.. just go read the comments on those posts and you know why mods don’t wanna deal with it.",
          "score": 3
        },
        {
          "text": "Your assumption is correct, it has always been like that when it comes to Israel Palestine related content. Other subs are able to properly regulate such hot topic discussions, I'm not sure why they've just shut it down here..",
          "score": 3
        },
        {
          "text": "Because it's a never ending story. ",
          "score": 3
        },
        {
          "text": "Any post regarding i/p is auto locked and has been for quite a while. Tbh its kinda understandable",
          "score": 2
        },
        {
          "text": "🧃, always the problem",
          "score": 2
        },
        {
          "text": "Because that post has been promised to them 3000yrs ago . Generally the entire Palestine-Israel issue can get very heated, so mod doesn't wanna take the shit",
          "score": 1
        },
        {
          "text": "the thread gets locked on r/singapore but the same article doesn't even get posted here on r/singaporeraw\n\nmod censorship vs self censorship",
          "score": 1
        },
        {
          "text": "Because nobody wants the national singapore and asksg subreddit to be closed down due to a simple post that leads to \"antisemitism\"",
          "score": -4
        },
        {
          "text": "We’re jus an island so best dun comment on such matters which has far reachin consequences. D bigger qns is r ya'l readi2bear d consequences of ur comments, d ans is no4whiny, complainy, blamin islanders🤐",
          "score": -6
        }
      ]
    },
    {
      "id": "t3_1r9laq9",
      "subreddit": "SingaporeRaw",
      "title": "Tipsy Unicorn 🦄 at Sentosa, from tipsy to up-Lorry suddenly today",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r9laq9/tipsy_unicorn_at_sentosa_from_tipsy_to_uplorry/",
      "score": 15,
      "num_comments": 3,
      "created_at": "2026-02-20T12:09:02",
      "selftext": "",
      "comments": [
        {
          "text": "I knew this would happen last year when Tipsy made the news for non payment of employee salaries and CPF.\n\nI also suspected something was very wrong when the co-founder died at a very early age (35?)\n\n\nThere is one Tipsy operating in Paya Lebar still.\n\nI don't know if they broke away from the main organization and continue using the \"Tipsy\" name.\n\nThey might want to consider re-branding it.",
          "score": 4
        },
        {
          "text": "Another fatality",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1r8yujj",
      "subreddit": "singaporefi",
      "title": "I have been learning more about CPF Life and here are some thoughts",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r8yujj/i_have_been_learning_more_about_cpf_life_and_here/",
      "score": 16,
      "num_comments": 58,
      "created_at": "2026-02-19T21:12:31",
      "selftext": "I have been modeling my CPF to understand more about RA and CPF Life and here are some of my thoughts for sharing and learning.\n\n1. Over a long period of time, I am surprised that CPF balance can be quite substantial. It doesn't feel much on a month by month basis but if you work for a long time, it can be significant.\n2. FRS will continue to grow and hence this is something to take note of. \n3. For BHS cap, if we were to assume that is the amount to target to ensure proper health coverage, it seems quite a challenge to hit it as well i.e. meaning one might have to have cash or insurance to address any unforeseen medical issue.\n4. Reaching FRS is doable but ERS is a different thing. You are likely not going to hit it unless you do active topping up. What are your thoughts? Would you try to go for ERS for the higher monthly payout.\n5. Delay CPF Life payout might increase the payout by a few hundreds but I am not sure if it worth the delay. Would you start your CPF life at 65 or later.\n6. My expense maybe on the high side because I realized CPF Life only contribute to less than 50% of expense. I am not sure if there is so called a \"target\" since everyone life style is different. How much does CPF life payout covers your expenses? I have peers that can cover up to 80% of their expenses.\n\n  \nHope you find this useful and would like to hear your thoughts as well!\n\nhttps://preview.redd.it/lrleibmy9gkg1.png?width=1219&amp;format=png&amp;auto=webp&amp;s=fc3152229a79b7829fa27d042010d8c39b04dede\n\nhttps://preview.redd.it/xcgnh0v1agkg1.png?width=1226&amp;format=png&amp;auto=webp&amp;s=7d7e2742dfbd748c18aa9d6789172280d3875365\n\n",
      "comments": [
        {
          "text": "This is my take on CPF LIFE. \n\nThe scheme is primarily a longevity insurance, with the key point on it being an insurance at the end of the day. People who focus on ‘breakeven’ ages and how to profit the most from it are missing the point - you don’t buy hospitalisation insurance and calculate how many times you have to get warded for it to be worth it, you don’t buy term insurance and say it’s worth if you die before X years old, so you shouldn’t be saying CPF LIFE is worth if you live to Y years old. You ‘buy’ into it for the insurance aspect and not to profit from it (because statistically you will not).\n\nNow while it’s not like term or CI insurance where you can explicitly choose a dollar amount to buy, the choices you have in the scheme determines the coverage of this ‘longevity insurance’. \nNamely, in increasing order of coverage \n1) BRS (pledging property)-&gt; FRS -&gt; ERS\n2) Basic -&gt; standard -&gt; escalating withdrawal plan\n3) how delayed the payouts start after age 65\n\nFor most, BRS to ERS is obvious but why is escalating and delayed considered a higher coverage? Because you’re paying a higher cost now to get a larger future payout (protection), the same way you would pay more for a term insurance with a higher sum assured.\n\nSo if you want the least coverage in this insurance, you go for BRS + basic + immediate start whereas the ‘highest’ coverage (meaning the most protection against living long) would be ERS + escalating + delay to 70.\n\nSo naturally the question is how much coverage do you need? Higher coverage is not always good since you’re paying more for it as well. For term or CI insurance, there are guidelines like 5x income but from what I know CPF doesn’t give much guidance on _how_ to choose between the options, they just present the facts to you and let you decide. \n\nTo me, the higher your net worth the less you need longevity insurance, since the chance you outlive your money pot is smaller. So if you’ve not much saved for retirement, max out CPF and go for the ‘highest’ coverage. Whereas if you have 10M then you really don’t need any longevity insurance and you should go for the minimum.",
          "score": 16
        },
        {
          "text": "If one plans his retirement properly by getting reasonable returns above inflation with reasonable risks through a diversified portfolio, there is no need for CPF Life. The reason for CPF Life is because a significant portion would not have sufficient retirement funds and the burden of providing them with payouts is passed on to others. \n\nTake note that the future payouts may not be that great once adjusted for inflation.",
          "score": 13
        },
        {
          "text": "Planning to pledge my property and withdraw amounts in excess of BRS to invest on my own.",
          "score": 5
        },
        {
          "text": "My current SA balance already exceeds this years FRS amount. So I figured this means I will for sure achieve FRS when my turn comes to hit 55yo, assuming SA still offers 4% pa until then, and the FRS increases is below 4%. Whether I will top up to meet ERS or not depends on how much I have on hand. If I can afford it, I’ll top up to ERS, not because it’s financially superior but because I don’t trust myself to have the mental capacity or discipline to continue to be able to manage my own investments as I grow older and older.",
          "score": 5
        },
        {
          "text": "I think we are the about same age (2032 cohort)\n1. I will go for ERS only if I have a passive income that can address 2 x my yearly requirement. Currently, I am going for FRS so that I can continue to use the money for investment in dividends stock.\n(Will be retiring next year when I hit 50 since I have achieve my FIRE target)\n\n2. I won't delay my payout, since I won't know when \"Truck-Kun\" will come along and send me somewhere else 😂.\n\n3. CPF payout will be treated as spare money for me.",
          "score": 4
        },
        {
          "text": "I have done personal projections and what I can say is that they are just that, projections. The biggest differences in balances (from projections) are employment income, housing deductions and investments. \n\nYour first target should be to hit the Basic Healthcare Sum, then Full Retirement Sum. So long as you're always at or above the median income for graduates of your cohort, you will certainly reach FRS in SA - by 40 if you max out BHS by 28. Much earlier if you also topup your SA / do OA transfers (neither are recommended in my opinion due to ringfencing). I personally do not recommend ERS for those with liquid assets of between 1-3M in retirement. It is fine for those with less (meaning they were never able to amass sufficient assets hence hints at lack of ability) or more (ERS is insignificant).\n\nI would not base my retirement income solely on CPF Life: too much concentration risk. My retirement income pillars would likely be: CPF OA (15-20%), CPF Life Basic - BRS (5-10%), rent (20-30%), SRS (10-15%) and cash investments (remainder) and at any time, always 50-100k in cash or equivalent for emergencies. \n\nIt is also important to account for inflation which is why most of my retirement income sources would have some form of inflation peg. CPF Life, even the escalating plan, would see real retirement incomes shrink over 20-30 years (when payouts start at 65 till the likely life expectancy age of 90+ for my cohort). Meaning a 3k CPF Life payout today would only be worth 1k in 30 years, something that many don't consider since they don't do proper retirement planning anyway.",
          "score": 3
        },
        {
          "text": "since you modelled it you can directly look up the Breakeven ages and discover for yourself that ERS is less efficient than FRS. at least that's what I found from my own napkin math from a few years ago but you should test.\n\nthat's the age you have to live up to to recover your principal surrendered at 55, plus interest up to 65 or maybe 70 if deferred. not that you can ever lose money to this system--either you beat life expectancy and win or you don't beat it and your dependents get the remainder if any.\n\nthere's also the option to do escalating cpf life payout which aims to deal with inflation by paying out less in the earlier drawdown years vs the later years. I believe this gives a better Breakeven age.\n\nbut in any case the Breakeven ages are beyond life expectancy by design. of course policymakers advise against fixating on Breakeven age, but policymakers have different goals in mind than individuals.  basically the few of you who live beyond expectation will be paid via the interests from everyone else who don't earn any interest from their personal sums beyond the age of 65 (or 70).so do your own due diligence with regards to this information.\n\nas for me, I see no point in participating beyond the bare minimum when statistically I have at least 30 years from 55 to death to have any extra funds growing outside the CPF system which is a long enough duration to expect better gains even with the higher volatility. this way I think I can win whether I die before or after expectation. but I know I can hit FRS easily and will not be fully dependent on CPF Life so that's my case, so again do your own DD.",
          "score": 3
        },
        {
          "text": "It's the power of compounding that helps and not really CPF giving very high interest. At 4% interest rate, your money is doubled after waiting about 18yrs.\n\nThe power of forced savings is amazing too. CPF Board forces us to save 20% of our income, and then my mother forced me to save another 20% of my take-home pay in a 20yr savings endowment plan. Both of these pay relatively low interest rates 2 - 4% but because capital is guaranteed so no complaints. The best benefit here is forced to save up no need to apply self-discipline.\n\nThe above 2 methods of growing wealth are suitable only for people who doesn't take any risks and who doesn't wish to seek greater yields in other investment vehicles.\n\nI am below 55 so currently I only top-up the amount that CPF Board allows me to (8k or less each year) for the purpose of tax relief. I also top-up $15,300 into SRS also for the purpose of tax relief.\n\nOnly after I have fully paid up my flat then I grew a pair of balls (joking lah, I am still an auntie, did not turn into an uncle) and I started learning about stocks, unit trusts and index funds. The balls I grew are not that big, so I did not venture into Cryptocurrency or Options (but hor I have more gutsy real uncle friends who are into these 2 lehhh).\n\nEhh wait, sorry I sidetracked too much already. Back to the question of ERS. Do I think after my 55th birthday I will want to actively top-up CPF RA to hit ERS? In the past, when I only knew 2 methods of growing wealth that time, I will say yes. Now I will say no. Cash is still king, you can decide what you want to invest in freely without restrictions. If you loved Apple you can go buy Apples, if you love Alphabet you can go and buy Alphabets, and, if you can't decide which of the top companies got the most growth potential you can just buy S&amp;P500 index funds.\n\nIn the grand scheme of things, CPF Life payout ($1000+) should only form a small portion of retirement income because CPF Life payout is enough to live on but not enough to have a life. Confusing? What I mean is you will have enough sustenance and surely won't die of hunger but you won't have a vibrant existence (imagine no overseas holidays and no regular fancy restaurant meals).\n\nAbout CPF Life payout adequacy and your high expenses, I will reassure you by telling you that you don't need to lose sleep over it because humans are highly adaptable intelligent beings. There is the opposite of \"lifestyle creep/inflation\"; call it \"lifestyle uncreep/deflation\" if you will. I give you 2 real life examples:\n\n1) My father is a gambler (Singapore Pools is his best friend) and saved up $0 of his $5k monthly income. At retirement, all he got is CPF savings because thank you CPF Board stopped him from gambling away CPF RA. He is now retired and living on CPF Life $900/mth. My sister and I help him by paying for his maid's salary and expenses, we don't give him cash because Singapore Pools is still his best friend.\n\n2) My ex-colleague used to live a high life travelling the world, buying luxury goods and eating at fancy restaurant regularly and she also saved up $0 of her I-dunno-how much monthly income. At retirement, she was so worried that she can't survive without work but she had worried for nothing. Now she has adapted to her new lifestyle so well until she recently told me her $1,300/mth CPF Life too much so she will still have balance leftover every month.",
          "score": 3
        },
        {
          "text": "For point 3, everyone has compulsory Medishield, right? The MA is there to pay the $2500 or 3000 deductible (for public hospital C/B ward) and ~10% co-insurance, not the whole bill.",
          "score": 2
        },
        {
          "text": "Aimed to hit ERS on 55. ✅Done\n\nFor the next 10 years, i planned to chase each year's new ERS ceiling. \n✅Work in progress.\n\nThere is sufficient OA balance to meet the new ERS increases (published figures) and a few projected years thereafter\n\nHow did i fund this? \n\n1. My BHS is topped up to the new limit on 1st Jan. The interest earned will be credited to the OA account on 31st Dec. this was $$2,990.19 for 2025.\n\n\n2. the other source will be the interest from the OA balance.\n\n&gt;55, means higher bonus interest kicks in. unsure of how exactly the calculation is but every +% is a bonus to this funding scheme.\n\nhttps://www.cpf.gov.sg/member/growing-your-savings/earning-higher-returns/earning-attractive-interest\n\n3. lastly, the traditional way of CPF contribution via work and the CPFIS dividends. \n\nin the past years, the final days of December. I took the bonuses or surplus cash to top up to all 3 accounts to reach the Annual Limit of $37200. won't do that anymore now that i am above ERS.\n\nFinally, I have to to stay healthy and active to milk the CPF life gao gao. 😇🍻✅",
          "score": 2
        },
        {
          "text": "CPF Life should be seen as the most basic safety net at retirement. At this age, it serves also as scam prevention. \n\nThere are elderly people who put their money in FD to earn 1% instead of CPF interest rate. Also those funds in FD are vulnerable to scams or creditors. \n\nYou'd be surprised how banks will entice the elderly who may not even have BRS, to invest in their products, enticing them with high but non-guaranteed returns.",
          "score": 2
        },
        {
          "text": "Answering OP's questions\n\nWould you try to go for ERS for the higher monthly payout? Some Youtubers suggest to go for FRS (and not ERS). TThe difference between ERS and FRS can be invested to acheive higher returns. For myself, if my assets are large enough at age 55, I will go for ERS to secure a risk-free passive income for life. If I think I will live long at age 55, I will go for escalating plan to fight against inflation.\n\nWould you start your CPF life at 65 or later? I will start CPF Life at age 65. While delaying each year may increase CPF Life payout by 7% (as noted by CPFB in the news), I prefer to start collecting money earlier.\n\nHow much does CPF life payout covers your expenses? No idea. It depends whether I choose FRS or  ERS. The ideal is that CPF Life payout can cover the essential expenses. So that when my stock portfolio is affected by stock market crash, I can use CPF Life payout for daily expenses while waiting for stock market to recover.",
          "score": 2
        },
        {
          "text": "Hi OP , thanks for these thoughts .\nHow did you arrive at the figure medisave of 164,472 ?\n\nMy understanding is whatever amount that hits the medisave cap , will flow into the OA . Furthermore it is unknown what’s the medisave cap in the future. Perhaps u had some assumptions ?",
          "score": 1
        },
        {
          "text": "I keep track of CPF growth right from my 1st year of working, the effect of compounding can make the growth almost exponential like. \n\nOne little known fact is when you are in the CPF Life scheme, the interest generated from your premiums is also shared with other people on the same scheme &gt; [https://www.cpf.gov.sg/member/infohub/cpf-clarifies/clarifications/4-facts-you-should-know-about-cpf-life](https://www.cpf.gov.sg/member/infohub/cpf-clarifies/clarifications/4-facts-you-should-know-about-cpf-life)",
          "score": 1
        },
        {
          "text": "Well I will say not to top up the MA to hit BHS as it is the most sort of useless (as in cannot be used at all unless touch-wood) .\n\nFor FRS , I sort of achieved but there is still another 21 years left before it will finally lock in as I previously top up a fixed amount and do manual transfer from OA . \n\nNow , I just cannot do anything as they don't allow u to top up to ERS unless u hit 55 n above .\n\nI do hope that government can allow those below 55 to continue top up via cash and manual transfer until ERS hit for the year.",
          "score": 1
        },
        {
          "text": "As I grew older , I am more conservative. I plan to keep 500k in OA to earn that 2.5% and FRS in RA. With home fully paid, nothing really matters. Mostly are just expenses so lifestyle adjustments when necessary that’s all.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r8vki1",
      "subreddit": "singaporefi",
      "title": "For those who FIREd early, did you pay off your house before retiring?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r8vki1/for_those_who_fired_early_did_you_pay_off_your/",
      "score": 10,
      "num_comments": 26,
      "created_at": "2026-02-19T18:16:42",
      "selftext": "Planning ahead for early FIRE and the house mortgage. After FIRE, is it still possible to have a bank loan since there’s no income from a job? \n\nSince mortgage interest rates are low, it makes sense to hold onto the mortgage loan and leave the excess funds to continue growing. \n\nWondering how other people have managed their mortgage amidst FIRE. Thank you in advance! ",
      "comments": [
        {
          "text": "My OA has enough to clear my mortgage all at once go, but my mortgage interest is 1.8%. as long as that remains below 2.5%, I won't be paying it off",
          "score": 19
        },
        {
          "text": "For the peace of mind, I plan to pay off house loans before fire.",
          "score": 15
        },
        {
          "text": "Barista-fired. Paid it off for peace of mind. I'm not mentally strong enough to handle volatility versus regular loan payments",
          "score": 13
        },
        {
          "text": "You can keep the bank loan you’ve got, but you will probably have trouble refinancing.\n\nWhich means that if you have a fixed rate now, it will revert to a floating rate plus spread. Therefore before you retire, you want to pay attention to whether that spread is acceptable to you. Depending on how many years are left, it may make sense to go for a re-finance/re-pricing before you retire that has a smaller long-term spread even if the first two years aren’t the best. \n\nI personally will end up paying off my mortgage at around the same time I retire. But that’s because I upgraded a couple of times and kept each mortgage quantum and tenure comfortably low instead of maximising leverage. Interest rates were high during my last re-finance so I made a partial payment abd reduced the tenure to 5 years. Now the amount is too small to refinance again.",
          "score": 9
        },
        {
          "text": "It's 2 separate but related considerations for people planning to FIRE.\n\n\nOn 1 hand there is the notion of good use of leverage. On the other hand, a key aspect to FIRE is managing cashflow, thus having to pay a mortgage is afterall cash flowing out, and therefore needs to be factored into projections for FIRE.\n\n\nBy paying off your mortgage, it does indeed simplify the cashflow equation by removing 1 factor, and if you do baristaFIRE, use SWR, side hustle, passive income etc, it is a worthwhile consideration for peace of mind and less pressure to have a balanced or net positive cashflow situation. \n\n\nOn the other hand that capital used to pay off the mortgage could be used to grow wealth at a potentially faster rate than the mortgage cost. Or just set it aside in a HYSA that pays more than the regular payments, and treat it as an emergency fund.\n\n\nI think either direction is ok, since it's literally a happy problem to have, to have enough money saved up to have the luxury of choice.",
          "score": 5
        },
        {
          "text": "Bank doesn’t check if you have income after they give you the loan. As long as you can keep paying, you’re fine\n\nI would not recommend it in the Singapore context as we do not have fixed forever mortgages like USA, which makes it volatile to manage",
          "score": 5
        },
        {
          "text": "You’ll need a payslip to refinance with a different bank. Rental income will be subject to a haircut. You can also pledge funds.\n\nRepricing with the same bank doesn’t require a payslip.",
          "score": 3
        },
        {
          "text": "I have a regular stream of income paying off my monthly mortgage. I didn’t pay off my full property mortgage, even though I have the lump sum to pay it off. \n\nI have invested the lump sum into S REIT, and the payout I have gotten is about 5.5 to 9% annual payout over the years. At the same time, my S REIT stocks have also appreciated up to about 30% as well.",
          "score": 2
        },
        {
          "text": "Probably only need an income slip if you're refinancing the mortgage loan. Even then I've heard of instances where deposits can be pledged instead of an income for a more favourable mortgage rate.",
          "score": 1
        },
        {
          "text": "yes, paying off my mortgage, so that i can retire with no debts, is one of my key criteria before i will decide to FIRE. ",
          "score": 1
        },
        {
          "text": "I wont pay off. I want to use future money, which is worth less to pay off the current debt.",
          "score": 1
        },
        {
          "text": "Don’t plan to.",
          "score": 1
        },
        {
          "text": "Won’t pay off since rates are low still. Leverage via property is always better IMO. Why rush to pay it off when you can take your time? Tomorrow is not guaranteed",
          "score": 1
        },
        {
          "text": "My mortgage rate jumped to 3+% during the onset of the COVID 19. Decided to pay off in full than to refinance. Now I’m FI and not yet RE…..",
          "score": 1
        },
        {
          "text": "Paying off mortgage is not so simple right? Because govt will then want you to pay the remaining sum \"back\" to cpf or something like that right?",
          "score": 1
        },
        {
          "text": "No, I did not pay it off. A mortgage at less than 5% is free money. The concept of paying off your home is an old one - made during the \"pioneer\" generation time when interest rates were more than 10%. ",
          "score": 1
        },
        {
          "text": "For peace of mind and if possible, paying off your mortgage definitely helps. Otherwise, if you have a better return of excess capital elsewhere, then you can use it for other investments.",
          "score": 1
        },
        {
          "text": "I've previously checked on this and I've been advised by the bank that repricing is possible without income document if you make a 3% principal repayment. However that is for repricing with the same bank. I'm not sure that would work for refinancing which is with another bank. If it doesn't,  then you may be stuck with whatever repricing rate your OG bank dictates.",
          "score": 1
        },
        {
          "text": "Refinancing/repricing not subject to TDSR and I would assume one who has FIRE-d would have significant assets which can be used in place of employment income. So in short, so long as one's investment returns (regular annualised returns) &gt; mortgage interest rate, never a reason to payoff early. Moreover, mortgages are pegged to money value today while payments are money value tomorrow (worth less when in inflationary environments) so even if both are equal, always keep the loan. \n\nHome mortgages are one of those few good debt options (if one purchases strategically) so my plan is to always max out the loan (meaning including taking home equity loans in later years).\n\nI'm aware the vast majority (especially in Asia/Singapore) would not be comfortable with this idea - as many would say, peace of mind is priceless.",
          "score": 1
        },
        {
          "text": "yes",
          "score": 0
        },
        {
          "text": "I used to think about FIRE. As i grow older,  this doesn't really suit my lifestyle. Personally im a driven person, so semi-retirement will be better for my mental health.",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1r92cp1",
      "subreddit": "singaporefi",
      "title": "Help Need regarding Debt",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r92cp1/help_need_regarding_debt/",
      "score": 5,
      "num_comments": 29,
      "created_at": "2026-02-19T23:35:40",
      "selftext": "Hello All, would like to know and get some of your advice. I am currently in 80k worth of debts, they are all from licensed moneylenders, i took out these loans purely for trading purposes which has backfired and the markets has been red.\n\nMy annual income last year is about 120k. Am seeking advice on whether i should hop on debt consolidation program as i have defaulted on some of the loans and im looking to stretch it out over a longer horizon. Have also signed myself up for credit counselling as i obviously need professional help. ",
      "comments": [
        {
          "text": "Trading is a nice word. You may have a gambling problem too.\nAlso sign up for gambling counselling as well",
          "score": 19
        },
        {
          "text": "Aren't the markets close to ath?\n\nYou have 120k income, not sure if that is average or bad as it depends on your age. What is your expenditure? \n\nWhat is the interest rate you have to pay on those loans?",
          "score": 12
        },
        {
          "text": "Borrowing money to trade? You completely ignored all the sound advice every step of the way didn’t you? \n\nMost important question now is what job do you have and is it stable? Is the income stable? And does it premise on you not being financial embarrassed to keep the job?",
          "score": 4
        },
        {
          "text": "Are you able to liquidate any existing stocks that you have ? 4% interest on 80k vs 4% interest on 20k is quite substantial. Gotta cut some losses. Priority is to reduce debt. Use income to cover.",
          "score": 3
        },
        {
          "text": "Don't want to kick OP while he's down, but I can't understand the thought process behind taking a 58.6% EIR loan to \"trade\". Did OP think he was going to make 100% returns a year or smth? Maybe the thrill of gambling is the root cause behind this predicament",
          "score": 2
        },
        {
          "text": "All from licensed moneylender? How about banks, did you take any loan from bank?",
          "score": 1
        },
        {
          "text": "Google shows CCS MDMP seems to be the closest program to your situation. Best to contact CCS to see got what options. \n\nFrom https://ccs.org.sg/consumer/mdmp/\n&gt; Credit Counselling Singapore (CCS) facilitates repayment arrangements on behalf of suitable debt-distressed borrowers under the Moneylender Debt Management Programme to enable them to repay unsecured debts with licensed moneylenders in full",
          "score": 1
        },
        {
          "text": "Honestly... Can you borrow fromnyour family. Just seeing your age and everything, your parents might be able to help you and that's the best way out of the hole.",
          "score": 1
        },
        {
          "text": "what u buy sia lol",
          "score": 1
        },
        {
          "text": "Age = 25\n\nIncome = 120k last year\n\nDebt = 80k\n\nAm I missing something here ? Govt scholar ?",
          "score": 1
        },
        {
          "text": "Based on your post and replies you gave\n1.DCP is out since probably ur credit rating is bad. To confirm, download your cbs report.\n2.MDMP is an option via CCS. Do note, based on feedback I received from othe borrowers, their LMLs counter for MDMP will be 2 times your total debt\n3.Self Petition either opting for bankruptcy or appeal to be on DRS. You should be looking at a mthly of $2.6k if you are under their 57 mths DRS program.\n\nUnorthodox approach\na.Flip your property and use sales proceeds to settle the debt. If you do have your own property\nb.Beg,borrow,pawn with a thick skin\n\nPM if u need more inputs ya. Cheers",
          "score": 1
        },
        {
          "text": "Borrow 80K from your family and pay it off.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r8wxu4",
      "subreddit": "singaporefi",
      "title": "First-time investors at OCBC flock to gold and silver, beating out stocks and unit trusts",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r8wxu4/firsttime_investors_at_ocbc_flock_to_gold_and/",
      "score": 2,
      "num_comments": 8,
      "created_at": "2026-02-19T19:36:20",
      "selftext": "Is this top signal? Let see how many think this is top signal. If this is a polymarket bet, I wager a majority in this sub thinks this is a top signal. Don’t disappoint me. ",
      "comments": [
        {
          "text": "If your grandmother or uncle tells you to buy gold during CNY it means the top is in",
          "score": 32
        },
        {
          "text": "You see so many people hyping up silver the last couple of months near the top and indeed it crashed quite hard for people that bought at the top",
          "score": 6
        },
        {
          "text": "Apparently SG retail gold investors signal the top. The biggest buyers in Asia are India n china",
          "score": 1
        },
        {
          "text": "I will disappoint you by saying ,\n\nGold and Silver still have big leg ups to go\n\nTargets are (for the remainder of this bull run),\n\n$GOLD to $6,800\n\n$SILVER to $180",
          "score": -10
        }
      ]
    },
    {
      "id": "t3_1r8vs9v",
      "subreddit": "singaporefi",
      "title": "Yet another ILP post",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r8vs9v/yet_another_ilp_post/",
      "score": 0,
      "num_comments": 17,
      "created_at": "2026-02-19T18:29:24",
      "selftext": "I have done my homework and understand that the general consensus is ILPs are dumb. I am dumb, and have signed up for 1 around 2020 with a 25 year term. I have since taken a premium holiday about 2 years ago due to other money needs and am taking a serious look at restarting it (at $630/mth). Before I do, I decided to do some homework with some (very rough) excel. These are my conclusions:  \n\n\n\n  \n\\- If I surrender now, take the surrender value and with $630 monthly + 3% per annum, ILP needs to do 4% per annum to match at end of 2045. \n\n\\- If I surrender now, take the surrender value and with $0 monthly + 3% per annum, ILP needs to do 3.2% to match at end of 2045. \n\n\\- When I surrender does not matter. Surrendering at any point, 3% per annum with $0 monthly, I get the same $ at 2045.  \n\n\n\nShould I restart the ILP? Or surrender now? I understand this depends very much on ILP's performance, my 3% assumption. Just wondering if I am missing any major points in my though process. Thanks! ",
      "comments": [
        {
          "text": "Don’t understand your calculation. What $630 + 3% per annum? If ILP is doing 4%, your all-world fund for that year will be doing 7% after you less off the insurance company, agent and fund house’s cut. ILP is just buying VWRA through three layers of middlemen. Am I missing something here?",
          "score": 12
        },
        {
          "text": "Surrender, bleed abit better than continue bleeding for another 25 years. Have a good look at the friend who sold you this, not a real friend.",
          "score": 10
        },
        {
          "text": "Surrender.\n\nPs: ilp victim",
          "score": 6
        },
        {
          "text": "If you cannot afford to pay ILP, then isn't it a no brainer to surrender?",
          "score": 6
        },
        {
          "text": "Surrender. A basic life or medical insurance will cost you lesser and the excess cash can be reinvested into a world index that gives better returns.\n\nILPs should not exist anymore. It’s a trash product that preys on uninformed. We will do better without it.",
          "score": 2
        },
        {
          "text": "What is the ILP investing in?",
          "score": 2
        },
        {
          "text": "I dont even understand what are you talking abt. You take surrender value then what $630 +3%pa, then still want what ILP to perform 4%pa? What 3%pa then $0 mth/mth? You are simply confused and not making any sense.",
          "score": 2
        },
        {
          "text": "2y in still early enough to surrender",
          "score": 1
        },
        {
          "text": "Not exactly the same but sharing for others to consider: I never bought an ILP but did get a whole life policy when I started working primarily because I was not yet financially literate. Fast forward 4 years, I decided to surrender based on:\n\n\n1) significantly greater financial literacy,\n\n2) understanding that actual lost was not (premiums paid - surrender value) but (premiums paid - surrender value - premiums otherwise incurred for term policy),\n\n3) high confidence in actually and properly deploying future premiums saved to investments\n\n\nMany just seek well-meaning advice and surrender but don't understand that the advice would only be wholly applicable under the specified circumstances e.g. buy term invest the rest - many stop at buying term and then spend the rest.",
          "score": 1
        },
        {
          "text": "Idk what you talking about. You bring this to FIDREC they also dk what you talking about.\n\nBut the fact that you took 2 yrs of premium holiday really mean that you are nowhere ready all these while.\n\nJust surrender the policy and go back to fixed deposits...",
          "score": 1
        },
        {
          "text": "surrender now",
          "score": 1
        },
        {
          "text": "Take the hit now, when you have not gotten too deep into the ILP, and if you want the insurance coverage, go buy a long-level term coverage. Open a low-cost brokerage account and DCA an amount you are comfortable with monthly into the ETF of your choice. You have just created a custom ILP minus all the headaches and high ILP fund expenses.",
          "score": 1
        },
        {
          "text": "I don’t understand what you are calculating. What is the current surrender value? What does “to match” mean? Match what?\n\nETA: Are you comparing the ILP vs some imaginary safe 3% investment?\n\nThat doesn't make sense, because ILPs aren't safe either. You should be comparing vs DIY investing.",
          "score": 0
        },
        {
          "text": "Surrender. Take hold of your losses early. Never make sense to wait 10+ years just to break even. You might as well invest those money yourself after studying abit of passive investment.\n\nThe key phrase that agents never tells you,\"Doesnt make sense to wait 10 years just to break even\"",
          "score": 0
        },
        {
          "text": "Surrender now, put the money in dividends/S&amp;P 500. You will thank yourself in 20-25 years. \n\nLost $10k when I surrendered my ILP 5 years in. Still the best decision ever made. \n\nDo take a look at your ILP. Some ILP T&amp;C changes when you stop paying premium. In my case many years ago, the returns don't take into account the existing capital in the policy after restarting the ILP.\n\nAs many always say, buying ILP don't contribute to your retirement. It contributes to your agent's retirement.",
          "score": 0
        },
        {
          "text": "In before something about boarding the wrong train and something about it being more expensive to return",
          "score": -1
        }
      ]
    },
    {
      "id": "t3_1r8ydhp",
      "subreddit": "singaporefi",
      "title": "Missed Bank Mortgage Payment",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r8ydhp/missed_bank_mortgage_payment/",
      "score": 0,
      "num_comments": 12,
      "created_at": "2026-02-19T20:50:38",
      "selftext": "Hi would like to check if bank mortgage payment is missed what are the next actions taken by the bank against mortgagor\n\nUnderstand typically there is a 3 month \"grace\" period -&gt; if there is no payment on the 3rd month bank will send laywer letter to chase? heard from some people that if you pay after receiving the letter you can \"reset\" the 3 month \"grace period\"? not sure if this is true\n\nif still unable to pay mortgage after the lawyer letter comes what happens next? will the bank repossess the house and auction it to recover the loan? is there a timeline eg. after 6 months of non-payment etc. for the events that happen next? understand that diff banks may have diff policies for missed payments but would like to get a general idea of the timeline for missed mortgage payments\n\nTKIA!",
      "comments": [
        {
          "text": "I dunno what is the reason for non-payment of mortgage... but I would advise you to faster go and speak to your bank to explain your reasons and ask for help. I won't advise you to continue camping on Reddit and waiting for bank to take legal action against you.\n\nSource: https://www.judiciary.gov.sg/civil/mortgage-actions#:~:text=The%20bank%20has%20asked%20the,time%20stated%20in%20the%20OA.",
          "score": 3
        },
        {
          "text": "It will spiral downward very fast with all the extra interests, penalties, legal fees, admin fees and what not.",
          "score": 3
        },
        {
          "text": "If your friend having difficulty to pay off mortgage. I think he should consider selling off the property or downgrading. As bank repossess and selling off on market price might not be the best option and on top of that your friend pay admin fee, lawyer fee etc",
          "score": 2
        },
        {
          "text": "Quickly go to the Bank and clarify yourself.\nUnlike HDB , there’s no “tolong tolong”",
          "score": 1
        },
        {
          "text": "stop try to find loopholes. go straight to bank and sort it out. fast\n\n\n\n",
          "score": 1
        }
      ]
    }
  ]
}