{
  "schema_version": "raw_scrape_v1",
  "report_id": "2026-02-08",
  "scraped_at": "2026-02-08T13:45:59.650785",
  "subreddits": [
    "singapore",
    "askSingapore",
    "SingaporeRaw",
    "singaporefi"
  ],
  "total_posts": 33,
  "total_comments": 421,
  "posts": [
    {
      "id": "t3_1qybg2t",
      "subreddit": "singapore",
      "title": "The S hook is a useful tool",
      "url": "https://old.reddit.com/r/singapore/comments/1qybg2t/the_s_hook_is_a_useful_tool/",
      "score": 557,
      "num_comments": 43,
      "created_at": "2026-02-07T19:27:10",
      "selftext": "",
      "comments": [
        {
          "text": "Wah I can’t forget the S hook jiejie voice on stream\n\nS HOOK\nS HOOK\n\nCAN SEE?!?!\n\nWhatever you wanna hoot you can hoot\n\nCan see?!\n\nYou today go to market, no hand to carry? No problem! Buy many this kind of hook, many ah many ah not one ah\n\n6 hook ah 6 hook\n\nCan put your Wantan Mee your kuey Peng your whatever okay?\n\nNobody help you it’s the no problem\n\nYou can hook your Kuey png lah your wanton mee lah, your whatever you can hook!\n\nOkay? Those 有大有小(have big have small)\n\nDon’t hook the Wantan Mee never mind\n\nThose 有小孩(have small kids)\nPai Lau Twee (Hokkien for climb stairs)\nBuay tia Huay (never listen to you)\n\nYou want to hook the Teng Tiao (cane) also can\n\nWhatever hell thing you think to hook, you can hook!\n\nThis is a designer top, it is the very useful, you can hook your EZ-Link card here, you can just teh teh teh (tap) like that up to you\n\nYou want to put all bell bell  can\n\nThose Seng Li Zhi Jin Dua (business do damm big), you want to hook the pen ah also can hook. Contractor maybe your ah Lao is a contractor, you’re the assistant , your ah Lao say “Eh Kai Dan!” (Open invoice) straightaway take out the pen, sign\n\nOkay very the easy\n\nWhatever you can think to hook, hook\n\nUmbrella can hang leh",
          "score": 136
        },
        {
          "text": "![gif](giphy|Z5VodYj3BXH68)",
          "score": 129
        },
        {
          "text": "Legit strategy. Will copy.",
          "score": 122
        },
        {
          "text": "Before everyone slimes this as irresponsible or inconsiderate, I just want to say whoever did this is actually a genius.",
          "score": 36
        },
        {
          "text": "Carabina is better",
          "score": 32
        },
        {
          "text": "Then train stop and that becomes a wrecking ball",
          "score": 12
        },
        {
          "text": "Especially useful when you’re in the bus and want to take a quick snooze. You don’t have to worry about dropping your stuff",
          "score": 10
        },
        {
          "text": "lol at least use a lockable hook of some sort like a d ring",
          "score": 9
        },
        {
          "text": "On train with no seat, i use a carabiner to put backpack onto one of the three vertical metal bars at the center of mrt.\n\nBucket list: Make a laptop holder that suction-cups onto window/smooth wall/glass at end of bench, for when I have urgent assignments and no seat…",
          "score": 7
        },
        {
          "text": "Modern problems require modern solutions.",
          "score": 5
        },
        {
          "text": "Can use this to hang the bag of a guy wearing it in morning commute so that he will realize it’s a narrow space. Bags should be on the floor.",
          "score": 5
        },
        {
          "text": "I honestly can't tell if there is just more stupid people now or just a case of more phones now, so more of this stupid shit gets recorded or both",
          "score": 4
        },
        {
          "text": "S hook at eye level, accident waiting to happen.",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1qyxlgj",
      "subreddit": "singapore",
      "title": "Fatal Chinatown accident: 38-year-old female driver arrested",
      "url": "https://old.reddit.com/r/singapore/comments/1qyxlgj/fatal_chinatown_accident_38yearold_female_driver/",
      "score": 484,
      "num_comments": 246,
      "created_at": "2026-02-08T11:02:28",
      "selftext": "",
      "comments": [
        {
          "text": "Good. Justice must be served",
          "score": 337
        },
        {
          "text": "goodness. the victim was a 6 year old child. A CHILD.",
          "score": 178
        },
        {
          "text": "For those of you wondering what she was arrested for and when:\n\n&gt; the woman was arrested on **Feb 6** for **driving without reasonable consideration causing death**.",
          "score": 168
        },
        {
          "text": "Orbigood, still wanna get mothershit to write abt her",
          "score": 112
        },
        {
          "text": "(6)  A person who is guilty of an offence under subsection (2) shall on conviction —\n\n(a)\tbe liable to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 3 years or to both;\n\n\nhopefully law can be tightened to make sure everyone drives properly. Seen too many time the drivers holding a phone or even watching soccer match while driving.\n\nEdit: not sure if I copied the correct information. Please correct me if I'm wrong.",
          "score": 72
        },
        {
          "text": "This is an absolute shit show of a human being regardless of what gender or race. For goodness sake its at the carpark, how fast the driver needs to drive to kill a person. Secondly, the reaction by this drive after the accident is abhorred and thirdly i saw report abt the driver pov in some news report, this is the most scary part, instead of being remorseful, this person is thinking abt damage control of her image.",
          "score": 65
        },
        {
          "text": "I wish can deport and ban after justice served. \nThere should be no exceptions for foreign criminals for any crime.",
          "score": 63
        },
        {
          "text": "&gt;Driving without reasonable consideration causing death\n\nStill want to blame victim somemore, hope proper justice is served",
          "score": 53
        },
        {
          "text": "Max punishment please, although it’ll still be insufficient because our traffic laws are so lenient.",
          "score": 30
        },
        {
          "text": "She should receive the full weight of the law. Rolled on the child 2x and nearly killed the mother too.",
          "score": 16
        },
        {
          "text": "Driving with international licence and conversion should come with a probatory active driving period of 12 months. \n\nPunishment for violation of sorts within that said period should be made clear. \n\nThe roads are super unsafe with older folks driving, especially those who choose to make a living by being PHDs. It’s the same with PMDS. Folks with “no choice” and depend on driving or delivery to make a living. The bicycle folks contribute to it too. Now that we have sorted the path ways let’s sort out the road users too.",
          "score": 10
        },
        {
          "text": "I hope they file separate charges for both victims. 3 years is too leniant for such a needless death…",
          "score": 10
        }
      ]
    },
    {
      "id": "t3_1qyb9qp",
      "subreddit": "singapore",
      "title": "Woman who allegedly hit girl, 6, in fatal Chinatown accident 'overcome with guilt'",
      "url": "https://old.reddit.com/r/singapore/comments/1qyb9qp/woman_who_allegedly_hit_girl_6_in_fatal_chinatown/",
      "score": 443,
      "num_comments": 387,
      "created_at": "2026-02-07T19:16:57",
      "selftext": "",
      "comments": [
        {
          "text": "So overcome with guilt she shouted at the father of the girl who was holding his child's dying body in his arms?",
          "score": 1032
        },
        {
          "text": "Fking bullshit framing from mothership. Go read the story from the Vietnamese witness",
          "score": 517
        },
        {
          "text": "So guilty she trying to taichi the blame to the victims",
          "score": 505
        },
        {
          "text": "Hey ma'am, you don't have to go on a PR stunt, there's evidence of your attitude at the scene.\n\nEdit: [scene of what happened](https://old.reddit.com/r/LearningFromOthers/comments/1qy7s20/lfo_car_hit_two_pedestrians_one_killed/?ref=share&amp;ref_source=link), but please don't watch it if you have a soft heart. Condolences to the couple",
          "score": 417
        },
        {
          "text": "There were several eyewitness accounts saying that she was trying to absolve herself of blame at the scene and saying things like it's not her fault. Even in the pictures, you can see her hand gesture signalling her self-proclaimed innocence at the bloody scene in front of her.",
          "score": 291
        },
        {
          "text": "How much was Mothership paid to write this “guilt” article?",
          "score": 276
        },
        {
          "text": "Hope she's \"overcome with consequences\"",
          "score": 268
        },
        {
          "text": "Mothership lost their conscience.. why write such an article? This is akin to stabbing the victim's grieving family even further. Evil mothership",
          "score": 226
        },
        {
          "text": "Overcame with guilt after she realised the potential consequences to herself?",
          "score": 194
        },
        {
          "text": "can ask her go to hell la",
          "score": 147
        },
        {
          "text": "Guilt my pantat. \n\nGuilt cos she got caught. \n\nGuilt cos she knows she will have to face the courts. \n\nGuilt because she killed a 6 year old. \n\nShe will come up with some teary apology citing that she's a mother, she's an outstanding citizen, she's not done this before etc, all hoping for a lesser sentence.",
          "score": 94
        },
        {
          "text": "I've said this before and I'll say it again. Drivers have the responsibility to be extra fking careful. Just because you have the right of way doesn't mean you are right to barrel down the road or accelerate right out of the Carpark ffs. \n\nNowadays the EV torque are damn high, cars can accelerate much quicker than last time. The suv heights are also pretty high so drivers need to be extra fking careful about the blind spots. I've been driving for close to twenty years and notice that most drivers here have fking poor etiquette and awareness. Speeding, going wrong direction, slowing down and cutting 4 lanes and across chevrons markings just so one doesn't miss an exit. Coupled with the power of high torque cars like EVs it's really dangerous. \n\nDrivers need to be extra careful especially in such a crowded tourist area. Somemore already drove for ten years. This is negligence at its finest. Fking shame. I feel so much pain and anger for the father. What was probably a memorable holiday turned out to be a tragedy. The beautiful little girl will never come back.",
          "score": 92
        },
        {
          "text": "Mothership scared offend talent is it. Video already shows otherwise, whole world can see what kind of person the driver is. simi guilt.",
          "score": 49
        },
        {
          "text": "// \"When she called me, she couldn't stop crying... She is truly blaming herself and feels immense guilt,\" //\n\nHonestly didn't see her crying in the video..  ",
          "score": 39
        },
        {
          "text": "Sounds like someone lawyered up.\n\nBut well I think she’ll get less than 5 years.",
          "score": 36
        },
        {
          "text": "This is beyond pathetic from mothership",
          "score": 35
        }
      ]
    },
    {
      "id": "t3_1qyeaak",
      "subreddit": "singapore",
      "title": "S'pore man, 85, drives car along walkway of NUS building, assisting with police investigations",
      "url": "https://old.reddit.com/r/singapore/comments/1qyeaak/spore_man_85_drives_car_along_walkway_of_nus/",
      "score": 225,
      "num_comments": 32,
      "created_at": "2026-02-07T21:49:52",
      "selftext": "",
      "comments": [
        {
          "text": "This guy is older than my grandparents, and I can't imagine any of them still driving lmao",
          "score": 156
        },
        {
          "text": "So that’s how they get cars into the mall for roadshows..",
          "score": 111
        },
        {
          "text": "Grandpa really took life long learning seriously and gonna enrol for a degree this way",
          "score": 78
        },
        {
          "text": "We got GTA Singapore before GTA 6",
          "score": 66
        },
        {
          "text": "85? Is that even legal?",
          "score": 42
        },
        {
          "text": "This is the reason why a law should be passed limiting the validity of driving license to age 75 or earlier if there are health issues affecting road safety. The 85yo maybe suffering from dementia when he committed that act.\n\nSo is our transport minister going to do something to tighten the law?",
          "score": 26
        },
        {
          "text": "In my experience, people drive (or cycle, for that matter) like they walk - and this sounds like a case of confused elderly wandering around. Only, you know, in a motorized vehicle that probably weighs somewhat over a tonne. ",
          "score": 18
        },
        {
          "text": "Driving has minimum age but not maximum age😔",
          "score": 13
        },
        {
          "text": "85 yo people should not be driving. Yearly tests for people over 65, no more driving for 75 and above.",
          "score": 12
        },
        {
          "text": "What kind of shit title is that. I thought the old man was Watson helping out sherlock Holmes with the next big murder mystery by driving down walkways.",
          "score": 6
        },
        {
          "text": "It was quite dangerous, the students in front of the car should have walked away quickly. This is also the age group that confuses break pedals…",
          "score": 4
        },
        {
          "text": "I hope the govt starts some initiative for elderly folks to voluntarily give up their licenses",
          "score": 2
        },
        {
          "text": "See someone do it with an electric scooter, why not a car?!",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qy8atz",
      "subreddit": "singapore",
      "title": "Elderly man in S'pore faints while queuing for new CNY notes before opening hours",
      "url": "https://old.reddit.com/r/singapore/comments/1qy8atz/elderly_man_in_spore_faints_while_queuing_for_new/",
      "score": 173,
      "num_comments": 78,
      "created_at": "2026-02-07T16:14:00",
      "selftext": "",
      "comments": [
        {
          "text": "Never really understood the hype in new notes, but everyone around me kept harping on them. I try to make it a point to reserve my new notes ahead of time every LNY, but if I couldn’t get a slot + waiting time is over 2 hours, then I will just get regular notes instead. No biggies.\n\nThere was an instance where my nephew (unintentionally) opened up their angbao and exclaimed “wah, why are your notes not new?”. I simply told him that if he doesn’t like the notes this year, he’s always welcome to return them back so that I can give it to him properly again next year. 😊 \n\nThat shut him up real good.",
          "score": 330
        },
        {
          "text": "In this day and age, should put NTUC Voucher inside instead. Get them used to the concept of CDC Voucher.\n\nj/k",
          "score": 63
        },
        {
          "text": "I believe your angbao if u pack 100k even in smelly dirty $2 notes , everybody will take it",
          "score": 57
        },
        {
          "text": "What i saw which i guess annoyed (but didnt surprise) me was, if you have normal bank accts, max new notes you can change is 800 bucks. And govt is constantly telling us stop using new notes, use fit notes, it's the same.\n\nBut the same rules dont apply to premium banking and private banking customers. Their new notes limit are 12k or higher like wtf.\n\nEdit: the one i saw for 12k was UOB which i can't find anymore. DBS Treasures customers can withdraw $6900 new notes:\n\nhttps://www.dbs.com.sg/personal/support/wealth-lny-online-reservation.html\n\nRules for thee, not for rich.",
          "score": 32
        },
        {
          "text": "I don’t get the custom to get new notes. The notes in the angbao I received from last year are **completely untouched** since I almost only use online payments. \n\nI offered to give my parents these notes for angbao but they refused, instead opting to queue for new notes. My notes are as good as new bruh.",
          "score": 30
        },
        {
          "text": "I can relate to how the wealthy looks at all the foolish things the poor do in wasting their time and life.",
          "score": 28
        },
        {
          "text": "Hope he is better now",
          "score": 4
        },
        {
          "text": "Other elderly my time is precious as I have so little left \n\nSporean elderly  ....",
          "score": 3
        },
        {
          "text": "same shit as lou hei. I lou heied for 30 plus years, never huat once.\n\nthese new notes are meant to symbolise some form of more money entering your bank account. never happened at all. all bs.",
          "score": 3
        },
        {
          "text": "Said so many times, Banks stop all these nonsense!",
          "score": 3
        },
        {
          "text": "What am I suppose to do when receive new notes? Frame it up?",
          "score": 2
        },
        {
          "text": "Fit notes look the same as new notes so I do not understand why people queue up for hours for new notes too. No one is gonna check the serial number to see if the note is new. Money is money they do not care.",
          "score": 2
        },
        {
          "text": "Side note, love that all the elderly are around him helping instead of queuing.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qyx5in",
      "subreddit": "singapore",
      "title": "Singapore to slash CDC vouchers as Budget 2026 pivots to defence",
      "url": "https://old.reddit.com/r/singapore/comments/1qyx5in/singapore_to_slash_cdc_vouchers_as_budget_2026/",
      "score": 146,
      "num_comments": 89,
      "created_at": "2026-02-08T10:41:42",
      "selftext": "",
      "comments": [
        {
          "text": "Me, 2025: 'Aunty, can I pay using CDC voucher?'\n\nMe, 2026: 'Aunty, can I pay using this matador?'",
          "score": 313
        },
        {
          "text": "Its been a good run cdc voucher...see you in 2030 buddy",
          "score": 188
        },
        {
          "text": "I feel a great disturbance in the Force, as if thousands of hawkers suddenly cried out in terror and were suddenly silenced",
          "score": 123
        },
        {
          "text": "As expected haha. I mean we all knew that GE was definitely a factor but it was a good run.",
          "score": 120
        },
        {
          "text": "No elections",
          "score": 80
        },
        {
          "text": "If you read the article carefully, all these are projections from banks. They’re not always accurate so I would await the actual speech before making a call on this.",
          "score": 44
        },
        {
          "text": "Ammo will be the new currency. My kopi peng will cost 1x 9mm round",
          "score": 39
        },
        {
          "text": "So will they increase NSF pay?",
          "score": 38
        },
        {
          "text": "Their source is Maybank, DBS, and RHB. Allegedly. With no name to the author.\n\nIs this publication trustworthy? Genuinely asking in case I'm just not aware of them before.",
          "score": 36
        },
        {
          "text": "He is known as voucher Wong for a reason",
          "score": 33
        },
        {
          "text": "No election means no chicken drumstick sadge",
          "score": 33
        },
        {
          "text": "Hahahaha, don’t get this wrong… the technology you’re gonna get is still a bit shitty. \n\nMost of this money will be directed towards managing the project and hardware costs. Not developing said hardware.",
          "score": 22
        },
        {
          "text": "Calls on ST Engineering &amp; related crony GICs",
          "score": 20
        },
        {
          "text": "isn’t this just Maybanks projection report and not actual government source?",
          "score": 15
        },
        {
          "text": "Ah yes, proof that people don’t read the article.\n\nThe article’s title is a click bait.",
          "score": 14
        }
      ]
    },
    {
      "id": "t3_1qygbvr",
      "subreddit": "singapore",
      "title": "Terrible finishing and QC in new BTO",
      "url": "https://old.reddit.com/r/singapore/comments/1qygbvr/terrible_finishing_and_qc_in_new_bto/",
      "score": 85,
      "num_comments": 20,
      "created_at": "2026-02-07T23:15:15",
      "selftext": "",
      "comments": [
        {
          "text": "House is still under warranty just need to go to the bsc near the block to get them to rectify.",
          "score": 22
        },
        {
          "text": "Isn’t there a BTO QC by HDB before handover of flat?\n\nAre there any other developments facing the same problem?",
          "score": 14
        },
        {
          "text": "In such cases, who bares the cost of rectification? The defects in this one seems quite major...would it need retiling the entire kitchen and toilets?",
          "score": 13
        },
        {
          "text": "he has a recent video on the dumb bell design at Tengah.. that one also worth watching. some of it is structure problems that can never be rectified. ",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1qyd3v8",
      "subreddit": "singapore",
      "title": "Why is Apple not continuing with LumiHealth?",
      "url": "https://old.reddit.com/r/singapore/comments/1qyd3v8/why_is_apple_not_continuing_with_lumihealth/",
      "score": 83,
      "num_comments": 19,
      "created_at": "2026-02-07T20:56:10",
      "selftext": "Does anyone know why? I really like LumiHealth and found it user-friendly. This shift seems sudden to me. \n\nAlso is the HPB app better? Are there quests like in LumiHealth? Ease of use of the app? \n\nCan users of HPB app share your experiences here? ",
      "comments": [
        {
          "text": "Cost of freebies was too much to sustain. They already reduced the rewards previously, but the volume of vouchers being given out increased even more.\n\nThe peak number of users was 377,000, assuming everybody maxes out the $10 voucher every 2.5 weeks then it’s running at ~$7.5 million per month to keep the app rewards program running.",
          "score": 129
        },
        {
          "text": "Too much money for too little benefits from gov pov",
          "score": 56
        },
        {
          "text": "Always comes down to cost vs benefits. I assume Apple doesn't feel they want to continue the partnership because it's no longer getting people to buy enough Apple watches.",
          "score": 35
        },
        {
          "text": "I suspect is more on hpb instead of apple. Is probably that Apple provide the UI app design etc HPB funds the rewards. \n\nGiven that the minister has said something about piloting use of health points to minus insurance premium, the closure of this app will channel people to use healthy 365 as well\n\nhttps://www.moh.gov.sg/managing-expenses/schemes-and-subsidies/medishield-life/premium-discount/\n\nPersonally hate the interface, There’s too many things all at once, there isn’t that apparent understanding that health is beyond exercise and diet. Lumi instead encourages u in different ways, whether is it about don’t doomscroll, be more mindful etc. Healthy365 will give u no motivation to do such things. \n\nJust basically a pragmatic ugly app which we will all eventually be forced to use esp if u take up their free   Activity stuff. Sigh",
          "score": 34
        },
        {
          "text": "As someone who deliberately signed a credit card to get a “free” Apple Watch just for Lumihealth, I have already exchanged quite a lot of vouchers from it and appreciate the program\n\nJust disappointed it will end soon and H365 app UI sucks arse but I can understand why Ah Gong wanted to force us to switch to it",
          "score": 22
        },
        {
          "text": "HBP365 is crap.  Lumihealth is way better overall, especially in closing goals.",
          "score": 11
        },
        {
          "text": "idk lumihealth cause i not apple user but have been using the healthy 365 in the background.\n\nthere's not much to it, literally just meet your sleep, activity and steps target and thats it. then redeem ur ntuc vouchers or whatever when u have enough. rewards wise it's ehh, I don't actively try to meet all the 3 targets but I estimate for me it takes about 1.5-2 months for $5. but it's basically $5 for doing nothing anyway (just my data) so I'm not complaining.",
          "score": 6
        },
        {
          "text": " You can try weward",
          "score": 5
        },
        {
          "text": "I’ve claimed about $1.5k worth of vouchers since LumiHealth started so this is super disappointing",
          "score": 5
        },
        {
          "text": "Ouh damnn, I haven’t claimed any of my points to vouchers…",
          "score": 2
        },
        {
          "text": "i always thought it was marketed as a project, meaning there was a sunset date planned",
          "score": 2
        },
        {
          "text": "fun fact - lumihealth was designed and built by apple themselves. h365 however seems.. closer to what our govt produces these days",
          "score": 2
        },
        {
          "text": "Lumi 100% better than hpb365, one of the factors I bought an apple watch again after my freebie from credit card spoil. Sad it discontinues, hope they have bring some of the better features and interfaces over from lumi to hpb.",
          "score": 1
        },
        {
          "text": "It’s not an initiative from Apple, but from HPB. Yes Apple does promote it in the Apple stores etc but the financing is from HPB",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qyc20e",
      "subreddit": "singapore",
      "title": "Restoration of bus arrival timing system more than 90% complete: LTA",
      "url": "https://old.reddit.com/r/singapore/comments/1qyc20e/restoration_of_bus_arrival_timing_system_more/",
      "score": 68,
      "num_comments": 28,
      "created_at": "2026-02-07T20:01:12",
      "selftext": "",
      "comments": [
        {
          "text": "then i must be really suay cause most of the buses i take are in that 10%",
          "score": 100
        },
        {
          "text": "Calling bluff on this. Havent seen any accurate timings so far, across different buses and locations\n\nMaybe trying to meet internal kpi by announcing to public like this",
          "score": 52
        },
        {
          "text": "So the 10% bus seems to be affecting alot..of numbers.\nStill get timing like 30+ minutes and then the bus arrives",
          "score": 41
        },
        {
          "text": "Took the bus today, the board at the bus stop says arriving in 20 mins, contemplating to walk instead so I searched the way in maps for a few mins, started to walk, turned back and saw the bus coming.",
          "score": 38
        },
        {
          "text": "Really?\n\nThen why does the bus still flake on me at least 50% of the time across multiple locations and services?",
          "score": 21
        },
        {
          "text": "At this point should just tell us the average bus schedule as a fallback",
          "score": 14
        },
        {
          "text": "I haven't been travelling by bus lately, have the timings been more accurate/back to normal since the \"fixes\" was rolled out?",
          "score": 8
        },
        {
          "text": "if u wait for bus and the timing is off, remember, you are the 10%",
          "score": 6
        },
        {
          "text": "They'd legit be better off just posting a physical poster of all the non-feeder bus services' arrival schedules onto the bus stops. they currently only do that for buses with 30 min schedule, can probably consider just expanding it to more frequent services",
          "score": 6
        },
        {
          "text": "Yesterday the app said bus 14 was arriving in 3minutes\n.. I waited for 20min lol",
          "score": 4
        },
        {
          "text": "Longest \"switch off-switch on\" so far ",
          "score": 2
        },
        {
          "text": "As an anecdotal counterpoint to everyone else here it seems. So far my buses around the north east area and central bishan area seems fine.",
          "score": 1
        },
        {
          "text": "Had to grab to work today cos the bus that was supposedly 5 mins away literally just left he busstop as I arrived \n\nAnd the app said next bus is in 15 minutes",
          "score": 1
        },
        {
          "text": "Might be legit. At those bus stops.with multiple buses, most seem to be on time now, except mine.",
          "score": 1
        },
        {
          "text": "The figures plucked from where? Can't be almost everyone taking the same 10% of affected bus services right? I was still seeing 25 mins on my daily feeder bus and then seeing the bus on the horizon. ",
          "score": 1
        },
        {
          "text": "2 of bus services in my place still CMI, even before the timing was messed up around 2 weeks ago",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qyuuvq",
      "subreddit": "singapore",
      "title": "Avoiding Street Solicitors",
      "url": "https://old.reddit.com/r/singapore/comments/1qyuuvq/avoiding_street_solicitors/",
      "score": 64,
      "num_comments": 99,
      "created_at": "2026-02-08T08:55:51",
      "selftext": "The entrances to the MRT station and mall near my work place is regularly closely guarded by various street solicitors. They specialise in getting public passerbys to do various things: buy a new house, sign up for a new insurance/ILP, donate to a particular charity, among others. Whatever it is, 99% are after my money (not like I got much anyway.)\n\nAt first, I stopped and gave them my attention and time, and sometimes my money (mainly charities.) But their constant presence is wearing me down, and I slowly started to politely decline, and move on.\n\nBut some are pretty persistent and literally walk (almost chase) after you for quite a distance **despite** politely declining. It is rather off-putting and sometimes triggering if they keep going on and on and on without boundaries. I don’t know if others feel the same way. I mean eventually I just walk far off enough, but it feels almost rude of me to do so despite me being the one to already politely decline. Am I rude or are they rude for persisting despite a nice “no thank you” ??\n\nMore recently, I’ve been avoiding going into the station (mall area) to get food and/or taking the longer route (one big detour) just to avoid the stress of the situation when I see them around.\n\nI wonder how others feel about street solicitors and avoiding them?",
      "comments": [
        {
          "text": "Dont even acknowledge them, just look into the distance and keep walking",
          "score": 139
        },
        {
          "text": "You're overthinking it. They prey on people like you who are too polite to ignore or tell them a hard no\n\nIf you want to do some good and donate to charity, find your own cause to support instead of getting solicited on the streets",
          "score": 120
        },
        {
          "text": "Stop being 'nice' about it. It just sends the signal that you can be worn down if they are persistent enough.",
          "score": 79
        },
        {
          "text": "Give du-lan face. Don't stop. Don't look at them. Hand straight up to block their face (not touch, just so you can't see them). Walk with purpose away. ",
          "score": 48
        },
        {
          "text": "There is nothing rude about walking off and ignoring them. They are the rude ones, constantly pestering people.",
          "score": 35
        },
        {
          "text": "I don’t even say anything, I just put my hand up, shake my head and power walk away. \n\nSometimes I’ll even slow down so there will be a human buffer in front of me to kenna then I speed up and avoid altogether",
          "score": 34
        },
        {
          "text": "Even the ones pushing charitable donations are not directly employed by the charity. They are employed by 3rd party companies which skim most of the income to pay the aggressive commission structure for the street vendor and “administrative charges.” In many cases less than half goes to the charity.",
          "score": 21
        },
        {
          "text": "Why inconvenience yourself because of such pests?\n\nJust walk past them and pretend they don’t exist",
          "score": 16
        },
        {
          "text": "Why are you so feeble. Their aim is to squeeze money from you. If their products are so good, ppl will go to them not the other way round. ",
          "score": 15
        },
        {
          "text": "Just stare past them or walk past them. Ignoring them if you don't want anything to do with them.",
          "score": 14
        },
        {
          "text": "Just ignore them, being polite or responding will only encourage them further",
          "score": 14
        },
        {
          "text": "There is only 1 exit at the mrt near my house and they would literally camp at the gantry and following me (and everyone they can catch) all the way to the escalator. So fucking annoying when I just wanna go home after a long day.\n\nUsually I pretend to stare at my phone but got once one of them cursed behind me and made a comment to their colleague so I went to the customer service and complained about them. That held them back for all of like the 5 minutes I was there glaring at them, the station staff said they'll try to hold them back from the gantry but they were back at it again the next day.\n\nHonestly no idea why they're allowed to do this when we're paying for our public transport. Back when we were students and we did those donation drives stuff, we're not allowed inside mrt premises. So obviously they have explicit permission but it should not be at the expense of us spenders.",
          "score": 13
        },
        {
          "text": "Look at them, smile, \n\nThey approach, \n\nKeep walking\n\nWaste their time, see their soul leave their body\n\nFeels good",
          "score": 9
        },
        {
          "text": "Just say not interested and walk away. Why so humji?",
          "score": 7
        },
        {
          "text": "It’s a natural response when someone friendly looks at you with a smile and says “Hi!” to try and be polite and respond accordingly.\n\nI hate these people and the bosses behind them because this is all fake and they’re after your money.\n\nSo you feel a slight sense of guilt for ignoring these people because you have been raised in these social constructs where this is not a good reaction.\n\nBut don’t pay any attention and don’t give them anything. Not a smile, not a word. Internalise the fact that this is an act and pure manipulation of feelings and the unwritten social contracts between human beings. All for a mercantile goal.",
          "score": 7
        },
        {
          "text": "Learn to politely but firmly refuse while continue walking on. It gets easier after the first try.",
          "score": 7
        },
        {
          "text": "I can understand that they’re also trying to make a living so I just reply with “I have no income”",
          "score": 6
        },
        {
          "text": "When I was younger, I gave off ‘prey’ vibes so got approached by these solicitors often. \n\nNow I put on my best RBF and hardly any of them approach me anymore, even though I’m prepared (eg was gonna tell them that the StanChart customer service sucks and I just cancelled my card, so I ain’t gonna sign up for a new one).\n\nOnce I gave a dirty look to this solicitor who was pestering an old lady. She (solicitor) saw my expression and looked embarrassed and avoided eye contact after that. You can try giving them dirty looks; might work lmao",
          "score": 6
        },
        {
          "text": "Stop being a prey animal and just walk past them.",
          "score": 5
        },
        {
          "text": "You’re not rude for refusing something you don’t want to do or need. They just see you as a soft target for being polite, just like how I was hounded a few years ago. Persistence is key to these people. I straight up just ignore them now or put on my earpiece and glare when they keep yapping on.",
          "score": 4
        },
        {
          "text": "Ignore the human ads and move on. There is no Adblock for these kind of thing, except for government intervention. They should feel bad, and not you. They should get a job that doesn’t have to cause some emotional stress on random passerby. But you should feel bad if you are going out with somebody, and you stopped to entertain these solicitors and that accompanying person has to listen too. Depending on the accompanying person’s character to bail you out.",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1qyhwm2",
      "subreddit": "askSingapore",
      "title": "What can we do to help victims of an accident before the paramedics arrive?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qyhwm2/what_can_we_do_to_help_victims_of_an_accident/",
      "score": 242,
      "num_comments": 82,
      "created_at": "2026-02-08T00:16:49",
      "selftext": "This question goes out to doctors , paramedics etc...  \n\nI am sure all us know the tragedy that unfolded yesterday at chinatown with the tragic passing of 6 year old child who happened to be on a holiday with her parents in SG. Our deepest condolences to the family and hope justice will be served. \n\nMy question is , if we happened to witness an accident , and the victims are injured, how can we render help to them before the paramedics arrive? \nAre there things we can do to help with the situation instead of being bystanders ? \n\nCuz i saw the video of that accident and alot people were just standing around observing what was happening untill the paramedics arrived , so how can we help out in the situation by any way before the ambulance/paramedics arrive ??\n \n\n\nEdit ;\n\n\nConsolidation of points : \n\n1. Call 995 ( inform the exact location and number of victims , if they are stuck in a car etc).\n\n2. Dont move victim\n\n3. Call out for anyone who has first aid /BCLS training / find the nearest AED ( check locations on myresponder app ) \n\n4. Ensure the victim is conscious/has a heart beat if not administer CPR \n\n5.  Help to clear/redirect traffic if its not on a highway.. \n\n6. If there's a GP clinic nearby , run and get a doctor to help. \n\n7.  Take note of what happened, time of accident etc so you can explain to the paramedics /SPF when they arrive..(for investigation purposes)\n\n\n",
      "comments": [
        {
          "text": "Hate to say this but sometimes there is a need to take video of what the driver does, the video and eyewitness narratives paint a different picture of what the driver claim to be.",
          "score": 325
        },
        {
          "text": "If you know first aid, you should know what to do. If you don't know first aid, call 995 and shout for someone who knows first aid while running to the nearest clinic.\n\nDon't move the casualty unless he or she is in an unsafe location.",
          "score": 127
        },
        {
          "text": "Sometimes, the best course of action if you are not an expert is to do nothing.",
          "score": 52
        },
        {
          "text": "make sure the place is clear of hazards, whether to move the victim or not depends on their injury and whether they're in immediate danger, if you're not trained then you shouldn't do anything unless it's cardiac arrest, bad CPR is better than no CPR",
          "score": 46
        },
        {
          "text": "If its an accident, sometimes the best thing to do is not move the casualty unless you’re trained. Sometimes they may suffer spinal injury from the accident and moving them may cause further harm. Remember to protect the casualty from further harm and try to do some crowd control. Try to make sure theres someone who is able to guide the ambulance to the victim. \n\nIf you’re slightly trained and comfortable enough, check on the victim for any signs of life. At the very least, check for pulse. If theres none, perform cpr and make sure someone get the nearest AED.\n\nThats the best thing you can do until professional help arrives. If possible, try to take down the time of the incident, what you see and gather witnesses to understand the mechanism of injury. This will help the doctors in ED to decide on their treatment plan later on.",
          "score": 36
        },
        {
          "text": "From my limited knowledge (BCLS)\n- Call for ambulance if not activated yet \n- Check level of consciousness\n- Check for breathing &amp; pulse\n- If both absent do cpr aed until paramedics arrive\n- Otherwise try to stop any bleeding\n- Sometimes if accident until too jialat best not to touch the victim as it can potentially make their injury worse",
          "score": 30
        },
        {
          "text": "This really broke my heart. There need to be more tests in driver’s aptitude regularly. Regardless of how many years of experience they have. ",
          "score": 22
        },
        {
          "text": "\nMost injuries should not be moved or touched at all and wait the professionals, one move could lead to death.\n\nWhat we can do is redirect the traffic to make space for paramedics, a video will help too to get the perpetrators details. Honestly there’s nothing much we can do, leave it to the professional",
          "score": 21
        },
        {
          "text": "Am a FirstResponder and this based on my limited knowledge.\n\n1) If no pulse no breathing, continue to do CPR + AED until AB arrives. But in this case, as the victim is a child, I would probably just call 995 and video call them to see what I can do to help the child. CPR on adults and child are vastly different.\n\n2) if you’re nearby the accident site and no clue on what to do, you can RUN to take the AED, and pass it to people who knows what they are doing. Every second counts.",
          "score": 18
        },
        {
          "text": "Take up BCLS",
          "score": 15
        },
        {
          "text": "Former NSF EMT here. Do not move the victim in anyway, always assume the victim have spinal injury (unless you are medically trained). When calling 995, be specific with the amount of people requiring medical assistance. Do also inform 995 call centre if the patient is stucked in vehicle or so, this will also activated fire side for extraction. \n\nIf the victim goes into traumatic arrest, start CPR immediately and instruct someone to get AED (if possible).",
          "score": 14
        },
        {
          "text": "Check pulse, if no heartbeat start chest compressions, not too fast and not too slow to the tune of Stayin Alive by the Bee Gees....rescue breathing every 30 compressions. Passive leg raise maybe?\n\nIf bleeding from limbs, torniquet above the wound and write down time of the application.\n\nTry not to move victim as there could be spinal injury to the neck and will be bad and for god's sake dont remove any impalement if there are any",
          "score": 7
        },
        {
          "text": "Quickly call ambulance? Tbh some may be too shock to react? I not sure whether it is safe to move the victim, poor dad just shout and the shock kind of reflect the helplessness and despair 😔",
          "score": 6
        },
        {
          "text": "Do:\n- Call for 995. Report accident. Give precise location (eg. Sembawang Rd/Mandai AVE Junction, lamp post #)\n- Help to redirect traffic to keep victims and yourself safe\n- Provide first aid if you are medically trained (BCLS/CFA), ensure scene is safe\n\n\n\nDon't:\n- Giving casualties water to drink.\n- Move casualties unless you know how to clear D-spine.\n- Put yourself in danger especially ongoing traffic is unable to see you clearly",
          "score": 5
        },
        {
          "text": "actually the best thing u can do (in this situation) has been done by the passerby - calling 995, shading the injured mother and documenting the scene\n\nAlso i took basic first aid training before &amp; learnt that its better to not move/touch victims in case of broken bones that may puncture their internal organs.",
          "score": 5
        }
      ]
    },
    {
      "id": "t3_1qy9bzi",
      "subreddit": "askSingapore",
      "title": "Is burnout and working long hours as a badge of honour normalised in employees in SG?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qy9bzi/is_burnout_and_working_long_hours_as_a_badge_of/",
      "score": 168,
      "num_comments": 63,
      "created_at": "2026-02-07T17:18:22",
      "selftext": "I hear of colleagues humble bragging how late they work and how they burn their weekends. Some talk about feeling burnout. Is this being normalised in employees in SG? ",
      "comments": [
        {
          "text": "The thing is that burnout isn’t just normalised, it’s **valorised**. I guess when you’re raised into believing that studying to the point of exhaustion isn’t just an expectation but something praiseworthy, you naturally extrapolate those ideals into adulthood. You learn to associate hard work not just with the results it produces, but as a performative gesture to signal your moral worth and character. I don’t think that this kind of culture is exclusive to Singapore, but it definitely seems like a lot of our culture in education and parenting plays into it.",
          "score": 137
        },
        {
          "text": "I thought I am burning out then China colleagues teach me what is burnout working like a dog.\n\nI thought I was a dog. Turns out you can be worse than a dog.",
          "score": 121
        },
        {
          "text": "It starts from schooling days, always talking about how they studied till late at night, mugging really hard for this and that. This spills over to adulthood.",
          "score": 62
        },
        {
          "text": "They need to touch grass.\n\nI’m sure they will be very happy about it on their death bed.",
          "score": 58
        },
        {
          "text": "Observation from mature worker, yes, sometimes and I notice this more from either fresh out of school people or old people.\n\nThe young ones have this hyper competitive mindset that they want to prove themselves. The other older people got nothing better to look forward in life, make work their identity.\n\nI know it is not always the case, but typically those with young families tend to want to protect their weekends and after work time.",
          "score": 42
        },
        {
          "text": "If the salary is like work one year and u can retire still ok , if u are just working for median salary and bragging thn bruhhhhh",
          "score": 32
        },
        {
          "text": "Yes, it is being normalised but not everyone. They feel it’s a mark of being useful and hardworking, but honestly has little relation to more productivity. \n\nUsed to know a colleague who thinks OT is a glorified and is somewhat proud of it, even if they absolutely have no urgency or reasons to put in the extra hours. Lowkey felt she thinks she’s better because I always left work before her. Took a peek at her work once and she’s basically just spending the additional hours on excel on formatting and extra complicated formulas which could otherwise be solved with more straightforward solutions.",
          "score": 18
        },
        {
          "text": "The whole SG culture is build from the blood and bodies of people OTing and burning their life away without equivalent pay.",
          "score": 12
        },
        {
          "text": "They are not burnt out. They won’t brag about it if they were. It’s a bad feeling",
          "score": 7
        },
        {
          "text": "This is a boomer mentality. One of the foundations of the phenomenon of sinkie pwn sinkie. Typical CNY topic, millenial complain about work situation in sg, then boomer say millenial nvr work hard enough and last time how hard they work etc,.",
          "score": 6
        },
        {
          "text": "They have Stockholm Syndrome. Next time just tell them that you are sorry that this is the only thing they have more than others.",
          "score": 6
        },
        {
          "text": "If you real brag and say every week you work 10 hours instead of 40, ppl will just be jealous. If you do reverse and work 60 hours people say not badge of honour.\n\nMoral of the story is shut up and don’t say anything just be the most boring singaporean for the normies. For those who know how to enjoy life, find people you like hanging out with and are similar to you. 60 hours? Find others who work 60 hours and suffer together. 10 hours? Find them and take 3-4 hour lunches in CBD together.",
          "score": 6
        },
        {
          "text": "Then they should feel very very proud when they are divorced\n\nIt's also a badge of honour lol",
          "score": 5
        },
        {
          "text": "I HATE colleagues who brag about OT or staying late and I’m glad I have none of these at the moment. It’s really about the culture of the department or company &amp; how much the leaders take wellbeing seriously . If you are in an MNC filled with people from various countries, this would help a lot.",
          "score": 5
        },
        {
          "text": "Back when I was working with Ah Kong, it was. So I quit. These days, my Western boss asks people why they're still in the office at 5pm on Fridays.",
          "score": 4
        },
        {
          "text": "Man, until I went for a biz trip to China. Colleagues there work from9 to 10 and there are still ppl after 10 lol. Kinda make me appreciate Singapore work culture more.",
          "score": 4
        },
        {
          "text": "I dont think it is like a badge of honour. It is more of my life sucks more than urs kinda thing. I never got why ppl say such things, but it’s really the romanticism of suffering.",
          "score": 4
        },
        {
          "text": "Lol depends on your company and people you hang out with. It's frowned upon by mine lol. At the end of the day it's just a job. I'd rather spend long hours with my family",
          "score": 3
        },
        {
          "text": "Just feel that if you work long hours, you will just probably be less productive the next day, and the cycle continues. Using the extra time to sleep is just better. \n\nSadly some bosses just look at your email timings to see if you work late.",
          "score": 3
        },
        {
          "text": "i have one such colleague and only the big boss likes them because of the work produced. the rest of the colleagues are irritated because that person also lowkey expects everyone to work as hard.",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1qy7u7j",
      "subreddit": "askSingapore",
      "title": "Is creating online porn legal in Singapore?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qy7u7j/is_creating_online_porn_legal_in_singapore/",
      "score": 121,
      "num_comments": 72,
      "created_at": "2026-02-07T15:46:21",
      "selftext": "I am genuinely very confused. So there are laws that criminalises the filming of pornography, distribution of pornography, transmitting obscene material via electronic means, etc. \n\nBut there are many Singaporean pornstars here who are making sexual contents. There was a case that a local ‘content creator’ was charged many years ago. Now he is still doing it, and many of the other people are still doing it (both male and female).\n\nSo is it against the law or not? Or is it a case like the law was left up for symbolic purposes like banning porn websites? ",
      "comments": [
        {
          "text": "just do it bro, i fully support you ",
          "score": 292
        },
        {
          "text": "That’s disgusting, where do these content creators upload their videos? Which specific gross site are they on?",
          "score": 110
        },
        {
          "text": "Another one of those things which are illegal but the gahmen can't be bothered to do anything about since it doesn't hurt anyone anyways",
          "score": 95
        },
        {
          "text": "Strictly speaking the making of such films are illegal. The thing is, the legality is one thing but the enforcement is another. Also, the local creators use foreign platforms so the potential argument goes that they should be subject to the laws that the platform is based out of. And the authorities so far have chose not to crack down on any female creators. Even with Titus Low, his charges was on transmitting obscene materials via electronic means resulted only in a fine. His jail term was him violating a police order on his OF account.",
          "score": 32
        },
        {
          "text": "It’s only against the law if you are male",
          "score": 17
        },
        {
          "text": "I would think what you do behind closed doors they won’t really bother you unless a kaypoh complains. \n\nHowever if you transmit and distribute, as long as kaypoh complaint, you’re fucked.",
          "score": 16
        },
        {
          "text": "This is disgusting! \n\nWhere are these uploaded so we can avoid them",
          "score": 10
        },
        {
          "text": "Care to share the name of these actors? Need to make sure I stay away from them",
          "score": 5
        },
        {
          "text": "Is it common also for singaporean guys to leak private sex videos?",
          "score": 2
        },
        {
          "text": "Law and enforcement separate",
          "score": 2
        },
        {
          "text": "It's against the law making porn and distributing it here, but we cannot enforce our laws overseas. But then again, we enforce our law when people return to sg after taking weed overseas. So... double standards applies.\n\nShout out to our own sinkie \"tits fake af\" porn queen dj sakura making her jav debut in MOGH-001",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1qyt9dv",
      "subreddit": "askSingapore",
      "title": "Age 39. Average cpf. Little to no savings. Yearly Contract job. Am I in trouble? How much should I save monthly to afford 2 room flexi moving forward.",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qyt9dv/age_39_average_cpf_little_to_no_savings_yearly/",
      "score": 75,
      "num_comments": 133,
      "created_at": "2026-02-08T07:45:02",
      "selftext": "Now as I turn 39 this year.  Yes is time to think about my future. Ya I am worried because due to my spending habits. I do not have any savings.\n\nYup before i have people reply that about I should have save when I was younger. I get it. I have no regrets about my spending. It was fun. Yolo. I didn't really think about the future when I was young.  I just a happy go lucky person in general. But is never late than never right? to realise I should start saving.\n\nCurrently I have 110k in my cpf OA. Earning 4k a month before cpf.  but is a yearly contract  role.  No savings.\n\nDon't plan to have kids. Single.  \n\nI looking to get a 2 room flexi bto. I check the bto projects cheapest is around 130k to 200k? \n\nHow much should I save monthly moving forward ? Or am I fucked :(. ",
      "comments": [
        {
          "text": "It's never too late to start. $4k is decent for a single  person. What you need to do now is take that new found realization and drive into your work.\n\nPeople will start looking at that shift of attitude and  will see you are keen to do the best you can do. Then finding a good job will follow when people notice.\n\nYou can do it!",
          "score": 124
        },
        {
          "text": "You are not screwed, but you are a little late, which means discipline is more important now.\nWith approximately $110k in CPF and a monthly income of $4k as a single with no children, a 2-room Flexi BTO is still possible. The main concerns are financial flow and employment stability, not CPF. \n\nThe first objective should be to create a 6-month emergency reserve (about $15,000. A realistic objective is to save $650-800 every month, best is to set that aside whenever you pay comes in. Once that cushion is in place, you can divert your savings to housing and retirement. \n\nSaving, like spending, may become an addiction. As the numbers increase, the mentality switches from \"can I afford this?\" to \"do I really need this?\" It's not too late, but the margin for error is narrowing, so spending patterns must change going forward.",
          "score": 44
        },
        {
          "text": "Hey there. $110K in CPF is healthy to buy a 2 room flexi. Downpayment of a BTO is 25%, can be paid in CPF fully. You should be able to get some grants too. So long as you're working, your CPF moves. \n\n\nAfter CPF, your take home salary is $3.2K. You can try to save 5 to 10% of your salary for a start and slowly increase over time if possible. Once your BTO has MOP-ed, you can consider moving back to your folks' place and rent out your BTO for passive income. \n\n\nJust a few suggestions I can think of. I also didn't save during my 20s and early 30s. But we all start somewhere and it's never too late. ",
          "score": 28
        },
        {
          "text": "What are you spending on? Spending full 3.2k for 1 pax is living quite luxuriously. \n\nLook at your expenses please.",
          "score": 18
        },
        {
          "text": "Your industry easy to find job?\n\nTbh if you manage to get bto 2rm shouldn't be much issue with financing it la. Able to stay with parents indefinitely?",
          "score": 11
        },
        {
          "text": "&gt; I have no regrets about my spending. It was fun. Yolo.\n\nChange your mindset, because you stole from your future self. You stole your ability to retire and you're going to need to work a lot longer because you wasted at least a decade and a half of savings and investing. \n\nIf you don't change your mindset, if you keep telling yourself you don't regret the spending you did, you'll continue this cycle of \"oh I was okay when I was younger, spending this little bit extra isn't going to hurt, YOLO~\" every time you get tempted to buy something unnecessary. You've gotten used to a certain lifestyle without regrets, and without regretting you're going to fall back into the habit again.\n\nThank the Singapore government that you're forced to have CPF, they are saving your older self from your younger self.\n\nLet's say you die at the average age of 83. That's 44 more years you have on this earth. How much do you want to be able to spend at that old age? Assuming an inflation rate of 4%, you'll need around 3.5MILLION dollars for those 44 years if you keep spending at the same rate of what is the equivalent of 3.2k a month at this point. Assuming you work until 65, with your salary increasing at a rate of 4% a year (meaning no meaningful increment), you'll only earn 1.5million by 65, less than half of what you need. \n\nIf you halve your spending and spend 1.5k a month, you'll need 1.6million over those 44 years. Still less than what you'll earn, but that shortfall can be covered by your CPF. You might even be able to pay off a 2 room HDB if you invest your savings. \n\nChange your mindset, halve your spending and you'll be okay. You won't be rich, but you'll be okay. If you want to be able to spend more, you need to earn more.",
          "score": 11
        },
        {
          "text": "If you are staying with parents and no kids or wife, what are you spending your 3.2k take home salary on?",
          "score": 8
        },
        {
          "text": "\n\nHelped you do the math. You can use the hdb loan calculator yourself, to get a more accurate result.\n\nhttps://homes.hdb.gov.sg/home/calculator/budget\n\n110k cpf.\n40k grant.\nIf you buy resale, Extra 40k grant. \nLoan up to 253k over 20 years if you want pay everything via cpf. 1.4k monthly repayment, which same amount of oa contribution for a 4k monthly wage. \n\nSo you can get a house cost up to about 440k if you don't want to wait and want to go resale.\nIf you willing to wait bto, house cost up to 400k. But of course the house will be a lot cheaper.\n\nThis just the max you can get. You don't have to buy the upper limit. Cuz the more expensive the house the longer you need to work to repay everything. \n\nI think you need to save up about $5k cash?\n\nIf I'm wrong anywhere, feel free to help me correct.",
          "score": 7
        },
        {
          "text": "singles bto about 60k enough liao for first payment",
          "score": 6
        },
        {
          "text": "Personally i think you should start balloting now. I was like you too, concerned with savings and only started trying when i was 39. The thing is, it is not easy getting a queue number and i only managed to book a flat when i was 40 after my 2nd try (you really have to manage your expectations because it's very competitive for 2 room bto and unless you are ok with standard, i think it'd be even harder if you have set your sights on Plus or Prime areas). \n\nDue to the loooong runway till the completion of my bto project, the HDB officer shared that i might even be able to fully pay off the flat by the time it's finally done (don't even need to get any HDB loan). \n\nSo start trying now. Just bear in mind that you'd have to pay an additional +$15k on top of your flat cost  (i call it the singles tax). You can consider taking HDB's optional component scheme (opting in flooring, wash basin/shower fittings) which is another add on $3.3K - $3.5K (?) if you want some cost savings (&amp; are not picky). All payable through cpf.\n\nI think it puts things into perspective once you get your flat. I was like you too, yolo-ing etc. But after the booking, my mindset changed and i looked at my finances and started saving. \n\nMy only regret was not trying sooner for a flat, everything else is secondary. So all the best, OP!",
          "score": 6
        },
        {
          "text": "If you are single, it’s fine really, no obligation to anyone but your parents. I draw 5 digits but when I net off monthly obligations for family and kids and see what’s left for myself,  it’s not far off from your current state , with more taxes to bear\n\nBe optimistic about it",
          "score": 6
        },
        {
          "text": "You’re not actually that screwed if it’s just about getting a BTO. It’s more that you have to wait long long because singles flat is always over-subscribed. And after that retirement is what you need to save for.\n\nNormal people get a mortgage and don’t pay for a flat in full cash!\n\nFor the minimum 25% downpayment, you might already have enough in CPF OA? The 110k is total CPF or just OA? \n\nYou need to use a mortgage calculator to check, and also take note of how CPF allocation to OA goes down when you get older (https://www.cpf.gov.sg/service/sfc/servlet.shepherd/document/download/069IW00000DZMxZYAX)\n\nbut at least initially, you should be able to pay the mortgage entirely from future CPF OA contributions. Even if it’s a 200k flat and you need to loan 150k, mortgage payment for a 20 year loan (say your key collection is when you’re 45) is ~$800. For a 4k salary hob with CPF, about that much should be going to OA each month. \n\nAlso, you shouldn’t need to loan that much because you will be accumulating CPF OA in the years when the flat is being built.\n\nThe most important thing is you need to stay employed! The CPF policy is designed to protect people like you from your spending habits. \n\nGo ahead and apply for HDB HFE income assessment, do your research on how the system works, and start balloting. It is not easy to get singles BTO at all, and you may need to get resale which will be considerably more expensive.",
          "score": 4
        },
        {
          "text": "You actually have enough to buy already. The down payment is 15% of the purchase price. 2 rooms are super affordable the difficulty is you getting it because supply is really little.",
          "score": 3
        },
        {
          "text": "You’re not fucked for sure. Never too late! Try to save abt 1k-1.5k a month for now. When it’s easier, increase your amount.  Put it in an account that can help you earn a little on the amount being saved too - a little goes a long way. Use ocbc 360 because their requirements to meet are quite straightforward and got different categories. Just hit the monthly credit salary and save at least $500 a month and can earn some interest. Any intention to look for better paying jobs? Something that is perm so at least got bonus and stuff.",
          "score": 3
        },
        {
          "text": "It’s not easy to just flip and become totally different in your spending ways, but sometimes when you are up against a wall you have no choice. It doesn’t sound like you are there yet so it’s good you are thinking about this. Take it one solid step at a time, try targeting a savings amount for one month, and if you hit that, go for another month, and then aim for doing it for 3 months and so on. You need to save up something for 1-2 years to get yourself to a more solid foundation to enable your other choices",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1qy8rwh",
      "subreddit": "askSingapore",
      "title": "Has anyone had an experience on Karung Guni knocking/ringing everytime he comes around?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qy8rwh/has_anyone_had_an_experience_on_karung_guni/",
      "score": 53,
      "num_comments": 31,
      "created_at": "2026-02-07T16:43:20",
      "selftext": "Context: My late grandmother passed away and we were moving and clearing her stuff out. We found a stash of alcohol like Cognac, XOs and martels about 10+ bottles. One of them being martel bleu. We heard the usual karung guni horn and my mum called him up to enquire on the alcohol. The uncle came into my house and looked through it and gave my mother an absurd price of $200. After hearing that absurd price, my mother instantly rejected it and asked him to leave. The uncle wasn't really willing to leave and started to increase the price to 300 then 500 then 700. I came out and heard the commotion and asked the uncle to leave which he eventually did. 3 days in a row after that, he kept coming back, knocking the door and ask if my mum wants to sell the alcohol. Which me and my mum expressively rejected and told him he was very dishonest with the price and to never come back. He came back every weekend after that but stopped for a few months. Just today, he came ringing my house doorbell again.\n\nHas anyone experienced this? I feel like this is harassment at this point. I would like to hear everyone's opinions/comments.",
      "comments": [
        {
          "text": "next time you hear him don't open the door just call 999 and let them pick him up",
          "score": 42
        },
        {
          "text": "Use those doorbell Camera. Record how often he visits. Make sure you also record that you tell him that he's not welcome and for him to not visit anymore.",
          "score": 28
        },
        {
          "text": "Why not tell the uncle that you sold to a higher offer?",
          "score": 16
        },
        {
          "text": "the karung guni at my house area is quite pushy too.. asked us if we have phones or laptops to sell, we said no but won't take no for an answer keep asking us another 2-3 times to search for phones and laptops in our house to sell.",
          "score": 9
        },
        {
          "text": "Your grandmother so cool, kept all this alcohol 😁 \n\nWhy not just for  the price you really want to sell eg $5000?\nAsk him not to come unless he wants to buy at that price?",
          "score": 6
        },
        {
          "text": "You didn’t do anything wrong and you don’t owe him politeness or explanations. Once someone ignores firm boundaries, it’s reasonable to escalate and protect your household",
          "score": 2
        },
        {
          "text": "Just tell him all the alcohols have been sold. He gian all those bottles only.",
          "score": 2
        },
        {
          "text": "Just ignore or just tell him off",
          "score": 1
        },
        {
          "text": "So how much would the Marin blue fetch",
          "score": 1
        },
        {
          "text": "He's not dishonest. U asked him for a price. He started low... Shocker.. Did u tell him how much you would sell them for? Maybe you inflated your price.... ®️😎",
          "score": -12
        }
      ]
    },
    {
      "id": "t3_1qy5rep",
      "subreddit": "askSingapore",
      "title": "What are some small f&amp;b businesses to try?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qy5rep/what_are_some_small_fb_businesses_to_try/",
      "score": 41,
      "num_comments": 27,
      "created_at": "2026-02-07T13:49:53",
      "selftext": "I really want to support more small f&amp;b businesses because I’m getting a bit of chain-restaurant-fatigues. I am looking for locally-owned stores but as long as it’s a small business I’m down! It can be any cuisine, hawker or non-hawker, I just want to try sth where the people really put love into their food :)\n\nMy recommendation:\n\nChoc a Bloc for amazing chocolate cakes! ",
      "comments": [
        {
          "text": "Overbrod at anchorpoint. Great Scandinavian food by a local.",
          "score": 20
        },
        {
          "text": "butter and cream seems very nice\n\n(pretty sure they arent really small anymore but)",
          "score": 15
        },
        {
          "text": "Alex creation cafe in Bugis Cube #03-13 formerly he was a chef from a well known hotel. His Instagram name is alexcreationcafe",
          "score": 11
        },
        {
          "text": "Hecha at Everton Park! they are working really hard and receptive of opinions 🙏🏻",
          "score": 7
        },
        {
          "text": "Mad Roaster Coffee, Spicy Wife, Jack Marzoni's (closing tomorrow but coming back with a new concept), will add on when I recall more",
          "score": 4
        },
        {
          "text": "Three's A Crowd at Tampines West.\n\nPretty good waffles and ice cream.",
          "score": 4
        },
        {
          "text": "If you want malay/halal food, i would definitely recommend “Warung Indonesia”. I ate at Toa Payoh and was so shiok! I heard that they’re opening a new store in Bedok South as well! Cant wait 🔥🔥",
          "score": 2
        },
        {
          "text": "Carrara cafe at Bukit Merah.  It's very near ABC market, tbh their pastas and main dishes are just ok but their waffles and gelato are great!",
          "score": 1
        },
        {
          "text": "If you’d like to try American soul food, would really give Nitty Gritty at Outram Park a shout :) Was so nice I’ve been there thrice. Just brought my mum for her birthday dinner there!\n\nAnother place I regularly go to for Indonesian is THREE at Toa Payoh, run by three sisters. Their ayam bakar is like no other!",
          "score": 1
        },
        {
          "text": "The Weirdoughs at Serangoon Avenue 4.",
          "score": 1
        },
        {
          "text": "It's great that you want to support small businesses! In a place like Singapore it really makes a difference for them so kudos for that. \n\nI'm a fan of Plain Vanilla or Edith Patisserie when it comes to desserts. There are other home-made brands such as Nothing Butter who offer bulk order and collections. Tina's cafe is a good example for a local and family-owned meals too and the best part is that they employ people in need so it truly feels like your supporting a community!",
          "score": 1
        },
        {
          "text": "I like the frosted chick for cakes!",
          "score": 0
        },
        {
          "text": "tiktok shop natcookies, twobakeboys, tash tish tosh",
          "score": -1
        }
      ]
    },
    {
      "id": "t3_1qy77yz",
      "subreddit": "askSingapore",
      "title": "Specific phone number keeps calling my house phone",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qy77yz/specific_phone_number_keeps_calling_my_house_phone/",
      "score": 21,
      "num_comments": 12,
      "created_at": "2026-02-07T15:10:20",
      "selftext": "ive been receiving calls from a handphone number (telco SingTel) non stop for the past month from a specific phone number. every time the person calls, they don't speak. i am able to see the phone number because it shows up on my house phone. im really confused and at a loss of what to do.\n\ni've called back to this number with them picking up, multiple times. i only do this when they start their call frenzy. when they pick up, they will say hello hello and i just dont respond. they will stay on the line for a minute or so.\n\nP.S. please understand that i'm not doing this because i want to harass the person back. i'm doing it so it \"blocks\" the person from calling me back because my house phone does not support blocking of numbers.\n\nthe reason why i dont speak is because im not sure if this is one of those scam calls where they record your voice and use AI to use my voice for scams.\n\ni've added this number on my phone just so i can see their whatsapp DP, and it is of an indian guy.\n\ncan someone advise me on what to do? should i report it to SPF, will they be able to help? has anyone had the same experience? :(",
      "comments": [
        {
          "text": "Why don't you submit this number to Scamshield and see what it says?",
          "score": 33
        },
        {
          "text": "Report in spam shield and see what it says.\nThen contact your teleco about it. They should have call logs.\nIf they demand police report, go make police report and inform your teleco.",
          "score": 17
        },
        {
          "text": "Caller id Numbers can be faked. But when you call back it’s the real number that you call. So in the end you may be harassing someone that didn’t harass you.",
          "score": 11
        },
        {
          "text": "Can block the number?",
          "score": 6
        },
        {
          "text": "Get desk phone unit that have redirect function like those in office. Than just redirect the number into some random free toll number",
          "score": 1
        },
        {
          "text": "Doom is calling you. He wants you to fight in the battle world against Iron Man and the X-Men !\n\nOur entire timeline lies in your hands. Don't fail us",
          "score": -17
        }
      ]
    },
    {
      "id": "t3_1qyw3c7",
      "subreddit": "askSingapore",
      "title": "How easily can one immerse in Mandarin in Singapore",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qyw3c7/how_easily_can_one_immerse_in_mandarin_in/",
      "score": 20,
      "num_comments": 49,
      "created_at": "2026-02-08T09:52:43",
      "selftext": "I (21M, Canadian) will be coming to Singapore in August for an exchange semester at Nanyang Technological University. Im very much looking forward to it.\n\nI am a finance student and I am interested in international finance and foreign capital markets especially. I speak five languages already and want to learn Mandarin in a nation where Mandarin is an official language. I plan on taking an introductory course and hopefully using it in day-to-day as much as possible.\n\nMy question is, how much would I be able to practice everyday? Is Mandarin widely spoken? Can I sign up for supplementary classes independant from NTU to really perfect it? I can take more advanced levels upon my return and can keep learning on my own, I just thought the best way to start would be in Singapore. How comfortable could I realistically get in 4-5 months?",
      "comments": [
        {
          "text": "You just hang out with Mandarin speakers which there is plenty here.\n\n\nThere are two types of Chinese crowd here. Those who speak mandarin and those who speak English. \n\n\nYou see the cliques and listen to which language they are using. Then approach the Mandarin speaking clique to make friends telling them, you want to force yourself to speak mandarin and need Mandarin speaking friends.\n\n\nMany hawker stalls owners and mom and pop shops are Mandarin speakers so you can practice placing orders or asking for info in Mandarin too. \n\n\nHow fast you pick up depending on your ability. I live here and am chinese and learn Mandarin for at least 16 yrs of my life and I still can barely speak it. My parents are hopeless in Mandarin too. I think I inherited from them inability to be good at Mandarin. We only speak English at home. ",
          "score": 39
        },
        {
          "text": "Mandarin is widely spoken amongst older generations, like retirees, but many people here speak dialects such as teochew/hokkien which is very different to putonghua. The intonation of mainland Chinese putonghua is quite different to that in Singapore. Here people also speak Singlish which is a transliteration of Chinese phrases into English and some Malay.\n\nThe biggest challenge is that regular Mandarin speakers might not want to converse with you in Mandarin. You'll find Mandarin speakers amongst service staff at food courts etc, but they're not necessarily going to appreciate it like they do in mainland China and might even think it's a bit odd, as they can all speak English here. I don't think you will learn much in Singapore in 4-5 months, unless you take classes.",
          "score": 36
        },
        {
          "text": "Holdd up. A few things;\n\n1. Mandarin is an official language but if you are looking for good/fluent mandarin of the textbook type, very few locals speak that way. And perhaps some of the foreigner Chinese does.\n2. Locals speak a jumbled version of local-mandarin that has a mix of english/malayu/mandarin. You can learn this its fun but it will sound horrid if you travel to lets say Hong Kong/China and try to speak this.\n3. Youths/younger adults like your peers in Uni most likely speak English almost exclusively. Unless you insist they do mandarin with you (some of local chinese can't speak mandarin), or make some Chinese (Mainland) friends. But interactions at friend-level unlikely to get you to learn much really....Not to mention local culture tends towards staying home/ introverted activities. So if any of your friends seem reluctant to hang-out, its 100% normal behaviour. \n4. Your best bet probably to join any of the social activities clubs at the school. So you get a constant stream of forced interactions. Or you get a Chinese girlfriend.",
          "score": 12
        },
        {
          "text": "I think it is not easy to immerse because everyone can speak English. It’s better if you go China or Taiwan to be honest.",
          "score": 9
        },
        {
          "text": "Bro come to a country where none of the languages are properly spoken. 😆",
          "score": 7
        },
        {
          "text": "I’ll be honest with you that the Mandarin language that Singaporeans speak is not the kind of Mandarin that Mainland Chinese speak. As a Singaporean who can speak pretty proper Mandarin, I have to code switch a little to speak Singaporean style Mandarin to Singaporeans here. Haha. Do I think you can improve your Mandarin here? Yea! Especially with older people, or intentionally put yourself in situations that speak Mandarin. But just be acutely aware that the Mandarin here is different from what Mainland Chinese speak and it isn’t the most standard Mandarin haha. But good enough to let all Mandarin speakers understand you well :)",
          "score": 6
        },
        {
          "text": "Get a chinese girlfriend",
          "score": 3
        },
        {
          "text": "Join a Chinese company. Trial by fire",
          "score": 3
        },
        {
          "text": "Yes it’s widely spoken here.\n\nIn fact, it’s the unofficial working language here. Majority of Hawkers, retail staff and F&amp;B outlet staff (which are mostly foreign workers from china and Malaysia), all speak mostly mandarin only.  \n\nMandarin is used very commonly during work meetings / pantry / lunch conversations too even tho you might think it will be done in English.\n\n It’s very common for Chinese people to come here not know a single word of English and they can easily get a job and live normally here. This should tell you how widely Mandarin is spoken here.",
          "score": 2
        },
        {
          "text": "Mix around more with the PRC cliq in NTU, force yourself to speak only in Chinese/Mandarin with them. They will love it.",
          "score": 2
        },
        {
          "text": "Many people can speak mandarin but few converse in the language unless forced to (e.g. communicating with PRCs). Your best bet is volunteering at an old folks home or daycare centre.",
          "score": 1
        },
        {
          "text": "Aside from the other helpful suggestions here, you can consider joining a mandarin speaking club or activity (Chinese debate, China business networks etc) whether inside or outside your university (the larger Chinese clan associations have activities open to the public). Not sure if you are religiously inclined but if so, there are many Chinese speaking churches and Buddhist societies (maybe others). Last but not least, there are Chinese speaking drama and theatre groups. Maybe you can attend their performances or even join their group :)",
          "score": 1
        },
        {
          "text": "Talk to the Chinese speaking international students",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qyf3jx",
      "subreddit": "askSingapore",
      "title": "Is Valley Park a good condo in River Valley?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qyf3jx/is_valley_park_a_good_condo_in_river_valley/",
      "score": 11,
      "num_comments": 17,
      "created_at": "2026-02-07T22:25:07",
      "selftext": "My family is considering buying or renting there/ is it somewhere that is pleasant and would go up in value over long term? \n\nAnyone know people who live there? \n\nIt’s a 999 year leasehold (as good as freehold). ",
      "comments": [
        {
          "text": "I lived there. It was great, massive units and with the brown line it’s super convenient. 3 supermarkets within walking distance and Zion is a great hawker. Tennis courts and squash courts too is nice.\n\nIt’s a very big space so you don’t notice that there are a lot of units.\n\nMy only recommendation is don’t get a unit that faces the pool. As soon as school is out, it’s loud as shit",
          "score": 9
        },
        {
          "text": "It’s a good development. Management runs a tight ship. Pretty safe",
          "score": 8
        },
        {
          "text": "Not a fan, as there are too many units. Personally prefer smaller projects. \n\nBut, noise-to-resident ratio definitely much better than HDB despite fairly similar density.\n\nTake it if u enjoy having many neighbours. It’s pretty affordable too.",
          "score": 5
        },
        {
          "text": "Very old. Security guard past 2 years quite good. Expats love that condo for rental.\n\nGot other stuff to comment on but I don't wanna say it online, can DM me if you would like to know.",
          "score": 4
        },
        {
          "text": "I visited a couple of unit there to buy. It’s old but the common areas are super well maintained so it doesn’t look like its age. \n\nAs someone pointed out the layout of the units is very odd. The kitchen was at the back with no window. \n\nAlso it’s a bit far from the nearest MRT.",
          "score": 2
        },
        {
          "text": "I know some Japanese families that live there and I also used to work next door at Valley Point Shopping Centre. The units are large, and the condo is well-maintained considering its almost 30 years old. I think there is a good chance it will be sold en-bloc within the next 5 or so years because of its age, size, and location. That can be good and bad. Only issue is that the MRT/Great World is a good 15-minute walk away and it's not really shaded. I think the condo has free shuttle buses. If not, Valley Point Office Tower definitely does for those that work there, but nobody ever checks who's who.\n\nThe Italian - 2it at Valley Point - is awesome. The fact it has been there for a long time - could be 15 years at least - tells you all you need to know.",
          "score": 1
        },
        {
          "text": "Given it sits in sprawling 40000sqm land, and limited supply and current age. Definitely enbloc potential. \n\nAlso the latest d9 new launch prices vs valley park resale price: the price gap should suggest it would be a safe investment \n\nSource: [Realsmart SODA](https://realsmart.sg/share?msg=uJA69mow6YMPUBCBLZ16qvhInK02_1770526626181_1770526626569)",
          "score": 1
        },
        {
          "text": "Buying and renting are different consideration. I think the location is ok but not great as it’s quite a long walk (more than 13 minutes) in the hot sun to Great World mrt and surroundings. The psf seems reasonable but layout seems a little odd if I recall correctly. But when buying property, the most criteria is you like the unit and environment.",
          "score": 1
        },
        {
          "text": "You are talking about Singapore. Real estate will appreciate long term. I mean 10-15 years.",
          "score": -6
        }
      ]
    },
    {
      "id": "t3_1qyxxug",
      "subreddit": "askSingapore",
      "title": "Best way to find a personal trainer",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qyxxug/best_way_to_find_a_personal_trainer/",
      "score": 10,
      "num_comments": 15,
      "created_at": "2026-02-08T11:18:46",
      "selftext": "Unfit af\nDon't want to work out with friends. \n\nWilling to drop abit of cash in this\n\nAny experience with this? ",
      "comments": [
        {
          "text": "It is always better to hire PT from words of mouth, with good reviews and proven track records. Some offer first trial session at a small fee. Try out different one to decide who is more suitable for your needs.",
          "score": 10
        },
        {
          "text": "All gyms have PT, you can ask the front desk for advise.",
          "score": 5
        },
        {
          "text": "Join RT and work out with strangers ",
          "score": 3
        },
        {
          "text": "I feel PT are expensive but a good way to learn proper posture which YouTube may not cover comprehensively. There is someone to spot your posture issues, correct them and plan which muscle group you need more training on. My AF gym are doing rates at $95 per session. Otherwise you should check out if there are any suitable free group classes. Yes PT is expensive but so is other people’s time and money (they need to make a living). Only you can say if the cost is worth it. Start with machines rather than free weights if you are training yourself as this will reduce degree of movement and reduce chances of injury",
          "score": 3
        },
        {
          "text": "Telok Ayer has a lot of private gyms with PTs that works like a tuition centre. You only get to train there with a PT and have a session booked. Depending on which gym, it can range about $140-175 per 1 hour session, usually sold in packages of 10 or more. May have special packages for CNY/special occasions. \n\nUsed to think I could just watch YouTube videos and do it but then I looked a fool and wasn’t sure if I’m working the right muscles.\n\nMost of the private gyms are on weight/fat loss programs which can get pretty tough, so you have to tell them your fitness goals and they’ll cater to you. \n\nUsed to train with OnePT couple years back for about 8 months for fat loss, it was tough and gruelling because they limited my carbs and overall calories down by a whole lot. But I did lose a good amount of fat and went on my own fitness journey. \n\nBut 4 months into training on my own, I had a slip disc, either doing RDL or machine leg press, prolly due to improper form and the weights were too heavy for me. \n\nRecovered and now I’m with Unreal PT, mostly on mobility recovery and muscle gain. I find their programs more sustainable than OnePT, but then again, different goals. \n\nIf you’re comfortable speaking Mandarin can look into a China gym called Zhongtian, heard it’s $980 a month and you can book as many sessions as you want, so if you go 3/4x a week it’s quite worth it. Of course have to book with the trainers, haven’t tried it myself but heard a couple of my colleagues liking their programs. They also have trial class I think. \n\nOh and if you do join a private gym, be prepared to also invest some $$$ on proper food and protein powders and maybe creatine. All the best.",
          "score": 1
        },
        {
          "text": "i had a free 3 PT session when i signed up Fitnessfirst, can give it a try. maybe if you request it might’ve worked.",
          "score": 1
        },
        {
          "text": "Many PTs will offer a free session so I'd recommend reaching out to a few near where you are and seeing who you bond with the most in terms of their training style and personality before committing",
          "score": 1
        },
        {
          "text": "Try Classpass.  Sent you a message on it.",
          "score": 1
        },
        {
          "text": "Personally had trained with Wee Jie from Garage Circuit. Highly recommend him. He’s dedicated n encouraging n will made sure u achieve your fitness goal. Unfortunately I have not trained with him for some years as he left to open up his own gym Garage Circuit so I do not have his current rates. U can check out his ig @wj.see n DM him from there.",
          "score": 1
        },
        {
          "text": "The gym that you work out in usually has a contact list of personal trainers.",
          "score": 1
        },
        {
          "text": "Anytime fitness gym is 3 session for $195. \n\nKinda expensive.",
          "score": 1
        },
        {
          "text": "Brandon from FITLUC. Personally trained with him before and seen results! He’s also very professional and paced well.",
          "score": 0
        },
        {
          "text": "Was Unfit af also, less unfit now thanks to this guy.\n\nhttps://freedomgym.sg/trainers/nicholas-hee/",
          "score": -2
        },
        {
          "text": "Don’t waste your money on them tbh",
          "score": -2
        },
        {
          "text": "Dont waste money. Watch YouTube can learn one. With a bit of grit you can probably progress faster learning yourself than with a PT",
          "score": -4
        }
      ]
    },
    {
      "id": "t3_1qyh8yw",
      "subreddit": "SingaporeRaw",
      "title": "What the driver allegedly said to the pedestrians",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qyh8yw/what_the_driver_allegedly_said_to_the_pedestrians/",
      "score": 615,
      "num_comments": 272,
      "created_at": "2026-02-07T23:51:34",
      "selftext": "",
      "comments": [
        {
          "text": "Fuck this idiot, she has 0 sign of remorse.\n\nAnyone who defends her needs to get their brain checked out at IMH.\n\nUodate: I think Mothership removed the post about her being guilty already…",
          "score": 436
        },
        {
          "text": "There is no picture of her trying to help the poor kid and parent ?",
          "score": 236
        },
        {
          "text": "Can we singaporean stand solidarity to against this type of PRs seriously… they bully people in our own land?\n\nEdit: Idk what kind citizenship she have… Condemning the mentality and their “cultural” way of life being to sg",
          "score": 215
        },
        {
          "text": "As the day passes, this kind of scumbags are making me hate them more and more now it's unbelievable",
          "score": 177
        },
        {
          "text": "“It’s not my fault I am a negligent driver and ran you and your child over TWICE” I hope this woman faces the fullest extent of prosecution, she, the person who gave her a licence, and the parents that did a horrible job raising her should all get jailed. \nShe has very likely murdered a little girl, potentially her mother, and ruined the life of the father. The gal to berate a man as he’s holding his daughter who’s dying in his arms. Even in an accident scenario no normal person would be berating someone as they’re holding their severely injured child. This woman has no empathy, she is psychotic. I hope that woman never sees the light of day, and that the daughter and mother make it out ok. I cannot imagine what the father is going through, I hope he has people around him who can support him.",
          "score": 70
        },
        {
          "text": "If one can behave like this after killing a child, can only imagine her attitude towards our labour laws and colleagues",
          "score": 44
        },
        {
          "text": "https://preview.redd.it/v2mbw55p34ig1.jpeg?width=1440&amp;format=pjpg&amp;auto=webp&amp;s=668dcdc5b1b7a1030ed875e5e67b1b316b563cd9\n\nHere's a clearer version",
          "score": 37
        },
        {
          "text": "As I'm reading I could totally hear her say that. Even her body language is saying it",
          "score": 35
        },
        {
          "text": "I’m frankly surprised nobody bothered to tell her off there and then. \n\nIf I witnessed the whole incident and she was speaking like that to the family, I would have told her to f***k off and leave them alone then and there. If you have nothing useful to contribute and can’t behave like a decent human being, you do not deserve any ounce of dignity or respect. \n\nWanna bet if this had happened in Europe or USA she’ll be behaving that way? I really think sometimes these c3ca bastards think they can walk all over sinkies just because our govt lets them in droves",
          "score": 27
        }
      ]
    },
    {
      "id": "t3_1qyifs0",
      "subreddit": "SingaporeRaw",
      "title": "Photo of the lady driver from the accident scene. Pretty relaxed for someone who killed someone.",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qyifs0/photo_of_the_lady_driver_from_the_accident_scene/",
      "score": 486,
      "num_comments": 101,
      "created_at": "2026-02-08T00:37:24",
      "selftext": "",
      "comments": [
        {
          "text": "Send to mothershit please",
          "score": 217
        },
        {
          "text": "someone find where she works and get her terminated or something 😭",
          "score": 175
        },
        {
          "text": "Doesnt look like someone overcome with guilt. It's amazing she doesn't realize she's 100% going to be spending time in prison. It's just a matter of how many years.",
          "score": 167
        },
        {
          "text": "She’s upset she’s late for her lunch appt",
          "score": 151
        },
        {
          "text": "srsly dun understand how she can be this heartless",
          "score": 132
        },
        {
          "text": "Typical CECA F face",
          "score": 58
        },
        {
          "text": "Prob discussing who's the most expensive and best lawyer to engage.",
          "score": 53
        },
        {
          "text": "Remember the Ramesh case and the Ma Chi Ferrari case? Combine both of them together and you get this lethal combination.\nThank PAP for their ‘astute’ immigration policies to continue to source from these two main pools of aspiring “New Citizens”. 65% somemore lah. Jeffrey and Gan still want more, a lot more of them.",
          "score": 34
        },
        {
          "text": "Find out who the other party is and make sure he is accountable for helping a murderer",
          "score": 25
        },
        {
          "text": "Probably because for her, lives are cheap where she came from. Until it involves her family then she will realise",
          "score": 25
        },
        {
          "text": "Discussing how to make a quick escape outta the country later",
          "score": 19
        },
        {
          "text": "This kind of ego can rot in hell",
          "score": 14
        }
      ]
    },
    {
      "id": "t3_1qya0oa",
      "subreddit": "SingaporeRaw",
      "title": "Please be careful..",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qya0oa/please_be_careful/",
      "score": 483,
      "num_comments": 177,
      "created_at": "2026-02-07T18:00:57",
      "selftext": "We didnt begin today on a good note.. its saddening that a young child lost her life while on a holiday with her parents here. \n\nJust wanted to say please please be very very careful while crossing the road, no matter how small or visible the entire area is.. \n\nWhat happened today could have happened to you , me or any of our loved ones.. \n\nNot all drivers are competent/take the necessary precautions while driving unfortunately. \nSometimes i see drivers turning without using signal lights.. \n\nLikewise as pedestrians, please dont dash across the road , use your phone while crossing , try not to listen to loud music on your earphones while crossing the road.. \n\nBe vigilant of your surroundings...haishh",
      "comments": [
        {
          "text": "I tried to call out the r/Singapore moderators for actively deleting comments about us calling out the CECA driver but instead got permanently banned. The useless moderators just hate Singapore and Singaporeans.",
          "score": 385
        },
        {
          "text": "Reminder that r/singapore is overrun by ceca",
          "score": 152
        },
        {
          "text": "One can be very careful but a reckless driver can still ruin your or your family.",
          "score": 87
        },
        {
          "text": "Enough of us bending over backward to accommodate rapists, scammers, and murderers, \"Be careful this,\" \"Be careful that.\"\n\nThe 65% need to take a hard look at what the country has turned into and reflect on their part in this.",
          "score": 80
        },
        {
          "text": "This is why every time my teen kid goes out by himself or without me, I'll almost always be a broken record and remind him to look out for traffic, PMDs/PMAs included. ",
          "score": 73
        },
        {
          "text": "To people who're saying immigration has nothing to do with good driving and following road rules:\n\n**please search up and watch any documentary or interview conducted in Brampton, Ontario, Canada**, regarding driving and road etiquette. Literally all of them will have scathing remarks, and collectively agree on the absolutely atrocious quality of drivers.\n\nFor those who don't know, that entire town has turned into a completely dominated ethnic enclave of one specific ethnicity. Considering it's one of the **worst places in Canada to drive**, and the specific origin country's road rules/etiquette are absolutely abhorrent, the reason is very clear. \n\nAbsolutely shameful. Congrats 65%, enjoy your CDC vouchers 👏👏...",
          "score": 48
        },
        {
          "text": "In India, you throw a stone, you hit a rapist, murderer or a thief.\n\nWhy do you think they have so many backlog court cases that takes ,10-20 years to clear?",
          "score": 45
        },
        {
          "text": "The incident happened yesterday. RIP to the innocent girl :(",
          "score": 37
        },
        {
          "text": "my mind can't erase that photo of the girl dying in her father's arms as he held her while kneeling on the road ",
          "score": 34
        },
        {
          "text": "Yeah man that’s what I told my mom. Don’t assume drivers will give way to you, even at green light. \n\nJust need to be very aware and careful, including those PMA PMD. Most of the times they just zoom past without giving a shit. I saw it many times. I also kena knocked by PMA/PMD before and left with bruises. If old people kena then lagi worse.",
          "score": 12
        },
        {
          "text": "Thanks for posting this, people need reminders like this even if it feels repetitive. Hopefully it makes someone pause and be more cautious today",
          "score": 12
        },
        {
          "text": "Actually even when all cars have stopped and green man also should not take for granted. I have an experience when i was jogging across the road at night at a pedestrian crossing where i check traffic and everything (Cars all stopped at stop line etc) suddenly a delivery rider just zoom past the red light for vehicles. Almost became a roadkill. Also, quite common for drivers not to stop at pedestrian crossings. Either playing with phones or pretend nvr see u.",
          "score": 12
        },
        {
          "text": "EDMW in Hardwarezone forum seems to have banned/blocked all discussions on this incident. You can't find any of this thread there.",
          "score": 10
        }
      ]
    },
    {
      "id": "t3_1qywtfz",
      "subreddit": "SingaporeRaw",
      "title": "Explaination for CECA behaviour",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qywtfz/explaination_for_ceca_behaviour/",
      "score": 312,
      "num_comments": 132,
      "created_at": "2026-02-08T10:26:10",
      "selftext": "Those who cannot comprehand why the female Ceca driver ran over the victims multiple times, and then get out her vehicle to scold the victims, let me explain the Ceca behaviour.\n\nIn India, the upper caste treat the lower caste as less than human, hence such \"accidents\" are common in their country. The societal system in India allows the upper caste to get away with all kinds of crimes. Now, when a pro-CECA government like PAP shields these people, it further amplifies their ego that they are sovereign and above the law. Previous Ceca cases such as Ramesh Erramalli who worked in JP Morgan with a fake degree, has shown the other Cecas in Singapore that they can abuse people and get away with it. Hence, I have absolutely no faith in the justice system that this Ceca driver would get the appropriate punishments.\n\nOn my part, I don't support any pro-CECA party otherwise I won't be able to sleep at night, the PAP MPs who knock on my door every GE knows that I only have one request, that's to abolish CECA for the collective benefit of Singaporeans, I told them not to bother speaking to me until CECA is abolished, then overtime the door knock stops, because they know this request is impossible to fulfill as it's their fundamental core policy which is existential to their political survival.",
      "comments": [
        {
          "text": "Just to add: Korea and Japan flat-out refused to sign CECA.\nTaiwan too.\nAnd the best part is not even China dare to go near that agreement.\n\nOur scholars in our meritocratic government are the only suckers to jump right into it eagerly. 20 years on, the damaging effects are becoming amplified and the locals are still shouldering the burden and negative repercussions of this ill-fated decision.\n\nMeanwhile, Jeffrey, Gan, SXL (another genius mastermind behind visa-free scheme for PRC syndicates and gangs) are claiming 10 months bonuses, patting themselves on the back for 4.8% GDP growth and rewarding themselves with multi-million dollar salaries. Huat ah!",
          "score": 220
        },
        {
          "text": "Disgusting female driver. Hope she gets the karma and rots in hell.",
          "score": 112
        },
        {
          "text": "justice for the little girl. let's keep this topic active until something is done and the case is not swept under the carpet.",
          "score": 99
        },
        {
          "text": "You forgot the last part. Then over the mother AGAIN!",
          "score": 63
        },
        {
          "text": "I really hope this uproar will lead to authorities taking a much harsher stance on her especially all the anecdotes of her entitled behaviour. Mothershit shld be cancelled as well",
          "score": 44
        },
        {
          "text": "She ROLLED over them multiple times?\n\nIntent to kill right there, \"silence them so they cant speak\" kinda deal",
          "score": 40
        },
        {
          "text": "The biggest mistake of PAP will be turning us into CECApura\n\nFrom first world to third world",
          "score": 30
        },
        {
          "text": "yes.. ceca policy is the worst.. now even want to collaborate to work in space tech.. die liao...",
          "score": 28
        },
        {
          "text": "I hope the Indo family has travel insurance",
          "score": 20
        },
        {
          "text": "This CECA thing is really getting on our nerves… may all the CECA incidents be brought up for the next GE… for the 65% to consider",
          "score": 20
        },
        {
          "text": "Need to explain? Their behavior points to lack of civil mindless and everything is NOT their fault. Still wonder why out G love them so much",
          "score": 18
        },
        {
          "text": "I salute our PHV drivers that go the extra mile to make it known that they are not welcome here by the people",
          "score": 16
        },
        {
          "text": "65% voted for this",
          "score": 12
        }
      ]
    },
    {
      "id": "t3_1qyf9t7",
      "subreddit": "SingaporeRaw",
      "title": "Please stand up more against rudeness in public",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qyf9t7/please_stand_up_more_against_rudeness_in_public/",
      "score": 249,
      "num_comments": 27,
      "created_at": "2026-02-07T22:32:26",
      "selftext": "Was at a neighbourhood mall today and this commotion happened. \n\nA couple with a baby was walking towards the escalator and there were kids running around the area. One of the kids hit the wife who was carrying the baby and still stood in their way playing after that. The husband let out a loud “oi” for them to disperse. \n\nHere comes the ironic part - the dad of the kids (who was just nearby them &amp; looked/sounded south asian) confronted the husband with an aggressive “excuse me?!”\n\nThe husband very firmly told the dad his kids ran into his wife carry the baby but the dad still postures it as if his kids have no fault. The husband shouted back at the dad something along the lines of “handle your kids before others do” \n\nWas quite surprised a local is willing to stand up for himself as we’d usually want to avoid confrontations in public. Hopefully more of this happens so we can stamp out and not normalise rudeness in public. What are your thoughts? ",
      "comments": [
        {
          "text": "Sound like the suspects are usual",
          "score": 126
        },
        {
          "text": "Fucking hate kids from that race. Saw so many instances in public, really wanted to smack",
          "score": 111
        },
        {
          "text": "Good!! Just scold, if they cant discipline their children, then someone else will..\n\n\nP.s. I honestly applaud the moderator of this sub... \nWhoever is behind is genuinely the only one who allows voices to be spoken and heard compared to the other subs here..\n\nEvery other sub, dont even know how they are subs for SG when they are skewed towards supporting/protecting a particular group of people.",
          "score": 62
        },
        {
          "text": "Yes more to standing up against rudeness! \n\nToday something similar happened to me and my husband on the train. I was standing on the train, in the middle of the seats. The seat in front of me opened up, and my husband asked if I wanted to sit. I see a china family signaling for the elder man in their family to sit, so I said to give it to the man. \n\nShortly after, a seat opens up beside his wife (diagonally opposite him) without caring- he stands up, pushed past me (beside me was the pole..) and steps on my foot (I was wearing slippers some more) at the same time and made me stumble, so that he could get the sit beside his wife. My husband had to catch me as I was falling, and this guy didn’t even say sorry or anything- and my husband said “eh uncle” as he saw how hard he pushed past me. I immediately thank my husband for standing up for me. And right after I looked back at the uncle and told him that he pushed and stepped on me in mandarin. He didn’t say sorry or even acknowledge me plsssss",
          "score": 27
        },
        {
          "text": "earlier today, their own species killed someone over a traffic accident and had the audacity to shout at the victim dad. Ccb! giving us all sorts of reason to hate them ",
          "score": 27
        },
        {
          "text": "Normal that people don't like confrontational when they can't even say no.",
          "score": 16
        },
        {
          "text": "Lol hit and never say sorry? One can make a good educated guess on whose kids they are.",
          "score": 14
        },
        {
          "text": "As a father of two I would thank any stranger that put my kids in check in public. They are wild and no matter how many we try to teach civil sense at a young age it may fall on deaf ears. But for a stranger to come in a correct behaviour that will be more impactful",
          "score": 13
        },
        {
          "text": "Freaking hate those parents who don't discipline their kids and just let them scream, shout, run around and disturb others in public. Sometimes they just laugh along with the kids. Selfish and inconsiderate af. Their kids are only cute to them but everyone else dislikes them.",
          "score": 11
        },
        {
          "text": "Can we start by telling the aunties watching dramas on speaker to use earbuds?",
          "score": 11
        },
        {
          "text": "They bring their idiotic behavior and expect others to accommodate. Once saw their kid jumping on the tables with their shoes on in a food court. Which decent human being will allow their child to do that.. seriously hope they a;; get send back, learn manners before allowing them here. ",
          "score": 8
        },
        {
          "text": "not just rudeness.. any unfairness I will stand up!\n\nbut sometimes my *wife* will tell me don't be hero! live to die another day!",
          "score": 7
        },
        {
          "text": "Well done. And i totally agree. Parents don't teach the right manners, the public should. Otherwise, what will become our next generation? I'm also one of those who will ask the kid, what must you say? Manners are so rare these days. Same for adults",
          "score": 4
        },
        {
          "text": "Happened when I was at the woodlands train station customs on the way back to sg, whole group there, one kid run around the queue and accidentally knock the pole with the retractable belt, the belt came loose and snap back causing a loud sound. \n\nI just commented \"sia suay\" to my wife , one of the lady in the group heard it, she and her friend started to argue with me. When we mentioned one of lady actually cut queue , the lady gave excuses then they started to comment our size (we are fat) , say we low education lah, we do not have kids wouldn't understand one lah etc, the kicker was the guy in the group who was at the front, suddenly turn around and said \"shame on you for arguing with a lady!\" Like wtf bro.\n\nBest thing is the kid's parents kept quiet the whole time, it's the friends in their group that argued with us.",
          "score": 4
        },
        {
          "text": "Just last week i saw a mother letting her kid rode a bicycle around outside of the condo gateway. As a car from the main road before turning into condo guard post for entry. The mother stood still and just stare without a single survival tendency to shout or alert her child riding freely at the road. \n\nI don’t understand how people able to have kids with this kind of mentality.",
          "score": 3
        },
        {
          "text": "Idw say ah but I think we all know.....",
          "score": 1
        },
        {
          "text": "I would apologize to the parents and hold my kids back and explain them to say sorry as well. I hope you don’t generalize everyone though. Plenty of nationalities here in SG and plenty of races here in SG. \n\nIt’s spreading this negativity that hurts the sentiments. It wouldn’t be fair for me to call all Singaporeans as ignorant, racist and lazy cunts … but if I apply the same logic as some people who use the terms “monkeys are monkeys” … I’d be lowering my standards.",
          "score": 1
        },
        {
          "text": "Nah sinkies have become a lot more confrontational liao.  \nSee the mrt case.  \nI also know ppl stop siamming in mrt, just bang only",
          "score": 1
        },
        {
          "text": "&gt;Was quite surprised a local is willing to stand up for himself as we’d usually want to avoid confrontations in public. Hopefully more of this happens so we can stamp out and not normalise rudeness in public. What are your thoughts?\n\nNot before Sinkies are accused of racism and causing trouble.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qyhn20",
      "subreddit": "SingaporeRaw",
      "title": "Chinatown accident has G in damage control mode",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qyhn20/chinatown_accident_has_g_in_damage_control_mode/",
      "score": 224,
      "num_comments": 51,
      "created_at": "2026-02-08T00:06:36",
      "selftext": "First, just want to say it's an extremely tragic accident, involving a young innocent life, whose life took a 180 degree turn, going from joy to having her life cut short in an instant by an irresponsible and selfish driver. rip little one\n\nOn the other hand, can tell someone in the G is nervous with the Chinatown incident, HWZ (owned by SPH Media) thread on the accident deleted, Mothership coming out with a PR piece to defend the driver. at least reddit and meta remain independent. ",
      "comments": [
        {
          "text": "I checked zaobao’s IG page even the boomers aren’t defending the driver anymore and calling out their bluff about the driver feeling guilty.",
          "score": 133
        },
        {
          "text": "haa. now they keep blocking ppl access to EDMW. a lot of migrated to reddit they have lesser controls. funny how things work in sg. ",
          "score": 121
        },
        {
          "text": "Mothership needs to do some investigative journalism vs just taking the hubby word for it. How come never print the Vietnamese tourist word for balance? This Mothership is really mothershit lo!",
          "score": 98
        },
        {
          "text": "any CSI done on both driver and husband? are they part of some high management? \n\nedit: seems like they have lawyered up and powerful enough to get HWZ to remove related stuff",
          "score": 65
        },
        {
          "text": "she from the most populous country on earth is a murderer no doubt. MURDERER!",
          "score": 32
        },
        {
          "text": "Hwz was bought so it could be killed off.\n\nG scared to see the online anger",
          "score": 31
        },
        {
          "text": "This issue is blowing up to show that the governments CECA policy is failing and the imported talents are causing trouble and discrediting the government's policy. The Singapore government, always doubles down, never admits mistakes. Because that's the typical Chinese/asian arrogance and narcissistic culture. Never ever admit mistake, always double down on the mistake to show it's right.",
          "score": 29
        },
        {
          "text": "Because it involved CECA. If the driver is a regular SG man they'll allow it to run, our ministers would even comment on how tragic this is and criticise Singaporeans for the road accidents.",
          "score": 24
        },
        {
          "text": "Wish we know who they really are… who can share information so we can help her LOL",
          "score": 22
        },
        {
          "text": "Doesn’t matter. It will all come out. This is an international incident.",
          "score": 17
        },
        {
          "text": "Its their favoured CECA... this is Lawrence's We society",
          "score": 13
        },
        {
          "text": "Pathetic place with pathetic mods...",
          "score": 12
        }
      ]
    },
    {
      "id": "t3_1qywrtg",
      "subreddit": "SingaporeRaw",
      "title": "Kudos to the lady in blue and man in black for helping by calling for emergency services. The lady driver on the other hand still tried to argue.",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qywrtg/kudos_to_the_lady_in_blue_and_man_in_black_for/",
      "score": 220,
      "num_comments": 38,
      "created_at": "2026-02-08T10:24:12",
      "selftext": "",
      "comments": [
        {
          "text": "The husband still claimed that his wife called the ambulance when this photo shows otherwise.\n\nThe wife showing lack of remorse and blaming the girl and her parents while two passerby being the one calling for emergency services",
          "score": 135
        },
        {
          "text": "Disgusting behaviour from the lady driver. Hope she gets the punishment and rot in hell",
          "score": 126
        },
        {
          "text": "Body language shows arguing .. she can argue with a man who just lost his young daughter by her wheels ? Da heck",
          "score": 59
        },
        {
          "text": "Post the video, we will make sure it beat the leopard crawl viral video!!!!!!\n\nhttps://www.reddit.com/r/SingaporeRaw/s/ChoOD8mQ1Z",
          "score": 40
        },
        {
          "text": "This neh woman really aggressive, heard she scolded the father loudly said it was not her fault the mother and kid dashed onto the road . 😡😡😡🤬",
          "score": 20
        },
        {
          "text": "What happened to the video they took it down",
          "score": 18
        },
        {
          "text": "There’s another photo of the same man using tissues to try to stop the bleeding on the girl’s head",
          "score": 12
        },
        {
          "text": "Go to jail ceca!👍🏻❤️🌟",
          "score": 12
        },
        {
          "text": "Jail and deport",
          "score": 7
        },
        {
          "text": "In their blood to argue",
          "score": 4
        },
        {
          "text": "So end of story the female driver who ran over got off just like that ???",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1qyic5l",
      "subreddit": "SingaporeRaw",
      "title": "Link to the post with the original video. Don't see what others say. Watch it yourself and judge. The driver still fking go tug on the kids hand??? Tf?????",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qyic5l/link_to_the_post_with_the_original_video_dont_see/",
      "score": 216,
      "num_comments": 46,
      "created_at": "2026-02-08T00:33:19",
      "selftext": "Translation using chatgpt from the vietnamese witness see the last line wtffff\n\nLink to the post with the original video. Don't see what others say. Watch it yourself and judge. The driver still fking go tug on the kids hand??? Tf????? \n\nhttps://www.facebook.com/share/v/1K1Gmp2Rrj/\n---\n\n“This morning I walked to the market to buy coriander to make bánh mì. Because I forgot to order coriander, I went to the market and then witnessed a traffic accident this morning in the car park of the Chinese temple near Maxwell MRT. This was the first time in my life that I witnessed a traffic accident happen right in front of me, at around 11:40 a.m. today.\n\nI was the first person walking behind a mother and her child. A woman was driving out from the car park and did not look to her right for pedestrians; she only looked to her left while turning right. Then the front wheel of her car ran over the little girl’s stomach, after that it ran over the mother’s leg, and then the woman suddenly stepped hard on the accelerator, causing the rear wheel to run over the mother’s stomach. I don’t know why she accelerated so quickly right after exiting the car park. I guess they’re tourists. I can help and might be the one to testify in the traffic accident.\n\nI saw very clearly that when the accident happened, the front wheel had already run over a person and the driver should have felt that there was something under the car, but she did not stop to get out and check. Instead, she accelerated strongly and continued driving, which caused the rear wheel to run over the mother’s stomach one more time. I panicked and cannot remember clearly whether the rear wheel ran over the little girl again — I really can’t remember because I was in shock from what happened in front of me.\n\nAt the time of the accident, the woman’s husband was not with her — only the mother and child were there, and I was walking behind them. About two minutes later, the husband ran over and held the little girl in his arms. When the front wheel ran over the little girl, she rolled three times and ended up lying face down on the ground, with her mouth bleeding heavily. The father used a water bottle and a camera to block the blood, but the blood from the child’s mouth flowed a lot and spread all over the road.\n\nWhen the woman got out of the car from the back to look, she then realized that she had caused the accident. She shouted loudly at the father who was holding his daughter, and she tried to explain that she was not at fault.”\n",
      "comments": [
        {
          "text": "This is why many people are losing trust in tabloids like Mothership, instead of sympathy for the girl, they choose to push out irresponsible narratives about how the driver feels guilty instead.",
          "score": 198
        },
        {
          "text": "LTA, SPF so many cctv. confirm can show us the footage.\n\nSee how big is this issue only lor. if involved in national crisis, cfm investigate gao gao .",
          "score": 70
        },
        {
          "text": "This woman must have some huge connections to people on top.",
          "score": 37
        },
        {
          "text": "Any video that is not on facebook? it is not public",
          "score": 24
        },
        {
          "text": "&gt;The driver still fking go tug on the kids hand??? Tf?????\n\nmaybe she is a \"doctor\" imported by PAP",
          "score": 24
        },
        {
          "text": "I can't fuking believe it...what kind of monster is this.",
          "score": 22
        },
        {
          "text": "You can all email llydia.chua@mothership.sg to tell her what you think of her article ",
          "score": 21
        },
        {
          "text": "Hopefully this lady had given her a full statement to the police and any evidence that would bring justice the family.",
          "score": 15
        },
        {
          "text": "st gt mthershp by d balls ✊🎾",
          "score": 7
        },
        {
          "text": "Thanks for sharing proper evidence unlike mothershit.",
          "score": 6
        }
      ]
    },
    {
      "id": "t3_1qyiwyc",
      "subreddit": "SingaporeRaw",
      "title": "How drivers’ licenses are obtained in India based on YouTube Comments. I wonder if they could explain the accident in Chinatown",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qyiwyc/how_drivers_licenses_are_obtained_in_india_based/",
      "score": 144,
      "num_comments": 31,
      "created_at": "2026-02-08T00:56:12",
      "selftext": "",
      "comments": [
        {
          "text": "Wait till you hear how their pilot got their licenses.",
          "score": 62
        },
        {
          "text": "Well this case is more stupid than this easy test if the eyewitness article is true. Allegedly the driver only looked left while turning right, ran over the girl and mother with the front tires and did not realise it and accelerated anyways and ran over them again with rear tires. \n\nThis is not passing an easy test matter. This is borderline mentally impaired.",
          "score": 44
        },
        {
          "text": "That's why when all these third worlds come, they should be subjected to the same stringent test",
          "score": 16
        },
        {
          "text": "Previously a mum allow his son to drive, SLL2173R, don’t think I see any news on that?",
          "score": 10
        },
        {
          "text": "NZ cracked them down with 358 licenses revoked.\n\nWidely reported worldwide except in Singapore..\n\nhttps://www.theaustraliatoday.com.au/indian-origin-truck-drivers-caught-in-nz-licence-crackdown-after-false-or-altered-documents-uncovered/",
          "score": 8
        },
        {
          "text": "so did LTA or TP verify her driver's license?",
          "score": 7
        },
        {
          "text": "Uni same also. Just need to download and print.",
          "score": 5
        },
        {
          "text": "Lol same as how they got their degrees. But doesn't matter can still hold high paying jobs that singaporeans unqualified to do",
          "score": 4
        },
        {
          "text": "And we hire them to be doctors and tech professionals",
          "score": 3
        },
        {
          "text": "![gif](giphy|11uYyAmGgTWwGQ)",
          "score": 2
        },
        {
          "text": "Still got ppl say they show up for the test cos no money to pay the bride.",
          "score": 2
        },
        {
          "text": "I wonder how their doctors get licenses too, since we gonna hire doctors from them",
          "score": 2
        },
        {
          "text": "Why am I not surprised. Alibaba way of doing things. \n\nThere was even an incident of a south asian pilot caught with fake license",
          "score": 2
        },
        {
          "text": "Going to get my medical degree in India by prescribing medicine to randos",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qytkz1",
      "subreddit": "SingaporeRaw",
      "title": "Anyone knows her? Who’s this Ilyda Chua",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qytkz1/anyone_knows_her_whos_this_ilyda_chua/",
      "score": 125,
      "num_comments": 104,
      "created_at": "2026-02-08T07:59:20",
      "selftext": "",
      "comments": [
        {
          "text": "Karma will get llydia for writing and publishing lies. Nothing good will come out of it",
          "score": 198
        },
        {
          "text": "\"The girl is dead but hey Singapore look! They're repentant so please be kind and forgiving to our Master Race okay?\"",
          "score": 102
        },
        {
          "text": "Ilyda Chua\nIlyda Chua is a Senior Writer at Mothership, where they contribute news and longform features and manages Mothership's Telegram channel. Their background includes communications roles in public sector organizations, including the National University Health System (NUHS) and the National Research Foundation Singapore. At NUHS, Ilyda served as a Communications Senior Executive (Content). At the National Research Foundation Singapore, they held positions as Corporate Communications Assistant Head and Corporate Communications Senior Officer, contributing to public affairs and media relations efforts.\n\nEarlier in their career, Ilyda gained experience in media and content creation through various internships and contributor roles. These included positions at Art Market as Manager, Content, at The Ministry of Communications and Information as an Information Policy Division Intern, at Singapore Press Holdings as an Intern Journalist, and at Heart Media as a Contributor",
          "score": 90
        },
        {
          "text": "Went to JC at JJC with her. Didnt like her from day 1. Very annoying and guai lan in general. When I saw she was the person who wrote this article, wasnt the least bit surprised",
          "score": 68
        },
        {
          "text": "Probably someone grooming to be part of the white in 2030? This is her brownie points at trying to curry favour with them",
          "score": 66
        },
        {
          "text": "How does she sleep at night?",
          "score": 50
        },
        {
          "text": "It’s mothershit. I don’t really expect much from them",
          "score": 49
        },
        {
          "text": "Wonder how she sleeps at night - downplaying the whole incident and trying to paint the lady as guilty when photos and videos clearly show otherwise. \n\nThere is evidence and eyewitnesses of the indian lady pulling the poor little girl’s arms and berating the father. The indian lady was also seen quickly trying to prata that she is completely innocent and not at fault.",
          "score": 29
        },
        {
          "text": "I hope when she writes this, she write with her heart check and ethics check. Karma runs deep and hope her family approves of this",
          "score": 12
        },
        {
          "text": "Indonesia take note",
          "score": 12
        },
        {
          "text": "My son told me a couple of years ago that JC students regard Mothership as the most important and credible source of news!",
          "score": 12
        },
        {
          "text": "https://sg.linkedin.com/in/ilyda-chua-15711b141",
          "score": 10
        },
        {
          "text": "Mothetshit!\n\nAlways can find grammatical errors or phrases that doesnt make sense in their articles",
          "score": 9
        },
        {
          "text": "Guilt lj lah. She kan the hubby till song song...pui",
          "score": 8
        },
        {
          "text": "Fker downplay the incident sia.",
          "score": 8
        },
        {
          "text": "Maybe ask her who asked her to write the article. And then ask that someone who ask Mothershit to write the article",
          "score": 7
        }
      ]
    },
    {
      "id": "t3_1qyyh27",
      "subreddit": "singaporefi",
      "title": "Support Engineer in Finance: How do I break into the next salary bracket?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qyyh27/support_engineer_in_finance_how_do_i_break_into/",
      "score": 8,
      "num_comments": 14,
      "created_at": "2026-02-08T11:44:24",
      "selftext": "Hey all, I’m a Support Engineer in the finance world. I want to stay in this industry but need to start planning my next move to increase my TC (Total Compensation). \n\nShould I stay on the technical track and climb the engineering ladder, or is the real money on the business/functional side of things?\n\nIf you’re in finance, what’s the most \"recession-proof\" and high-paying skillset you’ve seen lately? Thanks!\n\nQuestions\n\n• For those who moved to the business side, do you miss the hands-on technical work, and was the pay jump worth it?\n\n• What niche technical skills are most valued in Finance right now? (e.g., FIX protocol, Python for automation, Cloud migration experience?)\n\n• In your experience, is it better to move to a 'Buy-side' firm (Hedge Funds/PE) or stay with the big 'Sell-side' banks for career growth?",
      "comments": [
        {
          "text": "You are actually in the intersection of 2 industries - IT and finance.  And unfortunately, support is at the lower end of the value add curve.\n\nAs a retired IT person, I will tell you that the most valued skill for IT service providers is domain knowledge, i.e. finance where you are concerned.\n\nConsider a lateral move to a service provider company.  This can be a product company with services arm (e.g. SAP) or services company (e.g. Accenture).  The move up to executive rungs in these companies lands in the $400k-$500k at junior ranks.",
          "score": 4
        },
        {
          "text": "Why not FPGA and HPC, since you mentioned FIX that would imply networking stuff is involved. \n\nHigh bandwidth and low latency.\n\nOne decode (to decode fast you need a demux hardware etc to work out things) that FIX packets at light speed, FPGA works out he next compute then route it out etc.",
          "score": 3
        },
        {
          "text": "Private investment. Hedge Funds.",
          "score": 3
        },
        {
          "text": "Engineering won’t have good salary in sg. Especially technical people will always get paid less than those managing. I give you an example, in my field the TC of someone doing technical work in a private co might be earning 70k as a new grad. But the equivalent new grad in a gov role could be earning 80k, but they don’t do any technical work, just approving design and witnessing validation tests.",
          "score": 2
        },
        {
          "text": "Work where your skills contribute to a high margin section of its core business’s sales.\n\nMake the pivot to Delivery and Service Sales in big tech. From there the sky’s the limit.",
          "score": 1
        },
        {
          "text": "Stay sell side - you need to do alot of networking to promote. You would need typically 2-3 endorsement from directors to get promoted at later stages such as managerial role. \n\nGo buy side - you will probably work in a much smaller team (2-4 pax) so you need to be really flexible and adaptable. If you are good you will probably get a decent pay and decent compensation. \n\nIf you can get promoted to higher rank, stay sell side. If not buy side and move between buy side firms",
          "score": 1
        },
        {
          "text": "What's your current JD now? And why Finance sector",
          "score": 0
        },
        {
          "text": "C++",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qy99ix",
      "subreddit": "singaporefi",
      "title": "Where are you all putting temporary liquidity?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qy99ix/where_are_you_all_putting_temporary_liquidity/",
      "score": 6,
      "num_comments": 31,
      "created_at": "2026-02-07T17:14:08",
      "selftext": "For context I have 100k in IBKR, (50k invested 50k cash), and an additional 60k liquid in Local banks. \n\n1.5years working but considering between a BTO/EC in the next few years and hence need to save for the hefty downpayment.\n\nSeeking opinions on what to do with the spare liquidity? MMF? Short term Bonds? Non volatile indexes? ",
      "comments": [
        {
          "text": "Anyone else kinda cringe at this guy calling spare cash \"temporary liquidity\"",
          "score": 63
        },
        {
          "text": "DBS multiplier for me",
          "score": 23
        },
        {
          "text": "Depends on your spend and see if you can easily qualify for HYSA interest rates. Currently they are slightly higher than MMF for some of them.",
          "score": 5
        },
        {
          "text": "You can consider \n\n(1) savings account where you credit your salary to e.g. OCBC 360, UOB One, DBS Multiplier. \n\n(2) Singapore Savings Bonds (Limit of $200K, take up to a month to withdraw)\n\n(3) Short-term bond fund/etf e.g.  LionGlobal Short Duration Bond ETF which can be bought in IBKR but there's slight volatility\n\n(4) Money market fund where you can obtain cash within a few working days. ",
          "score": 3
        },
        {
          "text": "If you are flexible on whether you buy a house or not then just invest as usual. If you definitely are buying a house then mmf",
          "score": 2
        },
        {
          "text": "5% in bank, rest in equities",
          "score": 2
        },
        {
          "text": "Not in this situation myself, but I would do short-term bonds, maybe some Pimco GIS Income Fund if I'm feeling greedy. PS you can buy the institutional class of Pimco in IBKR for lowest fees, even lower than Endowus. Search by ISN (which you get from the Endowus website) as IBKR names it weirdly. ",
          "score": 2
        },
        {
          "text": "Btc.",
          "score": 2
        },
        {
          "text": "High yield savings account.",
          "score": 1
        },
        {
          "text": "Your 50k cash with ibkr is in usd or sgd? Be aware your cash with ibkr as a us broker may be subject to US estate duties",
          "score": 1
        },
        {
          "text": "Uob one for 150k is good enough buffer for me",
          "score": 1
        },
        {
          "text": "Downpayment for a car",
          "score": 1
        },
        {
          "text": "See where Google invest in, put money where it is going. Thanks me 5 years later if you manage to listen and retire.",
          "score": 1
        },
        {
          "text": "EMLC (emerging markets investment grade bonds on local currencies). The returns are super solid",
          "score": -9
        }
      ]
    },
    {
      "id": "t3_1qyenw0",
      "subreddit": "singaporefi",
      "title": "TDSR",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qyenw0/tdsr/",
      "score": 0,
      "num_comments": 10,
      "created_at": "2026-02-07T22:06:27",
      "selftext": "Help me out here:\n\nMe and my wife have a monthly mortgage of $4000 and it deducts from my bank account:\n\nScenario A: If we both have 50-50 share, do i declare my monthly loan as $2000 when applying for loan to calculate TDSR?\n\nScenario B: If ownership is 30% (me) and 70% (wife) do i declare my monthly loan as $1200 when applying for loan to calculate TDSR?\n\nThanks!",
      "comments": [
        {
          "text": "What are you trying to hide? When they ask for statement, everything will be shown",
          "score": 7
        },
        {
          "text": "Because you are so generous and also so honest, the whole $4,000 is attributed to you as you are paying 100% of it.\n\nIf you weren't so generous and also not so honest, it can go down to 50% attribution since you and wifey are co-owners of the existing property and housing loan. You need to be able to convince your banker that your wife pays half of it though.",
          "score": 5
        },
        {
          "text": "This is based on title deed, not what you declare. \n\nIf you falsely declare, that is something else. These things can easily be verified.",
          "score": 2
        },
        {
          "text": "You planning to pay 20% ABSD and also can afford 55% downpayment for concurrent 2nd mortgage? If not most of the time ur name should be already out of first ppty, normal TDSR should apply.",
          "score": 1
        },
        {
          "text": "What other loan are you trying to get next, and will that loan be only in your name?",
          "score": 1
        },
        {
          "text": "Hi, you might not be aware, but FI stands for financial independence, not financial indebtedness.",
          "score": 1
        }
      ]
    }
  ]
}