{
  "schema_version": "raw_scrape_v1",
  "report_id": "2026-02-21",
  "scraped_at": "2026-02-21T13:43:00.110048",
  "subreddits": [
    "singapore",
    "askSingapore",
    "SingaporeRaw",
    "singaporefi"
  ],
  "total_posts": 40,
  "total_comments": 386,
  "posts": [
    {
      "id": "t3_1r9t22r",
      "subreddit": "singapore",
      "title": "Oh wow this is really cool",
      "url": "https://old.reddit.com/r/singapore/comments/1r9t22r/oh_wow_this_is_really_cool/",
      "score": 1230,
      "num_comments": 54,
      "created_at": "2026-02-20T19:37:07",
      "selftext": "That's really cool and uniquely Singapore.\n\nThank you so much. Wishing all a happy Lunar New Year, Blessed Ramadan month, and a nice weekend.\n\nNamaste.\n\nYour post body must contain at least 200 characters.",
      "comments": [
        {
          "text": "Chinese New Year is always an interesting holiday as it’s the only holiday in Singapore that’s really more of a racial holiday and than a religious one.",
          "score": 342
        },
        {
          "text": "Some Chinese pray at Hindu temples too because they believe the Hindi deities are part of the cosmology of deities.",
          "score": 123
        },
        {
          "text": "The indian temple at waterloo st has a pot outside its entrance for everyone to burn incense",
          "score": 84
        },
        {
          "text": "Gong Xi Fa Cai and Ramadan Mubarak. On the other hand I wish we had more public holidays in the 2nd half of the year. Till June we have one per month and then afterwards there's only National Day, Deepavali and Christmas ",
          "score": 49
        },
        {
          "text": "Really really heartening to see this in our home❤️‍🩹",
          "score": 41
        },
        {
          "text": "There's a similar banner outside Ba'alwie Mosque just off Bukit Timah Road. Didn't have time to take a pic of it. ",
          "score": 26
        },
        {
          "text": "Could use more PH, everyone loves PH",
          "score": 18
        },
        {
          "text": "There’s this hindu temple called Sri Krisha temple in waterloo street, its right beside a buddhist temple and they have the buddhist prayer stand right infront of the temple",
          "score": 17
        },
        {
          "text": "Makes me think; do Chinese Hindus exist? In sure there could be but how rare is it\n\nEdit: thank you all for the knowledge!",
          "score": 17
        },
        {
          "text": "One of my favourite temples. I love this picture",
          "score": 5
        }
      ]
    },
    {
      "id": "t3_1r9qe40",
      "subreddit": "singapore",
      "title": "About 22,000 civil servants to get pay rise of between 2% and 9% from August",
      "url": "https://old.reddit.com/r/singapore/comments/1r9qe40/about_22000_civil_servants_to_get_pay_rise_of/",
      "score": 193,
      "num_comments": 77,
      "created_at": "2026-02-20T17:01:07",
      "selftext": "",
      "comments": [
        {
          "text": "Not sure if some think this is the annual raise or something. This is likely to be on top of the usual annual raise in April. \n\nAnd in the previous off-cycle raise, higher end % raise went to lower level workers. I expect it to be the same for this one.",
          "score": 100
        },
        {
          "text": "There are about 87k civil servants, according to MOF. If only 22k is getting this, it seem to be about pulling up those at the bottom.",
          "score": 68
        },
        {
          "text": "Waiting for the JLB comments",
          "score": 52
        },
        {
          "text": "2% is truly pathetic",
          "score": 47
        },
        {
          "text": "Means for diploma level and lower only??",
          "score": 23
        },
        {
          "text": "What is \"Competitive\"???",
          "score": 20
        },
        {
          "text": "So … MX12 and above (degree holders) dont have?",
          "score": 11
        },
        {
          "text": "&gt; adjusts them when necessary to “broadly keep pace with, but not lead, the market”\n\nIn other words, it helps those who are currently being shortchanged",
          "score": 11
        },
        {
          "text": "&gt; Public servant Raman Kathavarayan, 53, said he is happy about the salary adjustment, which will help him fund his children’s education, given that one of his two sons just entered polytechnic.\n&gt; \n&gt; The mechanical maintenance supervisor, who **takes home about $2,000 a month**, said it will also help him cope with the rising cost of living as the family’s sole breadwinner.\n\nI know there will probably be a lot of comments about JLB, etc. but wtf $2k/mth as a 53-year-old is really quite low. \n\nAnyway this news only affects 22,000 of the 154,000 officers in the public service which is like 13% of the staff. Not a terribly big deal and I'm glad it'll at least help Mr Kathavarayan. \n\nAlso, since the service employs Singaporeans, I can't say I'm unhappy that raises are going to locals. Can't complain about people getting a pay raise when I made my own decision to not join the public service right. To me it's like doing arts in uni then complaining that your friend in tech gets paid more.",
          "score": 6
        }
      ]
    },
    {
      "id": "t3_1r9ubnc",
      "subreddit": "singapore",
      "title": "2-room resale flat in Queenstown's 'SkyParc @ Dawson' sold for record-breaking S$695,000 in Feb. 2026",
      "url": "https://old.reddit.com/r/singapore/comments/1r9ubnc/2room_resale_flat_in_queenstowns_skyparc_dawson/",
      "score": 118,
      "num_comments": 85,
      "created_at": "2026-02-20T20:41:29",
      "selftext": "",
      "comments": [
        {
          "text": "Why buyer, WHY?? \n\n$700k can buy 4room resale or 5room resale lei!!! \n\nWhy you buy a tiny 2 room???? \n\nWEI SHE MO??? Dawson is good, but THAT GOOD MEH??",
          "score": 182
        },
        {
          "text": "Looks like I can sell my 3 room for 1mio in due course",
          "score": 48
        },
        {
          "text": "Even the so called slum estate 2 rooms are in the 450-500k range",
          "score": 25
        },
        {
          "text": "Man this 2 room is on par with my flats resale value in Punggol, and I live in a 4 room ffs.",
          "score": 25
        },
        {
          "text": "Something is really awry with public housing policy.",
          "score": 25
        },
        {
          "text": "Buyer sets a precedence, everyone follows by example. And then the government sets BTO prices again based off resales and says no issue.\n\nI think the housing prices are seriously out of control at this point.",
          "score": 19
        },
        {
          "text": "2 rm going for 700k HAHAHAH",
          "score": 18
        },
        {
          "text": "Can’t say 2 room is worthless anymore",
          "score": 17
        },
        {
          "text": "No fucking way.",
          "score": 6
        },
        {
          "text": "crazy, just crazy..",
          "score": 6
        },
        {
          "text": "The one closer to MRT..SkyResidence @ Dawson is going to MOP end of this year.. get ready for more shocking prices",
          "score": 5
        }
      ]
    },
    {
      "id": "t3_1r9pkss",
      "subreddit": "singapore",
      "title": "Cat B COE Priced Lower Than CAT A",
      "url": "https://old.reddit.com/r/singapore/comments/1r9pkss/cat_b_coe_priced_lower_than_cat_a/",
      "score": 115,
      "num_comments": 35,
      "created_at": "2026-02-20T16:08:52",
      "selftext": "\nDid I see wrongly or results not finalised yet? Why is CAT B cheaper than CAT A? Was this because of the recent PARF changes?\n\nBut even with that change why does CAT B drop so much in value, so much so that it's cheaper than CAT A now. ",
      "comments": [
        {
          "text": "Too many premium cars downgraded to CAT A",
          "score": 73
        },
        {
          "text": "don’t worry, showrooms will be swarmed tomorrow and the price will magically launch up again",
          "score": 65
        },
        {
          "text": "HAHAHAHAHAHAHA, not done by PHV bidders btw",
          "score": 37
        },
        {
          "text": "Many EVs were competing in Cat A segment as Cat A COE was cheaper ..\n\nBut it’s out of balance now .. EVs will start to go CatB now cos it does not make sense that I can get a more powerful car now at a cheaper COE. Market forces will balance this equilibrium back",
          "score": 34
        },
        {
          "text": "Time to monitor 🦎\n\n![gif](giphy|mao3nYUP6aOZFbsXpI|downsized)",
          "score": 16
        },
        {
          "text": "Yeah very efficient price discovery, no funny business going on here.",
          "score": 15
        },
        {
          "text": "Introducing Cat A+. \nMore expensive than Cat A but less premium than Cat B.",
          "score": 14
        },
        {
          "text": "yes, PARF rebate change announced in budget impacts CAT B cars a lot more than CAT A. the higher the value of your car, the more ARF you need to pay",
          "score": 12
        },
        {
          "text": "Clearly system is broken for way too long",
          "score": 9
        },
        {
          "text": "Cat B is the new poor people car",
          "score": 9
        },
        {
          "text": "Just scrap the cat nonsense , find a system that will maximise the COE price and be the hero of pap and some crazy people who think the higher the Coe the lesser cars .",
          "score": 6
        },
        {
          "text": "With cat b coe price reflecting a buyers adjustment of total cost of ownership from reduced parf rebate, think we see changes in car price lists going forward to reflect this.",
          "score": 5
        },
        {
          "text": "parf rebate cap (starting this round of bidding) affects large cars more, so less people buying large premium cars = cat b coe went down.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r9xe5u",
      "subreddit": "singapore",
      "title": "Balestier Khalsa comeback to beat Geylang 5-2",
      "url": "https://old.reddit.com/r/singapore/comments/1r9xe5u/balestier_khalsa_comeback_to_beat_geylang_52/",
      "score": 88,
      "num_comments": 11,
      "created_at": "2026-02-20T22:52:09",
      "selftext": "",
      "comments": [
        {
          "text": "SHINZOOOOOUUU SASAGEYO!!!",
          "score": 49
        },
        {
          "text": "SHINZOOOOOUUUUU WO SASAGEYO!!!",
          "score": 37
        },
        {
          "text": "![gif](giphy|WhL5HFWam1RBkD9g33|downsized)",
          "score": 11
        },
        {
          "text": "Hala Tigers!!",
          "score": 6
        },
        {
          "text": "What sport is this",
          "score": 6
        },
        {
          "text": "Kelong Lelong game. I was hoping for some crazy table tennis score like 11-6 after first half but alas wasn't to he",
          "score": 6
        },
        {
          "text": "First half was crazy, raining goals left and right and end to end, second half was a bit of a snoozer but nice to see Gavin Lee watching on",
          "score": 4
        },
        {
          "text": "Noor Ali out",
          "score": 2
        },
        {
          "text": "ATK 100\nDef 0",
          "score": 2
        },
        {
          "text": "Geylang were shellshocked. Masahiro and Hafiz and Harith and Darren and Katusa and Ignatius and the rest of the Balestier team played well but I still think the Balestier coach must go. He's lousy.",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1racujb",
      "subreddit": "singapore",
      "title": "59 motorists punished for traffic offences including queue jumping at Woodlands Checkpoint",
      "url": "https://old.reddit.com/r/singapore/comments/1racujb/59_motorists_punished_for_traffic_offences/",
      "score": 54,
      "num_comments": 10,
      "created_at": "2026-02-21T08:40:39",
      "selftext": "",
      "comments": [
        {
          "text": "Well deserved. These buggers make life worse for everyone (including themselves) by delaying buses and other traffic just because they insist on being selfish. \n\nHope the penalities increase to make them think thrice",
          "score": 34
        },
        {
          "text": "Deserved. Queue cutters insist on going to your lane even at the expense of a possible accident. Fuck them.",
          "score": 21
        },
        {
          "text": "These motorists should not only be fined heavily but also make to make a U Turn and join the queue from the rear again.\n\nThey are inconsiderate idiots that thinks other people's time isn't important, only theirs are. F them!",
          "score": 14
        },
        {
          "text": "No jail no talk",
          "score": 5
        },
        {
          "text": "Those idiots that dive bomb for every small little gap to enter then it's on you to react in time to not hit them.",
          "score": 4
        },
        {
          "text": "Orbie gd",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1r9rovd",
      "subreddit": "singapore",
      "title": "Mobility scooter prices may rise by up to 15% ahead of new registration rules, say retailers",
      "url": "https://old.reddit.com/r/singapore/comments/1r9rovd/mobility_scooter_prices_may_rise_by_up_to_15/",
      "score": 53,
      "num_comments": 40,
      "created_at": "2026-02-20T18:18:58",
      "selftext": "",
      "comments": [
        {
          "text": "Dear able-bodied people,\n\nPlease go everywhere by BMW. \n\nBMW = Bus, MRT, Walk.\n\nIf you have no medical problems and insist on using PMAs, you are stupid lazy bums. I hate you, I despise you, and you will forever be lower than me.\n\nI have hated your kind every since one of you almost knocked my kids down and screamed at them for being in your way.\n\nScrew you all.\n\nAnd screw you for making legit PMA users pay the price.",
          "score": 53
        },
        {
          "text": "If black market cheaper scooters becomes more common place then more fine money to collect ",
          "score": 36
        },
        {
          "text": "Time to reintroduce the very old [Class 1 driving licence](https://invalidcarriageregister.wordpress.com/files/2009/05/1977-invacar-model-701.jpg) for motorised wheelchair transport.\n\nThen, introduce a CAT F COE for motorised wheelchairs. /s",
          "score": 21
        },
        {
          "text": "Introduce COE for scooters /s",
          "score": 10
        },
        {
          "text": "Once the mobility scooter comes under onemotoring, it will be subjected to traffic rules and fines.",
          "score": 7
        },
        {
          "text": "Thanks to those trash people that abuse it. ",
          "score": 5
        },
        {
          "text": "These retailers always fear mongering….😱",
          "score": 4
        },
        {
          "text": "I hope mobility scooters require the equivalent of COE and OBU (extremely high cost of ownership + ability to track anywhere). All the goons speeding around or using them as battering rams is very aggravating. Having a medical certification to own a scooter is pointless if enforcement is difficult/impractical. Currently, ebikes need a \"license\" plate but there are so many either without plates or with plates that are difficult to see which makes taking video evidence impossible. If the enforcement really works there wouldn't be so many; COE and OBU for ebikes as well.\n\nI also disagree with differentiating PMDs from PMAs. Both can be operated by complete idiots. I'm sure we've all seen videos/pictures of elderly using PMAs on the roads; being old and having a genuine medical reason to use a PMA doesn't give anyone the right to be a complete idiot.",
          "score": 3
        },
        {
          "text": "Sadly, no enforcement means this is nothing to worry about for them.",
          "score": 1
        },
        {
          "text": "No road test meh? 😁",
          "score": 1
        },
        {
          "text": "COE goes up. I happy. PMD tio pwn. I happy. \n\nOh Reddit, I do love you so!",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rafkny",
      "subreddit": "singapore",
      "title": "Audrey Fang death: Family seeks to keep suspect Mitchell Ong in jail longer - CNA.",
      "url": "https://old.reddit.com/r/singapore/comments/1rafkny/audrey_fang_death_family_seeks_to_keep_suspect/",
      "score": 46,
      "num_comments": 10,
      "created_at": "2026-02-21T10:46:12",
      "selftext": "What happens now ?\n\n\nTo meet 200 characters requirement: The family of Singaporean Audrey Fang, who was found dead in April 2024 with more than 30 stab wounds, has asked a Spanish court to keep suspect Mitchell Ong in custody for longer.\n\nSpanish news outlet La Verdad reported on Saturday (Feb 21) that Ong is approaching two years in remand and that the lawyer representing the victim's family has asked the investigating judge to keep him detained, citing the risk that he could evade justice if released.",
      "comments": [
        {
          "text": "wow it's been so long, wonder why investigations are taking so long",
          "score": 27
        },
        {
          "text": "He's gonna get away with it isn't he",
          "score": 6
        },
        {
          "text": "Hopefully justice is served",
          "score": 5
        },
        {
          "text": "If it happens in Singapore the murderer would have been charged and sentenced by now. RIP Ms Fang. And to her bereaved family, our hearts are with you.",
          "score": 1
        },
        {
          "text": "Maybe couldn't decide which stab was fatal aka cod and the sequence of the stabs. Just joking. But no incentive for Spanish court to speed up",
          "score": -20
        }
      ]
    },
    {
      "id": "t3_1radj7q",
      "subreddit": "singapore",
      "title": "'Aircon weather' in Singapore: What's behind the rainy, cool week?",
      "url": "https://old.reddit.com/r/singapore/comments/1radj7q/aircon_weather_in_singapore_whats_behind_the/",
      "score": 19,
      "num_comments": 5,
      "created_at": "2026-02-21T09:11:04",
      "selftext": "",
      "comments": [
        {
          "text": "The article mentioned 3 phenomena causing the rainy weather of the CNY period: \n\n- La Nina\n\n- Madden-Julian Oscillation (MJO)\n\n- Northeast Monsoon\n\nBut the Dec-Jan period had both La Nina and Northeast Monsoon conditions but it was unusually dry compared to usual Dec-Jan periods over the past few years. \n\nSo does this mean the main factor is the MJO? Seems like the MJO is significant enough to alter rain-favourable conditions (La Nina, NE Monsoon) isn't it?\n\nEdit. To add to it, it wasn't that there weren't any monsoon and cold surges this winter; they actually appeared in early Nov (affecting Hat Yai and Penang) towards Jan (multiple cold surges pushing cold air down to Taiwan and Central Thailand) but even though the winds blew down towards Singapore, they never brought enough moisture to cause rains or monsoon surges here.",
          "score": 9
        },
        {
          "text": "Definitely a welcome break from the haze",
          "score": 3
        },
        {
          "text": "Well lets enjoy it while it last.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r9qcxo",
      "subreddit": "singapore",
      "title": "A-level exam results to be released on Feb 27",
      "url": "https://old.reddit.com/r/singapore/comments/1r9qcxo/alevel_exam_results_to_be_released_on_feb_27/",
      "score": 20,
      "num_comments": 8,
      "created_at": "2026-02-20T16:59:14",
      "selftext": "",
      "comments": [
        {
          "text": "All the best to everyone!\n\nRemembered having to collect mine while botak but it was what it was.",
          "score": 18
        },
        {
          "text": "Throwback to the day when I found a student who leapt to his death during A levels results day. All the best to everyone but whatever it is, remember this is but one of many many chapters in your life",
          "score": 11
        },
        {
          "text": "Inb4 Alvin Tan annual A Level post on social media",
          "score": 10
        },
        {
          "text": "all the best guys",
          "score": 5
        },
        {
          "text": "Good luck y’all!!❤️‍🩹",
          "score": 4
        },
        {
          "text": "Ok?",
          "score": -15
        }
      ]
    },
    {
      "id": "t3_1r9yk5m",
      "subreddit": "askSingapore",
      "title": "Should I lie to my family about my salary?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r9yk5m/should_i_lie_to_my_family_about_my_salary/",
      "score": 207,
      "num_comments": 127,
      "created_at": "2026-02-20T23:36:12",
      "selftext": "Recently started my first job after graduating and somehow my parents have yet to ask me about my salary. They aren't terrible with money, but let's just say they don't seem to have concerns with rising COL despite being fairly low earners (like they look at median fresh grad income of 4.5k and think degree holders live like kings). So I'm not sure how their behaviour/lifestyle will change if I tell them.\n\nAlso my relatives will confirm ask what I'm making next CNY (just nice this year I was sick so didn't attend). Has anyone had consequences for revealing your true salary?",
      "comments": [
        {
          "text": "Always under report, that’s my experience. There’s a chance that people might feel entitled to your money if they know you’re making a decent living.",
          "score": 407
        },
        {
          "text": "please don't tell anyone how much you're actually making. if not you might eventually become the defacto person people expect to help for family financial matters. seen it happen to friends and even myself",
          "score": 227
        },
        {
          "text": "My salary has been 3k to my relatives for more than a decade.",
          "score": 92
        },
        {
          "text": "nope... my parents know how much I make and what's my net worth LOL... know what they told me? Told me to rest and enjoy life more instead of working so much",
          "score": 74
        },
        {
          "text": "Wait you guys tell your family your salary?",
          "score": 61
        },
        {
          "text": "Take note that your income could easily bump your family out of subsidies like Chas card in the future so do remember to disclose a reasonable sum.",
          "score": 35
        },
        {
          "text": "When you earn 5k and under, always under-report it by 20-25% when people ask. Btw 5-10k, 30%. &gt;10k at least 40%. If people ask about bonus, just say can get 13th month + another 0.5 month more is very good in your line of work liao.",
          "score": 29
        },
        {
          "text": "I don’t tell most people what I really make. Just say not enough and complain about CoL",
          "score": 21
        },
        {
          "text": "if no one asked, don’t need to open a can of worms yourself and reveal your salary.\n\nif there’s someone that asked - just say you are earning comfortably. That’s what I do - People with tact will\ntake it as a hint to not ask further. I also don’t feel like it’s anyone’s business to know.\n\nI don’t think you owe anyone an answer or explanation how much you earn, don’t be so stressed out about it over an issue that does not seem to exist yet.",
          "score": 13
        },
        {
          "text": "If you are earning above average, say your salary is lesser than average. If you are earning less than average, ask them if they can lend you money. That’s bound to scare off their questions.",
          "score": 13
        },
        {
          "text": "If relatives ask. Say you jobless and want to borrow money 🤑",
          "score": 11
        },
        {
          "text": "Depending on your relationship with your parents but anyone outside I would brush them off.",
          "score": 9
        },
        {
          "text": "I always underreport by 1k",
          "score": 8
        },
        {
          "text": "well. Don't tell people how much you truly earn.",
          "score": 8
        },
        {
          "text": "It honestly really depends on your how well you know your parent’s financial situation and how good they are with financial planning. For myself, I’m transparent with them about it because they earn way more than me and have multiple sources of income and they have pretty much planned out their retirement. \n\nThey don’t expect me and my sibling to give them money but we still do so anyway cause we feel it’s only right. I’ve had discussions with my parents on financial planning matters before thus I’m comfortable sharing such info with them. \n\nOnly you know your parents best, so if you know they’d be the kind to demand you give each of a certain percent of your salary it would be better to under-report your income to them. But if you feel that they are financially mature and understanding enough I think there is nothing wrong being honest with them about your pay\n\nAs for relatives, I never let them know my salary. Whether my parents divulged this info to my uncles and aunties I don’t know and don’t care either but at a personal level the only people I talk to about my salary are my wife and parents",
          "score": 6
        },
        {
          "text": "Always do so. My family have no financial education and will tell people.\n\nThere are two extreme during cny. Rich pretend to be poor and poor pretend to be rich. \n\nCouple working as accountants with 2 children working as doc and prof lived simply. From outside look like coffee shop uncle aunty.\n\nCouple working dunno what, wear jewelleries, rolex buy fancy car, say their mlm \"business\" earning a lot. Ask people join. Post their live style. But secretly ask for loans. Say they semi retired but want to share money making schemes as good karma.",
          "score": 6
        },
        {
          "text": "You do not need to disclose amount. Can just say survivable. Stop it at that. \n\nMy parents also do not know how much I make but they have a gist as i sponsor all their annual trips, supplements, skincare, dinner/lunch outside bimonthly. Of course, they also receive allowance from me. ",
          "score": 6
        },
        {
          "text": "For parents, likely the intention is to know whether their kids have good income so they can rest their mind and inform you if you are under paid. Especially for first job, because you may not have experience to nego your salary or setting the baseline. \n\nI do understand that some parent also can be toxic or leech on their kids. So it depends on your relationship with your parents",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1r9v0rg",
      "subreddit": "askSingapore",
      "title": "Tingkat recommendations for a family of three",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r9v0rg/tingkat_recommendations_for_a_family_of_three/",
      "score": 13,
      "num_comments": 20,
      "created_at": "2026-02-20T21:13:39",
      "selftext": "Working mum here and am considering ordering tingkat for my family of 3 (including a toddler). Does anyone have a tingkat recommendation? There are so many options, but am unsure which is tasty and also worth the money. ",
      "comments": [
        {
          "text": "Following! I tried tingkat in the past. But kids always got bored after the second week. (And my kids are not picky eater!) we feel the sauce taste the same always.\nSo if anyone has different recommendation, please do! :)",
          "score": 16
        },
        {
          "text": "I tried mom’s cooking for a month and I love it. Decided not to continue as we were overflow with food everyday and I gained more weight 🤣 \n\nA bit expensive but for the portion and taste I think worth it. They only delivery for dinner around 4-5pm. https://momscooking.com.sg/menu",
          "score": 12
        },
        {
          "text": "Try meihao99! Find it good value for the quality compared to brands like neo garden",
          "score": 6
        },
        {
          "text": "I use Select for the two of us. I consider it quite cheap, the taste is good, and it's healthy as well because there're always vegetables. I reduced the price by cooking my own rice and ordering the tingkat version instead of tupperware (means I have to wash the tingkat every day but I think it's more environmentally-friendly than throwing away disposable ware)\n\nCustomer service has been very reliable as well. I'm pleased to recommend them.",
          "score": 4
        },
        {
          "text": "Neo garden",
          "score": 4
        },
        {
          "text": "Some of them have designated areas of operations so do contact them to check. And some also offer a week trial kind of thing so, you can test out their menu first too. Best to do trials with them as everyone's tastes are different.",
          "score": 3
        },
        {
          "text": "Im currently on Empress. A bit pricey but the food is decent most days",
          "score": 3
        },
        {
          "text": "Try kim paradise!",
          "score": 2
        },
        {
          "text": "I believe food safety is priority versus the cost. I tried one call royal something. Lucky is only 1 month. I basically threw away most of it. ....... but the most consistent for me would be Kim Paradise (i think subsidiary of Neo) and SELECT.  these 2 are the one i ordered consistently and dare to eat the meals.",
          "score": 2
        },
        {
          "text": "Can consider confinement food brands, some offer family meals / have portions big enough to feed more than one",
          "score": 2
        },
        {
          "text": "Empress porridge! They have cute kids Bento also. On the pricier side but I think it’s worth it for the portion and quality and customer service.",
          "score": 2
        },
        {
          "text": "[removed]",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r9nxyf",
      "subreddit": "askSingapore",
      "title": "Favorite hiking routes in singapore?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r9nxyf/favorite_hiking_routes_in_singapore/",
      "score": 9,
      "num_comments": 20,
      "created_at": "2026-02-20T14:29:25",
      "selftext": "Hey guys,\n\n  \nLooking to do some hiking in Singapore and was wondering what is everyone's favorite route to hike. \n\nI've recently tried the treetop walk and it was fun but was wondering if there was others that would give a little more.... sense of adventure.\n\nI would love some recommendations especially any that do require some light exploring off road trekking like the old Clementi Forest trail (that seems to have been closed off due to construction.) or the short trail off Seah Im market.\n\n  \nthank you!",
      "comments": [
        {
          "text": "If you want adventure, hike from Macritchie to Bukit Timah. \n\nIt was an accidental route for me because I took the wrong path and got lost. Imagine having limited water with you.\n\nDefinitely very adventurous haha.",
          "score": 6
        },
        {
          "text": "I used to jalan jalan at macritchie and pulau ubin but not so much anymore.. now days quite crowded 🤧",
          "score": 3
        },
        {
          "text": "Bukit Timah nature reserve, the yellow (or “difficult”) trails. Then walk to MacRitchie from there.",
          "score": 2
        },
        {
          "text": "Sungei Buloh feels a bit more adventurous to me despite having more built paths due to the high chance of meeting big lizards along the way",
          "score": 1
        },
        {
          "text": "I like Windsor Park and Macrichie",
          "score": 1
        },
        {
          "text": "You want some light adventure? Try going Jalan Mashhor to Bukit Brown Cemetery. At your own risk ok. You didn't hear it from me. Don't do it at night though.",
          "score": 1
        },
        {
          "text": "Bukit Timah Park.  \nMacritchie Reservoir\n\nMy fav is Buona vista &gt; Normanton Park &gt; Sentosa",
          "score": 1
        },
        {
          "text": "I really like the bt Timah hill/dairy farm loop - a damn good workout. there are additional trails you can meander off to which is quiet quiet and lovely. ",
          "score": 1
        },
        {
          "text": "Try finding these Torii Gates.\n\nhttps://thesmartlocal.com/read/bukit-batok-hillside-park/\n\n\nTake a selfie with these cars.\n\nhttps://www.straitstimes.com/life/how-did-these-abandoned-cars-end-up-in-a-forest-in-singapore",
          "score": 1
        },
        {
          "text": "Just did the Boardwalk side of MacRitchie, at the reservoir. A different view of MacRitchie. There were signs to hike all the way to Bukit Timah too, but it takes about 8km if i’m not mistaken. I looped back as it was drizzling. \nIf it doesn’t rain, this week has perfect hiking weather!",
          "score": 1
        },
        {
          "text": "MacRitchie there’s a trail after the SICC which you have to cross a swamp I did it in the days of no GPS anyone knows it?",
          "score": 1
        },
        {
          "text": "Railway corridor, Sungei Buloh Wetland Reserve, Bukit Timah Hill, MacRitchie Treetop walk, bukit timah to MacRitchie via Rifle Range",
          "score": 1
        },
        {
          "text": "Do the same walk in the dark. Very adventurous lol. People looking for birds/insects/ other animals often go in the dark which is quite challenging but you do see more creatures",
          "score": -1
        }
      ]
    },
    {
      "id": "t3_1r9xj9c",
      "subreddit": "askSingapore",
      "title": "Noisy Neighbourhood Kids Every Night",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r9xj9c/noisy_neighbourhood_kids_every_night/",
      "score": 6,
      "num_comments": 6,
      "created_at": "2026-02-20T22:57:48",
      "selftext": "Right below my block is a playground and for the past two weeks, 9-12 neighbourhood kids have decided that playing kickball and games there till after 12am is an ideal past time. I understand children need to have fun but this is too much. There must be some channel whereby I can get this resolved. Will town council help?",
      "comments": [
        {
          "text": "Call the non-emergency police hotline for noise nuisance after 1030pm. Or report on the one service app.",
          "score": 8
        },
        {
          "text": "Call the neighborhood police after 11pm and file a noise complaint. Ask them nicely to come down and patrol.",
          "score": 6
        },
        {
          "text": "depending on what 'resolve' means to you.\nthe bulk of such noise nuisance falls on 2 parties\n\n1) SPF - call their non emergency line and they will send someone down to speak to them, if they are below 16 - likely parents will be notify after via letter (not sure still in practice)\nhowever that's all they do, screen and advise\n\n2)TC - Under prevailing internal guideline, the tc manage noise nuisance in common area. however there is no power given for such works. which means they have the same power as you - a normal citizen.\n\nthey will put some poster and notices around and that's the end of it.\n\nOneService will not help.\nit's not a one size fit all approach. r",
          "score": 2
        },
        {
          "text": "Besides the ways already suggested, have you tried having a calm conversation with the kids in person, and tell them that they are disturbing the surrounding residents? Sometimes a polite and kind word can resolve it. \n\nMay even work better if you happen to see one of their parents/adult with them. \n\nJust my two cents.",
          "score": 2
        },
        {
          "text": "I will shout down to them to be quiet. If they don't want, I call neighbourhood police centre.",
          "score": 1
        },
        {
          "text": "Please report. Thanks for your service.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r9omwn",
      "subreddit": "askSingapore",
      "title": "Civil service 'fixed terms' emoloyment",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r9omwn/civil_service_fixed_terms_emoloyment/",
      "score": 5,
      "num_comments": 4,
      "created_at": "2026-02-20T15:10:25",
      "selftext": "Scrolling through careers@gov website and noted there the jobs were tagged as 'permanent', 'contract' and 'fixed terms'. Perm and contract are self explanatory but what does 'fixed terms' mean?",
      "comments": [
        {
          "text": "Think of it as a contract position with no renewal. Fixed term means that the contract will run for a predetermined time or until a certain milestone has been reached. Maternity covers are the most common fixed term contracts, but certain projects will also have, as there is no need to keep you on once the milestone has been reached.",
          "score": 21
        },
        {
          "text": "Probably a temporary or time-bound project role",
          "score": 6
        },
        {
          "text": "Speaking from personal experience, fixed terms = contract. Recommend u to read the description or just apply and clarify with HR if u are interested. Also most gov jobs are 1-2 years contract atm",
          "score": 1
        },
        {
          "text": "Basically a non-renewable contract.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r9rin2",
      "subreddit": "askSingapore",
      "title": "Anyone try V medical aesthetic clinic?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r9rin2/anyone_try_v_medical_aesthetic_clinic/",
      "score": 3,
      "num_comments": 12,
      "created_at": "2026-02-20T18:08:57",
      "selftext": "Anyone can share if you’ve good experience with this clinic?\n\nHow much do you pay for pico laser package and is it effective? ",
      "comments": [
        {
          "text": "They tend to hard sell ppl into buying packages. I’ve never been there before though",
          "score": 3
        },
        {
          "text": "10 sessions for 1.5k. My tattoos faded....a bit..",
          "score": 2
        },
        {
          "text": "Quite factory style. I think results also depends on skills of individual doctor. Cheapest in the market for pico if i’m not wrong",
          "score": 1
        },
        {
          "text": "My friend used to work there as a doctor. Factory style. Some doctors are good, others not so good.\n\nWorst part is the hard selling and that they will sell you the “flavour of the month” rather than what is necessary.",
          "score": 1
        },
        {
          "text": "I go to the one at Tanjung Pagar , Dr Zac . Signed up for Pico laser . Not too bad . Dr is very professional and friendly .",
          "score": 1
        },
        {
          "text": "I’ve been with them for over three years. They will hard sell you if you don’t know what you want to do. My recent experience with them was that staff A recommended I get a new package to top up to my current one. I knew it was working for me so I got it, stupid me really. And then the next visit, staff B told me the treatment (that was recommended by the previous visit, something I’ve been doing for quite awhile) doesn’t work and asked me to get another package. Their typical tactic is to tell you that they will speak to the doctor and ask for discount. Go out for a while chit chat then come back in and say they got the discount for you. \n\nIf your concern is price, I think it’s still ok. \nIf it’s about the service, they are pretty good. \nIf you’re scared of hard selling, just reject them even if they keep insisting.",
          "score": 1
        },
        {
          "text": "Very hard sell. Like a factory, feel like burger going through the stations.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r9puxt",
      "subreddit": "askSingapore",
      "title": "Courts Warranty claim help. Curious to hear your experiences.",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r9puxt/courts_warranty_claim_help_curious_to_hear_your/",
      "score": 4,
      "num_comments": 14,
      "created_at": "2026-02-20T16:26:28",
      "selftext": "Hi all, had a very bad experience in warranty claims (broken washing machine door), and courts just shirking all responsibility even thought i got the extended warranty. \n\nThey just diagnosed online: \"the reported door crack and hinge misalignment are assessed to be consistent with physical or structural damage\"\n\nWhat are my options? \n\nDid you even know that courts had a Premium track for their extended warranty? They basically said I am SOL because i didn't get the premium, lol.\n\nAnyone have any bad experiences with Courts? And where do you shop instead now?",
      "comments": [
        {
          "text": "I nv get the extended warranty. It’s their main profit driver.",
          "score": 5
        },
        {
          "text": "Singaporeans are always damn supportive of complaints but....warranties more often than not do not cover physical damage leh. Like that I can claim a new screen when my kid threw the remote controller at the TV already.\n\nIf your motor stopped working or something then yes la, they should cover it. But things like crack, scratch, dents are 99.9999999% not covered (yes yes maybe some very very premium brands will accept it go ahead use hammer and whack your appliance)",
          "score": 5
        },
        {
          "text": "The only retailer I will get EW from is Harvey Norman.\n\nFrom past experience, Courts and Best are bad, with too many conditions. \n\nThis is anecdotal, but a friend who had her stuff spoil 1y1w after the warranty (meaning base 1y expired), and Courts said there was \"depreciation\" factored in. The first year \"depreciation\" was like 50% or something, and since the repair cost came to more than the \"depreciation\", no repair for her.\n\nWe blacklisted Courts after that. When I saw that Best had a depreciation clause in their EW, I also blacklisted it.",
          "score": 4
        },
        {
          "text": "Washing machine door should not break even with usage. That are made to withstand slams",
          "score": 2
        },
        {
          "text": "Basically everything go back to the fine print on the back of the invoice you get from them. How it’s read is up to them, if you feel really dissatisfied you go everyday bang table at their store until they refund you the extended warranty.\n\nOr else engage the actual distributor and insist courts pay you back the costs. Good luck.",
          "score": 1
        },
        {
          "text": "Everytime a courts or harvey norman sell extended warranty you don't know how much they celebrate. Hari Raya is their favorite festive season. Not even CNY nor Christmas can beat.",
          "score": 1
        },
        {
          "text": "So far no issue to claim repair via Courts extended warranty 3 times for my Samsung Washing machine due to loud vibration issue... ",
          "score": 1
        },
        {
          "text": "Courts normal extended warranty-covers manufacture defects same as agent 3 x repair up to retail purchase price paid \nCourts premium warranty - unlimited repairs for manufacture defects, accidental damage 1 time repair or exchange and the warranty will void after.\n\nLike all insurance there's a fine line between negligence or accidental damage. Accidental covered, negligence no. Depends on how u report it.",
          "score": 1
        },
        {
          "text": "I got extended warranty from harvey norman for my washing machine cuz my drum is loose. They just replace with a new set for me.  Same with my TV and fridge.\nI realise my electronics always spoil during extended warranty period. Or maybe it is just fate trying to help me.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r9uzz6",
      "subreddit": "askSingapore",
      "title": "question on scrape value of repossessed car",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r9uzz6/question_on_scrape_value_of_repossessed_car/",
      "score": 1,
      "num_comments": 4,
      "created_at": "2026-02-20T21:12:38",
      "selftext": "Sorry, a noob just entering resale car market. Can I check that in a case where a car loan was defaulted and the bank repossesses the car, the minimum value that it can recover by scraping the car is simple the sum of (a) coe rebate + (b) parf rebate?\n\nAlso, the coe rebate is dependent on the coe paid rather than the current coe level? for example, if the coe paid for the car was 100K, a 8 years old repossessed car will have a rebate of about 80k regardless of the prevailing coe price when scrap?\n\nIn general, the bank should be able to recover a higher value by selling rather than scrapping the car?\n\nthanks.",
      "comments": [
        {
          "text": "Coe rebate is based on value of coe paid for that car, not current coe value. If car is 8 years old, you only get back the balance 2 years of unused coe upon scrapping of car. As for scrap and parf rebate, that depends on the model and age of your car.\n\nAlso - all of the above depends also on what the terms of your hire purchase agreement are. Is actual car ownership yours or does it belong to the leasing company still? If you did a check on onemotoring website, whose name appears as car owner? If you're not listed as the car owner then none of the coe rebate or scrap value goes to you...\n\nBetter be careful with those 0% upfront car leasing deals that some companies offer. It's been in the news lately for the wrong reasons (e.g. Autobahn, Shariot) since these arrangements are not regulated (a loophole in the law) and ownership typically does not pass to the individual until the last monthly instalment in the long lease is paid. \n\n* edited for clarity",
          "score": 3
        },
        {
          "text": "Scrap value of car is...  COE rebate + PARF rebate + car body value + road tax prorated refund.",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1r9rjgv",
      "subreddit": "askSingapore",
      "title": "Ghost stories at marine terrace",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r9rjgv/ghost_stories_at_marine_terrace/",
      "score": 1,
      "num_comments": 5,
      "created_at": "2026-02-20T18:10:14",
      "selftext": "So I’m at St. Patrick’s school and visiting for various reasons and we were split into groups with a sec 4 touring u. During our tour we went to the chapel and our guides told us about the history including the massacre in the chapel and various ghost stories. This piqued my curiosity and i asking for any ghost stories if you used to be or are attending St. Patrick’s school.",
      "comments": [
        {
          "text": "Interesting. What was the story about the massacre in the chapel",
          "score": 3
        },
        {
          "text": "https://en.wikipedia.org/wiki/Saint_Patrick%27s_School,_Singapore\n\nFYI",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r9nrnq",
      "subreddit": "askSingapore",
      "title": "Polyclinic dental services appointment",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r9nrnq/polyclinic_dental_services_appointment/",
      "score": 1,
      "num_comments": 9,
      "created_at": "2026-02-20T14:19:27",
      "selftext": "How do i make polyclinic dental appointment for dental fillings? Tried to search on healthbuddy &amp; healthhub ynder the appountment services but all i saw was dental polishing and scaling…",
      "comments": [
        {
          "text": "Go ahead and make that appointment for polishing and scaling. Then while there, they would also take a look at your other dental issues. They can then either 1) deal with your issue immediately if simple, 2) give you another appointment to come back to deal with that issue, 3) recommend you to a dental specialist appointment to deal with the issue. This how it works for polyclinics.",
          "score": 5
        },
        {
          "text": "Just go Q&amp;M if urgent. I think max ~$120 if straight forward.",
          "score": 2
        },
        {
          "text": "Srsly the waiting time...... rabak",
          "score": 1
        },
        {
          "text": "I heard it's not cheap at polyclinic these days…if it's urgent, may be better off going jb…",
          "score": 1
        },
        {
          "text": "All dental appointment slots at Polyclinic are release on the 1st of every month.\n\nIf urgent, try some ulu Polyclinic, like Bukit Panjang",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r9p71z",
      "subreddit": "SingaporeRaw",
      "title": "Where can i buy her firey bak kwa 🔥🥓",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r9p71z/where_can_i_buy_her_firey_bak_kwa/",
      "score": 122,
      "num_comments": 57,
      "created_at": "2026-02-20T15:45:47",
      "selftext": "",
      "comments": [
        {
          "text": "PR firms wet dream the way she handled it",
          "score": 143
        },
        {
          "text": "Ordered her bakkwa a few years ago through a GB (group buy) host. Ordered long before CNY but the promised delivery date came and went before the business finally conceded they couldn't meet the orders. Exactly as she said lor. End up everyone who ordered it for gifts had to scramble to find something else to gift.\n\nSo don't see what's the big deal. Seems like just a PR expert to me but if 2 days before CNY you are still making bakkwa you're already late for your orders lah. People need the bakkwa earlier to gift.",
          "score": 64
        },
        {
          "text": "Her watch can buy my HDB already",
          "score": 42
        },
        {
          "text": "https://preview.redd.it/j08itkl2omkg1.jpeg?width=1280&amp;format=pjpg&amp;auto=webp&amp;s=50d54317da54b5c2c4c5fe474d72471e6075ae6a\n\nEven on the day of the fire in her shop, she was ever ready for photo shoot 😁  \nPic credit : ST.",
          "score": 27
        },
        {
          "text": "I bet she has good insurance for her shop",
          "score": 17
        },
        {
          "text": "It doesnt gel. Managed to clear 100% of orders. Now we have a lot of refunds to do. Issue 2-month bonus right after the fire? Because of the bonus no one is at the shop? Everything only sounds sugary and even coincidental",
          "score": 16
        },
        {
          "text": "Quite milfy.",
          "score": 16
        },
        {
          "text": "Edit : I am legit talking about the food that her business sells. Get y'all's mind out the gutter \n\nHer ba kwa actually damn nice one. Ate this lychee flavored one and it was the absolute bomb. Very soft and fragrant also.",
          "score": 16
        },
        {
          "text": "Damm steady in handling the entire situation.",
          "score": 9
        },
        {
          "text": " Her lips too close to the fire izzit?",
          "score": 5
        },
        {
          "text": "I love her vibes! She is so genuine, nice to employees too. “Ma De”, “Gan”. haha.\nNext year I will sure order my ba kwa from her.",
          "score": 5
        },
        {
          "text": "Sure she never wear this outfit to cook bak kwa?",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1r9tca2",
      "subreddit": "SingaporeRaw",
      "title": "Man, 22, a S'pore PR from China, takes off clothes &amp; urinates outside neighbour's house, gets charged",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r9tca2/man_22_a_spore_pr_from_china_takes_off_clothes/",
      "score": 92,
      "num_comments": 33,
      "created_at": "2026-02-20T19:52:06",
      "selftext": "",
      "comments": [
        {
          "text": "Nobody is really against foreign talents. Problem is too many foreign untalented in SG nowadays",
          "score": 71
        },
        {
          "text": "This kind can get PR, truly a foreign talent.",
          "score": 54
        },
        {
          "text": "Certain kinds will fast track to be PR. IYKYK",
          "score": 32
        },
        {
          "text": "You will be surprised by how easy type C people are given PRs nowadays. Most just write a bare minimum application with basic info like education and work experience. Some don’t even have local degrees, do any volunteering work, have any local friend to give recommendation letters for, and don’t even need to speak fluent English. From my experience speaking with them, PR is their golden ticket for job hopping and negotiating for higher pay, but they don’t want to settle in Singapore at all. Some blatantly said that Singapore is small and their motherland is more powerful.",
          "score": 17
        },
        {
          "text": "\"Court documents viewed by Mothership stated that the victim's unit was specifically targeted because it had a door camera, and the accused derived excitement from stripping naked and urinating outside the unit while attempting to avoid detection.\"\n\n![gif](giphy|ukGm72ZLZvYfS)",
          "score": 14
        },
        {
          "text": "![gif](giphy|xT1R9IWTRv6Kn3FvoI)",
          "score": 13
        },
        {
          "text": "Is he being stripped of PR? There is no writing of his charges.",
          "score": 12
        },
        {
          "text": "really giving out PRs and citizenships like candy",
          "score": 10
        },
        {
          "text": "Bian Tai Hentai",
          "score": 5
        },
        {
          "text": "Our citizenship really worst than toilet paper",
          "score": 5
        },
        {
          "text": "![gif](giphy|xT1R9IWTRv6Kn3FvoI)",
          "score": 5
        },
        {
          "text": "Huh... so need to take off clothes to get charged? So pee is no problem? ",
          "score": 4
        },
        {
          "text": "Another tiong…these people are really public nuisance",
          "score": 4
        },
        {
          "text": "Kinda low bar for PRs that it’s insulting",
          "score": 3
        },
        {
          "text": "His response live in court xD\n\nhttps://i.redd.it/wjozahjplnkg1.gif",
          "score": 2
        },
        {
          "text": "Pepper is Pappy darling. New citizenship coming",
          "score": 2
        },
        {
          "text": "22 yo got simi lanjiao talent. Only know how to swing his lanjiao in public",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1r9yilx",
      "subreddit": "SingaporeRaw",
      "title": "Found out sick/dying mum has a godson",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r9yilx/found_out_sickdying_mum_has_a_godson/",
      "score": 61,
      "num_comments": 42,
      "created_at": "2026-02-20T23:34:30",
      "selftext": "Hi all, how common is it in Singapore for people to have godchildren, and do they ever take on a role that replaces actual children?\n\nSo to give some background, I'm (30+M), my mother (60+) was diagnosed with cancer around mid 2025 and had been receiving treatment (radiation and chemotherapy) at a local hospital until end 2025. She was awaiting a review by the cancer doctor (I think they're called oncologists?) to check whether the treatment was successful when she got hit with life threatening infection that almost cost her her life. Thankfully, she seems to be recovering although she might need a helper at home for a long time. A lot of things happened in-between and I can elaborate further if there is an opportunity.\n\nWhen she first got diagnosed and was staying in a hospital, my family (2 younger brothers and my father) noticed that there was a China (a real PRC, so I will refer to him as such) man (40+) who was unusually close to my mother. He was always at her bedside when family visited her and she would shoo us away when we visited her but let the PRC man stay. Our family members would spend more time travelling to visit her than the actual visit itself, while my mum seems happier when PRC or other friends visited. This really pissed us off.\n\nSo fast forward to her being warded due to infection (our family saved her by rushing her to the hosp against her wished btw), doctor told the family that the infection was life threatening and that family had to decide on treatment plan. PRC man started interfering in family matters, such as attempting to influence my mom to go for a dangerous surgery which resulted in him being blocked by the family. Guess what, my mum unblocked him herself afterwards, telling us that she wanted to see him even though he almost got her killed.\n\nSo afterwards, PRC man basically got involved with a lot of family matters such as collaborating with my mum's younger sister to separate her from her family, stopping her family from receiving important updates from the hospital (mum transferred hospital recently and we were not informed, bloody hell) as well as telling her to say or do things that she would not normally do. That was a tldr but I could elaborate on this next time.\n\n\\--end of lore for now--\n\nBut back to the point, my mum absolutely adores this guy. I had the opportunity to go through her phone when she gave me the password and found out things that broke me. Lots of her passwords were in the format of **\\[PRC Man\\]@ddmmyy** when they used to be my brother's name (he was always the favorite child but nvm). I also found other evidence such as them taking grad photos (you know the one a family takes together with their kids wearing grad gown), them on outing etc. Everything that mother should have done with her kids.\n\nI was hit with a wave of extremely negative emotions after this realization, because it explains why she seemed so worried about not being able to see him despite her sons pleading with her about being uncomfortable about having him around. PRC man was basically fulfilling her needs of being a mother, so much that she would protect him even from her own family who was concerned for her safety. Like mentioned, PRC man and my mom's sister made it absolute hell for my family to care for my mother in hospital, and basically said we were not doing our best for her. Throughout this time, my mother never once defended nor protected her family, nor answered the difficult questions that we asked her. Just few days ago, we received a report from the hosp (good on them) that my mum referred to a suspicious person as a \"godson\".\n\nTo say I’m devastated is an understatement. My father, my brothers, and I are all deeply hurt that my mum had this secret relationship with someone outside the family, and that she continues to enable his involvement even though it’s clearly causing us pain. To be really raw with this, there have been multiple instances where I would be ok if my mum just died. I just want the pain to go away.\n\nI could elaborate more on my relationship with my mum next time but she was basically a typical, traditional, narcissistic, emotionally abusive asian mother that would make any adult child distant from her. She has never changed in her ways, said sorry or made amends with us but now we find out that she is a replacement for the adult sons that she messed up?\n\nSorry for the long post, I tried to give some context to my situation while providing only the information relevant to my question. My mother is (unfortunately) not dying anymore so she is currently enjoying the company of both her toxic friends and her immediate family while doing recovery.\n\nI do not know what I should do. Maybe this is more of a rant than anything else, but I am really struggling with how to treat my mother after this. It feels like she expects her children to fulfil all the traditional obligations, such as financial support, caregiving and regular visits. She keeps emphasising how much she wants to see me and my brothers, but I cannot tell whether she genuinely cares for us or whether she simply expects it because she gave birth to us and raised us. Once she is discharged, we will be the ones responsible for her long term care, but it feels like we will always come second to the people she chooses to surround herself with, even when they have clearly hurt us. If she now has someone she treats like a godson, I honestly do not know what my role is supposed to be anymore. Should I even bother trying to be a son to her at all.\n\nI would appreciate any perspectives on this. I know my view is based on my own experience and emotions, so it might be skewed. If you need more context, I can share. My family and I are supporting each other, but we are all extremely hurt that the person causing us the most pain is also the person we are expected to take care of.\n\nThanks in advance fellow Singaporeans.\n\n\\-----Edit (21/02/2026 01:39)-----\n\nThanks for all the advice so far, I'll just add some more context:\n\n1. Family also initially suspected this PRC is a scammer (not saying that he is confirmed not a scammer now), he puts himself out as someone who treats my mum as his own mum. Based on other eyewitness accounts, he goes out of his way to spend time with her in and is also not close with other people in the same circle. He is basically a creep, heard from my bro that he once sent my mum a cctv to install at home so that he can monitor her while she is sick (I sleep next to my mum so that I can support her up when she needs to at night, the cctv would have captured me as well), amongst other inappropriate things that he did. based on her phone history, they have known each other since 2023.\n2. My mum is not rich, she has a been a low earner her whole life, but apparently has hoarded a lot of money (less than 500k). She basically does not pay for household expenses, receives allowance from me and my brother and so had lots of opportunities to save money. Based on what we managed to fish out while she was hospitalised, seems like she and her sister have some grand plan for their future, so it is likely that the sister has more insights into her assets than us. BTW, according to my dad, half our house is hers.\n\nBelieve it or not, there are even more details that makes things more complicated. But I will reveal them as necessary. Thanks again SG redditors.\n\n\\-----End Edit (21/02/2026 01:39)-----\n\n  \n\\-----Edit (21/02/2026 11:55)-----\n\nThanks so much for the advice so far. I'm willing to try everything if it means protecting my family.\n\nHere's some additional info on the \"Villains\" in this.\n\n1. PRC Man  \nKnown to my mum for around 2 years. They seem extremely close. We once blocked him from seeing my mum cos he was interfering with family affairs by feeding her wrong info and making her do things based on that wrong info. Mum later unblocked him herself, saying she wants to see him and we had an argument. I'm basically on \"cordial\" terms with him now at least until we can deal with him.\n\n2. Aunt  \nMum's younger sister in her late 50s. Lives in the US with an older companion after her divorce. Has one daughter who chooses not to live with her cos of who my aunt is. A real psychotic bitch, she keeps saying we don't do enough for my mum even though she does even less. Came back to sg to visit her sister when she heard that her condition is life threatening, then proceeded to loop in outsiders and effectively cut my mum off from her family for around 2 weeks. For that 2 weeks, we didn't know how was my mum's condition nor that she was going to transfer hospitals. Of course, our complaints to our mum fell on deaf ears. She flew back to the US, I hope her plan crashed.\n\n3. PRC Nurse  \nA nurse from who knows where that works in the hosp my mum is in. Apparently looped in by PRC man and my aunt to monitor my mum. An absolute bitch to deal with cos she doesn't answer questions from the family and doesn't update family on matters related to my mum. She got my mum to change the main contact person from my brother to her (from \"son\" to \"friend\"), which also weirded out the nurses. She tried to pull the same stunt in the new hosp but was thankfully flagged out by the social worker and doctor. My mum had put the contact persons as me and my brother in the new hosp but then wanted to change it to the PRC nurse after she visited. We are suspecting something ber wrong and I am in touch with the prev hosp on this.\n\nI know this sounds ridiculous and I really wished this was a work of fiction but it's a hell that my family has to live through everyday. It is really unfair that what limited time we have with my mum has to be spent so full of hate against her and the people she brought into our lives.\n\n\\-----End Edit (21/02/2026 11:55)-----",
      "comments": [
        {
          "text": "What would your mom leave behind if she passed?\n\nMake sure that all the properties, etc., do not fall under her estate when that happens, and that there won’t be any room for dispute for any form of wealth your family has, should she pass. It should be to the point whereby she has nothing to will to any of her beneficiaries.\n\nVery common case, but suspect that this “godson” of hers is playing the long game - he stands to gain wealth when she passes.\n\nThough, on a personal note… this is one of those situations where this advice applies: you are your own person. \n\nIf possible, stop emphasising on how your mom neglected you, and how it hurts. You’re just hurting yourself comparing what she did for her now “godson” vs what she didn’t do for you and your siblings.\n\nDo things because you’re just that kind of person - maybe filial, maybe kind, or practical, I don’t know. There is a difference between doing things because others expect it, etc., and doing things because you’re you.\n\nIt’s your life, man. Holding on to past trauma hurts no one but yourself. I’ve been there, at least in this aspect.",
          "score": 57
        },
        {
          "text": "We have seen cases like this before whereby the Scammer worms his way into a supposedly dying person's life with the intention of convincing them to transfer funds or write them into the will. \n\nThey will lovebomb the victim and attempt to isolate them from their family. I'll not be surprised if some sort of intimacy was involved.\n\nAs someone else posted, try to limit what she owns in her name so she can't hand them over to the Scammer. Keep her estate miniscule.\n\nThe scammers behavior can deemed as elder abuse, financial abuse. Do start to collect evidence against the Scammer so you can use it if you decide to involve the authorities in the matter.\n\nhttps://mothership.sg/2025/12/singaporean-widow-cheated-tour-guide-dies/\n\nThis was the case of the scam btw.",
          "score": 24
        },
        {
          "text": "40 yr old PRC. I can tell you your mom is his sugarmommy. not mother - son relationship.",
          "score": 11
        },
        {
          "text": "&gt; I would be ok if my mum just died\n\n&gt;she was basically a typical, traditional, narcissistic, emotionally abusive asian mother\n\n the guy is likely  a scam artist, but it seems like there's also another side to this story.",
          "score": 9
        },
        {
          "text": "First of all.  He sounds like a scammer.  Secondly, fuck anyone who moves the patient without informing the kids or the husband.  \n\nSo fuck him.  I would also hire a private investigator to figure out his background and what he has done before.  You might be surprised.   Whatever you do, don’t tell your mom because she won’t believe you. \n\nThird, your mom sounds incapacitated.  Don’t know about Singapore laws but in USA, the husband can file for something that allows him to sign stuff on her behalf, and have her declared temporarily incompetent.  This allows you to formally ban him and his family from visiting.  And get cops involved asap.   Because this is elderly abuse. \n\nNext.  The aunt may be in on this.  Fuck her if she is. \n\nDo not tell anyone about the filing until the judge approves it. \n\nAfter that, warn the aunt, if she brings the guy in, you will file a lawsuit against her as well.  \n\nAssuming the PRC asshole is not a citizen, if there’s anything from the private investigator’s report, file an immediate police report, and saying that he wants to scam your mom.  Also report to immigration. \n\nAlso talk to the lawyer about what kind of rights a “godson” has.  If nothing, ban him from the hospital, and inform them if they let him in, you will file a police report and lawsuit against them.  \n\nSo.  Go talk to lawyer and private investigator immediately.  Get your father the rights to manage her affairs while she’s temporarily incompetent. \n\nIf lawyer says godson has no legal status, then immediately at the hospital, his legal status changes to “visitor” or “friend” whereas you guys are “family members” or “spouse”.  \n\nShe will argue and fight for him to visit.  Doesn’t matter.  Your dad, once he has that document signed by a judge, can kick him out.  \n\nAnd kick all the PRC friends and family out.  If you can afford it, send the private investigator after them as well. \n\nFuck the fucking scammers who prey on the elderly and the weak.\n\nOh yeah.  Check *ALL* the paperwork. Does she have any wills, life insurance, next of kin/pay on death set up in bank accounts, etc?\n\nFind out if she’s signed anything over to him or the sister already. Like her half of the house etc",
          "score": 8
        },
        {
          "text": "I have a sick dad and while what im going through is different kind of emotional pain, there are similar pain points. I hope we heal from the family we were born into. Hugs",
          "score": 6
        },
        {
          "text": "You have a half-brother",
          "score": 2
        },
        {
          "text": "Sounds like Yang Yin Part II\nhttps://www.straitstimes.com/singapore/courts-crime/yang-yin-saga-a-full-recap-of-the-case\n\nYou need to make a police report and get social workers involved. Also the CCTV is very dangerous. And you need to inform your mother.",
          "score": 2
        },
        {
          "text": "Reading through your story made me realise that this could happen to me and my sister anytime, but we are earlier in the timeline. My mum is very similar to yours in terms of personality and she skims and leeches money from my dad, sometimes me etc. doesn't work but lots of opportunities to 'save $', doesn't want to spend own money and very protective of what she has assets wise because she needs to 'save for old days'. Does not ever want to reveal to dad or myself what assets she has. Surrounded by these handsome RMs probably selling her ILPs or whatnot. Anyway I doubt she regards us as family (she's PR and refuses to convert). Always referring to dad's side of family as 'your family' while waxing lyrical about her own siblings (who are honestly just hypocrites) and gives them money because they are in a more 3rd world country while she 'made it' to SG. I'm like you hoping sometimes she just passes on. If it were just dad me and my sis we would have lived such a peaceful life and financially less stressed too because she's so bad with money and gas lights everyone into giving her more.\n\nAll I can say is that you gotta find your own moral code to live by. I still do stuff for her because I am that kind of person. I want to be filial etc and that's independent of whether my parents are saints or sinners. But of course I'm looking out for my dad to ensure things don't get fked if my mum dies first and wills half the house away to some random or her siblings. \n\nIt definitely gave me trauma and makes me very sceptical of marriage",
          "score": 2
        },
        {
          "text": "[ Removed by Reddit ]",
          "score": 1
        },
        {
          "text": "Your mum got big inheritance?",
          "score": 1
        },
        {
          "text": "Usually with a narcissistic mother doesn’t sound very good. You need to think of how to protect your assets and rights and also how to prevent that prc guy and toxic friend from visiting your mum. But that might not be possible until your mum is unable to stop this from happening.",
          "score": 1
        },
        {
          "text": "Up to a certain, you probably need to think of a time when y’all need to file LPA for your mom if you think she is incapable of making financial decisions on her own. Might not be now, but the time will definitely come",
          "score": 1
        },
        {
          "text": "i smell a Yang Yin. Seek legal advice from an actual lawyer who can guide you with your police report, and evidence to collect against this \"godson\".",
          "score": 1
        },
        {
          "text": "Too long.\n\nBut I wonder how the family treated her for her to become like this.\n\nBeside the point if it is a scam or not. At least she's happy.\n\nLet her be happy at the end. That's the least your family can do.\n\nIf rich family then good luck fighting for assets. That's the fear right?\n\nEdit: timeline is confusing. 40+ prc. But photos of graduation? But only know each other 2 years?\n\nEdit2: reading some of your other replies. It does seem like your mum is already fairly split up with your family. I wonder why.",
          "score": 1
        },
        {
          "text": "Go make yourself her LPA",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rac6xm",
      "subreddit": "SingaporeRaw",
      "title": "SG homes getting smaller. 65% please dont open mouth complain when you approved the plan for more smaller homes.",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1rac6xm/sg_homes_getting_smaller_65_please_dont_open/",
      "score": 57,
      "num_comments": 52,
      "created_at": "2026-02-21T08:12:22",
      "selftext": "I read postings on Reddit SG and one article stood out is the size of smaller HDB which have been an issue past 2 decades.\n\nYet, election after election, dumb voters voted PAP and even dont want Leong Mun Wai whom on fire past parliamentary term touched on HDB issue.\n\nThey regard him as coffeeshop uncle wannabe MP where obviously they didn't read his credentials.\n\n65% voted and deserve it. They've to answer to their children and grandchildren.",
      "comments": [
        {
          "text": "But PropNex agents are becoming millionaires at the age of 28… and these 800 sqft, 99-year lease condos priced at $3 million get sold out on launch day…",
          "score": 15
        },
        {
          "text": "shan ge old home got enough land mass for 2000 families ",
          "score": 11
        },
        {
          "text": "It's a wonder how the 65% are so masochistic -no worries in a decade we're will have flats that are probably much smaller than today. \n\n\nMeanwhile rajahs live in huge properties....",
          "score": 10
        },
        {
          "text": "actually if govt wants carlite society, they can sacrifice the parking lot around the hdb estate to compensate for bigger unit. just like Japan, carpark is really rare",
          "score": 8
        },
        {
          "text": "They have already upgraded long ago to condos now worth multi million dollars or multiple condos\n\nSo it's been good to them. Of course they will continue voting them.\n\nFor the rest of you just starting out, tough luck and good luck",
          "score": 6
        },
        {
          "text": "Getting smaller yet resale prices are now more expensive, some more than $1m.\n\nThey don't have to answer because most got no kids or grandkids looking at the low fertility rate.",
          "score": 6
        },
        {
          "text": "&gt; 65% voted and deserve it. They've to answer to their children and grandchildren.\n\nBut many don't even have children or grandchildren. They aren't replacing themselves......not sure which is the cause and which is the effect though.",
          "score": 6
        },
        {
          "text": "People keep blaming the government but keep in mind this is a consequence of Laissez-faire capitalism particularly in the aspect of housing\n\nWhen you leave something to market forces, it's in the incentive of the small number of developers to maximize profit with as little input as possible\n\nDoesn't help that  the asset and cash rich  boomers are not buying houses to stay but to continually flip and turn over profits, using loopholes and their offspring to bypass cooling measures. Developers see this and build house not for living space or practical reasons but to maximize profit margin and cover it up with sleek additions like premium ovens which most households don't even use\n\nIf government tries to reign in property market, it goes into a slump and the boomers which constitute the most significant bloc of the voting population will lose their assets resulting in government losing support\n\nThis is not a practically solvable problem in a democracy where sensible decisions prioritizing the future generations cannot be made without significant backlash. Even if PAP is voted out it's unlikely any new government can actually change things for the better without any backlash\n\nThese are the limitations of a democratic system functioning within a capitalist system. At this point we need to wait for the boomers to die out before any meaningful change can be instituted",
          "score": 4
        },
        {
          "text": "65% are many boomers who only care about capital gain. Their kids already old n have property. It’s the next gen that’s screwed. Our TFR will permanently below 1 as I don’t see a single thing gov is doing to reverse it. All the child subsidies don’t make up for decreasing hdb flat sizes n increasing hdb prices",
          "score": 4
        },
        {
          "text": "To be fair, the new layouts are nicer. But hdb is pretending to be a castle in the clouds when it's just a shoebox in the sky\n\n\nEdit: typo ",
          "score": 3
        },
        {
          "text": "I forseen that in another 50 yrs time, we will be similar to HKG. There will be \"cage\" homes for those who cannot afford housing.",
          "score": 3
        },
        {
          "text": "Buy small here..go big overseas",
          "score": 2
        },
        {
          "text": "![gif](giphy|NYBVJUGdiJdG8)",
          "score": 2
        },
        {
          "text": "All waiting to inherit when boomer parents uplorry, rent out to foreigners for top buck. Ownself stay small bto/condo is ok, pocket full of money… free time go holiday. Next generation not thinking of kids. Kids are a lot of work.",
          "score": 2
        },
        {
          "text": "Small house also means less kids or none at all. Though it could be a chicken and egg problem.  \n\nGovt will likely turn around and say since most not having children, might as well squeeze more couples in 4 room flats. Those that want children can buy a bigger 5 room flat.",
          "score": 2
        },
        {
          "text": "&gt;They've to answer to their children and grandchildren \n\nknowing them theyll probably just gaslight them into thinking that they dont \"work hard enough\" and its their fault they can only afford to live in this cramped space hdb\n\non the bright side its still more than enough space to have sex /s",
          "score": 1
        },
        {
          "text": "So if u vote in WP or one of the housefly parties in, is that going to change it up?",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r9yspx",
      "subreddit": "SingaporeRaw",
      "title": "Saw pieces of this with hell notes on pedestrian road",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r9yspx/saw_pieces_of_this_with_hell_notes_on_pedestrian/",
      "score": 43,
      "num_comments": 25,
      "created_at": "2026-02-20T23:44:59",
      "selftext": "Along Jurong East/wert Ave 1. Any scope on this? ",
      "comments": [
        {
          "text": "WALAO THE HANDWRITING DAMN SCARY",
          "score": 23
        },
        {
          "text": "I saw this last weekend too.\n\nI mean, what do you expect from that area. It's the same place with the illegal gambling.",
          "score": 15
        },
        {
          "text": "https://preview.redd.it/7hsjw306rokg1.jpeg?width=2164&amp;format=pjpg&amp;auto=webp&amp;s=41d2563ac714e5aa3b504988966053964645b198\n\nNewest edition today, coupled with hell notes",
          "score": 12
        },
        {
          "text": "降头 is gong tao",
          "score": 7
        },
        {
          "text": "What is a gongtao sound?\n\nHmm",
          "score": 6
        },
        {
          "text": "please report her for littering, thanks",
          "score": 4
        },
        {
          "text": "... IMH can open franchise at jurong region.Buangkok too far alrdy",
          "score": 3
        },
        {
          "text": "can someone please translate haha",
          "score": 2
        },
        {
          "text": "Wow which part of Jurong West are these found? Right outside the condo mentioned? I used to stay in that area",
          "score": 1
        },
        {
          "text": "Really creepy. On cny too ",
          "score": 1
        },
        {
          "text": "To the person who wrote this on the paper:\n\nhttps://preview.redd.it/myty5kp7zrkg1.png?width=800&amp;format=png&amp;auto=webp&amp;s=061b9d5acf0ff64e8b2a0da1b7ab7d6b2ff946fd\n\n",
          "score": 1
        },
        {
          "text": "[deleted]",
          "score": -10
        }
      ]
    },
    {
      "id": "t3_1r9o21a",
      "subreddit": "SingaporeRaw",
      "title": "2 weeks’ jail for woman who slapped 73-year-old cabby while drunk",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r9o21a/2_weeks_jail_for_woman_who_slapped_73yearold/",
      "score": 33,
      "num_comments": 34,
      "created_at": "2026-02-20T14:36:00",
      "selftext": "SINGAPORE - An intoxicated woman slapped an elderly taxi driver in an unprovoked attack after stating that she did not have any cash or cashless payment methods to settle her $24 fare.\n\nShalini Devarajan, 36, was sentenced to two weeks’ jail on Feb 19 after she pleaded guilty to assaulting the male victim, who was 73 years old at the time. Deputy Public Prosecutor Adelle Tai said the fare remains unpaid.\n\nCourt documents stated that Shalini reeked of alcohol when she boarded the victim’s taxi at around 3pm on Nov 11, 2025, and fell asleep during the ride.\n\nWhen they reached her stated destination in Yishun Street 22, the driver woke her up and told her the fare was $24.\n\nShe replied that she had no cash or cashless payment methods with her, and needed to go up to her unit to get the money.\n\n“The (driver) asked her to leave her phone in the (taxi) and go up to the unit, but she refused. (He) then suggested following her up to the unit to get the money, but the accused refused this as well,” DPP Tai said.\n\nShalini challenged the cabby to take her to a police station, and he did so, with her scolding him during their drive to Yishun Neighbourhood Police Centre (NPC) in Yishun Central.",
      "comments": [
        {
          "text": "So new citizen , pr or s pass?",
          "score": 26
        },
        {
          "text": "Why never mention nationality? Usually Singaporeans will also mention.",
          "score": 15
        },
        {
          "text": "Always got rotten apple from everywhere yes, but the proportion from CECA damn high, got a lot of similar cases where they’re full of shit and overbearing.",
          "score": 12
        },
        {
          "text": "If nv mention nationality, likely is not sinkie\n\nMainstream media loves to paint sinkies in bad light whenever possible",
          "score": 11
        },
        {
          "text": "Inb4 yishun",
          "score": 8
        },
        {
          "text": "This is really fucked-up entitled behavior. People 73 yr old, drive taxi, bring you home, still have to put up with this shit from her. And that is not the face of someone contrite with what she has done. Real disgusting  piece of shit of a human being.",
          "score": 7
        },
        {
          "text": "i suspect she is malaysian. loves to drink and usually ceca is not tatted",
          "score": 7
        },
        {
          "text": "Usually if the convict is a Singaporean or SG PR our MSM will indicate accordingly. So you can be almost certain this one is a CECA in order to avoid fanning the recent anti CECA tensions",
          "score": 6
        },
        {
          "text": "My question and everyone’s question, is she PR, EP or New Citizen? \nWhy never disclose? \nTIL India culture also includes slapping public service staff.\n\nEdit: On second thoughts I think she is born and breed Singaporean, if not she won’t be jail. If she is CECA, maybe get warning only but this one straight jail so likely it’s Singaporean.",
          "score": 5
        },
        {
          "text": "So we have ceca to whack our local :(",
          "score": 4
        },
        {
          "text": "Knnbccb ceca again.",
          "score": 3
        },
        {
          "text": "Why only two weeks? Why no fine?",
          "score": 2
        },
        {
          "text": "Based on recent incidents, curious on the percentage of,\n\n= found guilty by court of law / total resident population %, \n\nfor each that racial group",
          "score": 2
        },
        {
          "text": "CNA got mention is singaporean: [https://www.channelnewsasia.com/singapore/woman-jailed-slap-taxi-driver-dodge-fare-5939531](https://www.channelnewsasia.com/singapore/woman-jailed-slap-taxi-driver-dodge-fare-5939531)",
          "score": 2
        },
        {
          "text": "Nothing new coming from the CEcA kind",
          "score": 1
        },
        {
          "text": "Mdm no nd resort2violence😒",
          "score": 1
        },
        {
          "text": "Attitude very bad.",
          "score": 1
        },
        {
          "text": "Nin lao hia another CECA",
          "score": 1
        },
        {
          "text": "Try to post that in r/singapore 🤣🤣🤣",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1raf3no",
      "subreddit": "SingaporeRaw",
      "title": "Too many noisy troublemaker Ah Tiong in Toa Payoh, Clementi, Bedok and perhaps many more",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1raf3no/too_many_noisy_troublemaker_ah_tiong_in_toa_payoh/",
      "score": 32,
      "num_comments": 25,
      "created_at": "2026-02-21T10:23:43",
      "selftext": "I started my life in Bedok with almost zero NOISY Ah Tiong. When I moved to Toa Payoh a few years ago, I started seeing more and more of them. Even near my workplace at Clementi also starting to see more of them. And then I occasionally go back to Bedok, and I also see many of them too. Perhaps these few years have a huge influx of them. \n\nIf they behave well like the Japanese or Taiwanese, I seriously don't mind, but their uncivic and uncultured behaviours really make people hate them worldwide. Suddenly become agitated and shout. Throw things, bang on walls, slam their gate, very uncooperative.   \nRemember a woman filming herself voting during the latest GE? No punishment.   \nRemember a man brazenly drinking water and filming himself on mrt? Still no news. ",
      "comments": [
        {
          "text": "First time?",
          "score": 20
        },
        {
          "text": "Law should be passed to double the punishments for foreigners in Singapore who commit crimes ",
          "score": 16
        },
        {
          "text": "toa payoh all old people don't see alot PRC, clementi area alot mianly due to professor, researcher and student, which near NUS and NTU, if you go east side alot CECA, like Tampines, Bedok",
          "score": 9
        },
        {
          "text": "I was having dinner at MBS food court some time ago and saw Ah Tiong tourists just take the chairs without even asking ppl, like wtf??",
          "score": 6
        },
        {
          "text": "No picture, no video = no proof. Anyone can easily make up a story without any proof.\n\nPlenty of cecas tell stories about racism on the main sub all the time. But without proof, they're just stories.",
          "score": 4
        },
        {
          "text": "Try posting that in r/singapore 😂😂😂",
          "score": 2
        },
        {
          "text": "The real race is how many we can red-pilled vs how many citizenships the govt can give out to PRC. ",
          "score": 2
        },
        {
          "text": "u/kongweeneverdie, rise up and respond here 🤣🤣",
          "score": 1
        },
        {
          "text": "Rage baiting post?",
          "score": 1
        },
        {
          "text": "I think the few famous cases are all locals.\n\nGeneral complains on reddit on neighbour topics also seems like is locals. Not prc.\n\nWhere you getting your source?",
          "score": -2
        },
        {
          "text": "Your grand parents are tiong too. \n\nJust live and let live",
          "score": -14
        },
        {
          "text": "Go teban, no tiongs there. Only got kongwee there.",
          "score": -18
        },
        {
          "text": "If you're so discriminatory towards other nationalities, you'd be called a racist. But this is reddit.",
          "score": -19
        }
      ]
    },
    {
      "id": "t3_1r9qliv",
      "subreddit": "SingaporeRaw",
      "title": "PSA: You are not entitled to spam repeated CECA threads anyhowly. Later become CECA only forum.",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r9qliv/psa_you_are_not_entitled_to_spam_repeated_ceca/",
      "score": 29,
      "num_comments": 40,
      "created_at": "2026-02-20T17:13:26",
      "selftext": "",
      "comments": [
        {
          "text": "Agreed. Some of yall fucking too free sia",
          "score": 57
        },
        {
          "text": "There is a line between having valid concerns about certain elements of India Indians and China Chinese, and being outright fixated to the point of just being racist and xenophobic. A lot of mfers here is far beyond fixated.",
          "score": 54
        },
        {
          "text": "Ah Neh Boyfriend!?",
          "score": 13
        },
        {
          "text": "Maybe start r/CECApore and see the Redditors posting there.",
          "score": 11
        },
        {
          "text": "Tbh not sure if reading only spam of Ceca and prc is that interesting. \n\nSo I kinda agree if they are taken down.",
          "score": 9
        },
        {
          "text": "Time to create sgrawceca sub",
          "score": 9
        },
        {
          "text": "Eh is the Mod a ceca ? I think if he is he shouldnt be a mod ba.",
          "score": 8
        },
        {
          "text": "Honestly, this subreddit dont have a CECA spam problem. They have a PRC spam problem proliferated by a few users.",
          "score": 7
        },
        {
          "text": "Lol people mistake more free speech for permission to post rubbish.",
          "score": 6
        },
        {
          "text": "agree. stop being a dumbass, get over your own racist thoughts and focus on our very own elites raking in the dough.",
          "score": 5
        },
        {
          "text": "Where our sinkie pwn sinkie mod",
          "score": 4
        },
        {
          "text": "Yeah. The mod known as kacheng Lim already deleted many threads about the ceca Uni and China robot. Talk about freedom of speech. Pui.",
          "score": 3
        },
        {
          "text": "Should I post the robot AI thingy to test ?",
          "score": 2
        },
        {
          "text": "People are free to just scroll past a post they don't like. Unless it breaks the rules, it shouldn't be censored. \n\nRepeated threads on CECA just means it is topical. If mods start censoring threads they don't like, then it is no longer topical, but agenda-pushing. ",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1r9vh71",
      "subreddit": "SingaporeRaw",
      "title": "M'sian couple breaks into S'pore beauty salon 6 times in 1 month, steals S$13,950 to pay off debts",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r9vh71/msian_couple_breaks_into_spore_beauty_salon_6/",
      "score": 24,
      "num_comments": 9,
      "created_at": "2026-02-20T21:33:41",
      "selftext": "",
      "comments": [
        {
          "text": "Jiu hu sai really lumba wan",
          "score": 23
        },
        {
          "text": "Break into me once, shame on you. Break into me six times, shame on me.",
          "score": 12
        },
        {
          "text": "... after the 1st robbery, you'd think changing the locks might be up high in priority considering there was no forced intrusion.",
          "score": 7
        },
        {
          "text": "Another case of premier foreign talents.",
          "score": 2
        },
        {
          "text": "Lawrence \"Don't be xeno.....\"",
          "score": 2
        },
        {
          "text": "“Singaporeans commit more crimes!”",
          "score": 1
        },
        {
          "text": "Jhk, prc &amp; ceca bad news are all hitting sgraw these days.\n\n\n\nAnd pap is still opening sg's legs wide wide rofl",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r9sqtd",
      "subreddit": "SingaporeRaw",
      "title": "Outsourced hawker centres are cursed!",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r9sqtd/outsourced_hawker_centres_are_cursed/",
      "score": 24,
      "num_comments": 10,
      "created_at": "2026-02-20T19:19:51",
      "selftext": "In Singapore, many hawker centres are managed by private operators instead of directly by the National Environment Agency.\n\n The idea is to improve management, cleanliness, and programming — but in practice, stallholders sometimes face:\n\n\nHigher rent or service fees\n\nMandatory cleaning/centralised\n\nDishwashing charges\n\nMarketing levies\n\nInconsistent footfall\n\nCompetition within the same centre\n\nGood luck to Singapore unesco hawker culture!\n\nSo sad government not helping much here",
      "comments": [
        {
          "text": "“Social enterprise” my arse. Businessmen just want to max their profits.",
          "score": 18
        },
        {
          "text": "If you notice, the SEHC management are the usual players. Whether they have value-add is up to your judgement. NEA hawkers basically allow no-frills rental and this keeps hawker food prices low",
          "score": 10
        },
        {
          "text": "Because the overheads of white collars managing the hawker centres already take away such a huge portion of the pie.\n\nIt’s basically an overpriced MCST trying to manage a system that didn’t need to be micromanaged in the first place. Location good, don’t even need management. Location bad, manage also cui.",
          "score": 4
        },
        {
          "text": "They are called \"Social\" Enterprises because they socialise the costs to Singaporeans and then privatise the profits into their pockets.",
          "score": 3
        },
        {
          "text": "I would say around 80% hawker centres in and around are managed by NEA and rest by private parties or Unesco. If a food court is in a condo say for example bayfront doesnt it need appropriate pricing rather than subsidised. Remember few of the hawker centres are subsidised as well. If you want to eat in Lau pa sat you need to shed more dollars if you dont want you can just grab a bus and alight at place 2 stop after. Sometimes we need to let market places figure out prices by demand and supply, which you cant enforce always.",
          "score": 2
        },
        {
          "text": "Just remember that these private operators get the contract by being the lowest bidder. \n\nThese private operators also want to earn money so they pass the costs to the stall holders and the stall holders pass the costs to the customers. Basically everyone lose and NEA can shake leg.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r9vdik",
      "subreddit": "singaporefi",
      "title": "How much do Singaporeans from different income levels spend on annual holiday trips?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r9vdik/how_much_do_singaporeans_from_different_income/",
      "score": 44,
      "num_comments": 72,
      "created_at": "2026-02-20T21:29:22",
      "selftext": "Would love to travel a lot but coming from a somewhat low income family its a rare affair. Now graduated with a well paying job with good progression opportunities, I would like to strike a balance between income (and thus work stress) vs being able to travel regularly. Sorry if it sounds weird haha I am just curious about the lives of people with different economic means and whether there is a \"right amount\" to budget for it.",
      "comments": [
        {
          "text": "It's not about how much u earn \n\nIt's about how much leave u have. \n\nMy friend &amp; his wife total income 100k\nFlying every odd months. \nSelf employed.",
          "score": 136
        },
        {
          "text": "do it before u get married and have children.\n\nbecause traveling alone/with friends is cheap.  traveling as a family of 4-5, cost jumps up more than 500%.",
          "score": 74
        },
        {
          "text": "You should be proud to come from \"a somewhat low income family\" and now hold a well paying job. There's no right or wrong answer on how much to spend, and many well paid people have fond memories of traveling on a budget as a student or fresh graduate.\n\nYou can look for cheap flights, cheap hotels (even get a dorm bed instead of a hotel room before you outgrow it), street food, and go to places where the best experiences are free like simply walking around in an old town, a river promenade, or beautiful hiking trail. Entering places where real people live from markets to churches are all free.\n\nTime is more scarce than money. The important thing is you travel as you feel like without thinking you'll do it later, when you earn more or when you have more time. Give yourself well earned breaks, or opportunities to expand your experiences as you like.",
          "score": 37
        },
        {
          "text": "I went to Japan and Korea solo last year, i spent about 1.5k each for both! 1k to bangkok!\n\nMonthly salary low 3k, I don't really have any commitments...",
          "score": 14
        },
        {
          "text": "If you can afford it, do it as long as it doesn’t derail your other financial commitments.\n\n% wise I spend around &lt; 10% of my annual income on travelling.",
          "score": 5
        },
        {
          "text": "Less than S$10k a year but also because I used to travel to Europe when I was a student on subsidised trips or for work. So my own trips are mainly to different parts of Australasia - this includes subsidising my parents trips maybe once a year.\n\nAnyway, totally understand how you feel because growing up I only ever gone on 3 trips with my parents and it's a JB day trip, Genting and BKK (only when I was in uni and I paid for my own using my part-time pay).\n\nAlso, if you're still eligible, there's a youth pass for Eurail so suggest going to Europe on that pass and like others mentioned, you can have good memories even staying in a dorm bed.",
          "score": 4
        },
        {
          "text": "earn around $65-70k a year and spend around $3-4k on trips\n\nbesides travel i'm a really low spender so frankly i feel like i can spend more on travel but there's this weird sense of guilt for spending money :') trying to get rid of this mindset though because i do think it's important to maximise life's experiences while still young",
          "score": 4
        },
        {
          "text": "If you are confident in your career progression, you can spend more now with the expectation you will earn back next time. When you are older / more senior / more stress, holidays become harder and harder to take (or even take already interrupted with work calls / meetings / etc). Also inflation. Last time I could eat michelin star meals for $100/pax... now good luck with that. Luxury resorts also more than 2x in price.\n\n  \nWhen starting out I spent maybe 10% annual income on holidays.",
          "score": 4
        },
        {
          "text": "$20k/Yr",
          "score": 3
        },
        {
          "text": "Past 3 years always clocked about 4 countries each year. Less than 10% my annual income.",
          "score": 2
        },
        {
          "text": "Should earn and travel when you are young. Some things you definitely won't / can't do when older. Doesn't have to spend a lot. To nearby lesser known places is also an experience.",
          "score": 2
        },
        {
          "text": "I’ve all the money to travel. But I’ve no time and I’m tired. Dad of 2 young kids.",
          "score": 2
        },
        {
          "text": "Congrats on making adult money.\n\nStart with how much you want to save/ invest first. If I'm making 6k take home,  I'll invest 3.5k. Then 2k for spending in that month. And 500 for travels (accumulate across the months).",
          "score": 2
        },
        {
          "text": "Depends on their family size and priorities. A single regional trip for a family of four can easily hit 10k, or you can do budget trips alone for 1-2k.\n\nIf you're young with less commitments now is the time to visit the places off the beaten path if that's your jam.\n\nI wanted to go to Tibet in my younger days but kept putting it off and by the time I got around to planning the trip, my doctor advised against it.",
          "score": 2
        },
        {
          "text": "It's so much easier to travel on budget now then decades ago. Travel further and often when you are younger and no kids. Keep the children friendly places like Australia,  Japan etc to when u have kids.",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1r9t1ji",
      "subreddit": "singaporefi",
      "title": "For those who have FIREd, what is your daily routine?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r9t1ji/for_those_who_have_fired_what_is_your_daily/",
      "score": 26,
      "num_comments": 34,
      "created_at": "2026-02-20T19:36:17",
      "selftext": "Wanted to hear from those who have FIREd, how does your daily routine look like? Did you plan ahead before taking the leap of faith - what are the considerations? How much has realities deviated from the original plans? TIA!",
      "comments": [
        {
          "text": "0530 - reveille to prepare breakfast\n0600 - wake son and wife up for school and work\n0700 - walk with son to school. Walk home then accompany wife to her workplace. \n0815 - start 5km walk/jog followed by static exercises (push-ups and sit-ups, no thanks to IPPT)\n0945 - grocery shopping \n1030 to 1300 - read kindle, lunch\n1300 - fetch son from school \n1330 to 1830 - play with son\n1930 to 2130 - lesson (tutor here)\n2130 to 2330 - play with wife\n2330 - lights out",
          "score": 108
        },
        {
          "text": "In the morning, if my face is a little puffy, I’ll put on an ice pack while doing stomach crunches. I can do 1,000 now. After I remove the ice pack, I use a deep pore cleanser lotion. In the shower I use a water-activated gel cleanser, then a honey almond body scrub, and on the face, an exfoliating gel scrub. Then I apply an herb-mint facial mask which I leave on for 10 minutes while I prepare the rest of my routine. I always use an after shave lotion with little or no alcohol, because alcohol dries your face out and makes you look older. Then moisturizer, then an anti-aging eye balm, followed by a final moisturizing protective lotion",
          "score": 84
        },
        {
          "text": "Posted this on a previous discussion as well. Reposting again:\n\nSold my startup recently and been on a break for 9 months. I have had a great time so far. Here is what I have been upto:\n\n1. Learnt Baking from ACI (used Skillsfuture)\n2. Short overseas trip every other month\n3. Reading a lot - we have excellent libraries\n4. Improved my meditation practice\n5. Exercise - 10k steps per day + 3 times/week strength training at ActiveSG gym\n6. Cooking meals at home\n7. Mentoring new founders\n8. Doing courses on Coursera and EDX\n9. Taking care of the 65 houseplants I have\n10. Investing in ETFs, stocks and bonds\n11. Exploring the outdoor spaces - parks, trails etc\n\nMy wife claims I am busier now!",
          "score": 20
        },
        {
          "text": "Wake up. Chauffeur duties.train and exercise, breakfast, rest. Lunch. Free time. Prep dinner. Chauffeur duties.cook dinner. Play with kid, sleep",
          "score": 14
        },
        {
          "text": "wake up, do some form of exercise (weights/yoga/hike), go hawker centre for tea/coffee, visit my parents/friends for lunch/dinner, do chores, trade, read, watch mindless videos…giving myself 6 months to live without a fixed routine for now…\n\n",
          "score": 9
        },
        {
          "text": "Single FIRE-ed life*.\n\n9-10am: Sleep in. Wake up and wash up. Have light branch (make it myself, or if lazy order/buy take away or eat at a cafe and chill. \n\nUntil 3-4pm: Interests/Hobbies - Whatever I feel like doing. Gaming, baking, reading, chilling out to music, learning Japanese, light exercise on threadmill while watching videos. \n\n3-4+pm: Cook a nice dinner for family. Cooking and baking are part of my core interests.\n\n6+pm: Dinner, bath.\n\nUntil 1-2am: Continue with Interests/Hobbies until bed time~\n\nTo switch things up, some days I'll meet friends for lunch or dinner, or volunteer at church. Some days I'll spend time socialising and networking in person or on chat groups. I also travel overseas at least 2-3 times a year (mainly to Japan).\n\n*Caveat is now I am volunteering full-time in church as they need people. Before that, I had the schedule above for 1+ years and was extremely contented. I am looking forward to resuming the above schedule once I am no longer needed on a full-time basis!",
          "score": 8
        },
        {
          "text": "I only FI…..haven’t RE yet….but I think I would spend time doing nothing if I FIRE….",
          "score": 7
        },
        {
          "text": "Just curious for those who have FIREd, how much passive income per mth do u guys have?",
          "score": 3
        },
        {
          "text": "Live in Sapporo after I FIREd. Everyday is an exploration..meeting neighbours, go explore new places, run errands at city bureau and other gov agencies.",
          "score": 3
        },
        {
          "text": "Oh, I get up and make myself some coffee.\nI try to read a bit but the story's too thin.\nI thank the Lord above,\nyou're not here to see me in this shape I'm in.",
          "score": 3
        },
        {
          "text": "Gooning",
          "score": 3
        },
        {
          "text": "Wake up 545am, do 10mins of stretching, and then some push ups. Then boil water to cook 2 softboil eggs, eat a banana, eat a handful of nuts and pumpkin seeds, and a slice of bread. And make a cold glass of honey water. Then get kids ready for school and walk them to bus stop and then go for a 45min walk at park. Then do some chores at home depending on the day. Then read and check share prices and news. Lunch might be alone or with friends if they are free. Then some reading again. And then some chores or go for a swim, basketball, hike, before dinner. After dinner is family time, coach kids on studies if they need help. And then listen to music to relax and count my blessings",
          "score": 3
        },
        {
          "text": "Wake up whenever I want. Have a good breakfast, gym, meet people for tea/coffee, have. A nice dinner, work out more. Repeat. Tbh it can get boring but at least I don't have to worry about money.",
          "score": 2
        },
        {
          "text": "When I'm in SG, I usually wake up between 1200 noon to 1300 (usually sleep around 0500).\n\nCoffee. Breakfast (leftovers, sandwich, buy from coffee shop downstairs).\n\nTurn on the computer again. Start clearing emails. Depending on the day I might pop into the office or a work site (I still work a bit). If not I usually spend the afternoon listening to music as I do admin work. \n\nEvenings are for meeting friends, gymming, indulging in hobbies. I dance and DJ salsa, bachata, and west coast swing so there's usually at least one social going on.\n\nIf I go out then I usually get home around 0100. Look at the markets and see if there are any swing or scalp opportunities. Clear more emails and do more admin work. In bed around 0430 - 0500 and read for a bit till I fall asleep.\n\nSome times I'm deep into a computer game so most of my schedule then revolves around that! My most recent entrapments were Oxygen Not Included, Satisfactory, Slay the Spire, BG3, Cyberpunk.",
          "score": 2
        },
        {
          "text": "I researched the financial and emotional sides of retirement. I am the sort of person who is never bored for long so I was worried about not having anything to do in retirement. I did not inform my parents and relatives of my retirement to avoid having them think that my free time is now to be spent doing things for them. \n\nI retired a month ago and am still tuning my routine. Main things would be healthier eating, exercising and exploring new places and learning new things. \n\nMornings: Hydrate. Chores. Exercise at home or out. \n\nLate mornings/early afternoon: Grocery shopping and cook lunch, or once a week explore some place such as local sights and parks. I bought passes to universal studios, national gallery, zoo, flower dome. \n\nLate afternoons: Read/listen to audiobooks, planting/gardening, virtual tourism on youtube, gaming. Prepare recipe and shopping list for next day. ",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1ra81yc",
      "subreddit": "singaporefi",
      "title": "Emerging Market/non US etf?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1ra81yc/emerging_marketnon_us_etf/",
      "score": 5,
      "num_comments": 9,
      "created_at": "2026-02-21T05:26:08",
      "selftext": "Most of my position are in US stocks. I want to diversify some to emerging markets or just non US etf. Any low cost etf that are tax friendly/ zero estate tax to Singaporean? similar go VWRA to recommend?\n\nEdit: I’m using IBKR",
      "comments": [
        {
          "text": "EIMI is the classic. \n\nBut please help yourself next time by looking on this valuable resource, and choose something that is both big (fund size) and has low TER, and find the LSE, USD version. \n\nhttps://www.justetf.com/en/etf-lists.html",
          "score": 7
        },
        {
          "text": "Depends on your definition on emerging. Most include china/Taiwan/Korea which I feel not YOLO enough for me. EIMI is the main one.",
          "score": 4
        },
        {
          "text": "I was in the same mindset a few months ago - at the time, my portfolio was mostly CSPX, then I just changed it to VWRA and a bit of EIMI (emerging market)",
          "score": 2
        },
        {
          "text": "I am 90% VWRA and 10% EIMI.",
          "score": 2
        },
        {
          "text": "EXUS(LSE) + EIMI.\n\nOR just sell existing and buy VWRA.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1ra1f6b",
      "subreddit": "singaporefi",
      "title": "Any experience of FIDReC?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1ra1f6b/any_experience_of_fidrec/",
      "score": 3,
      "num_comments": 43,
      "created_at": "2026-02-21T01:19:53",
      "selftext": "Fighting with an insurance company. \n\nMy dad went through an operation to remove a benign mass at left adrenal gland at NUH. Everything went well and his recovery is smooth.\n\nAfter a very very long claim process, the insurance company has decided to void his policy and will only refund the premiums, on the basis of we didn’t disclose his existing condition on lungs. \n\nOn the lungs, in the prior year health screening reports it showed the lungs have some “Fibrous hardening lesions” and “Multiple lymph node calcifications”, which now they believe are material for underwriting. My father had no symptoms and he was a smoker previously, there was no long-term medication required other than monitoring. \n\nTo be clear, these conditions don’t fit into the explicit callouts like “breathlessness, coughing with blood, persistent cough” in the fine prints of T&amp;C, and only fit into the “any other conditions”. \n\nI wrote to the CEO and said I am about to file FIDReC, very quickly someone called me in the same hour but after a few days of “investigation”, they still decided to reject the claim. \n\nAnd the thing is, the insurance company said no need medical examination when they sell the policy, now they want to void the policy and reject the claim because a condition that is 1) not related to the actual operation and 2) not even explicitly called out in the contract? \n\nI think the insurance company is deliberately making the policy selling easy so they can collect premiums, and then not asking for medical examination, so they can reject claim at their discretion. \n\nAnyone have dealt with FIDReC with similar cases? Do I have a case at all? \n\nThis long fight has really taken a toll on me, seriously considering on whether I should continue this uphill battle. \n\nThanks for reading, appreciate your insights in advance. ",
      "comments": [
        {
          "text": "No experience with FIDREC.\nHowever, not requiring medical does not mean one can not declare pre-existing conditions. This justification of yours holds absolutely zero water.",
          "score": 37
        },
        {
          "text": "Agent for 10 years already. You have no case. You're suppose to declare under other conditions. \n\nIt doesn't matter if it's material or not, not for you to decide. Moreover, the policy wording is against you.",
          "score": 25
        },
        {
          "text": "You not disclosing the condition just gave the company the easy reason to do what they did..",
          "score": 15
        },
        {
          "text": "It is not for you to decide whether what's in the health screening reports is material to his under-writing or not. That's the under-writers' job. My question to you is, did you submit those medical screening reports prior to purchasing the policy? If not, then its totally on you liao. The fact that those screening reports did highlight issues with the lungs is already sufficient for you to bring up during the application. ",
          "score": 6
        },
        {
          "text": "Sympathy for your father, but your post does not make sense and you have not even done the most basic ChatGPT research. What matters is what the policy wording says and what questions were asked in the application. It is not relevant that no medical exam was required or the policy was easy to sell.\n\nNo one can tell if you have a case based on the information given because your post is very badly framed. You could not take this post to an insurance lawyer.\n\nThis is probably the wrong sub as most people here are focused on telling you to buy VWRA and chill and have zero experience with insurance policy wording and nuances.",
          "score": 6
        },
        {
          "text": "Clear cut, no case, worse than didn’t know, knew but didn’t disclose. Since u already at it go thru Fidrec and get that finding, u not gonna let go until they adjudicate anyway, maybe u get closure then.",
          "score": 5
        },
        {
          "text": "The policy was purchased before or after the health screening?",
          "score": 4
        },
        {
          "text": "Never declare pre existing condition means the entire policy is voided. Save your energy, don't waste time.",
          "score": 4
        },
        {
          "text": "Sorry to hear what you’re going through, \n\nI usually go straight to MAS… But FiDRec should work, but I think need to pay a small fee or something\n\n\nMAS better because too many people complain about the same thing then MAS may remove that product or something",
          "score": 2
        },
        {
          "text": "I went to FiDREC with an insurance company. They paid me the full amount after that - not a big sum by the way.\n\nTo have a chance of winning, you first need a doctor to declare it is not related to existing condition. This will come in the form of “I’m seeing the patient for this condition the first time” checkbox.\n\nNext, you challenge the insurance to prove that it is related to existing condition. (Hint: even with in house doctor, they can’t).\n\nTell them you’ll drag the case as long as possible.\n\nYour mental mindset: don’t plan to win, just plan to drag the case.\n\nDrop me a DM if you want to talk.",
          "score": 2
        },
        {
          "text": "Did you mention to the agent back then that there was this finding in the health screening? I don’t think the agent could have possibly known that there was this finding before - and logically speaking, it’s very hard for the agent to ask all the specific questions, hence your agent has done his due diligence in asking about medication/symptoms. \n\nHowever if you did tell him/her about this finding back then during the application phase, it’s agent’s mishandling for sure. Usually for my clients I’ll just declare even if it’s like a small cyst/small lump/small lesion that was detected. If my client told me about “Multiple lymph nodes calcification” in his previous health reports, it would have 100% made me declare it in the application. \n\nRegarding your question tho - I have dealt with Fidrec before on behalf of a client. Technically it was supposed to be a condition that shouldn’t have been covered, hence the insurer rejected the claim  (congenital illness has a 1 year waiting period, 9month old baby has no symptoms at birth + it was a congenital condition that will take a while to surface, and the symptoms only surfaced when she was 9 months old) - but the insurance company ended up covering the costs of the hospitalisation after I went to fidrec. Disclaimer: This is not the full account of the situation, I don’t want to type too much on Reddit so I’m just keeping it concise. \n\nAnyway, just go and contact fidrec if you have to! They are not difficult to deal with. Regarding time &amp; effort - filing the claim took less than 30 min, after which insurer had a phone call with my client to tell claim has been approved. Good luck!",
          "score": 2
        },
        {
          "text": "You dont have much of a case, but you can file anyways and see what comes of it.",
          "score": 1
        },
        {
          "text": "You said it yourself. It may not apply for the explicit call-outs you mentioned. But you probably also put no into the ANY other conditions / abnormality. That is the catch all term.",
          "score": 1
        },
        {
          "text": "Are adrenal gland lumps related to the lungs? Why not exclude lungs, how come can void the policy?",
          "score": 1
        },
        {
          "text": "Which company?",
          "score": 1
        },
        {
          "text": "If you had presented the report to your agent (presumably a GE-tied agent) and your agent advised you there was no need to disclose, you have a case. But you would need some proof. Otherwise, probably not. ",
          "score": 1
        },
        {
          "text": "Fight for what. You dont understand the T&amp;Cs? Spend the time and effort in education instead",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r9z5ng",
      "subreddit": "singaporefi",
      "title": "OCBC 360 vs DBS Multiplier",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r9z5ng/ocbc_360_vs_dbs_multiplier/",
      "score": 2,
      "num_comments": 14,
      "created_at": "2026-02-20T23:58:24",
      "selftext": "Fiancee and I are planning to get a joint account, while maintaining separate bank accounts. Can’t decide on either OCBC or DBS. We don’t have a home loan or investments with either. How should we split our finances and which HYSA is better?",
      "comments": [
        {
          "text": "I'm very happy with multiplier. 4.1% is awesome.\nI used SRS to sign a 5k manulife 3 year investment plan as I don't have a housing loan. Just getting 2-3% interest on that 5k but doesn't matter, the additional 1.1% is totally worth it. It will count for 1 year, since 3 years is the minimum plan I just gotta top up SRS 3 times in total and sign up new plan, then I can just roll over from earlier payout after 3 years. And even reduce taxable income.\nI got 3650$ in last 12 months from multiplier.",
          "score": 2
        },
        {
          "text": "If you are doing salary deposits to your personal bank accounts, not the joint one, then it hardly matters if it’s just for monthly expenses. \n\nUnless you are really asking which one is easier to trick with a fake salary deposit?\n\nIf the joint account is to be used for savings, not just expenses, then it’s better to use a money market fund instead of a HYSA with salary deposit hoop to jump through. I’m not sure if MMF can be joint though; it will probably have to be in one person’s name but you share the login credentials.",
          "score": 1
        },
        {
          "text": "Google",
          "score": 1
        },
        {
          "text": "I don’t have OCBC 360 but I’m pretty happy with my 3% on 100k in DBS multiples",
          "score": 1
        },
        {
          "text": "Why not both? 😁",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1rafzse",
      "subreddit": "singaporefi",
      "title": "OCBC SRS promo",
      "url": "https://old.reddit.com/r/singaporefi/comments/1rafzse/ocbc_srs_promo/",
      "score": 1,
      "num_comments": 0,
      "created_at": "2026-02-21T11:05:54",
      "selftext": "I just found out that OCBC was running an SRS promo, and got 50 bucks credited into my account for creating and depositing money into the account. \n\nI think it's already over though. Does anyone know if the other banks had/have similar promos?\n\nDidn't see any posts here about it so I'm posting it. \n\n  \n[https://www.ocbc.com/iwov-resources/sg/ocbc/personal/pdf/campaign/terms-and-conditions-governing-srs-srs-year-end-campaign-2025.pdf](https://www.ocbc.com/iwov-resources/sg/ocbc/personal/pdf/campaign/terms-and-conditions-governing-srs-srs-year-end-campaign-2025.pdf)",
      "comments": []
    },
    {
      "id": "t3_1radaa9",
      "subreddit": "singaporefi",
      "title": "Weekly Celebratory Thread!",
      "url": "https://old.reddit.com/r/singaporefi/comments/1radaa9/weekly_celebratory_thread/",
      "score": 1,
      "num_comments": 1,
      "created_at": "2026-02-21T09:00:02",
      "selftext": "This thread is for those looking to share hitting their milestones!\n\nCongratulations on being one step closer to FI!",
      "comments": [
        {
          "text": "Put on only 1.2kg instead of 2kg during CNY.\n\nBeating forecast so far ...",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r9su0g",
      "subreddit": "singaporefi",
      "title": "Home loan show fund",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r9su0g/home_loan_show_fund/",
      "score": 1,
      "num_comments": 8,
      "created_at": "2026-02-20T19:24:53",
      "selftext": "Say you want to buy a property of 2M, ideally you want to pay with 500K down payment with a loan of 1.5M\n\nNow because of TDSR, you can only borrow 1.3M. What are the show-fund options available in order to loan an additional 200K?\n\nIn particular would 200K SSB in CDP count towards pledged fund? ",
      "comments": [
        {
          "text": "Ask the bank",
          "score": 5
        },
        {
          "text": "Was recently asked to do the same. You can either transfer a certain amount into the bank's current/savings account which is the most straightforward, and mostly requested, or you need to have equities in your CDP to support. Take note that equities only account for 30% to 50% of its value, so you might need 300-400k in equities. Moreover, they have to be blue-chip stocks. \n\nThe easiest way, as shared is to transfer money temporarily into the bank's account. The amount, you will need to check with the banker. \n\nAnother alternative is to find another bank which does not require you to show funds. ",
          "score": 3
        },
        {
          "text": "No, ssb in cdp cannot be counted as pledged.",
          "score": 2
        },
        {
          "text": "Show fund (unpledging) means literally show fund lor, got money, show bank (what each bank/officer expect may differ) \n\nSSB in CDP unlikely for pledging purposes.",
          "score": 1
        },
        {
          "text": "Ask your mortgage brokers/specialists. The simple rule is unpledged funds are recognised at at most 30% (so 100k is only worth 30k). And they take the discounted value and divide it over 48 months (so 100k, only 30k recognised and over 48months is +$626 \"income\" per month). \n\nBut before people run off trying to show funds, first ask yourself truthfully if you'll be able to finance the monthly repayments consistently for at least 4 years (due to SSD) even if rates spike to 4.5%.",
          "score": 1
        },
        {
          "text": "Needs to be liquid - or there will be a haircut at the discretion of the bank. Best funds to show will be deposits at a local bank.",
          "score": 1
        },
        {
          "text": "damn scary to see people trying to borrow more than the TDSR (\"safe borrowing limit\") allows/recommends.",
          "score": 1
        },
        {
          "text": "it is just a form with a table where you list out the different accounts you have and amount of monies in there. Along with the form are the screenshots of the balances and proof of ownership over the accounts. e.g. brokerage account (poems, ibkr, standard chartered trading, moomoo, etc.), savings account in other banks under your name, etc.  \n  \nit must be under your name. i believe is quite a common practice for family members to do a temp. cash transfer. pad the bank balance and transfer back once the loan is secured; provided your loved ones have the funds.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r9rwnl",
      "subreddit": "singaporefi",
      "title": "How do you track category spend on UOB Lady’s card",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r9rwnl/how_do_you_track_category_spend_on_uob_ladys_card/",
      "score": 1,
      "num_comments": 10,
      "created_at": "2026-02-20T18:31:34",
      "selftext": "I just got the UOB Lady solitaire and assigned two categories. Given there’s a cap for the 4mpd, I want to track those category spend and once I hit the cap, move to another card.\n\nHow can I do that? The rewards tab in the UOB TMRW app doesn’t seem to have that function.",
      "comments": [
        {
          "text": "Have a supplemental card. Ensure category 1 is used on primary card.\n\nUse category 2 on supplemental card.",
          "score": 5
        },
        {
          "text": "I just take out my calculator and manually count it lol",
          "score": 4
        },
        {
          "text": "I use a Google sheet to track. Enter the amount and category, then use a formula to sum up based on category",
          "score": 2
        },
        {
          "text": "I use a combination of google sheets and iPhone automation. \n\nEach time I log an expense, I would select the category it falls under and send it to my google sheet. \n\nOnce recorded in my sheets, I use sumifs formula to sum all expenses based on that category. Every week I will open the sheet and check lor",
          "score": 2
        },
        {
          "text": "Nowadays Chinese Android phones have an Ai assistant. Taking a screenshot and sending that into the Ai space can help you keep track of the monthly spending.\n\nFor example on Oppo and Oneplus phones using colorOS or oxygen OS there is something called mind space. \n\nWhen you use a 3 finger swipe, which I did on Google wallet spending page (I link my lady solitaire to my Google wallet). It will save it into mind space. I can find the spending there. You can also ask gemini to link up with mind space and summarize for you (only on global not Chinese versions) This is tried and tested on my oneplus 15 using Google wallet. I believe this feature works on most transaction and shopping apps including lazada/shopee",
          "score": 2
        },
        {
          "text": "lady card is via calendar month so just make sure u hit 750 for each of the 2 categories to maximise it fully at EOM. ",
          "score": -1
        }
      ]
    },
    {
      "id": "t3_1r9pblq",
      "subreddit": "singaporefi",
      "title": "How to bring money to spend in China",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r9pblq/how_to_bring_money_to_spend_in_china/",
      "score": 1,
      "num_comments": 28,
      "created_at": "2026-02-20T15:53:34",
      "selftext": "Planning to spend 4 months / 8k SGD on student exchange program in China.\n\nI'm not very knowledgeable and have received different advice from friends so want to know which is best way to bring/spend money in China.\n\n1. Physically exchange SGD for CNY, declare at customs and deposit into Chinese Bank Account, pay using Alipay\n2. Use bank to exchange SGD for CNY and do a international transfer into Chinese Bank Account, pay using Alipay\n3. Use Youtrip/Revolut/Wise to exchange/link and spend throughout using Alipay\n\nMy main concerns are transaction fees and limits.\nMethod 1 guarantees I can bring money in with minimal fees but might be risky. Method 2 is safest and won't hit limits but the fees seem high. Method 3 might hit limits in those Youtrip/Revolut/Wise apps.\n\nHas anyone went on a long trip in China recently? What would be the best way to go about this, sorry if I sound stupid.",
      "comments": [
        {
          "text": "I simply linked my Visa card to Alipay.\n\nProbably not the most cost effective but its the simplest.",
          "score": 15
        },
        {
          "text": "You can open a Chinese bank once you get the student visa verified at the police station. You will be issued a 居留许可 then you can get Sim card and bank account.\n\nWhen I did my exchange in shanghai almost a decade ago , I got both a locol bank and Sim card. The school will guide you by the way",
          "score": 7
        },
        {
          "text": "You can use Alipay using a foreign(eg sg credit card/youtrip). I am not sure how easy it is for you to open a local bank account without a local number. \n\nOne issue with using a sg card is that some apps in China only recognise local cards. From my experience, you run into more issues with a foreign card when using WeChat pay than Alipay",
          "score": 5
        },
        {
          "text": "I heard Changi Pay app works with Alipay+ enabled QR codes (merchants)\n\nIt’s a top up system like Wise, Revolut and Youtrip\n\nYou can change back your wallet amount (RMB to SGD) to your bank account\n\nIt’s zero transaction fees, but your exchange rate fluctuates with the exchange market rate, unlike youtrip where you can lock the exchange rate for that amount you topped up. You are not limited by the above 200 rmb and additional transaction fees added. You have a 35,000rmb limit per transaction (it’s about 6890sgd now, so quite a large transaction limit)\n\nAlternatively you have a Chinese friend who has a wechat wallet, you western union to your friend’s wallet (western union only charge one time transaction fee), and you set up a WeChat wallet (must verify with your local debit/master card though) and receive the transacted rmb money from your friend. Either pay your friend a token fee or treat your friend a drink or smth? For me I use this method because I spend using my wechat wallet (in rmb) very easily across the country and in Hong Kong airport too. Direct deductions in rmb also help me keep my wallet transactions fuss free",
          "score": 4
        },
        {
          "text": "DBS union pay debit card linked to Alipay or Wechatpay.",
          "score": 3
        },
        {
          "text": "1. chi bank acct is notoriously difficult to open. for 4 months, the effort is not worth it imo. \n\n2. same as 1 \n\n3. this is most convi. iirc revolut has surcharge if you convert rates on a weeend. for simplicity i just use youtrip, trust card works fine too, link to alipay and spend from there. 8k is well below any sort of daily/monthly limit! \n\n\npro tip for 3. if you use youtrip, link your disposable virtual card no. instead of your physical card no. in case of any fraud, you need not get a new youtrip card replaced (i.e. deliver to sg address, relink card across all your apps, etc. i went thru it, it's a pain)\n\n\nhave fun on your exchange!",
          "score": 2
        },
        {
          "text": "How about\n\n\n4. Open a China bank account. Physically exchange about 2k SGD (or whatever the limit is to not declare, i cant recall if i brought in 2k sgd in CNY before or more, and didnt declare) for CNY and deposit into bank account. \nThis can cover your first month there. \n\n\nUse Youtrip/Revolut/Wise to exchange/link and spend throughout using Alipay. \nNote that spends above 200rmb have a 3% fee.\n\n\nYou can also use it to withdraw money from China ATM and deposit more into your China bank account. Rates are as good as changing at money changer in SG. \n\n\nSpending more than 200rmb from your China bank account has no additional fees.\n\n",
          "score": 2
        },
        {
          "text": "Get a fx free card.\n\nLink to alipay and wechat.\n\nBigger purchase just use the card.\n\nMost places don't take cash.\n\nWhy is this fi...\n\nEdit: you won't be able to open account easily. You have better luck opening an account with a china bank in sg if they have options for you. I don't know if there is.\n\nEdit2: there's no cap on spending. But there's transaction limit of 200 rmb. The fee isn't that high. But when the bill is above 200 rmb, there's a chance of using card directly.",
          "score": 2
        },
        {
          "text": "I wouldn't recommend 3 as a lot of places in China don't accept cards, not to mention international cards (even if you link them via Alipay!). 1 and 2 are much safer and almost guarantee a cash-less life in China.\n\nIf it's 8K SGD (roughly 40k CNY) in total, I don't think you need to declare at all. As for fees, use Wise to convert and send money to your Chinese bank account is usually the cheapest with least hassle, based on my personal experience.",
          "score": 2
        },
        {
          "text": "Are you using $8k to pay for accommodation?\n\n$2k/month is a lot of spending money if accomodation is accounted for.\n\nIf you are only requiring spending money, just tie your YouTrip or Wise card to Alipay. Top up as you spend,\n\n  \nYouTrip does not have any transaction fee or limit.",
          "score": 2
        },
        {
          "text": "Once you linked a Chinese bank account to Wechat or Alipay you should be able to transfer money directly with wise (and other similar stuff i guess)\n\nAlternative if you know someone that have such card already linked you can ask him to transfer the money to himself and then to you.",
          "score": 1
        },
        {
          "text": "Can get a Bank of China Union Pay debit card from their Singapore branches.",
          "score": 1
        },
        {
          "text": "The limit for YouTrip / Revolut / Wise is 100,000 SGD per year. You won't hit one.\n\n\nFor Alipay / WeChat Pay:\n\nMari Credit Card is a good option if you qualify for credit cards, otherwise Trust Debit Card. Just be aware of the 200 yuan limit for fee free transactions for Visa and Mastercard. \n\nThere's also an ICBC Friendship Credit Card but ICBC UI is terrible. It is a Unionpay credit card, so no 200 yuan limit, and gives you 1.6% cashback with no FX fees.\n\nOtherwise Changi Pay as others have mentioned.",
          "score": 1
        },
        {
          "text": "YouTrip link the card to Alipay.\n\nI go to China a few times a year and it works well in most places. I can use it for public transport like buses and trains too. \n\n\nI bring a few hundred dollars of yuan too and a credit/debit card I can use in a pinch too but almost every used them in the recent years. ",
          "score": 1
        },
        {
          "text": "Cash and you trip card.",
          "score": 1
        },
        {
          "text": "You can just top up your Alipay balance with a money changer. It’s a pain opening a Chinese bank account and  the fees the apps charge aren’t worth it",
          "score": 1
        },
        {
          "text": "i had exchange in china before. created an icbc account in singapore and was able to withdraw cash in RMB from icbc atm across anywhere in china. subsequently, i will deposit the cash into my china icbc / boc bank account. \n\nunfortunately icbc SG / boc SG aren't linked to icbc china / boc china. ",
          "score": 1
        },
        {
          "text": "alipay/wechat pay, link to youtrip ",
          "score": 1
        },
        {
          "text": "There's no need for a china bank account.\n\nBest option: Wechat. Link you credit/debit card to it.\n\nTech-free option: You can use cash. Change it in Singapore. The limitation is the small local stores may not have change.\n\nDidn't work for me: Alipay was pain. I still couldn't get it to work after a week. Couldn't verify my passport, manual verification didn't work either.\n\nTrust card has no transaction fees.",
          "score": 1
        }
      ]
    }
  ]
}