{
  "schema_version": "raw_scrape_v1",
  "report_id": "2026-02-13",
  "scraped_at": "2026-02-13T13:28:43.809539",
  "subreddits": [
    "singapore",
    "askSingapore",
    "SingaporeRaw",
    "singaporefi"
  ],
  "total_posts": 40,
  "total_comments": 501,
  "posts": [
    {
      "id": "t3_1r2orp8",
      "subreddit": "singapore",
      "title": "Budget 2026: Smokers to pay 20% more for tobacco products from Feb 12",
      "url": "https://old.reddit.com/r/singapore/comments/1r2orp8/budget_2026_smokers_to_pay_20_more_for_tobacco/",
      "score": 788,
      "num_comments": 228,
      "created_at": "2026-02-12T17:11:55",
      "selftext": "",
      "comments": [
        {
          "text": "my mom hates smokers, the fact this was on her birthday, well thats a nice birthday gift.",
          "score": 431
        },
        {
          "text": "Too many inconsiderate smokers. At homes and at traffic junctions. Some also walk along path way and smoke ignoring others.",
          "score": 362
        },
        {
          "text": "That's + $2.00 for a 20-pack in case you're wondering.",
          "score": 254
        },
        {
          "text": "Never felt happier to be a non-smoker, but I do hope that with time, programmes that help quit smoking do also get the attention it deserves",
          "score": 212
        },
        {
          "text": "With effect immediately is the best news of the day",
          "score": 143
        },
        {
          "text": "I am planning to quit after April so hopefully this will really force me. Then I only smoke during reservist",
          "score": 98
        },
        {
          "text": "Hahaha get rekt",
          "score": 76
        },
        {
          "text": "Raise their insurance premium too. They are a huge liability to the healthcare system.",
          "score": 70
        },
        {
          "text": "Unlikely to fully stop smokers but hopefully can reduce their smoking rate 😂",
          "score": 53
        },
        {
          "text": "idc if cigarettes cost $1 or $1000 per stick, can something be done about people smoking illegally all around the island?",
          "score": 52
        },
        {
          "text": "Divert the increase from tobacco tax to healthcare costs associated with smoking!!",
          "score": 43
        },
        {
          "text": "I am an ex-smoker quit for almost a decade. One of the best decision I've ever made. If you're a smoker and plan on quitting this is a great time. You can do it believe in yourself",
          "score": 18
        }
      ]
    },
    {
      "id": "t3_1r2tynr",
      "subreddit": "singapore",
      "title": "Straits Times front page feature on 12 Feb - A labour of love at a horse-picious void deck",
      "url": "https://old.reddit.com/r/singapore/comments/1r2tynr/straits_times_front_page_feature_on_12_feb_a/",
      "score": 629,
      "num_comments": 21,
      "created_at": "2026-02-12T21:51:34",
      "selftext": "",
      "comments": [
        {
          "text": "The person in charge of the design is an Indian lady, how awesome!",
          "score": 305
        },
        {
          "text": "That is nice. Next month Hari Raya maybe can decorate like malay kampung",
          "score": 126
        },
        {
          "text": "Taken by the talented photojournalist, Shintaro Tay. You can check out his works on IG @ shintarotay",
          "score": 57
        },
        {
          "text": "This is so wholesome!! Very nice effort to decorate and showcase the CNY spirit \n\nPs: just noticed the person in charge of this design is an Indian lady 😲 incredible!",
          "score": 29
        },
        {
          "text": "Let just hope that no one complains to town council",
          "score": 27
        },
        {
          "text": "I saw this when I was strolling around the Blair Houses area! Wonderful efforts. The flip sides of the walls have good decor too. ",
          "score": 20
        },
        {
          "text": "this looks good. didn’t hit me how austere our void decks usually look.",
          "score": 14
        },
        {
          "text": "Oh, now I wanna see one for the other holidays too. Very nice tbh.",
          "score": 8
        },
        {
          "text": "Just, wow. 80s/90s void decks are great. Today’s void decks are like playing Wolfenstein 3D.",
          "score": 4
        },
        {
          "text": "This is awesomeee! There's a block at Marsiling that does this type of festive decoration too awhile back!! Not sure if they still do it tho",
          "score": 4
        },
        {
          "text": "My neighbor decorated the lift lobby and walkway every CNY.\n\nthere's even festive plants just beside the lift doors.",
          "score": 4
        },
        {
          "text": "Lowkey feels like you'd see Tensen here",
          "score": 2
        },
        {
          "text": "Under whose approval?",
          "score": -3
        }
      ]
    },
    {
      "id": "t3_1r2od78",
      "subreddit": "singapore",
      "title": "​Budget2026: Singaporean households will each get $500 in CDC vouchers in Jan 2027. Eligible Singaporean adults will also receive a Cost-of-Living Special Payment of up to $400.",
      "url": "https://old.reddit.com/r/singapore/comments/1r2od78/budget2026_singaporean_households_will_each_get/",
      "score": 301,
      "num_comments": 120,
      "created_at": "2026-02-12T16:46:16",
      "selftext": "",
      "comments": [
        {
          "text": "they never talk about housing at all sia, thought they wanted to talk about single bto age and bto incoming ceilings",
          "score": 256
        },
        {
          "text": "Please just address salaries and housing costs instead of vouchers as a band aid.",
          "score": 129
        },
        {
          "text": "Never change, Voucher Wong, never change.\n\n(I'm a big fan of using vouchers as a progressive economics tool)",
          "score": 122
        },
        {
          "text": "Sept and Jan never felt so far away....",
          "score": 114
        },
        {
          "text": "so i guess they did slash cdc vouchers? no more mid year tranches",
          "score": 48
        },
        {
          "text": "Well, at least got $500 more in child lifeSG credits this year.\nFamilies with young children deserve additional support.",
          "score": 40
        },
        {
          "text": "LW: We need more ideas for the budget \n\nLackeys: CDC vouchers? \n\nLW: Do it.",
          "score": 29
        },
        {
          "text": "wow... i didn't know 100k assessable income is considered needing help for cost of living...  \n\n\nor COL is not what i think it is?",
          "score": 17
        },
        {
          "text": "No surprises there. The election is already over.",
          "score": 12
        },
        {
          "text": "My company PRs are laughing at us.. priorities given to our neighbours, and those converted to Singaporean",
          "score": 8
        },
        {
          "text": "Minister salaries to be reviewed, then now CDC and Cash is lesser than last year. Coincidence? I think not.",
          "score": 7
        }
      ]
    },
    {
      "id": "t3_1r39caz",
      "subreddit": "singapore",
      "title": "Hazy conditions expected in Singapore soon",
      "url": "https://old.reddit.com/r/singapore/comments/1r39caz/hazy_conditions_expected_in_singapore_soon/",
      "score": 231,
      "num_comments": 64,
      "created_at": "2026-02-13T07:39:20",
      "selftext": "",
      "comments": [
        {
          "text": "Hazy conditions expected in Singapore ~~soon~~ now\n\nMy MRT train just pass by AMK and Bishan and the smell when the door open was putrid",
          "score": 269
        },
        {
          "text": "How soon uh… Last week? The week before?",
          "score": 137
        },
        {
          "text": "Since few weeks ago lol",
          "score": 86
        },
        {
          "text": "Soon? It’s been hazy here for 2 weeks",
          "score": 78
        },
        {
          "text": "my mouth just feels like an ash tray at this point \n\n  \n",
          "score": 53
        },
        {
          "text": "How long does it take for them to report this?\n\n*insert Zootopia sloth*",
          "score": 48
        },
        {
          "text": "It’s been a good run of a few years without serious haze… October 2023 was the last time.",
          "score": 43
        },
        {
          "text": "Straits Times \"news\" is on brand.",
          "score": 43
        },
        {
          "text": "She’s on a different planet this Grace Fu.",
          "score": 28
        },
        {
          "text": "Soon?\n\nI can't even go running in the park next to my office. \n\nNow I gotta run on a treadmill at the gym.",
          "score": 22
        },
        {
          "text": "now bro",
          "score": 19
        },
        {
          "text": "Soon? How about now? As in this very morning?",
          "score": 17
        },
        {
          "text": "Guys, do you remember the webpage we have to clap/cheer/ say thanks  for 11 months of fresh air?",
          "score": 13
        },
        {
          "text": "Haze finally approved, can report liao",
          "score": 11
        },
        {
          "text": "Soon? Our noses must be lying to us then 🤨",
          "score": 10
        },
        {
          "text": "I already smelled it when I woke up this morning.",
          "score": 10
        }
      ]
    },
    {
      "id": "t3_1r2lj7u",
      "subreddit": "singapore",
      "title": "Opening of Kallang Airport on 12 June 1937 in photos",
      "url": "https://old.reddit.com/r/singapore/comments/1r2lj7u/opening_of_kallang_airport_on_12_june_1937_in/",
      "score": 155,
      "num_comments": 16,
      "created_at": "2026-02-12T13:53:40",
      "selftext": "I spend a lot of time looking for old media and while searching for other photos I found these amazing old photos from [Kallang Airport](https://en.wikipedia.org/wiki/Kallang_Airport) that I don't think have been posted before. Enjoy!\n\n  \nSource: *Collection: Netherlands Institute of Military History / Collectie: Nederlands Instituut voor Militaire Historie*",
      "comments": [
        {
          "text": "The design of the runway was so interesting too. Hope it’ll be restored soon, I’ll love to visit the place (I don’t know why it’s been closed for so long)",
          "score": 13
        },
        {
          "text": "Damn before ww2....cool shots and can't imagine the state of the fields during the war",
          "score": 3
        },
        {
          "text": "Did some digging on the aircraft parked at Kallang on slide number 4\n\nAircraft PK-AFK (last aircraft, partially cut off by image) is a DC-2 operated by KNILM (defunct airline for the Ducth East Indies). In fact, you could still visit that aircraft IRL at the Nederlands Transport Museum! The fact that she still exists makes me happy lol.\n\nThen for the large middle aircraft (G-ABTJ) is a Armstrong Whitworth AW.15 Atalanta operated by Imperial Airways. There was a minor incident where the Crew and passangers were injured during a landing in Johannesburg. As I can't seem to find other infomation about this aircraft (other than other photos at Kallang Airport and one in the Mandate of Palestine) I'm assuming she got scrapped.",
          "score": 2
        },
        {
          "text": "These photos are a real gem. Thanks for sharing! ⭐️",
          "score": 2
        },
        {
          "text": "Very interesting runway. I hope it will be re-opened as a historical site.\nI love to visit and see history of places",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1r3g026",
      "subreddit": "singapore",
      "title": "Bus on fire near pie clementi road exit 13/02/26",
      "url": "https://old.reddit.com/r/singapore/comments/1r3g026/bus_on_fire_near_pie_clementi_road_exit_130226/",
      "score": 150,
      "num_comments": 34,
      "created_at": "2026-02-13T12:48:37",
      "selftext": "",
      "comments": [
        {
          "text": "Wtf!?\n\nHope everyone is ok. I can barely make out the sbs transit on the side of the bus",
          "score": 1
        },
        {
          "text": "Friday the 13th huh.hope no one was injured",
          "score": 1
        },
        {
          "text": "And lots of gawkers endangering other motorists for slowing down just to gawk. No brains at all.",
          "score": 1
        },
        {
          "text": "The bus regos is SBS6840D while Off service to depot",
          "score": 1
        },
        {
          "text": "Wah fk. Hopefully everyone has been evacuated alr",
          "score": 1
        },
        {
          "text": "That is a massive fire. I hope everyone have evacuated and are alright. The Bus is completely destroyed.",
          "score": 1
        },
        {
          "text": "the whole bus got burnt to a skeleton already. i think it was an off service bus to depot so no passengers affected",
          "score": 1
        },
        {
          "text": " No wonder the side going clementi got massive jam on PIE while the bukit panjang side is clear… hoping everyone is okay",
          "score": 1
        },
        {
          "text": "![gif](giphy|ukGm72ZLZvYfS)",
          "score": 1
        },
        {
          "text": "Wah damn jialat... hope nobody got injured...",
          "score": 1
        },
        {
          "text": "In b4 the EV accusations.",
          "score": 1
        },
        {
          "text": "Holy…. Hope nobody’s injured",
          "score": 1
        },
        {
          "text": "EV bus?",
          "score": 1
        },
        {
          "text": "sbs transit😲",
          "score": 1
        },
        {
          "text": "BMW bus?",
          "score": 1
        },
        {
          "text": "Diesel bus?",
          "score": 1
        },
        {
          "text": "That's a huge fire",
          "score": 1
        },
        {
          "text": "Passed the bus jn, only left the frame of the bus",
          "score": 1
        },
        {
          "text": "holy shit",
          "score": 1
        },
        {
          "text": "Wtf",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r2vf95",
      "subreddit": "singapore",
      "title": "Singapore Pools wrongly gave double payouts to 3,000 winning bets due to technical disruption",
      "url": "https://old.reddit.com/r/singapore/comments/1r2vf95/singapore_pools_wrongly_gave_double_payouts_to/",
      "score": 146,
      "num_comments": 21,
      "created_at": "2026-02-12T22:51:29",
      "selftext": "",
      "comments": [
        {
          "text": "Case of Haut Ah! huat ah?",
          "score": 87
        },
        {
          "text": "Interesting. No way they are not gonna try clawing back those double payouts.",
          "score": 47
        },
        {
          "text": "Eh then they should refund all the transaction fees they charged for PayNow top ups, which they SHOULD NOT have charged.\n\nSeems like absolutely no consequences for such an oversight",
          "score": 21
        },
        {
          "text": "&gt;This resulted in about 13,000 bets that were placed online or at retail outlets not being registered in the system, said Singapore Pools, which added that it will refund the stakes and honour any winnings if a punter can show proof or record of a winning bet made.  \nThe operator will contact affected online customers. Retail customers may call 6786-6688 for help.",
          "score": 18
        },
        {
          "text": "&gt;_Singapore Pools said it is in the process of notifying these customers and recovering the erroneous payouts._\n\nMost important line for those wondering if those \"double lucky\" punters will walk away with bonus jackpot..",
          "score": 14
        },
        {
          "text": "*Na si wah oo* *~~ji pa~~* *gor zup ban!*",
          "score": 5
        },
        {
          "text": "If dun gif back earnings, wat happen?🤔",
          "score": 3
        },
        {
          "text": "Hacked by China hacker this time?",
          "score": 2
        },
        {
          "text": "GG, then claw back.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r2p3n7",
      "subreddit": "singapore",
      "title": "Budget 2026: Singapore to set up National AI Council, chaired by PM Wong",
      "url": "https://old.reddit.com/r/singapore/comments/1r2p3n7/budget_2026_singapore_to_set_up_national_ai/",
      "score": 122,
      "num_comments": 78,
      "created_at": "2026-02-12T17:33:58",
      "selftext": "",
      "comments": [
        {
          "text": "Everyone is going to start digging into AI.\n\nPerfect time to start a business selling shovels.",
          "score": 139
        },
        {
          "text": "Time to push AI for the sake of using AI",
          "score": 97
        },
        {
          "text": "Not a single opposition or non-ruling party voice. Not even any voice of local AI workers, startups or people on the ground actually versed and experienced in the AI work environment. Just a bunch of party members.",
          "score": 90
        },
        {
          "text": "Issue with Lawrence Wong is, everything is done by council, taskforce, consensus-building.. \n\nI suspect half done to “risk-share” with the citizenry too - “eh you all also got liability ah”\n\nSometimes it is better to be top-down and drive things through.",
          "score": 86
        },
        {
          "text": "Can replace all the ministers into AI? That way we won't have to pay so many millions for them to do everything but solve core problems",
          "score": 80
        },
        {
          "text": ".... How many task forces do we need? Also like nothing is produced from it lol",
          "score": 63
        },
        {
          "text": "Own self give own self job, come I clap",
          "score": 49
        },
        {
          "text": "He stacking his resume to find next job.",
          "score": 39
        },
        {
          "text": "And when the AI bubble bursts... see ya'll in the fallout",
          "score": 21
        },
        {
          "text": "When your own ministries can’t even deal with legacy stuff,lagging behind in IT systems, not very optimistic over this. \n\nhttps://www.straitstimes.com/singapore/public-accounts-watchdog-emphasises-importance-of-modernisation-of-public-sector-it-systems",
          "score": 16
        },
        {
          "text": "Last time was comp science. Then it was biotech. Now it's Ai. \n\n\nDon't see any happy ending in this at all. ",
          "score": 14
        },
        {
          "text": "Bandwagon after bandwagon ",
          "score": 9
        },
        {
          "text": "My workplace, new guy came in, we need ai agent for this, ai agent for that.\n\n1yr plus, all diam diam, back to good old fashion people answering the calls and using spreadsheets. Someone's probably got a spreadsheet to track the number of ai agents deployed...",
          "score": 7
        }
      ]
    },
    {
      "id": "t3_1r2mdvb",
      "subreddit": "singapore",
      "title": "Man to be charged with attempted murder after allegedly attacking woman with axe at Sims View",
      "url": "https://old.reddit.com/r/singapore/comments/1r2mdvb/man_to_be_charged_with_attempted_murder_after/",
      "score": 107,
      "num_comments": 30,
      "created_at": "2026-02-12T14:42:36",
      "selftext": "A 30-year-old man will be charged with attempted murder on Friday (Feb 13) after he allegedly attacked a 30-year-old woman with an axe at a residential unit on Sims View, the Singapore Police Force (SPF) said on Thursday.\n\nThe police were alerted to the alleged attack at about 7.05am on Wednesday.\n\nThe suspect, an Indian national, and the victim, an Indonesian national, are known to each other.",
      "comments": [
        {
          "text": "Foreign conflict on local soil",
          "score": 61
        },
        {
          "text": "Gonna bet it's dating gone wrong",
          "score": 38
        },
        {
          "text": "How much you wanna bet that they used to date each other?",
          "score": 21
        },
        {
          "text": "If I speak, I in big trouble.",
          "score": 15
        },
        {
          "text": "Indian national...",
          "score": 13
        },
        {
          "text": "Looks like “love” gone wrong",
          "score": 10
        },
        {
          "text": "2 week jail with food and $100 fine",
          "score": 4
        },
        {
          "text": "[ Removed by Reddit ]",
          "score": 1
        },
        {
          "text": "This is serious",
          "score": 1
        },
        {
          "text": "Axe is not a household tool in SG. Never seen it in chapahlung shops. Have seen axes in those in-case-of-fire boxes at warehouses. But other than that, no other way to get this power-up.",
          "score": 1
        },
        {
          "text": "Photo and name pls!",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1r2pfia",
      "subreddit": "singapore",
      "title": "Budget 2026: 45pp lower PARF rebate for cars; tobacco excise duty up 20%",
      "url": "https://old.reddit.com/r/singapore/comments/1r2pfia/budget_2026_45pp_lower_parf_rebate_for_cars/",
      "score": 68,
      "num_comments": 120,
      "created_at": "2026-02-12T17:55:22",
      "selftext": "",
      "comments": [
        {
          "text": "The govt will do anything except to create a separate COE Category for private hire vehicles. If you can’t convince, confuse.",
          "score": 86
        },
        {
          "text": "How does the reduced rebate incentives car users to deregister their car earlier?\nIf I am going to get back lesser when I deregister at year 3, i might as well drive the car until year 10?",
          "score": 40
        },
        {
          "text": "The price gap between expensive and cheap resale car is going to be really small going forward… good luck to the depreciation value!",
          "score": 35
        },
        {
          "text": "Basically, if a car costs $200k with a max PARF of let's say $20k, that car technically costs $180k.\n\nNow, your max PARF is only $2k. This means the same car now costs $198k.",
          "score": 33
        },
        {
          "text": "So if I'm interpreting this correctly, reduced PARF rebate (cause of increased electrification of vehicle) = lower outlay for the authorities?\n\nPolicy scholars putting their intelligence to good use indeed to achieve win-win outcome for the authorities lol",
          "score": 33
        },
        {
          "text": "# 1️⃣ PARF Rebate Is Reduced\n\nFor cars registered from **Feb 2026 COE onwards**:\n\n* The rebate percentage is reduced by **45 percentage points**.\n* Meaning: You get back much less money when you scrap the car before 10 years.\n\nSo early deregistration becomes less attractive.\n\n\n\n# 2️⃣ Maximum Rebate Cap Reduced\n\nPreviously:\n\n* Max PARF rebate = **$60,000**\n\nNow:\n\n* Max PARF rebate = **$30,000**\n\nThis mainly affects:\n\n* Luxury cars\n* Cars with high ARF\n\nBig loss for high-end car owners.\n\n# Example (Simple Illustration)\n\nOld system:  \nLuxury car owner might get back $55,000.\n\nNew system:  \nMaximum possible rebate = $30,000.\n\nThat’s a $25,000 difference.\n\n# 🧠 What This Means Practically\n\nIf you buy a petrol car after Feb 2026:\n\n* You should plan to drive it full 10 years.\n* Scrapping early gives you much less money back.\n* Luxury car buyers are hit hardest.",
          "score": 15
        },
        {
          "text": "This is just ridiculous. It just means that the cost of owning a vehicle just went through the roof. Supposely to you could get back 50% post 2023, than 50% capped at 60k, now 5% capped at 30k??Which means a entry vios with a parf of around 15k, you are only getting back $750 at expiry. This is going to hit mid range luxury car really bad.",
          "score": 13
        },
        {
          "text": "PARF rebate reduction is a tax on the rich. Only the high OMV cars have any significant PARF value. \n\nIf anyone complains about this I don’t know what to say.",
          "score": 7
        },
        {
          "text": "I wonder but this probably doesn't affect trade in value?\n\nAnyone could enlighten me please?",
          "score": 3
        },
        {
          "text": "Articles from this site may be behind a paywall which affects others' ability to view the content. If so, please comment a summarised but not copied version of it, or your submission may be removed.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/singapore) if you have any questions or concerns.*",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r2o2rh",
      "subreddit": "askSingapore",
      "title": "31M resigned and leadership is willing to accommodate me",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r2o2rh/31m_resigned_and_leadership_is_willing_to/",
      "score": 154,
      "num_comments": 162,
      "created_at": "2026-02-12T16:27:22",
      "selftext": "tl;dr: resigned due to workload/manpower issues. company secured 10 headcount after i resigned and new senior leadership is offering major accommodations to get me to stay. not sure if i should stick to my original plan to take 6–12 months off for studies or try the new arrangement.\n\n31m, single, no debt/commitments other than parent. have enough savings to last myself for 12 months and pay for my school.\n\nbeen in semicon 5 years. shares doing great, company doing well (iykyk). i don’t dislike my job and get along well with colleagues. i would consider myself one of the stronger contributors in my department, if a bit unmotivated\n\nwhy i want to leave: manpower attrition (27 → 14), absorbed ~3 roles’ worth of responsibilities. tried raising workload concerns for ~1 year, no headcount secured due to being a cost center rather than profit center\n\nresigned 2 weeks ago planning to take 0.5–1 year off to focus on masters and spend more time with ageing parents (currently clashes with working hours until end of year).\n\nafter my resignation:\n\n* currently there isn’t anyone who can fully absorb my responsibilities\n\n* department secured 10 headcount\n\n* new director met me personally to ask me to stay \n\n* offered:\n\n    * flexible schedule for classes (no need to use leave)\n\n    * no ot\n\n    * unpaid sabbatical in future once things are stable\n\n    * accelerated progression path (structure-based)\n\n    * 1-month trial arrangement\n\n    * but no immediate pay bump (review end of year).\n\nI do need to get this in black and white but other than that it seems kind of enticing. other than monetary part. however they want an answer by next week due to my notice coming to an end.\n\nmy concerns:\n\n* could this be reactive and temporary cause of the volatility\n* likely will end up being the training keystone during this period\n* will workload creep back once things stabilise, since semicon theres always something new\n* just a ploy to train up newer people until don't need me\n* should i just take my clean break now while financially able?\n\ni’m genuinely torn, really want to know if anyone has any input, actually 50/50 at this point\n\nedit: formatting",
      "comments": [
        {
          "text": "Only go back if there is a pay bump. All these promises mean nothing",
          "score": 297
        },
        {
          "text": "No review pay bump is a red flag.",
          "score": 95
        },
        {
          "text": "I’d ask for a pay bump.\nHigh chance they’ll let you go once the new hires are trained, so I’d say to use this chance to get the most out during this “training period”.",
          "score": 89
        },
        {
          "text": "stay. if none of the promises are kept, you can always resign.",
          "score": 88
        },
        {
          "text": "i think stay, but be ready that they will take you off once they are ready to take over (with whoever you train)\n\nSo you might as well take as much as you can get. You can always resign, (but hush hush on what you can really teach as you might just be the one to displace yourself)",
          "score": 34
        },
        {
          "text": "I think that your concerns are valid. The accelerated progression path seems like a carrot that they’re just vaguely dangling in front of you too. To me it gives the sense that they consider you to be the cheapest and easiest solution.\n\nI think that you should still negotiate a pay raise if you want to take the offer.\n\nIf I were in your shoes, I will write back to say that I accept the offer (setting out the whole list of promises that they gave to you) *and* on the condition that your pay is now $X per month.\n\nEssentially, stay on and get paid but with full awareness that they may let you go in several months’ time once they are able to replace you — you may as well get what you can out of this.",
          "score": 31
        },
        {
          "text": "What do you lose by accepting?  You can quit anytime, again",
          "score": 19
        },
        {
          "text": "Negotiate for a realistic position that is too good to refuse. Then your worst case scenario becomes going back to your original plan to resign and do your own stuff.\n\nEspecially given that your director is new, there is no saying how much say he has with these HR allowances like promotion, unpaid leave etc, and it is quite rare for such accommodations to be extended to relatively junior staff. Everything on the table is potentially empty promises unless they are able to deliver in black and white. \n\nPlenty of room to apply leverage here, but seems like they are retaining you to train new staff? If this is the case I would at minimum ask for immediate pay raise + title promotion to team lead / manager to reflect any change in responsibilities, so that at the very least your immediate payoff is better negotiating base for your next jump. ",
          "score": 18
        },
        {
          "text": "Maybe an unpopular opinion, but the things being offered don't really sound like significant tangible benefits other than a flexible schedule (which really depends on the arrangement). No pay bump is a bit of an insult if they're hoping to retain you (after allegedly doing 3 roles worth of work for a year) imo. \n\nI would definitely say take the break if you can afford to, but try not to burn any bridges? I'm not familiar with the industry so I'm not sure how many competitive semicon companies there are to apply to after your studies.",
          "score": 17
        },
        {
          "text": "Your company will not keep the \"promises\" listed to you. Mine didn't and went back to their old ways. I resigned a 2nd time, and am now wiser. What I learnt is once I throw letter, never go back! ",
          "score": 15
        },
        {
          "text": "I'd negotiate a pay bump because the other things are quite subjective eg if you can't finish your work on time you'd still need to OT. Flexible schedule usually means ending later the next day if say you've a class you have to go off early for today. I highly doubt they'd keep to their promise of granting you an unpaid sabbatical or an accelerated promotion. \n\nMoney is all that matters because it's real money hitting your bank account, not promises they can rescind or find some way to walk back on.",
          "score": 12
        },
        {
          "text": "To be honest, feels like this is just a stop-gap measure. \n\nYou have raised your workload concerns for over a year, which was unaddressed, neither in the form of adding headcounts nor rebalancing workload. Perhaps they had their challenges too, but I would think if sincere in addressing these, something would have been done already. They probably chose to take a passive stance and to only do something when people spoke up about it. \n\nBasically, the current situation is they are now afraid of losing knowledge within the department, with the stepped up resignation rates/attrition and then it will be full of newer employees with little or no knowledge of how the department functions or escalation beyond basic issues. The retention package offered to you is simply to buy time to alleviate this situation, and by having you as a senior employee train and guide these newer employees along, to a certain degree of competency. Thereafter, you would see a change in attitudes. The new director, being new, is just trying to make sure the dept don't collapse under his watch. Once it stabilises, then again expect change in attitudes. \n\nWorkloads will more than likely creep back and if you raise concerns again, this time they will not hesitate to let you go. ",
          "score": 11
        },
        {
          "text": "New director LLST to accommodate you.\n\nHe parachuted in, you buay song and quit leaving him high and dry.\n\nTo protect his own job since he has not proven himself in this new company.\n\nOnce he becomes more familiar, and have his own ppl filling up the key places. \n\nDun get me wrong. You can easily landed yourself in the same situation once you have reached the level to take over a legacy team in your new company.\n\nYou would have done the same..",
          "score": 11
        },
        {
          "text": "Stay but ask for money.\n\nBut if you are super serious on the studies, go.",
          "score": 9
        },
        {
          "text": "sounds like micron",
          "score": 6
        },
        {
          "text": "要我留，加五千",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1r2o0so",
      "subreddit": "askSingapore",
      "title": "Singaporeans - anyone benefited from working with / under Expats?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r2o0so/singaporeans_anyone_benefited_from_working_with/",
      "score": 137,
      "num_comments": 71,
      "created_at": "2026-02-12T16:23:54",
      "selftext": "I am asking this in relation to mainly office workers (not migrant workers).  \nAsking in a genuine manner, not looking to discriminate or complain.\n\nBy \"Expats\", I mean workers who are flown down for certain roles in (usually) multinational companies in Singapore because there are supposedly no local person who can do the job.\n\n1. Are you working with or under Expats? As a co-worker, as a subordinate?\n2. Have you learnt anything working with Expats or under Expats?\n3. What is something that an Expat has taught you at work, that you feel \"Oh that's why we need this person here\" ?\n4. Many of them are in top roles, what do you observe about their knowledge and expertise ?\n\n**For context: I have worked under the following:**\n\n1) A Filipino direct Manager, big boss is Singaporean\n\n2) A Singaporean direct Manager, big boss is Indian\n\n3) A German direct Manager, big boss is British",
      "comments": [
        {
          "text": "I worked under an Australian boss - very easy going and everything I do is “excellent”.\n\nI worked under Indian boss in investments. Best boss ever - teach me so many things about valuation, due diligence, and earn so much respect from me. He is the best mentor. \n\nI worked under a Singaporean male boss boomer or late Gen X - worst boss ever. Always insecure and afraid I will outshine him. Constantly trying to steal credit. \nAnd do everything to ensure I don’t shine.\n\nSo sometimes, Singaporean bosses are the worst.",
          "score": 189
        },
        {
          "text": "I’ve worked under a British national, although I’m unsure if he’s technically an expat or not since his family has been here for 2 generations and I think he’s a PR at this point in time.\n\nHaving said that in my almost 15 long career so far, he was the best boss I ever had. Apart from gaining new professional perspectives, I did also learn more from managing clients and stakeholders. He was also surprisingly chill for someone who had a defiant subordinate who wanted to make his life difficult at every turn because she wanted a promotion. \n\nWe parted ways about 2 years ago now but we’re still in touch",
          "score": 177
        },
        {
          "text": "I previously worked under an Eastern European and Chinese boss during the first 3 years of my life under 1 company.\n\nThe Eastern European boss was very chill, he encourage me to think beyond traditional frameworks and taught me how to subtly challenge the company status quo using jokes and memes.\n\nThe Chinese boss was a workaholic and very gung-ho about new initiatives, while is tiring, but you get where she is coming from since she is trying to cover all the grounds and thinking more long term than doing the bare minimum work to complete her KPIs. Plus she doesn't force anyone to follow her working style, and become apologetic when she message people after office hours. She is really awesome to showcase the power of documenting your work, decisions, and who says what.\n\nI remember my old supervisor who is Singaporean, while he did try to encourage me to think to be more independent. However, if I made a mistake he would publicly point it out, when I ask for clarification, he would give me demeaning remarks, \"you should know such simple things\" or \"why so difficult? why you like that?\". That frankly impacted my self-esteem, gave me a traumatic experience that made me feel very anxious when I try to highlight an issue or ask for help, it took me months back and forth with my therapist to process it.",
          "score": 160
        },
        {
          "text": "I have worked with german, Netherlands and some other europe countries. As well as American.\n\nThe general perspective i from them is the amount of confidence they have when speaking.\n\nIt generally sounds like they really know their stuff and thus easier to convince people to try this out, do it their way, etc.\n\nDo note that with locals in such senior roles, I have the same impression. \n\nThis is senior manager and director levels. For comparison, salary range is going to be 20 k and up.\n\nComparatively, going downwards to manager or team leader levels. I still get similar impression for non locals. But not as common for locals anymore.\n\nTo be clear. The ones I worked with are hardworking and intelligent people. They probably put in effort to reach where they are and gain all the knowledge they needed.\n\nSo this is what I have learnt. Having the knowledge, skills, experience will get you to a certain level. But to get to the next hop, it is also how you are able to present it.\n\nSounds simple but I don't see much locals able to do it. They are smart, skilled, experienced but present it poorly.",
          "score": 102
        },
        {
          "text": "Worked under 3 expats. \n\nMalaysian. Came from top company in the industry in Malaysia, under him business in Singapore took off. Shrewd business man. Basically rescued the product from failure and became industry leader in SG. \n\nAmerican. Came in the build regional product. Came from top company in the world, household name. Unfortunately due to industry shifts, product never took off. Not her fault though. She retired after. \n\nKorean. Came in to build regional product. Managed to build business in Korea and Japan, but unfortunately business had a change in direction. Not as sharp as the Malaysian but was very good at opening doors. \n\nI always believe that you can learn from anyone",
          "score": 53
        },
        {
          "text": "(self-employed) Most of my income comes from expats, because for wtv reason my talents and skills seem to be more appreciated by non locals. They are more willing to hire me, pay for my services, and don't haggle. Locals seem very unwilling to support, even my own friends will complain about price (even if they are obviously richer than the average expat). A lot of ppl here will complain bout foreigners, but when they actually spend money for their own shit, they will think foreign/western &gt; local product. Sinkie pwn sinkie",
          "score": 48
        },
        {
          "text": "Worked with many expats both below and above my role. Some have technical knowledge or industry contacts you won't find in local candidates. Others are morons who could be replaced by anyone with a pulse. Like everything else there is a range in capability and competence. \n\nI would say though there are reasons why there are stereotypes and many people from certain racial or geographical regions (including Singaporeans) run true to these stereotypes. But of course, not all.",
          "score": 42
        },
        {
          "text": "A Dutch company I used to work for.\n\n  \nThey hired two new graduates from TU Delft.   \nTheir titles? \n\n\"South East Asia Experts\"",
          "score": 38
        },
        {
          "text": "I just know expats who are here without family tend to like going to the office because they don't have an established social life outside of work yet. Also because if they could do it remotely they would have zero reason to be here in the first place.\n\nThis is not a great experience when this person is your manager because it usually means they want you to be in office along with them.",
          "score": 20
        },
        {
          "text": "Worked under a British-Swiss boss and she was very one of the best bosses I’d had. Very collaborative, understanding and pragmatic. Excellent at L&amp;D and communications. Partnered with a French subject matter expert - learnt so much from him and gained niche skills that I’m still using today! Had an American ex-boss and through him learnt that fake it till you make it is real 😂 very confident and good talker.",
          "score": 15
        },
        {
          "text": "this. i think it's the general air of confidence. not saying Singaporeans aren't, i've worked with really impressive locals as my bosses before. \n\none more point i'd add is their friendliness - i've worked with one company where most of the senior management (like, 8 out of 9 of them) are expats. everytime i head into their room to talk to them, i've noticed that they don't go straight into business like us Singaporeans. they usually start with a nice small chat to ask how you are, your weekends etc. it makes a lot of difference when they're your superiors.",
          "score": 13
        },
        {
          "text": "I have work with/ under French, Brazilian, Indian, Thai, Australian. Both direct reporting and non-direct. \n\nLearnt a lot from different people. Compared to the Singaporean bosses I had, they are generally more trusting/ less micro-managing and more open to inputs from team members. \n\nI really enjoyed working with people with different backgrounds and exposures. They expanded my perspectives.",
          "score": 11
        },
        {
          "text": "I think diverse teams are great. You get to learn different ways of tackling the same problems, different povs. \n\nI've worked in Vietnam, Cambodia and Australia and have always picked up a thing or two from the different people I've worked with, from different backgrounds.\n\nThe Germans are rules-based, not that creative, but you can expect the same outcome with consistent results whenever a task is given to them.\n\nTaiwanese are hardworking and caring people, who are quite homely and more than friends than colleagues. \n\nDutch knows when to work and when to party 😅 \n\nArgentineans are very protective of their culture, and very welcoming when you're keen to learn about it. \n\nUruguayans are chill people - you can talk to them about anything.",
          "score": 9
        },
        {
          "text": "Western culture is more of, relax lets brainstorm, we can do this, good job no need to ot guys were on track.\n\nEast asian culture is like, everything is our responsibility, monitor every data, finish then go home. \n\nSg culture is like, why didnt you do this, like this or think mah i got so many people under me i cant do so many things you know. But if ownself mistake is a simple, ya you are right. Singlish talk is really bad for the mental in a work setting.",
          "score": 7
        },
        {
          "text": "My ex-manager from the UK wasn’t flown in by the company but worked her way up in Singapore. Honestly couldn’t have asked for a better manager. When I was leaving the company people asked me what I would miss the most and I literally told them working under my manager (not to bootlick, she wasn’t present anyway). But she would stand up for her subordinates even though she was the youngest manager in the office (early 30s) and she was just so filled with life, always willing to try new things and volunteer outside work. She would always listen to whatever issues we would bring up at work and work on it together with us even though she was swamped with work. I miss working under her 🥲",
          "score": 6
        }
      ]
    },
    {
      "id": "t3_1r3a56k",
      "subreddit": "askSingapore",
      "title": "Is it me or the haze is damn bad today?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r3a56k/is_it_me_or_the_haze_is_damn_bad_today/",
      "score": 139,
      "num_comments": 51,
      "created_at": "2026-02-13T08:13:27",
      "selftext": "Opened my window and gagged fr 🥲 the whole atmosphere smells really bad and hazy atm",
      "comments": [
        {
          "text": "horrible! Windows closed, 2 air purifiers on and still smell",
          "score": 53
        },
        {
          "text": "Same, bad in the Northeast",
          "score": 23
        },
        {
          "text": "Haze has been bad for some time I think I was coughing quite badly last week alr.",
          "score": 21
        },
        {
          "text": "Northeast here, quite bad",
          "score": 17
        },
        {
          "text": "West side so far so good.\n\nGuess the wind?",
          "score": 16
        },
        {
          "text": "While taking the red line heading towards marina bay direction, I can smell it when the cabin door opens at ang mo kip onwards. Even underground MRT platform also got the smell. ",
          "score": 11
        },
        {
          "text": "Central-South is kinda bad, buildings opposite have this fog effect but with a burnt smell.",
          "score": 10
        },
        {
          "text": "It's horrible :( I'm down with cold the whole week and the haze is just rubbing it in\n\nReminder to drink more water people!",
          "score": 6
        },
        {
          "text": "Damn bad.. is it still safe to go for a run? Or better stay indoors? :(",
          "score": 6
        },
        {
          "text": "No just haze. The air smelled horrible since last night in Sengkang.",
          "score": 5
        },
        {
          "text": "Is baddddd",
          "score": 4
        },
        {
          "text": "Which area u guys at",
          "score": 3
        },
        {
          "text": "i entire month choking and nose block very irritant throat dyingggggggg",
          "score": 2
        },
        {
          "text": "No wonder I was coughing and started feeling unwell, since last night been smelling it.",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1r3a78i",
      "subreddit": "askSingapore",
      "title": "Find my lost friend in Singapore",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r3a78i/find_my_lost_friend_in_singapore/",
      "score": 79,
      "num_comments": 36,
      "created_at": "2026-02-13T08:15:54",
      "selftext": "Hi all,\n\nI've never been to Singapore but I studied together with Singaporeans in Korea a decade ago. We kept in touch online and sometimes mail. \n\nLater this year I will go to Singapore and I want to see my friend.\n\nThe problem is, he disappeared online about 5 years back, quite soon after we even had a video call, randomly. I even asked a common friend but they weren't in touch aymore.I only had his name and his old address and could find nothing.. not a trace\n\nLast year I received a Christmas card from him! But, he didn't write his address or contact.\n\nobviously I know his name and some of his job/study history. How would I find him?",
      "comments": [
        {
          "text": "LinkedIn?",
          "score": 83
        },
        {
          "text": "If he wants to be found, he will be found",
          "score": 72
        },
        {
          "text": "I'm just curious, based on the info you provided, what responses are you expecting from Reddit?",
          "score": 54
        },
        {
          "text": "If his name is Junjie, good luck lol",
          "score": 53
        },
        {
          "text": "Just put his name here. Singapore is so small there’s a non-zero chance that someone on reddit will know him personally.",
          "score": 19
        },
        {
          "text": "Might want to do a bit on sleuthing before coming here. You have his name, job, school. Perhaps you can go to facebook or other social media and look for groups or alumni, graduating class year FB group etc. Even if you don't see him as a member, you can ask around that group of anyone know your friend and see if you can connect from there.\n\nWorst case scenario, when you do arrive at Singapore, if you have the address of the last known workplace, you can just turn up and ask around if anyone by that name works there, or used to work there, and move on from there.\n\nYou mentioned you have his old address. That's also a lead. Just turn up at the old address and ask the current resident if they remember your friend who used to stay there, or ask the neighbours. Sometimes when people move away, they may leave their contacts with their old neighbours.\n\nApart from the really drastic like hiring a private investigator, perhaps your friend does not want to be found for some reasons. Just move on with your life, and enjoy your vacation in Singapore. Perhaps fate may bring you two together in the future. ",
          "score": 13
        },
        {
          "text": "try searching his full name on linkedin",
          "score": 11
        },
        {
          "text": "You can send me his name and details I will try and hardcore google him in my free time (I am pretty good at this)",
          "score": 11
        },
        {
          "text": "Move on",
          "score": 8
        },
        {
          "text": "with info like this he could be my next door neighbor or he could be myself",
          "score": 6
        },
        {
          "text": "If he sends u a Christmas card means he’s still in touch with u!! Don’t worry",
          "score": 2
        },
        {
          "text": "Go make a missing person report.",
          "score": 2
        },
        {
          "text": "perhaps you can try the Singaporeans in South Korea group on facebook i used to study in korea too, although it wasn't a decade ago. you could try use that to find him maybe",
          "score": 2
        },
        {
          "text": "if you want you can send me his name etc, i am good at stalking people lol",
          "score": 2
        },
        {
          "text": "you can dm me his dets. i do all these hard search online for fun.",
          "score": 1
        },
        {
          "text": "Don’t you have any photos taken with this friend? Sometimes it’s easier to post all the details in social media rather than Reddit",
          "score": 1
        },
        {
          "text": "I do this for a living. Send me some info.",
          "score": 1
        },
        {
          "text": "hope you find him, do update cuz im curious",
          "score": 1
        },
        {
          "text": "Give name, age back then, uni and course studied.\nHow he looks also. Height, build, skin tone",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1r2lzlf",
      "subreddit": "askSingapore",
      "title": "So far in 2026, what is ONE good thing that happened in Singapore?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r2lzlf/so_far_in_2026_what_is_one_good_thing_that/",
      "score": 81,
      "num_comments": 65,
      "created_at": "2026-02-12T14:19:20",
      "selftext": "Just feeling very negative recently, so I'm just putting out a question to get some positivity, and hope it also help others",
      "comments": [
        {
          "text": "Been pretty windy so far",
          "score": 414
        },
        {
          "text": "went for reservist, and realize life was so simple in army.  \nmental health been great at reservist, will probably spiral back to depression next week.  \nbut shall enjoy this calm for now.",
          "score": 176
        },
        {
          "text": "Everyone in Singapore around me whom I care about and love are healthy and happy.\n\nNot really directly answering your question but I’m sure we can all agree it’s the most important thing.",
          "score": 173
        },
        {
          "text": "it drops down to 26C or lower ambient temp at home everyday in the morning.. usually only drops to 28.5C so it always feels hot 24/7",
          "score": 57
        },
        {
          "text": "[https://www.straitstimes.com/singapore/yishun-spirit-residents-rally-together-to-rescue-kitten-trapped-in-drain-pipe](https://www.straitstimes.com/singapore/yishun-spirit-residents-rally-together-to-rescue-kitten-trapped-in-drain-pipe)\n\nThey saved that cat in the drain. ",
          "score": 51
        },
        {
          "text": "Train haven broke down, yet.",
          "score": 32
        },
        {
          "text": "No major natural disaster happening, we are a fortunate bunch in that sense.",
          "score": 31
        },
        {
          "text": "Lost 5kg",
          "score": 28
        },
        {
          "text": "Hasn't been raining much these days.... you can leave umbrella at home.",
          "score": 22
        },
        {
          "text": "I lost my wallet in Japan and someone found it, with all my cash in it. Managed to thank the kind lady in person",
          "score": 18
        },
        {
          "text": "woke up from nap, thought i was on a beach. so peaceful, so windy, so breezy. without the heat. ",
          "score": 13
        },
        {
          "text": "Not at the moment, thought that I would go steady with this girl, but turns out I am only a fish in the pond",
          "score": 11
        },
        {
          "text": "SGD has been strong relative to other currencies. Since Singapore relies a lot on imports, regular people would benefit in terms of cost of living. ",
          "score": 10
        },
        {
          "text": "There was sufficient drama and scandals happening to keep everyone entertained",
          "score": 9
        },
        {
          "text": "I had fried chicken in the afternoon. ",
          "score": 6
        }
      ]
    },
    {
      "id": "t3_1r380j1",
      "subreddit": "askSingapore",
      "title": "What is up with this horrible burning smell these last few days?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r380j1/what_is_up_with_this_horrible_burning_smell_these/",
      "score": 62,
      "num_comments": 27,
      "created_at": "2026-02-13T06:45:49",
      "selftext": "Literally woke up from it last night because it was that bad and it's been like that for the past few days, my sinuses are all swollen and my eyes are itching like crazy. Even now there's no way I can open the window without getting a full blast of it. Any one know where it's actually coming from?",
      "comments": [
        {
          "text": "The smell comes quite late nowadays. Yesterday there was no smell at 11+pm. But when reaches about 12am, the smell was terrible.",
          "score": 51
        },
        {
          "text": "Probably Johor peat fire = haze",
          "score": 18
        },
        {
          "text": "Haze! This morning my area smelt the worst. Northeast area. And now i'm starting to cough....ohhmyy",
          "score": 12
        },
        {
          "text": "It’s the haze, read news",
          "score": 8
        },
        {
          "text": "https://mothership.sg/2026/02/more-hazy-conditions-johor-hotspots/",
          "score": 3
        },
        {
          "text": "Can thank our neighbour up north for giving us such clean air",
          "score": 3
        },
        {
          "text": "Really bad this morning, they really should stop outdoor activities… but it seems I’m “over sensitive” and school and things are going normal",
          "score": 3
        },
        {
          "text": "im fking dying right here even with air purifier ugh",
          "score": 2
        },
        {
          "text": "Which area r u in?",
          "score": 1
        },
        {
          "text": "My Garmin says my respiration rate is above normal range last night.. woke up coughing",
          "score": 1
        },
        {
          "text": "seems like the smell comes from volatile compounds, which are not detected as PM2.5. not sure if there are any measuring equipments for those in singapore",
          "score": 1
        },
        {
          "text": "Northwest unaffected",
          "score": 1
        },
        {
          "text": "Must be Orcs burning the forests again, far away in their dark stronghold Atrakaj in the land of Aisenodni?",
          "score": -5
        }
      ]
    },
    {
      "id": "t3_1r2tvwn",
      "subreddit": "askSingapore",
      "title": "Fresh graduates, what was your experiences in GRIT Program?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r2tvwn/fresh_graduates_what_was_your_experiences_in_grit/",
      "score": 58,
      "num_comments": 24,
      "created_at": "2026-02-12T21:48:25",
      "selftext": "Hello fresh graduates! Hope everything is well with you? I do have a couple of qns for those in GRIT Program.\n\n  \n1. How long have yall been inside the GRIT Program?\n\n2. Whats the odds of conversions?\n\n3. Are you guys doing work that is an area that interests you? Or are you just there because you need a job?\n\n4. The work that you are doing, is it work that you can expect out from a fresh graduate? Or does it felt like you are under utilising your capabilities? ",
      "comments": [
        {
          "text": "GRIT is just a temporary solution by the government to reduce unemployment and underpay grads. The job market is just bad\n\nAnd before you say \"FreSh GraDs HaVe No ExPeRIence\", most uni grads have 1-3 internship before graduation right now.\n\nAnd well if you say internships are not considered actual working experience, then whats the point of internships?\n\n\n\nto fresh grads:  if possible, don't short change yourself by applying to grit, just apply for FT roles. GRIT doesn't guarantee conversation at all, its just another internship",
          "score": 68
        },
        {
          "text": "Dont do GRIT unless you cant find a job. Even if you are doing GRIT, just apply to fulltime roles while doing. Assume no conversion because conversion is not guaranteed and outside your control.",
          "score": 26
        },
        {
          "text": "Go post in the university subreddits. There are only jaded millennials and entitled boomers commenting in general sg threads.",
          "score": 12
        },
        {
          "text": "Advice to fresh grads is not to be too loyal to the company, and have the mentality that you need to stay and complete the whole duration of the GRIT (unless there’s contractual obligation to stay which is highly improbable). Keep applying to full time positions and don’t hesitate to leave once a good opportunity arises. Good luck!",
          "score": 6
        },
        {
          "text": "1. 1 month\n2. Near zero for my company\n3. Work is relevant to my career option\n4. Fresh grad expectations. Honestly, it’s team / manager dependent. Some have minimal expectations while some might have more.",
          "score": 4
        },
        {
          "text": "Tbh. There's something similar during my time called the edb TAP program\n\nNot sure if still got now\n\nBut most of my peers are still doing quite ok 15-20yrs on\n\nMost minimally Manager level already in MNC",
          "score": 1
        },
        {
          "text": "1.\t⁠2 months\n2.\tTold me on the first day that its very very hard. I would say 0.\n3.\t⁠work relevant to my degree\n4.\t⁠definitely solid experience but coming from gov, getting the necessary resources to start working is very slow. I just started doing real work 2 weeks ago",
          "score": 1
        },
        {
          "text": "You are fresh, what capabilities will you be able to bring to the table ?",
          "score": -63
        }
      ]
    },
    {
      "id": "t3_1r2tqw6",
      "subreddit": "askSingapore",
      "title": "Anyone knows what model king koil beds saf uses?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r2tqw6/anyone_knows_what_model_king_koil_beds_saf_uses/",
      "score": 44,
      "num_comments": 23,
      "created_at": "2026-02-12T21:42:29",
      "selftext": "The bed has the perfect amount of softness and firmness but I’m not sure what specific model they use. Just came back from reservist and had the best sleep of my life lol.",
      "comments": [
        {
          "text": "It could be due to the relaxed mode or the extremely tired body rather than the mattress which resulted in the good sleep.",
          "score": 118
        },
        {
          "text": "I think you can try asking the storemando. They might have intel/logistic knowledge about this.",
          "score": 24
        },
        {
          "text": "Not king koil, it's some Malaysia company based in KL called Baogaly which is now defunct.",
          "score": 18
        },
        {
          "text": "Edit: Its Sweet Touch \n\nIirc saw a listing of it on Shopee quite a while back but not sure if it's still there\n\n\nSource: the mattress has a label on it with the brand",
          "score": 8
        },
        {
          "text": "last time i went reservist they used magic koil beds",
          "score": 5
        },
        {
          "text": "Maybe, just maybe, it could be because you get a break from work, wife, and/or kids, and you get to sleep at 10pm! Give you tilam you also shiok 😏",
          "score": 5
        },
        {
          "text": "Ask your Unit Supply Assistants.",
          "score": 4
        },
        {
          "text": "Does it look like this pattern? \n\nhttps://sg.shp.ee/fTmoRBS",
          "score": 3
        },
        {
          "text": "A",
          "score": 2
        },
        {
          "text": "Does nobody remember when we used those orange sponge beds?",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1r2r74j",
      "subreddit": "askSingapore",
      "title": "Is my overpowered aircon compressor the reason for my sky high electricity cost?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r2r74j/is_my_overpowered_aircon_compressor_the_reason/",
      "score": 40,
      "num_comments": 112,
      "created_at": "2026-02-12T19:39:44",
      "selftext": "Hello all! \n\n  \nI'm trying to pinpoint the real electricity chugger in my 4R HDB flat. After 5 years of constantly paying ridiculously high bills and cutting cost every other way I can think off, I'm starting to suspect that it may actually be my little 9k BTU bedroom aircon.\n\nIt's switched on at 25⁰C every night and that's the only time it is used. Could this be due to it being overpowered by a 38k BTU compressor?\n\n\n\nI have a total of 4 aircon units in my house connected to 1 compressor, though only 2 at the most are in use at any one time.\n\nThe 9k BTU bedroom unit is the only one that is used most days, and only at night with the bedroom door closed.\n\nThe other aircon units are only used for specific occasions like when entertaining guests (not very often).\n\n\n\nHere's what I have installed in my 4-room flat:\n\n* Compressor: Mitsubishi Starmex 4G38VA2, 20.5kW capacity, 38k BTU\n* Bedroom aircon unit: FN10VE, 2.8kW, 9k BTU\n* Second bedroom aircon unit (hardly ever used): FN10VE, 2.8kW, 9k BTU\n* Living room Aircon 1: FN18VE, 5kW, 18k BTU\n* Living room Aircon 2: FN13VE, 3.5kW, 12k BTU\n\n\n\nMy question is whether my bedroom aircon being overpowered by my 38k BTU compressor could be the cause of my high electricity bills.\n\nIs it a short cycling issue?\n\n\n\nAnd with that, what should me solution be? Add another small aircon compressor and connect just the bedroom aircon unit to it? Maybe just leave the living room aircons connected to the big 38k BTU compressor?\n\n\n\nPlease help me out, home planning/aircon pros!",
      "comments": [
        {
          "text": "Probably. 5 years back when I was going for 4 fan coils in my BTO, I was advised to go for 2 smaller compressor than 1 big one. The cost difference was about 400 back then.\n\n  \nThe rationale of the salesman was that we are likely to use only 2 of the fan coils at night and not all 4. And it would be unlikely that we would be using the living room and study aircon in the night. So we are running only 1 small compressor at any one time, instead of 1 big compressor all the time.\n\n4rm flat. My monthly electric bills is usually between 100 - 150SGD a month. Sometimes goes down to 80 to 90.",
          "score": 53
        },
        {
          "text": "You didn't say anything about how high your sky is. I used to think my bill was ridiculous until I asked around, apparently I'm already using lower than many people around me, SP bill graph puts it like I'm a villain killing the earth.",
          "score": 42
        },
        {
          "text": "Before you start looking at solutions, you confirm your hypothesis first. \n\nGo one month without aircon.",
          "score": 25
        },
        {
          "text": "wife running a 4 node compute eth validator behind ya back",
          "score": 23
        },
        {
          "text": "look at your SP account in the app they have a breakdown by hourly your power usage but you must be using the new smart meter but an upgrade is only 43.60\n\nlimit your aircon between a certain time span like 9pm to 6am and see how much higher your hourly bill is compared to your usual during the day without aircon\n\nthen you can pin point how much percentage of power your aircon is using\n\nin my exp aircon can be up to 50% of my power bill esp during hot weather periods",
          "score": 11
        },
        {
          "text": "does your service provider have an app? im using sp and i can see the energy usage in half hour blocks.\n\ngenerally the largest guzzlers are ac, heater, dehumidifier.",
          "score": 5
        },
        {
          "text": "It might be. Most compressors work well(higher efficiency) at 50% or higher load. Right now you're only utilizing 25% load which reduces the efficiency.",
          "score": 5
        },
        {
          "text": "My monthly electrical bill is also high every month. I turn on the aircon for my room as long as I’m home. Air conditioner is a sucker for electricity. You should listen to little_caregiver_976, and not use your air conditioner for a month. I’m pretty certain that is why your electrical bill is so high. If you’re like me, a sucker for air conditioner, then expect to pay a high electrical bill every month.",
          "score": 5
        },
        {
          "text": "This feels like a good episode of Talking Point. Let’s get Steve Chia to go without aircon for a month. 😅",
          "score": 3
        },
        {
          "text": "Inverter do not use max power without need. Roughly one is 0.50 a night in power. Biggest offender is tank water heater, oven and empty freezer. Gaming machine also suck power like crazy, mine pull like 600 to 700 w so probably worse than aircon since it is run more often. You also never say how high is it. Mine is like 500 ish",
          "score": 3
        },
        {
          "text": "It’s so cool nowadays.  Take measurements for one night without aircon.  You will know if it’s aircon issue.",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1r3eiia",
      "subreddit": "askSingapore",
      "title": "Things to do alone in Singapore",
      "url": "https://old.reddit.com/r/askSingapore/comments/1r3eiia/things_to_do_alone_in_singapore/",
      "score": 23,
      "num_comments": 30,
      "created_at": "2026-02-13T11:34:15",
      "selftext": "Hello Singapore, I've been here for a while now and then few friends I have repeatedly cancelled on me. Feeling a bit down and alone. What are some fun solo and budget-friendly activities I can do here by myself tonight after work? Ideally not something like eat/drink somewhere alone, if there is something I can do that's more distracting that would be fun! ",
      "comments": [
        {
          "text": "I listen to podcasts while taking a long walk in the quiet park areas.",
          "score": 29
        },
        {
          "text": "Watch a movie. Can eat all the popcorn without needing to pass it here and there. Nobody would blink twice at you being alone in a movie theatre, or even notice you at all. ",
          "score": 20
        },
        {
          "text": "Here’s a few I do in my alone time:\n\nExplore each nature trail and find some place to eat along the way\n\nComplete a Lego passport, you can get them for free and each store can give you stamps but only the certified ones give you location specific ones and they have limited time ones during events like cny now it’s the horse stamp and the one at Bugis is unique too\n\nGo to a library and pick a random book\n\nGo see pasar malams/bazaars, there’s a bunch more now cus of cny",
          "score": 14
        },
        {
          "text": "If you asking this, then I guess you are not much a gamer? Haha. \n\nIf I am the kind of active person that I try to be, Mount Faber at night is possibly a nice walk? \n\nIf you cycle, you can cycle down the stretch of Marina Barrage all the way to the airport area. \n\nI think Chinatown should be bustling with the Lunar New Year energy right now as well.",
          "score": 7
        },
        {
          "text": "consider a makeit class (foc) offered by the library where they teach how to sew/laser cut/ 3d printing\n\nbut only downside is they are only avail at jurong, woodlands, punggol and tamp library on fri to sun only",
          "score": 4
        },
        {
          "text": "Go climbing. I usually go solo and just zen while climbing.",
          "score": 3
        },
        {
          "text": "the libraries are a nice place to hang out and read. \n\nJoin apps like meetup or reclub, maybe go join a pickleball game!\n\nThere are random night markets (Pasar malams) so maybe good to go walk around and see see. \n\nTaking the singapore sightseeing buses to just appreciate the sights around Singapore?\n\nTake classes, fitness or cooking classes.\n\nMaybe bowling or playing pool somewhere?\n\nMuseums perhaps?\n\n",
          "score": 3
        },
        {
          "text": "Options:\n1) join a gym with a community (like BFT)\n2) volunteer - soup kitchen, grassroots\n3) Toastmasters - self directed learning and community \n\nMost of these are alone but yet in a group",
          "score": 3
        },
        {
          "text": "Go to constant wind at the end of east coast park. Take up a 2 day stand up paddle or wing foiling course. You get to go into the sea to really enjoy the day, super fun, very few Singaporeans know about it yet the people who do it usually have a blast of a time.",
          "score": 2
        },
        {
          "text": "Join one of those social apps where u can meet up with different groups of people to play sports. The app Reclub is one of them, u can join pickleball games etc.",
          "score": 2
        },
        {
          "text": "Go east coast and rollerblade along the stretch, make friends with fellow solo-bladers along the way. Fun and free.",
          "score": 2
        },
        {
          "text": "I suggest picking up a language or dance class or martial arts. It’s a lot of fun and you make friends a bit more easily compared to other exercise classes. Plus you guys will end up meeting regularly for the classes which helps organically build up some friendships",
          "score": 2
        },
        {
          "text": "i sometimes visit museums by myself. i can go through all the paintings at my own pace without having to worry about whether i'm too fast or slow for my friend. i sometimes borrow books and read them in libraries (the one at vivo has a nice view i heard).\n\ni used to be into film photography and would go take pictures alone. but now that it's expensive i don't do it anymore. perhaps you could try it on your phone or a digital camera if you own one?",
          "score": 2
        },
        {
          "text": "Watch movie, go cycling",
          "score": 2
        },
        {
          "text": "Singapore parks not bad actually you can just go to one of the parks with a lake or pond or river and just relax and do what you wanna",
          "score": 2
        },
        {
          "text": "I listen to F1 podcasts and analysis on youtube while trying out new cafes and food spots.",
          "score": 1
        },
        {
          "text": "Go to Facebook and to the Events tab. There are plenty of things you can do where other people will join, and you can meet new people.   \n  \nA quick look I spotted this, which while it's not tonight, it's early tomorrow morning and I recommend it if you like nature.\n\nMorning Walk @ Rifle Range Nature Park  \n7:30 - 9:30 \n\nIf you don't want to do it in a group you can also just go for a hike yourself. Rifle Range to Windsor Park is a great walk.",
          "score": 1
        },
        {
          "text": "Do the same activities that you kena fly kite by your \"friends\" without them\n\nUwU",
          "score": 1
        },
        {
          "text": "Signing up for gym",
          "score": 1
        },
        {
          "text": "Parks are great! People watching, reading and book, running…",
          "score": 1
        },
        {
          "text": "Running. You don't need someone to run together, you don't need to spend a lot to run (this may change though, lol).",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1r2qqs5",
      "subreddit": "SingaporeRaw",
      "title": "You're not imagining things: Why Singapore feels unrecognisable compared to three decades earlier",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r2qqs5/youre_not_imagining_things_why_singapore_feels/",
      "score": 261,
      "num_comments": 79,
      "created_at": "2026-02-12T19:13:50",
      "selftext": "In **1996**, Singapore was a predominantly local society of **3.67 million people**. Singaporeans were a massive **82%** majority, meaning almost everyone shared a permanent, lifelong stake in the nation. The streets were quieter and the social fabric was uniform, as the non-resident workforce was just beginning to expand. Back then, the country functioned as a tight-knit nation-state where the vast majority of people held voting rights and a multi-generational claim to the land.\n\nIn **2026**, the population has surged to **6.15 million**, yet the citizen share has shrunk to just **59%**. While the total population grew by **68%**, the non-resident group exploded by over **530%**, reaching nearly **2 million**. This demographic shift has transformed the island into a high-pressure global hub where citizens of the country are increasingly outnumbered by transient residents. The physical density is compounded by an ageing crisis, with **21%** of citizens now **over 65**, leaving a smaller core of local stakeholders to navigate an unrecognisably crowded city.\n\nCrucially, the **59%** citizen figure is **deceptive** because it ignores the distinction between natural-born and naturalised citizens. The data masks the influx of adults who may not share the local culture or have served National Service (for males). This internal shift means the proportion of \"traditional\" stakeholders with deep roots is even lower than official stats suggest. Today, the [native-born](https://www.merriam-webster.com/dictionary/native-born) Singaporean finds themselves in a city where nearly **1 in 3 people** is a temporary guest, fundamentally altering the sense of home that existed thirty years ago.\n\n_________\n**Tl;DR:** Since **1996**, Singapore's population has hit close to **6.2 million** while the citizen stake diluted from **82% to 59%**. This **59%** includes many new citizens who didn't grow up locally or serve NS, meaning traditional stakeholders now share a much denser country with **2 million** non-residents. How much lower will this figure go in another three decades?\n_______\n\nOfficial Data Sources: [Singstat](https://www.singstat.gov.sg/) (For Censuses held decennially, [latest in 2020](https://www.singstat.gov.sg/publications/reference/cop2020/cop2020-sr1)) and [National Population and Talent Division](https://www.population.gov.sg/) (For Population In Briefs held annually, [latest in 2025](https://www.population.gov.sg/files/media-centre/publications/Population_in_Brief_2025.pdf) and [visual by ST](https://i.imgur.com/gH7Ynnh.png)).",
      "comments": [
        {
          "text": "Wait till you see the shift in % ownership of assets",
          "score": 149
        },
        {
          "text": "why need to do NS?  \nor why should NSF be paid only an allowance while every other foreign graduates come in and get a headstart in work with full pay.  \nThey make the country safe for their family as well as for businesses to invest and foreign employees to come to work.  \nTime for a conversation to justify their sacrifice..",
          "score": 108
        },
        {
          "text": "Better to renounce citizenship here and apply back for jobs here as a foreigner",
          "score": 86
        },
        {
          "text": "Turn the country into a quasi gulf state in Asia with high foreigner population - sure, maybe there's nothing wrong with that **if done the right way**.\n\nBut locals aren't even being treated royally like gulf citizens are? Locals are forced to NS, and worry about job security competing with foreigners, but gulf citizens don't have to do any of that? It doesn't make sense anymore...the social contract is literally being torn apart as the years go by..",
          "score": 32
        },
        {
          "text": "&gt;How much lower will this figure go in another three decades?  \n\n\nHonestly, many of us aren't going to be around to face that reality: Good luck, if you are still around.\n\nMeanwhile, I do what I can to pre-empt that from happening, but I'm only one vote.\n\nThis talk of population sustainability, increasing to 6.9m in 2013 by 2030, is fraught: Let's assume that we hit 6.9m in 2030, what next? 10m in 2045 to sustain the 6.9m, and so on? When does it stop?\n\nDon't forget, we are only 720sq km, how much more can we grow?",
          "score": 28
        },
        {
          "text": "It's just a matter of time we lose our true national identity. When asked generally what would describe Singapore people - I don't think there's a unique identity that speaks of us true Singaporeans anymore, much less when we become the minority in the near future.\n\nCan we still function as a country, yes. Can we still progress, yes since we are heavily people dependent. But do people here actually have a belonging and identity, I m not sure.",
          "score": 18
        },
        {
          "text": "We have no natural resources except human resources. But in economics, the [PPF (Production-possibility frontier)](https://en.wikipedia.org/wiki/Production%E2%80%93possibility_frontier) will not expand no matter how much labour you pump into an economy.\n\nInstead, the net effect is a transfer of jobs from older and more experienced i.e. more expensive workers to younger and less experienced workers i.e. cheaper labour. We had been seeing this trend for years but just that officially it will never be acknowledged. To do so will be political suicide.\n\nJust look at the increasing number of senior, highly skilled and experienced professionals who ended up in the gig industry i.e. driving private hire vehicles or food delivery. The signs are there for those with eyes opened and ears listening.",
          "score": 12
        },
        {
          "text": "1996: local aunties and uncles speak in a mixture of broken english, malay, chinese despite not being english educated.\n\n2026: new citizen PRC seniors insist on speaking mandarin despite non-mandarin speakers in the group, creating awkward situations.",
          "score": 8
        },
        {
          "text": "Singapore is an example of globalisation and the Great Replacement Theory. Unfortunately due to cowardice east asian culture/tradition, the people will never oppose soft colonisation by foreign plants in the government.",
          "score": 7
        },
        {
          "text": "The world you grew up in no longer exists",
          "score": 6
        },
        {
          "text": "Imagine how fast this post will get taken down if posted in r/Singapore even online we dont have a proper home",
          "score": 6
        },
        {
          "text": "This means that 2/6 to half of locals are older than 65?",
          "score": 6
        }
      ]
    },
    {
      "id": "t3_1r2mkop",
      "subreddit": "SingaporeRaw",
      "title": "Which former Olympic athlete is he calling a loser?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r2mkop/which_former_olympic_athlete_is_he_calling_a_loser/",
      "score": 156,
      "num_comments": 137,
      "created_at": "2026-02-12T14:54:19",
      "selftext": "",
      "comments": [
        {
          "text": "He's fit for sure but his sport is a midlife crisis",
          "score": 212
        },
        {
          "text": "I saw Schooling a few months ago. He is an average size guy now. He’s not fat or anything. Just chubby and normal like most SG guys. He is still quite well built so probably still is active and works out. \n\nIt is clear that his priorities have changed, and that is totally fine. He already achieved the pinnacle of his sport, at a GLOBAL stage. What more does he need to prove. \n\nThis Soh guy is completely toxic and serves as a bad example for younger athletes. I pity the people who have to be his team mates.",
          "score": 209
        },
        {
          "text": "Sounds like this is targeted towards SNOC Mark Chay Kuay Teow",
          "score": 203
        },
        {
          "text": "Sounds like he's trying to stay relevant by stirring up drama.",
          "score": 129
        },
        {
          "text": "If they are not longer a professional athlete then what's the issue.\n\nWe have many people abusing their bodies anyway.",
          "score": 49
        },
        {
          "text": "Mid life crisis will hit this kind of person the hardest. No longer top of his field but the mouth is louder than ever 🤣",
          "score": 34
        },
        {
          "text": "talking abt Joseph Schooling?  \ni would give Schooling A PASS for the rest of his Lifetime!  \nthe frakking local-born bugger WON US THE OLYMPIC GOLD MEDAL!\n\nSRY, you get gold medal, then talk.",
          "score": 30
        },
        {
          "text": "Guy is quite entertaining, actually. Won't get the respect and recognition he wants, but we get to be entertained by him.",
          "score": 26
        },
        {
          "text": "As much as Tan Chuan Jin is a piece of filth, he wasn’t wrong about this cringe spreading ah Soh.",
          "score": 16
        },
        {
          "text": "Damn toxic please",
          "score": 11
        },
        {
          "text": "This dude pretty much needs to be relevant 24/7. Hence the act(s) of constantly drawing attention to himself.",
          "score": 11
        },
        {
          "text": "Sounds like projection.",
          "score": 7
        },
        {
          "text": "or is it ah schooling?",
          "score": 7
        },
        {
          "text": "So non olympic athlete = loser. Got it.",
          "score": 6
        }
      ]
    },
    {
      "id": "t3_1r2nc5k",
      "subreddit": "SingaporeRaw",
      "title": "30yo male Indian national attacked an Indonesian lady with an Axe 🪓 on 11th Feb at Sims View. Why so many violent crimes in SG lately?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r2nc5k/30yo_male_indian_national_attacked_an_indonesian/",
      "score": 143,
      "num_comments": 68,
      "created_at": "2026-02-12T15:41:12",
      "selftext": "",
      "comments": [
        {
          "text": "Another incident involving CECA as perpetrator, Indonesian as victim and Singapore as the arena. \n\n![gif](giphy|d7mMzaGDYkz4ZBziP6)\n\n",
          "score": 143
        },
        {
          "text": "I'm surprised they did indicate that it was an India national though",
          "score": 64
        },
        {
          "text": "Look no one is asking to completely ban immigration but at least do a comprehensive background check to ensure these people don’t come in",
          "score": 52
        },
        {
          "text": "CECAs.",
          "score": 37
        },
        {
          "text": "Another CECA killed Indonesian again. :(\n\nMust tell Indonesians about this or else they think why their people keep getting killed in Singapore.",
          "score": 30
        },
        {
          "text": "Can you post this in r/Indonesia to raise awareness please",
          "score": 19
        },
        {
          "text": "Foreign talent?",
          "score": 17
        },
        {
          "text": "Attack helper? Aiyo why on Sunday ahneh attacked pinoy then now attack Indo? Both ladies don't want give piak piak? Wkwkwkwk. . . . . .anyway, the one on Sunday at Lucky Plaza is just brutal. Got attacked just because kena rejected is fucking low. That guy's kkb and brain must be damn small to let it affect him",
          "score": 16
        },
        {
          "text": "Too much foreigner ",
          "score": 7
        },
        {
          "text": "50% of sg population are FTs now, many low level jobs so its expected they being their village mentality here too",
          "score": 6
        },
        {
          "text": "Like i said, Singapore is becoming the cesspool for cluster-B personalities. Mainly sociopaths and narcissists.",
          "score": 6
        },
        {
          "text": "Ind Vs Ind",
          "score": 5
        },
        {
          "text": "I believe, Singapore should tighten immigration controls for the long-term good.",
          "score": 4
        }
      ]
    },
    {
      "id": "t3_1r2p03o",
      "subreddit": "SingaporeRaw",
      "title": "Local born SGreans are screwed *Budget 2026%*",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r2p03o/local_born_sgreans_are_screwed_budget_2026/",
      "score": 127,
      "num_comments": 87,
      "created_at": "2026-02-12T17:27:24",
      "selftext": "Despite 65% approval from voters (excluding me) and GDP increase by 5% last year, ..\n\nThe Govt budget today gave local born SGreans teeny weeny benefit.\n\nWe are screwed!",
      "comments": [
        {
          "text": "65% still living their life with properties to flip, 20k per month salary and multiple annual holidays.\n\nSTI ath, everything up for them. Why complain?",
          "score": 157
        },
        {
          "text": "40% corporate income tax rebate for \"cost pressures faced\" by firms, keeping up the absolute burning garbage pile that is Skillsfuture, but not one single thing to **ensure job security** for local Singaporeans. The disrespect is insane 🤦‍♂️",
          "score": 152
        },
        {
          "text": "what a joke, treat citizens like trash",
          "score": 68
        },
        {
          "text": "We don’t need more vouchers if we have more job stability and lesser competition from foreign trash. \n\nDid pm talk about job security for Singaporeans? I only see the AI portion.",
          "score": 46
        },
        {
          "text": "skillsfuture is such a joke and they are going to double down on it lol ",
          "score": 42
        },
        {
          "text": "We always had a choice when it came to our votes. The reality is that many people don’t see the big picture and just want immediate benefits. That’s the price we pay lor.",
          "score": 37
        },
        {
          "text": "Did you see the budget surplus? it’s laughable. Enriching the war chest only. \nForeigners happy, they got a pay increment.\n\nA Singaporean I know has a NUS degree and when he saw this he wtf, foreigner pay is more than him and mind you, he has 20 years are experience.",
          "score": 21
        },
        {
          "text": "People who don't recognize the pattern and timing of the goodies deserve to be unhappy. \n\nUnless we have severe external shocks, more goodies will be given out closer to an election. Those are the years of the chicken wings. Now, the govt will be collecting the legs. And no matter what the govt will likely be having surpluses.",
          "score": 18
        },
        {
          "text": "The game is over. Darwinism wins. We need new citizens to take Singapore to the next stage.\n\n* **The Real Gap:** We were raised in a **Greenhouse** (follow rules = success). Foreign talent was raised in a **Jungle** (fight/hustle = survival).\n* **The Result:** Put a greenhouse plant in the jungle, it dies. We wait for instructions/fairness. They hustle, network, and fight dirty.\n* **Hard Truth:** Nature doesn't care about your Pink IC. It only cares about adaptability. The \"New Citizen\" is just the fitter organism for this economy. We are bringing textbooks to a knife fight.\n\n",
          "score": 18
        },
        {
          "text": "Why are you all acting surprised. This is what majority voted for... 3+ more years to election they can mess with us however they want to in the meantime. Next election they'll come out, distribute another round of cdc vouchers lnock doors and give us empty promises and fools will vote for them again..",
          "score": 14
        },
        {
          "text": "nepobabies win again.",
          "score": 13
        },
        {
          "text": "https://preview.redd.it/yhz985trt2jg1.jpeg?width=846&amp;format=pjpg&amp;auto=webp&amp;s=49d6262d741b025e33c3178de444b639ad8a470f",
          "score": 12
        },
        {
          "text": "SONGBO",
          "score": 11
        },
        {
          "text": "My mother is one of those masochist you guys mentioned, she loves to trap herself in poverty, in a dead end. Because she can't think, and gets mad when others tell her the reality ",
          "score": 9
        },
        {
          "text": "And PAP wants want to increase their own pay",
          "score": 4
        },
        {
          "text": "Ceca still in place",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1r37axv",
      "subreddit": "SingaporeRaw",
      "title": "I feel that authorities hide behind ‘shared responsibility’ to avoid real accountability",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r37axv/i_feel_that_authorities_hide_behind_shared/",
      "score": 90,
      "num_comments": 8,
      "created_at": "2026-02-13T06:17:24",
      "selftext": "What do the Ministry of Home Affairs, the Singapore Police Force, the Land Transport Authority, and the Singapore Road Safety Council have in common?\n\nThey all use the phrase: Road safety is a shared responsibility.\n\n\n\n[https:\\/\\/www.straitstimes.com\\/opinion\\/forum\\/forum-regular-enforcement-and-maintenance-carried-out-to-enhance-road-safety-for-cyclists](https://preview.redd.it/ujf2e7t9w4jg1.jpg?width=1550&amp;format=pjpg&amp;auto=webp&amp;s=377edb3647b2d5d619b3b69b390464a31bc97f78)\n\n\n\n[https:\\/\\/www.straitstimes.com\\/opinion\\/forum\\/forum-more-road-safety-measures-ahead](https://preview.redd.it/nbk8b01cw4jg1.jpg?width=1534&amp;format=pjpg&amp;auto=webp&amp;s=6c44df13de50ebee0ccc8dca0fb7224728b33946)\n\n[https:\\/\\/www.straitstimes.com\\/opinion\\/forum\\/forum-road-safety-a-shared-responsibility](https://preview.redd.it/o8zz5d1hw4jg1.jpg?width=1515&amp;format=pjpg&amp;auto=webp&amp;s=9c955d6a98af6fd954d2c7104d554ea7c4c990a4)\n\n\n\n[https:\\/\\/www.straitstimes.com\\/opinion\\/forum\\/forum-road-safety-depends-on-attitudes-of-all-road-users](https://preview.redd.it/3tnyr1lhw4jg1.jpg?width=1442&amp;format=pjpg&amp;auto=webp&amp;s=797043e6b41c8216cb68ae36bb174f503b60e8dc)\n\n\n\nAs someone who sometimes walks on pavements - not even trying to cross a road - I genuinely want to understand: why is it my responsibility to keep myself safe from vehicles?\n\nIf I am in a space specifically built to separate pedestrians from traffic, what exactly am I supposed to \"share\" in that responsibility?\n\nIsn't it primarily the authorities' role to design safer infrastructure, set appropriate penalties, and enforce the law in a way that deters dangerous driving?\n\nWhen a vehicle ends up on a pavement, the pedestrian didn't control the speed limit, the road design, or the enforcement regime. So the idea that responsibility is evenly \"shared\" doesn't quite make sense.\n\nIf the risks aren't equal, the responsibility shouldn't be framed as equal either.\n\n\n\n[https:\\/\\/www.stomp.sg\\/singapore-seen\\/car-ends-up-on-pavement-in-accident-at-woodlands-crescent](https://preview.redd.it/ojovghcrw4jg1.jpg?width=938&amp;format=pjpg&amp;auto=webp&amp;s=cd7c56c07a20504c765056cc8d778033b5471ea6)\n\n\n\n[https:\\/\\/www.stomp.sg\\/singapore-seen\\/car-mounts-pavement-near-bedok-reservoir-block-its-so-unsafe](https://preview.redd.it/di7pdk5vw4jg1.jpg?width=941&amp;format=pjpg&amp;auto=webp&amp;s=e8bcddb35678a12565e82a0e06c43a00a254874f)\n\n[https:\\/\\/www.stomp.sg\\/singapore-seen\\/car-crashes-onto-pavement-in-pasir-ris-driver-claims-brake-failure-assisting-with](https://preview.redd.it/8ermx9kxw4jg1.jpg?width=940&amp;format=pjpg&amp;auto=webp&amp;s=0fc8953b408c34457f04ad01a6291a388cbccd9f)\n\n[https:\\/\\/www.stomp.sg\\/singapore-seen\\/police-searching-driver-who-allegedly-fled-after-crashing-bluesg-car-woodlands-hdb](https://preview.redd.it/y88itpq9x4jg1.jpg?width=965&amp;format=pjpg&amp;auto=webp&amp;s=9d5ddd667208c1bcf808f5006c230a6ba16dc1e0)\n\n[https:\\/\\/www.stomp.sg\\/singapore-seen\\/yesterday-it-was-a-cab-today-its-bmw-that-crashes-into-hdb-block-this-time-at-bukit](https://preview.redd.it/6bm4v5chx4jg1.jpg?width=1014&amp;format=pjpg&amp;auto=webp&amp;s=3044c5c44fcac538fa35c251699c092ab6af6717)\n\n\n\n[https:\\/\\/www.stomp.sg\\/singapore-seen\\/driver-taken-to-hospital-after-crashing-car-into-void-deck-of-segar-road-hdb-block](https://preview.redd.it/dk1pznwkx4jg1.jpg?width=936&amp;format=pjpg&amp;auto=webp&amp;s=4f5e8a562696a23fc4bf8c0a3e9b05e14e9ef9cb)\n\n  \nGood thing no one died in the above incidents. (I'm too lazy to google for those that involved fatalities).\n\n[https:\\/\\/www.straitstimes.com\\/opinion\\/forum\\/forum-steps-being-taken-to-deter-speeding-and-beating-of-red-lights](https://preview.redd.it/x976mz0kz4jg1.jpg?width=1530&amp;format=pjpg&amp;auto=webp&amp;s=561088a4b10173e3c3919e859861d288713931a0)\n\n  \n\"Motorists **must play their part** by complying with traffic laws\".\n\nWhy stop there, though? Might as well say:   \n  \n*Everyone must play their part by complying with every law, so we don’t need enforcers or prisons. Imagine how much money we'd have to distribute as CDC vouchers every year!*\n\n",
      "comments": [
        {
          "text": "Unfortunately it exists as so because the policy makers themselves are the ones benefiting from the policy — “car superiority”",
          "score": 28
        },
        {
          "text": "There’s an accident waiting to happen at a side street in my neighbourhood because the hardware store trucks love to park illegally and I’ve been complaining to LTA that when cars turn into the alley they cannot see pedestrians and vice versa. You never know when a careless driver is going to run someone over, especially when even careful drivers may find it difficult to look over the trucks. I advocated for a convex mirror so at least we can kinda spot each other before crossing and not have to depend on trucks not parking there.\n\nLTA response is they will be more active in catching the illegal parking. Feels like ur headline in practice.",
          "score": 18
        },
        {
          "text": "Shared responsibility just means USE your own BLOODY EYES and head to see and think on the road, then no one will get into an accident. Simple, cos in their eyes, no amount of precaution can be understaken to prevent these accidents if the road user themselves are blind. We are basically wasting tax payer money on them to tell us back to stay safe ourselves without enforcement.",
          "score": 13
        },
        {
          "text": " Internally govt agencies push blame to each other and argue amongst directors. Sometimes one govt agency wants to do something but blocked by another agency. \n\nHowever on outside they project a sense of shared responsibility",
          "score": 5
        },
        {
          "text": "Basically they can't afford to offend those who are stupid enough to pay the high COE prices",
          "score": 5
        },
        {
          "text": "Sick insights op",
          "score": 2
        },
        {
          "text": "I think in the future they will just claim it was an \"act of god\" then nothing much they can do. XD",
          "score": 1
        },
        {
          "text": "It's fine to use phrases like that.  \nAs long as when sh.t hits the fan, they know who to punish correctly and appropriately.  \nStill waiting for cyclist to have road insurance, road tax. \n\nYes, I am waiting for flames. Light me up. hehe",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1r2nd1d",
      "subreddit": "SingaporeRaw",
      "title": "BUDGET 2026 DISCUSSION",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r2nd1d/budget_2026_discussion/",
      "score": 59,
      "num_comments": 93,
      "created_at": "2026-02-12T15:42:52",
      "selftext": "",
      "comments": [
        {
          "text": "FT get a pay raise again 🤔 so many jiuhu are working with S PASS here and earning 3.6K+ while our own local fresh grads are jobless and paid 2K for some intern rubbish.",
          "score": 52
        },
        {
          "text": "Same as usual, still massive import FT that Singaporean able do is useless. Also keep claim got a lot new job, but where the job is especially tech, even ai engineer kind of the job also don't have.",
          "score": 49
        },
        {
          "text": "Traitors selling the country again",
          "score": 47
        },
        {
          "text": "All the company rebates came out first",
          "score": 32
        },
        {
          "text": "VOUCHER WONG STRIKES AGAIN",
          "score": 18
        },
        {
          "text": "Ownself take care ownself folks❤️",
          "score": 17
        },
        {
          "text": "PM Wong said he will address the following in his speech: \n\n- Advancing Singapore’s refreshed economic strategy;\n- harnessing artificial intelligence as a strategic advantage;\n- building a resilient and skilled workforce;\n- providing families more support and greater assurance;\n- protecting security and sustainability;\n- renewing and strengthening the Singapore spirit.",
          "score": 14
        },
        {
          "text": "**FOREIGN WORKER POLICY AMENDMENTS**\n\n1. EP minimum qualifying salary raised from $5600 to $6000. For Financial Services sector, the min qualifying salary will be raised from $6200 to $6600. New applicants from Jan 2027, renewal applicants from 2028.\n2. S-Pass minimum qualifying salary raised from $3300 to $3600, and $3800 to $4000 for financial services sector. New applicants from Jan 2027, renewal applicants from 2028.\n3. Work Permit levies for basic skilled workers in Marine and process sectors raised by $100 and $150 respectively from 2028.\n\nhttps://preview.redd.it/5fcdmntcz0jg1.png?width=640&amp;format=png&amp;auto=webp&amp;s=0a381022526d3587e51130ff6fbbf166ed04af14",
          "score": 14
        },
        {
          "text": "**CORPORATE GOODIES**\n\n1. **40% corporate income tax rebate** \\- Companies will enjoy a 40 per cent corporate income tax rebate in the 2026 year of assessment. Each active company that employed at least one local employee in 2025 will receive a minimum benefit of $1,500, with the total benefit for each company capped at $30,000.\n2. Govt to invest **$37 Billion under Research, Innovation, and Enterprise plan**\n3. Govt to set aside **$1 Billion to enhance Startup SG Equity scheme**\n4. **Second $1.5 billion tranche of the Anchor Fund** to be launched - to attract and anchor high quality public listings.\n5. **$1.5 billion top-up to Financial Sector Development Fund** to strengthen Singapore’s broader equities market. Addition to MAS’s 2025 Equity Market Development Programme to develop Singapore’s fund management industry and increase investor participation in our equities.\n6. **400% tax deductions on qualifying expenditures in activities like R&amp;D, innovation, and capability development.** Champions of AI programme to help companies undertake sweeping AI transformation. Enterprise Innovation Scheme will be expanded to include AI expenditures as qualifying activity for 2027/28 years of assessment, capped ar $50k per year of assessment.",
          "score": 14
        },
        {
          "text": "Govt saying FU to smokers hahaha",
          "score": 14
        },
        {
          "text": "**NEW INSTITUTIONS**\n\n1. **“Make (Singapore) Equities Great Again” Workgroup** \\- led by MP Chee Hong Tat - work with industries to develop strategies to position Singapore as leading centre for growth capital.\n2. **National AI Council** \\- Led by PM Wong - to provide strategic direction and drive the country’s AI Agenda.\n3. **AI park at One-North** \\- a new hub to spark ideas, build partnerships and turn AI initiatives into practical solutions. Builds on the Lorong AI initiative, a dedicated co-working space for Singapore’s AI economy.\n4. **Taskforce on Assurance for Families with Persons with Disabilities** \\- led by Goh Pei Ming, Minister of State for Social and Family Development - provide greater opportunities and assurance to persons with disabilities and their families.",
          "score": 11
        },
        {
          "text": "**WORKERS' GOODIES**\n\n1. **Local Qualifying Salary** (min salary that a full time local employee must be paid in firms that hire foreign workers) **raised from $1600 to $1800**. To help businesses defray some of this cost, Progressive Wage Credit Scheme (PWCS) co-funding to be raised from 20% to 30%, and it will be extended 2 more years to 2028.\n2. Govt to raise Minimum Wage to qualify for PWCS support increase from $100 to $200, to encourage companies that invest in workers.\n3. Govt to enhance basic tier of Workfare Skills Support schemes and increase hourly allowance for workers who upgrade their skills.\n4. Senior Employment Credit (SEC) to be extended to end-2027, scheme helps to defray wage costs employers bear for hiring Singaporeans above 60 years old who earn under $4000 a month.\n\nhttps://preview.redd.it/btq5q4qgz0jg1.png?width=640&amp;format=png&amp;auto=webp&amp;s=6f9f4457563a1818fcbc8f480ccec4151296187e",
          "score": 10
        },
        {
          "text": "Tbf i believe youths doesn't need more cash support. They need inspiration, ideas &amp; empowerment and not have their curiosity and explorational instincts killed",
          "score": 7
        },
        {
          "text": "**SENIOR GOODIES**\n\n1. Government will top up the Long-Term Care Support Fund by $400 million. CareShield Life enhanced to offer higher payouts, giving seniors greater assurance against long-term care costs. The Government also increased CareShield Life premium subsidies, to help cushion the impact of the higher premiums.\n2. **CPF top-up of up to $1,500** for Singaporeans aged 50 and above, and with CPF retirement savings below the Basic Retirement Sum. Those with lower balances will receive larger top-ups.\n\nhttps://preview.redd.it/utp39e95z0jg1.png?width=640&amp;format=png&amp;auto=webp&amp;s=f2433d944d9f62763fc227fc99f754f6bb411dc9",
          "score": 6
        },
        {
          "text": "Ep sp got raise, where's ours 🥲",
          "score": 5
        },
        {
          "text": "**COST OF LIVING GOODIES**\n\n1. **Cost-of-Living Special Payment, comprising $200 to $400 in cash**, to Singaporean adults who earn up to $100,000 in assessable income and do not own more than one property.\n2. **Up to $570 of U-Save rebates** for eligible HDB households (1.5x the regular amount of U-Save rebates)\n3. All S’porean households to receive **$500 in CDC vouchers** in January 2027. Half can be used at participating supermarkets, said PM Wong, adding that the other half can be used at participating heartland merchants and hawkers.\n\nhttps://preview.redd.it/c1we2c57z0jg1.png?width=640&amp;format=png&amp;auto=webp&amp;s=416986761b883861c94198f8126c59e47896a937",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r2xzvr",
      "subreddit": "SingaporeRaw",
      "title": "Called back as NS OC, how to go back to being PC in ict",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r2xzvr/called_back_as_ns_oc_how_to_go_back_to_being_pc/",
      "score": 53,
      "num_comments": 42,
      "created_at": "2026-02-13T00:28:50",
      "selftext": "Hi all, I was a platoon commander back in NS and assumed I will be resuming that role during ICT. However, I just got informed that I will be attending a briefing for 2IC appointment and above on behalf of my company, which were only given to the designated OCs of the other companies. This was probably because my company's designated OC signed on after ORD lmao.\n\nAnyways I have no intention of serving as OC during reservist, go CTC and more work to do really not my cup of tea. How do I get out of this and get back to PC appointment again? If anyone has relevant experience pls share.",
      "comments": [
        {
          "text": "Basket. Wanted the privileges during NS then now don’t want the commitment?",
          "score": 120
        },
        {
          "text": "Go ocs somemore lor",
          "score": 86
        },
        {
          "text": "Declare as gay",
          "score": 80
        },
        {
          "text": "You can start by not attending the briefing. Take mc. Do whatever you have to but don't attend it.\n\nThen when they appoint you as OC, you claim you can't do the job cuz you are not briefed. Just keep taking mc every reservist until they are tired of you fucking up their plans",
          "score": 73
        },
        {
          "text": "Speak to your CO honestly. In such cases, the Bde DyS8 would have recommended a list of potential OCs to your CO and your appointment would have been an outcome of that conversation. NSmen often wanna stay in the same role for different reasons and turn down \"promotions\". If your CO is a NSman, he will understand this. Even if your CO is a Regular CAH, he will likely understand it too.\n\nAn honest conversation would go a long way.",
          "score": 53
        },
        {
          "text": "shag occifer ict still need do so much saikang.",
          "score": 29
        },
        {
          "text": "Additional 1 week for High Key ATEC ICT, Advance Party setup, daily nightly briefing with commanders during ICT\n\nI hope your employer is a GLC, govt sector or your direct boss is some siao on army lover. \n\nI definitely won’t give so much commitment for reservist, Not in this economy where everyone is jittery about their employment\n\nBut hey at least you get to enjoy officer mess + dinner with CO after end of ICT right? Lol",
          "score": 26
        },
        {
          "text": "downpes",
          "score": 13
        },
        {
          "text": "Loser. Then last time choose command school for fk.",
          "score": 13
        },
        {
          "text": "Chao geng, now you know the 4d chess we LCPs played",
          "score": 12
        },
        {
          "text": "Kinda screwed. Jus speak to Ur co/s3 on Ur preference. No reason to chao Keng. I mean officers are suppose to be mature guys so just be upfront. They also dun wan to put an unmotivated guy in a role. All the best! Btw if U r I .govt etc then hvg a senior appt in ns is recognized.",
          "score": 10
        },
        {
          "text": "You remind me of this golden bayonet fker, last time ns trainee, chiong and wayang like siao just to get golden bayonet then go unit keng like siao.\n\nReservist mia also.\n\nPui, throw face.",
          "score": 10
        },
        {
          "text": "Suck thumb lor",
          "score": 8
        },
        {
          "text": "Sorry to hear that. Luckily I am CFC. Can sleep in bunk during reservist heheheheh",
          "score": 7
        },
        {
          "text": "Downpes is the easy way out. Just geng MC non-stop only.",
          "score": 5
        },
        {
          "text": "go china work for 解放军. sure will get promoted to storeman.",
          "score": 2
        },
        {
          "text": "why u so siao on last time? u see la now u kena ict until 50yo.",
          "score": 2
        },
        {
          "text": "Not sure why your CO pull this stunt. For any major appointment like that, we will usually speak to the individual personally first to see if they are interested and committed, before calling them up with saf100. At least a short informal phone chat.\n\n+1 for transparency here, just let your CO know asap and explain honestly. He might try to convince you but end of the day, esp among commanders, no point pulling rank and forcing you if you don’t want. Should be able to have a mature chat as adults. No one wins if you are forced, especially the men in your Coy confirm suffer with an MIA OC.",
          "score": 2
        },
        {
          "text": "Training to be soldier, Fight for our land, Once in our lives, 2 years of our time..❤️",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r2oaq8",
      "subreddit": "SingaporeRaw",
      "title": "Salvation is here",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r2oaq8/salvation_is_here/",
      "score": 47,
      "num_comments": 26,
      "created_at": "2026-02-12T16:41:49",
      "selftext": "https://www.straitstimes.com/live-singapore-budget-2026-pm-wong",
      "comments": [
        {
          "text": "Meanwhile\n\nDrinks rise in costs due to forced recycling \nPublic Transport fare increase\nJobs still go to foreigners as priority \nGraduates go for 'traineeships' as the jobs go to foreigners\nCosts of living continue to rise\n\nNo wonder my gen lose hope in Sg",
          "score": 21
        },
        {
          "text": "Not much actually.",
          "score": 14
        },
        {
          "text": "srsly the only thing singaporeans are looking fwd to",
          "score": 13
        },
        {
          "text": "Singapore smokers doing the heavy carrying. Let’s see if annual tobacco tax revenue actually decreases, from the 20% increase today.",
          "score": 13
        },
        {
          "text": "cdc vouchers only disbursed jan27😓",
          "score": 9
        },
        {
          "text": "Pathetic",
          "score": 9
        },
        {
          "text": "In summary, at a glance. Includes the customary $450 - $850 GSTV cash payout in August.\n\nhttps://preview.redd.it/zjjy8k6hc1jg1.jpeg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=c337d2a2d7abae63754f6ad2328b7f40daaa7fba",
          "score": 8
        },
        {
          "text": "He seriously earns the name voucher wong lmao",
          "score": 4
        },
        {
          "text": "Liang por por. Hoo Hoo Hoo.",
          "score": 4
        },
        {
          "text": "This is the whole chicken right? RIGHT?",
          "score": 4
        },
        {
          "text": "that's some form of UBI",
          "score": 1
        },
        {
          "text": "All these one offs are useless in effecting real change \n\nTactical dark arts at work",
          "score": 1
        },
        {
          "text": "These are literally vote buying.",
          "score": 1
        },
        {
          "text": "Lots of people fall for these. Sad.",
          "score": 1
        },
        {
          "text": "No wonder they needed to fix Pritam and sling mud. They are horrible.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r2m98q",
      "subreddit": "SingaporeRaw",
      "title": "Man to be charged with attempted murder after allegedly attacking woman with axe at Sims View",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r2m98q/man_to_be_charged_with_attempted_murder_after/",
      "score": 42,
      "num_comments": 21,
      "created_at": "2026-02-12T14:35:01",
      "selftext": "The suspect, an Indian national, and the victim, an Indonesian national, are known to each other.\n\n\\- Zero harm to sinkies, net positive GDP to sinkies, what a W and we need to absorb more of these positive cultures",
      "comments": [
        {
          "text": "Charged with attempted murder? His ass is fried. ",
          "score": 13
        },
        {
          "text": "Time to control excessive immigration",
          "score": 9
        },
        {
          "text": "I suspect maid?",
          "score": 8
        },
        {
          "text": "All these happening in SG. Gone are the days",
          "score": 8
        },
        {
          "text": "No name of suspect?",
          "score": 8
        },
        {
          "text": "I shall not speak",
          "score": 6
        },
        {
          "text": "Indian nat and Indonesian again???",
          "score": 5
        },
        {
          "text": "Please tag all the CECA defenders here.",
          "score": 4
        },
        {
          "text": "This will never be reported in r/sg",
          "score": 3
        },
        {
          "text": "Yes. We need to open our legs more and watch them fight it out, while we reap the rewards. ",
          "score": 3
        },
        {
          "text": "No name no photo?",
          "score": 2
        },
        {
          "text": "tis world is 🥜🥜🥜",
          "score": 2
        },
        {
          "text": "East side again. ",
          "score": 2
        },
        {
          "text": "![gif](giphy|1a0bXIep4jrY4)",
          "score": 1
        },
        {
          "text": "feels like deja vu, just that one with car and this...",
          "score": 1
        },
        {
          "text": "Good riddance",
          "score": 1
        },
        {
          "text": "Let's not get into conclusio-\n\nOh its an Indian again",
          "score": 1
        },
        {
          "text": "Waiting with popcorn for the usual pitchfork and torches crowd.\n\n![gif](giphy|pUeXcg80cO8I8)\n\n",
          "score": -2
        }
      ]
    },
    {
      "id": "t3_1r3cczz",
      "subreddit": "SingaporeRaw",
      "title": "Anyone smell the air in potong pasir?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1r3cczz/anyone_smell_the_air_in_potong_pasir/",
      "score": 39,
      "num_comments": 12,
      "created_at": "2026-02-13T09:53:52",
      "selftext": "yes it's different air quality measurement and NEA's air quality always looks good",
      "comments": [
        {
          "text": "Man last night was rough. The air smells bad and woke up with the throat feeling scratchy. \n\nWhat's our govt doing? Start talking to Johor and get them to do something damn it.",
          "score": 18
        },
        {
          "text": "Because you are looking at NEA's 24hr PSI which averages out in 24hr, resulting in a lower reading if the air quality is good for the rest of the time. You should use their hourly PM2.5 readings instead for a more accurate picture.\n\nIf you want to know more, search for \"PSI vs AQI vs PM2.5\"",
          "score": 8
        },
        {
          "text": "https://preview.redd.it/98fl6rlb76jg1.png?width=1240&amp;format=png&amp;auto=webp&amp;s=9b5323def833a82b9607cd594f536ee8999b0d83\n\nlucky i stay west side.",
          "score": 7
        },
        {
          "text": "NEA following SMRT. Only report the major incidents. So don't count on NEA reporting until you literally cannot see 2 feet ahead of you. And then they will just call it \"unhealthy\".",
          "score": 5
        },
        {
          "text": "https://preview.redd.it/d4pj7vm4s6jg1.jpeg?width=504&amp;format=pjpg&amp;auto=webp&amp;s=72dff775ef3c8dc3112bb7c33bf36c799e555bd5\n\n",
          "score": 1
        },
        {
          "text": "das right air is so freshhhhh better breathe a mouthful innnnnn",
          "score": -3
        }
      ]
    },
    {
      "id": "t3_1r2onh6",
      "subreddit": "singaporefi",
      "title": "Recieved 9 x $100 from random stranger - 6 months later",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r2onh6/recieved_9_x_100_from_random_stranger_6_months/",
      "score": 118,
      "num_comments": 56,
      "created_at": "2026-02-12T17:04:24",
      "selftext": "Context - [https://www.reddit.com/r/askSingapore/comments/1n0kmz2/recieved\\_9\\_x\\_100\\_from\\_random\\_stranger/](https://www.reddit.com/r/askSingapore/comments/1n0kmz2/recieved_9_x_100_from_random_stranger/)\n\n  \nFast forward 6 months later. My bank account was still frozen.\n\n\n\nTexted IO through whatpps to check on status (What IO replied me)\n\n**Oct 2025**\\- The case is still on going , IO will update me when they conculded the case\n\n**Nov 2025**\\- They are addressing the case to AGC for their approval to unfreeze my bank account, Will keep me updated once they give their concurrence\n\n**Dec 2025** \\- No replies\n\n**Feb 2026** \\- They are going to conclude the investigation soon. IO will keep me informed again once they are about to release the bank account back to me. \n\n  \nFyi- Not even 1 time the IO contacted me to update me. I guess the waiting game shall go on. ",
      "comments": [
        {
          "text": "They froze your account over just $900? That seems way over reacting. Are you experiencing hardship from not having access to your money?",
          "score": 124
        },
        {
          "text": "They froze your bank acc for 6 months over something you didn't know? Thats daylight robbery no? What if you need the money... i would have just go make it big and pay people to put it on news paper to see the shit they are doing.",
          "score": 39
        },
        {
          "text": "wa fking suay. do u have other bank accounts that you can use in the mean time? i can't imagine being in your shoes man.",
          "score": 17
        },
        {
          "text": "Ask for a date of response. Don't just let the IO say he will contact you when he has updates. \n\nForces him to get to work. Put the onus on him to get back to you. \n\nThey are investigating if you are involved I suppose.",
          "score": 12
        },
        {
          "text": "Yes their handling of such case really need to be thoroughly refined. Or is work even being done...\n\nI am in the same situation, a little bit more story to it but same idea.\nMy entire dbs is unable to login and account unusable, my cpfis and srs all there. \nLuckily my paynow was changed to uob for some promotion thing otherwise it will be super problematic. Nric paynow still stuck under dbs.\n\nContacted Dbs and told to me to contact scam centre then contact police. But i was lazy, thinking if this was a police case, they should be finding me. And no. Dragged 3mths and i finally called police and needed 1mth for appointment. 2hours of checking and statement recording. Been almost 1mth soon, and now waiting for update.\n\nYou see, people transfer you money and they report they got scammed or something illegal, then every single account transacted to/from will be frozen for investigation. This is a joke because you can be screw just by receiving money. Police told me the right thing is to contact bank when you get any unkown money. Not reporting is wrong. From OP, seems like reporting doesn't work too. Very bad SOP.\n\nIf not for my cpfis and srs i probably would ignore dbs for much much longer.\n\nEdit: the culprit was due to 1 transfer in of abt $150.",
          "score": 11
        },
        {
          "text": "Which division is handling your case? Sorry to say bro, but realistically your bank account will only be released in April or May  (based on the timeline you have given, in my own opinion). How i know this? Let’s just say i know how the process works personally. Can’t say much to it due to agreements i have signed but what i can say is there are many parties involved in this process hence the really slow process. Hopefully your bank account is unfrozen asap",
          "score": 9
        },
        {
          "text": "I had the experience of my bank account frozen for 1 whole year as I’m a suspected money laundering mule. \n\nIt will take time. Don’t expect IO to be on top of your case all the time. \n\nI asked for approval too for my money in my bank account as my wife was expecting a baby, and I got some of the funds unfrozen and later on my account unfrozen too as I’m innocent.",
          "score": 8
        },
        {
          "text": "A question. Once the case has concluded and bank account became unfrozen, will your name with the banks be in a blacklist?",
          "score": 6
        },
        {
          "text": "Frozen because they sent money to you despite u not aware? That’s a lot of mess ur in to get back ur original money",
          "score": 3
        },
        {
          "text": "that too way too long and you didnt broke any rules.",
          "score": 3
        },
        {
          "text": "Bruh my bank account got frozen for 1 year due to unauthorised money transfer to my DBS account. It took 1 year to finally unfreeze it after some back and forth with the I/O. You have to keep asking every month.",
          "score": 3
        },
        {
          "text": "If you're Singaporean, go to your MP and make them work for your vote. \n\nThey can put pressure on MHA and AGC (why AGC?) for you.",
          "score": 3
        },
        {
          "text": "Yup, have to suck thumb and wait it out. Keep checking with officer once every month is fine.",
          "score": 2
        },
        {
          "text": "Wah sian account frozen for 6+ months.\n\nI'm genuinely curious, if someone or some people transferred $900 to my account, can I transfer my entire balance except that $900 to another account before reporting it to the bank/police?",
          "score": 2
        },
        {
          "text": "Have you actually been to the police station in person and met the IO? Government generally do not communicate through WhatsApp.",
          "score": 2
        },
        {
          "text": "OP, while your account is frozen, can the account still receive payment such as dividend, interest etc? Will GIRO and other regular payments that you have previously setup still go through?",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1r3dv8a",
      "subreddit": "singaporefi",
      "title": "Sitting on a pile of cash, wondering where to invest next",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r3dv8a/sitting_on_a_pile_of_cash_wondering_where_to/",
      "score": 96,
      "num_comments": 55,
      "created_at": "2026-02-13T11:02:54",
      "selftext": "Ah gong took profits at ATHs and now sitting on a pile of cash watching the stock market tank more",
      "comments": [
        {
          "text": "All in to MSFT!",
          "score": 43
        },
        {
          "text": "ST Engineering \n\n\n/j",
          "score": 18
        },
        {
          "text": "I already allocated approx 6-7% of my portfolio to MSFT in the past week since it dropped. Not sure if I want to buy more, maybe I'll consider Amazon or Netflix next.\n\n\nUsed to only buy VWRA but has since stopped for almost half a year. Realized the price of VWRA doesn't really fall much even when the us tech stocks drop. Which is a very good thing as almost 85% of my assets are in VWRA so I feel more secure",
          "score": 11
        },
        {
          "text": "MSFT, META, AVGO",
          "score": 7
        },
        {
          "text": "All in BTC la",
          "score": 5
        },
        {
          "text": "Ah gong can invest in me? I give you 100x returns",
          "score": 4
        },
        {
          "text": "Black Friday so early this year?",
          "score": 4
        },
        {
          "text": "Zzzzz ...\n\nCPI tonight, that's why vol spike last night.\n\nIf you think BLS has the balls to print a bad report, I have a bridge to sell you.",
          "score": 4
        },
        {
          "text": "AMZN, MSFT, NOW",
          "score": 3
        },
        {
          "text": "Why are GOOG, GOOGL and NVDA missing from this?",
          "score": 3
        },
        {
          "text": "APP, U",
          "score": 2
        },
        {
          "text": "Indonesia stock market! /s",
          "score": 1
        },
        {
          "text": "Msft, Amazon, mu. \n\nSpy also down 1.5% so can buy abit first, then buy more if it dips another 1 to 2%",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r3e0w9",
      "subreddit": "singaporefi",
      "title": "Opening a DBS account as a new foreign worker in SG almost broke me",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r3e0w9/opening_a_dbs_account_as_a_new_foreign_worker_in/",
      "score": 39,
      "num_comments": 39,
      "created_at": "2026-02-13T11:10:24",
      "selftext": "Just wanted to share my experience opening a bank account in Singapore as a new S Pass holder. Thought it would be straightforward. It was not.\n\nI arrived in SG on Jan 4, one week before starting work. Didn’t bring much cash, so my goal was simple: open a bank account ASAP.\n\nJan 5 – Went to a DBS branch\n\nStaff told me:\n\n• Employment contract is NOT accepted as proof of address\n\n• I need a letter from my company\n\n• Manual review takes a long time\n\n• Suggested I activate Singpass and open via app instead\n\nSo I survived the first week entirely on cash.\n\nJan 9 – Bought Singtel Hi prepaid SIM\n\nNeeded it for MOM work pass processing.\n\nJan 12 – First day at work\n\nJan 13 – MOM fingerprint appointment\n\nOfficer told me I need to wait 2 days before applying for Singpass.\n\nJan 15 – Tried Singpass\n\nDidn’t work.\n\nJan 16 – Finally able to apply\n\nBut card details didn’t show up properly.\n\nJan 17 – Singpass activated\n\nTried opening DBS account again.\n\nProblem:\n\nMOM website shows my address.\n\nSingpass shows “no record”.\n\nResult: manual review again.\n\nJan 19 – Called Singpass helpdesk\n\nSame day received my physical work pass card.\n\nTo be fair, Singpass helpdesk was efficient.\n\nBy Jan 20, my address was updated.\n\nTried DBS again.\n\nNew problem:\n\nDBS asked me to prove ownership of my phone number.\n\nI was confused.\n\nI received OTP from MOM with this number.\n\nIt’s registered in Singpass.\n\nIsn’t that proof?\n\nApparently not. Because it’s a recycled number.\n\nSolution: get a telco confirmation letter from Singtel.\n\nJan 20 – Immediately emailed Singtel\n\nWeekend passed. No reply.\n\nJan 24 – Had to physically go down to Singtel store to get the letter\n\nQueue was long. Process slow.\n\nSubmitted everything to DBS.\n\nStill manual review 🤡\n\nJan 29 – Received email from DBS\n\nThought account was finally ready.\n\nNope. Need to wait for card to be mailed.\n\nFeb 6 – Card arrived\n\nPIN did not.\n\nCalled DBS.\n\nThey said wait 1–2 working days.\n\nUpdate:\n\n3 working days passed. Still no PIN.\n\nCalled again.\n\nCustomer service told me the PIN was supposed to be inside the envelope with the card.\n\nNow they’re asking if I want them to cancel the current card and reissue a new one.\n\nWhich means another 3–5 working days.\n\nAt this point, I feel like I’ve completed a government compliance obstacle course:\n\nMOM → Singpass → Telco → Bank → Mail → More mail\n\nI understand compliance and KYC are important. But the lack of data synchronisation between systems is insane. One missing record or recycled number and you’re stuck in manual review purgatory.\n\nFor a country known for efficiency, this was surprisingly painful.\n\nIs this normal for new foreign workers here? Or did I just hit every possible edge case?",
      "comments": [
        {
          "text": "More of HR problem imo. They should have a 'care package, checklist' and instruction on what to expect when a new foreign worker comes in.",
          "score": 72
        },
        {
          "text": "This is great news to hear. Finally banks are doing the proper checks and not allowing money launderers to easily create new bank accounts.",
          "score": 35
        },
        {
          "text": "Used to be way easier, but lots of scam scam make banks \"improve\" their processes, so it is a pain now. Especially with the stupid singpass requirement",
          "score": 27
        },
        {
          "text": "New account opening for foreigners has gotten tighter due to all the scams and to prevent money laundering.\n\nYour company should have a tie up with one of the banks to allow you to open an account without a minimum balance or proof of mobile number. I never had these issues with my foreign workers.",
          "score": 13
        },
        {
          "text": "Do it at UOB main branch",
          "score": 9
        },
        {
          "text": "This is DBS issue and a pain indeed from your story, hope you get it fixed soon.\n\nTho from your time line, I have a different take away, I'm quite surprised at how fast you could set up your sing pass, work pass and everything else. I remember when I was in Germany, getting my registered house address took months and even for bank account I needed a letter from the foreign Office which involved taking at queue number from 2am and waiting for the office to open at 9am.",
          "score": 7
        },
        {
          "text": "Why is this on SGFI",
          "score": 6
        },
        {
          "text": "Never had an issue as a foreigner, except that I had to bring my passport and Singpass wasn’t a thing back then. Maybe times have changed since the AML crackdown…🤷🏻‍♀️",
          "score": 6
        },
        {
          "text": "Should have used a post-paid SIM",
          "score": 3
        },
        {
          "text": "Blame the scammers and money launderers for abusing the system in the past.",
          "score": 3
        },
        {
          "text": "Good!! KYC is impt",
          "score": 3
        },
        {
          "text": "It's nothing new isn't it, in practically every single first world country you need a residential proof of address before you can open a bank account. Can't you use your tenant lease agreement for that?\n\nIt seems to be the issue lies more in your Singpass setup and SIM card registration which I admit is oddly problematic.",
          "score": 2
        },
        {
          "text": "Yea your company can actually apply for you directly on the MOM portal\n\nIt takes less than 10mins for them to do so",
          "score": 2
        },
        {
          "text": "Why didn’t you just ask for the letter from HR? \n\nI think that’s more of an HR problem than DBS.\n\nMy process back then was look for rent &amp; get singpass. HR gave me the letter, employee contract, and employment certificate immediately.\n\nDBS process was just through their digibank app which I got to open after getting my S Pass",
          "score": 2
        },
        {
          "text": "[deleted]",
          "score": 1
        },
        {
          "text": "The issue of ease in access is you get a lot of bad actors.. but I would imagine this could be more effectively handled.",
          "score": 1
        },
        {
          "text": "Try other banks like fr it would be better. I use mari",
          "score": 1
        },
        {
          "text": "No credit card from your home country?",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r2o66w",
      "subreddit": "singaporefi",
      "title": "Lifetime retirement investment scheme mentioned in Budget 2026",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r2o66w/lifetime_retirement_investment_scheme_mentioned/",
      "score": 34,
      "num_comments": 44,
      "created_at": "2026-02-12T16:33:24",
      "selftext": "low-cost auto-rebalancing portfolio into safer assets as you age. what are your thoughts?",
      "comments": [
        {
          "text": "Wait for details come out. Prob only allow liquidity in sgx to pump the market. 🤣",
          "score": 56
        },
        {
          "text": "[https://www.channelnewsasia.com/singapore/budget-2026-cpf-life-cycle-investment-retirement-5925641](https://www.channelnewsasia.com/singapore/budget-2026-cpf-life-cycle-investment-retirement-5925641)\n\nVery silly IMO for the govt to stick their nose into this, and announce it loudly and proudly. The funds are still going to be managed by \"2-3 providers\".\n\nInstead, they could just have approved such target date funds as additional CPF-IS investments, without all the fanfare and what looks like endorsement. \n\nWhen there's a crash, the pitchforks are going to come out. ",
          "score": 23
        },
        {
          "text": "Someone had predicted target date fund earlier. Is it a Bingo?",
          "score": 17
        },
        {
          "text": "Pump STI.",
          "score": 9
        },
        {
          "text": "As expected - totally useless for savvy folks who are already investing in the amundi/dimensional range of funds themselves. \n\nWhat makes the government think that less savvy investors are able to start and stay invested in a target date fund relative to portfolio of equity and fixed income index fund with a fixed allocation?????? Is that what's observed in overseas market or are they hoodwinked by the target date fund sales people??",
          "score": 8
        },
        {
          "text": "MPs going to be more busy since financial crisis will definitely happen and those who think this scheme is a sure earn is in for a shock if their withdrawal years are when the crisis strike..",
          "score": 5
        },
        {
          "text": "Devil is in the details. Sekali the target date will also change with retirement age changes.",
          "score": 5
        },
        {
          "text": "buying dbs shares only is easier and better",
          "score": 4
        },
        {
          "text": "All the bank stocks to the moon! 🚀",
          "score": 3
        },
        {
          "text": "I wonder if it’s possible to choose the target date ourselves or is it predetermined by age.",
          "score": 2
        },
        {
          "text": "This will be very helpful to folks that don’t dare to dabble into any form of investment. I know people who just keep money in the bank or fixed D. This would never beat inflation. This initiative will ease these group of folks into modest investment with higher returns .",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1r3b5im",
      "subreddit": "singaporefi",
      "title": "Newbie at 32",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r3b5im/newbie_at_32/",
      "score": 10,
      "num_comments": 13,
      "created_at": "2026-02-13T08:58:01",
      "selftext": "Hihi! As per shown on the title, I am a newbie at  and I know I am late at 32. \n\nI have been seeing so many people building a huge portfolio and felt like I am lagging behind because I don’t really have any but I know it’s my fault. Was hold back by past circumstances and mental well being. \n\nWould love to know some tips and advice from your experiences and how do you guys get started on building your portfolio and what are the things to keep a look out for like key metrics etc. \n\nThanks a lot. I know there are guides but would love to hear your own experience on it. 🙏🏻",
      "comments": [
        {
          "text": "&gt;I am lagging behind\n\nNot a race. focus on yourself. You should compare with the 1 year ago you. So 1 year later, you'll compare with your 2026 you right now.\n\n&gt;Would love to know some tips and advice from your experiences and how do you guys get started on building your portfolio and what are the things to keep a look out for like key metrics etc.\n\nNo key metrics, the best way is to set it and forget it. The more you forget about it (after automation), the less you'll fiddle with it.\n\nThe wise Jack Bogle once said (in the context of a passive average retail index fund investor), [Don't just do something, stand there.](https://acmwealth.com/article-video/dont-just-do-something-stand-there/)\n\nIf you really want, here are some milestones you can keep track of, you'll notice that age is not tied to any of these:\n\n1. zero debts (for SG people, HDB loan don't count, but subsequently, can't count networth with HDB)\n\n2. 6 months of emergency fund funded (in HYSA)\n\n3. Reaching 100k networth\n\n4. Reaching 100k invested\n\n5. Reaching 1M networth\n\n6. Reaching 1M invested\n\n7. Interest generated by invested portfolio annually is equal or greater than your annual contribution to said portfolio.\n\n8. Interest generated by invested portfolio annually is equal or greater than your annual expenses.\n\n9. Interest generated by invested portfolio annually is equal or greater than your annual salary.\n\n  \nHere are some milestones I can think of right now which can help you in the long term.",
          "score": 33
        },
        {
          "text": "Read the pinned post \"Start here\". \n\nThe important thing to realize is that more knowledge doesn't mean more gains. The opposite is common. Discipline is more important. \"Key metrics\" are not important. ",
          "score": 14
        },
        {
          "text": "I started late too..was chasing skirts and cars in the younger days and was brainwashed that CPF is evil. \n\nanyway, where to start?\n\nbasically, do you have \n\n1. an income &amp; expenses budget? this helps to see where your $ goes to and what can be cut.\n\n2. Emergency cash. in cash you're retrenched or sudden need of cash for emergency...\n\n3. The investment part. Put this $ into a separate account. Keep adding monthly, even if you're not investing yet . What to invest? ask 10 persons and you'll get 20 answers. so, i say, go read up as much as you can.",
          "score": 5
        },
        {
          "text": "Well, not sure about your money sinks but cut down any vices if you have any. \n  \nYou’ll find that you save much more. I saved over $200+ by not drinking since the start of Feb. And now that tobacco tax has increased, I’m on my nicotine patch now",
          "score": 3
        },
        {
          "text": "The only person you can compare with I yourself\n\nDiscipline is the key to successful investing\n\nHave fun!",
          "score": 2
        },
        {
          "text": "Start small. Scale up. Increasing your income is more impactful than cutting your expenses. It's a marathon, not a race. Jiayou!",
          "score": 2
        },
        {
          "text": "Never too late to start building your own portfolio, be it small or big.\n\nDoing something is better than doing nothing",
          "score": 1
        },
        {
          "text": "No worries you still got 30+ years to get to retirement age. I started even later at 42; only after fully paying off my 5-room flat then I grew enough guts to invest (and watch the market swing up&amp;down and say nevermind laaa).",
          "score": 1
        },
        {
          "text": "You’re not late. Most people you see with “huge portfolios” either started earlier, earn more, or just post their wins. Don’t compare timelines.  \nIf you’re just starting, focus on the basics first, build your foundation and stay consistent.",
          "score": 1
        },
        {
          "text": "Better late than never.\n\nI only started to try to sort out my finances at around 29....not that different from 32...",
          "score": 1
        },
        {
          "text": "Some general tips:\n\nTime in market &gt; timing the market. \n\nNo need to justify your situation to strangers.\n\nSet realistic savings and investment goals depending on your own needs",
          "score": 1
        },
        {
          "text": "V",
          "score": -2
        }
      ]
    },
    {
      "id": "t3_1r3ezec",
      "subreddit": "singaporefi",
      "title": "CNY is coming, what are you doing with your kids' ang pao money?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r3ezec/cny_is_coming_what_are_you_doing_with_your_kids/",
      "score": 9,
      "num_comments": 20,
      "created_at": "2026-02-13T11:57:26",
      "selftext": "title says it all. \n\nFor the last few years, we've been putting their ang pao money into FDs because a) rates were ok b) relatively small amounts anyway. \n\nNow they've got a larger stash, I'm planning to buy VRWA. Thinking about DCA-ing for a couple of months (or maybe once every two months to spread out the risks), until about 50% is in there, then stop.  Rinse and repeat once the stash builds up again. \n\nThe idea is that I want to get something safe for them, so when they come of age (in about 15 years), they can cash it out and pay for what they need (including education if needed). \n\nAny ideas? I thought of putting it in their CPF, but who knows what the rules will be on withdrawal 20 years from now. \n\nMuch appreciated! ",
      "comments": [
        {
          "text": "My child’s first CNY - I would love to put it in the stock market but my wife is risk adverse so probably just keeping it in FD. \n  \nYour arrangement seems like a good idea - 50% exposed to world index. 50% in FD for capital preservation - in about 21 years $100 per month in VWRA, assuming 6% return, would net you $30+k. Can afford a portion of Uni",
          "score": 11
        },
        {
          "text": "All in D05",
          "score": 8
        },
        {
          "text": "Take it and buy Microsoft.",
          "score": 4
        },
        {
          "text": "put in the kids' piggy bank at home and I make them physically take out the money to (co-)pay for their own presents, ice cream treats etc. More impt to teach them the value of money and delayed gratification.\n\nI invest my own savings with the intention that some will need to be used for their further education, not just my living expenses in retirement.\n\ncompound interest may be the 8th wonder but it can't beat human stupidity (bad financial habits, psychology.)",
          "score": 4
        },
        {
          "text": "Combination of MM funds and SPY, SPY outperformed the MM easily",
          "score": 1
        },
        {
          "text": "My kid don't have much (about $4k) so i just leave it in the bank so that he can see his savings if he wants to.",
          "score": 1
        },
        {
          "text": "spy 0dte calls",
          "score": 1
        },
        {
          "text": "Ok la I just keep and continue the cycle of 'new' notes.",
          "score": 1
        },
        {
          "text": "If they are old enough, talk to them, explain the options and risks, get their agreement before investing the money. Keep them updated on the returns.\n\nIt's a good chance to start the financial literacy journey. It's what I do for my kid. ",
          "score": 1
        },
        {
          "text": "I have bought gold/vwra+ some local stock with my kids money",
          "score": 1
        },
        {
          "text": "50/50 in mmf and a globally diversified fund",
          "score": 1
        },
        {
          "text": "CDA account balances converts into PSEA account at age 13, where it earns similar interest as OA. PSEA is to fund higher education. Any unused balance in PSEA is transferred to OA at age 30. Something l am considering… put in money into CDA account",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r2tptz",
      "subreddit": "singaporefi",
      "title": "FTX Saga - just received this, legit?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r2tptz/ftx_saga_just_received_this_legit/",
      "score": 0,
      "num_comments": 11,
      "created_at": "2026-02-12T21:41:14",
      "selftext": "Hi all,\n\nPosting on behalf of an affected individual who just received this mail today. \n\nThis is related to FTX saga back in 2022. Is this legit?\n\nhttps://preview.redd.it/k34c2s1jh2jg1.png?width=1280&amp;format=png&amp;auto=webp&amp;s=23e5b3dde37c68a83a3e9e4fd4ced423a0a47a16",
      "comments": [
        {
          "text": "Anyway the website says need to file claim by 30 Jan 2026. So yeah it's over",
          "score": 11
        },
        {
          "text": "Did he send or deposit money or not? If not then confirm scam. If have, then use a reset ipad or clean laptop to click the link and not enter any personal info",
          "score": 2
        },
        {
          "text": "I got mine from Kroll because Gemini lend out the funds to FTX but that was just the heads up that they were going to court. I got back my crypto in full since.",
          "score": 2
        },
        {
          "text": "This looks really eerie for some reason.",
          "score": 1
        },
        {
          "text": "Received the same today too weirdly enough. Trying to do some search on this and yours was the only result so far lol afaik, bitgo already supposedly received all the  claims, so this letter seems sus, plus the expired claim date.",
          "score": 1
        },
        {
          "text": "Notice that:\n\n* they sent it as a unsealed post card which is highly unprofessional for something claiming to be a legal notice.\n* They didn't identify themselves\n* Only giving a PO box address, which is in California meanwhile they sent the mail from Netherlands.\n* Why didn't they sent by email? (Because they know that it will be flagged/reported as scam/spam)\n\n100% scam.\n\nwould be good to post this in ftx and crypto subreddits",
          "score": 1
        },
        {
          "text": "Try checking the link on virustotal.com",
          "score": 1
        },
        {
          "text": "[deleted]",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1r2od1t",
      "subreddit": "singaporefi",
      "title": "Debt Repayment Scheme",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r2od1t/debt_repayment_scheme/",
      "score": 0,
      "num_comments": 5,
      "created_at": "2026-02-12T16:46:00",
      "selftext": "Dear all Reddit users, can anyone advise DRS is the same as bankruptcy? If im having both debts from licensed moneylender and unlicensed moneylender, how DRS can help? I seriously do not want to just default the payment for unlicensed moneylenders and just report to the police. I don’t think this is really a good solution cause it might triggers some aggressive action from them if they cannot take back any cents.",
      "comments": [
        {
          "text": "&gt;DRS is the same as bankruptcy?\n\nNo. It's a pre-bankruptcy alternative that allows you to repay debts over a fixed period (up to 5 years) so you can avoid official bankruptcy.\n\n\n\n&gt;If im having both debts from licensed moneylender and unlicensed moneylender, how DRS can help? \n\nLicensed money lenders will have to accept arrangements made under DRS. Unlicensed money lenders are not bound by law and can continue to harass you for repayment regardless of DRS or bankruptcy.",
          "score": 2
        },
        {
          "text": "I suggest you speak to Credit Counselling Singapore first to know what options are best for you.",
          "score": 2
        },
        {
          "text": "Licensed you can speak to Credit Counselling Singapore for DMP rather than DRS. DMP will help consolidate all your LEGAL debts under 1 entity / bank for a much lower interest rate. Unlicensed nobody can help you. Even if you are a bankrupt, unlicensed lenders won't give a toot and will continue to harass you for repayment. ",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r3anz9",
      "subreddit": "singaporefi",
      "title": "“Fresh Funds” &amp; new sign ups promos",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r3anz9/fresh_funds_new_sign_ups_promos/",
      "score": 0,
      "num_comments": 3,
      "created_at": "2026-02-13T08:36:18",
      "selftext": "Hi everyone. I have cash from an asset sale. My family member last year opened a “wealth” type account with a local bank and deposited $1.2m, and was given a $30k reward by the bank. Now I would like to do the same, I saw the same bank RM, but now they will only offer me $18k for the same amount (“promotion is over”). \n\nI would like to shop around before accepting, and thought all the local banks will be offering similar incentives. However, I can’t seem to find such generous offerings from other banks when browsing online. \n\nI thought the competitive nature of the market will mean all banks will offer something similar. Am I looking in the wrong place? Is this type of deal only offered once we have a face to face discussion with the bank? Thanks in advance!!",
      "comments": [
        {
          "text": "1.2m is only prio banking/ the 2nd tier of prio banking, not private type aum. at this aum banks wont offer a higher “special” deal just cause you talked to them f2f\n\n30k is q surprising, it is likely combined w bonuses such as investment n all\n\nit sounds like hsbc premier elite? 1.2m is the cutoff. last year i think the promo was 7000$ welcome reward + 3% interest for 3 months on cash.\n\nnowadays not so much le, since the interest rates went down.\n\n12k also sounds quite high compared to current market, can share which bank u got this figure from? its likely from investing (but you also get charged on investment sales charge, so its inaccurate)\n\nim aware of scb prio private, 1.5m can earn about~10k (sign up bonus and referral, not incl any other bonus) \n\nif you want a referral can lmk i can link u up w my rm",
          "score": 3
        },
        {
          "text": "First, just wait.  They do these promo regularly.\n\nSecond, look at the fine print.  Only a small portion is unconditional money.  Rest are conditional.  Just like HYSA.  Buy X to get Y.  Usually includes a large component of insurance purchases.",
          "score": 1
        },
        {
          "text": "Two things, your 1.2 mio is not significant enough and interest rates have been on a steep decline for SGD. 18k is honestly pretty good, that's 1.5% interest paid upfront in an environment where MAS bill yields are also below that. I genuinely don't think other banks would be able to offer much higher.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1r3bt8w",
      "subreddit": "singaporefi",
      "title": "OCBC charging annual fee for credit card canceled years ago",
      "url": "https://old.reddit.com/r/singaporefi/comments/1r3bt8w/ocbc_charging_annual_fee_for_credit_card_canceled/",
      "score": 0,
      "num_comments": 7,
      "created_at": "2026-02-13T09:28:16",
      "selftext": "OCBC just e-mailed me a credit card statement for a card canceled before Covid-19. I opened it and it had an annual fee payment.\n\nI stopped using the card years ago. I could not even activate my OCBC online banking then because OCBC's interface was too difficult. I'm even afraid OCBC has been doing this and bringing down my credit score.\n\nWhat can I do other than calling them and asking them to cancel the credit card again instead of paying the annual fee?\n\nEDIT: I called customer service. Instead of canceling the card, OCBC kept the card active, charged an annual fee every year, then waived it when there was no activity. I'm wondering how to be sure my credit score is not affected. The contact details registered with OCBC are 5 years out of date.",
      "comments": [
        {
          "text": "What do you expect reddit to do for you? Call for you?",
          "score": 14
        },
        {
          "text": "? Why are you allergic to calling them",
          "score": 9
        },
        {
          "text": "If you really don't want call them then go down to a branch. Tbh, I think calling them is easier",
          "score": 2
        },
        {
          "text": "Do you have documentation confirming the cancellation of said credit card when you did it?",
          "score": 1
        },
        {
          "text": "Just check with OCBC, usually cancelled credit cards will be stated accordingly",
          "score": 1
        },
        {
          "text": "OCBC must be really short of $.",
          "score": 0
        }
      ]
    }
  ]
}