{
  "schema_version": "raw_scrape_v1",
  "report_id": "2026-02-07",
  "scraped_at": "2026-02-07T16:12:49.973167",
  "subreddits": [
    "singapore",
    "askSingapore",
    "SingaporeRaw",
    "singaporefi"
  ],
  "total_posts": 40,
  "total_comments": 430,
  "posts": [
    {
      "id": "t3_1qy1v3v",
      "subreddit": "singapore",
      "title": "Girl, 6, dies after accident in Chinatown near Buddha Relic Temple",
      "url": "https://old.reddit.com/r/singapore/comments/1qy1v3v/girl_6_dies_after_accident_in_chinatown_near/",
      "score": 451,
      "num_comments": 196,
      "created_at": "2026-02-07T10:38:30",
      "selftext": "",
      "comments": [
        {
          "text": "I watched the entire video.. after knocking down the girl the indian woman starts shouting at the father and even pulling the girls arm. I find it crazy she is more interested in justifying how its not her fault than caring that a little girl is close to death or already dead\n\n  \nThe vietnamese's eyewitness account also states her shouting at the father and not trying to get medical help even after she knocked the little girl down. Why would she be like that lol like what is the point even",
          "score": 499
        },
        {
          "text": "i read the article and saw the video, it's not pretty.\n\nfemale driver from a southern nation was driving and didn't check her right,only left when she made the turn. it was alleged she ran over the little girl and mom twice after she knocked them both down,it was the rear wheel that ran over the girl the second time.\n\nfemale driver then proceeds to victim blame the pedestrian for not watching the road and causing the accident. the eye witness who willsaw all these was on reddit and posting his/her side of the story.\n\nif anyone saw this accident,please go to the police station and give your statement,asshole drivers needs to be locked away for good.",
          "score": 404
        },
        {
          "text": "&gt; It added that the incident took place at the carpark next to the Buddha Tooth Relic Temple.\n\nI was going to question how fast a car had to be going \\*in a carpark\\* to hit two people and cause one fatality, but I've definitely seen worse driving behaviour here.",
          "score": 242
        },
        {
          "text": "SG Road Vigilante has the details....and the comments are not pretty. There's photos of the driver posted as well.",
          "score": 159
        },
        {
          "text": "If the driver gets caught, the sentence is gonna be in weeks/ months because I don’t see any true justice in Singapore at all",
          "score": 159
        },
        {
          "text": "Sorry but I just wanna ask how tf are you so bad at driving you kill a freaking girl at a carpark???\n\nBut also there is very high traffic in this area",
          "score": 149
        },
        {
          "text": "From mothership fb comments:\n\n&gt; I’m sharing what the witness wrote in Vietnam language 🥲\n\n&gt;This morning, I walked to the market to buy coriander for selling bánh mì because I forgot to order it. While walking through the car park near the Chinese temple at Maxwell MRT, I witnessed a traffic accident at around 11:40 a.m. today. It was the first time in my life that I saw a traffic accident happen right in front of me.\n\n&gt;I was the first person walking behind the mother and her daughter. A woman was driving out from the car park. She did not look to the right for pedestrians; she only looked to the left when she turned right. The front wheel of her car ran over the little girl’s abdomen first, then over the mother’s leg. After that, the woman pressed the accelerator hard, and the rear wheel ran over the mother’s abdomen again.\n\n&gt;I don’t know why she accelerated so quickly when she just exited the car park. I guess they might be tourists. I can help as a witness and testify about this traffic accident.\n\n&gt;I clearly saw that when the front wheel ran over them, the driver should have felt that there was something under the wheel. However, she did not stop to get out of the car to check. Instead, she accelerated strongly and continued to drive forward, which caused the rear wheel to run over the mother’s abdomen again.\n\n&gt;I panicked at that moment and cannot remember clearly whether the rear wheel ran over the little girl again. I was in shock when the incident happened right in front of me.\n\n&gt;At the time of the accident, the husband was not with them. Only the mother and daughter were there, and I was walking behind them. About two minutes later, the husband ran over and hugged the little girl.\n\n&gt;When the front wheel ran over the little girl, she was thrown and rolled about three times and ended up lying face down on the ground. Her mouth was in a pool of blood, next to her water bottle and her camera. The blood was flowing heavily from her mouth and spread thickly on the road.\n\n&gt;When the woman got out of the car and went to the back to check, she then realized that she had caused the accident. She raised her voice at the father while their daughter was injured and kept trying to explain that she was not at fault.",
          "score": 132
        },
        {
          "text": "I'm really so angry that stupid drivers that kills get a slap on the wrist. The law need to change!! Let's make enough noise so the MPs do their job!",
          "score": 98
        },
        {
          "text": "Accident happen, no body goes on the road wishing anyone dead.\n\nBut it’s the disgusting behavior of blaming the victims and trying to justify her driving whilst the victims are bleeding to death from internal injuries that is maddening.\n\nAnd albeit this being “xenophobic” I am sure 99% have experienced this unrepentant narcissistic behaviour from these certain nationality and “caste” of people who think everybody else’s owes them a living.",
          "score": 85
        },
        {
          "text": "she's here for a vacation, what a tragic accident. RIP little one, so sorry this has to happen to you. Its all the adults' fault.",
          "score": 56
        },
        {
          "text": "The driver sounds like she doesn’t think it’s her fault at all based on the post describing what happened above and her first reaction is terrible (should call for help instead of saying it’s not her fault as 2 people are injured) but at the same time I got to say some people crossing roads in Singapore are really NOT watching out for traffic. Accidents are unfortunate but you need to look out for yourself always, even if it means when you are crossing the road using the traffic light and it is in your favour.",
          "score": 46
        },
        {
          "text": "I saw the pictures, indian lady was literally screaming at the father who was hugging his still bleeding daughter and being treated by paramedics. .\n\nSeriously what kind of country are we turning into ?",
          "score": 29
        }
      ]
    },
    {
      "id": "t3_1qxczga",
      "subreddit": "singapore",
      "title": "Singapore imposes mandatory isolation of measles cases, contact tracing, as infections rise",
      "url": "https://old.reddit.com/r/singapore/comments/1qxczga/singapore_imposes_mandatory_isolation_of_measles/",
      "score": 335,
      "num_comments": 75,
      "created_at": "2026-02-06T17:19:49",
      "selftext": "",
      "comments": [
        {
          "text": "MMR vaccines do not cause autism, people.\n\nGet your shots. \n\nOh, and screw you, Iris Koh.",
          "score": 229
        },
        {
          "text": "How? Thought we’re all vaccinated against it.",
          "score": 183
        },
        {
          "text": "I just hope everyone have been vaccinated against Measles. I heard getting Measle means it will factory reset your entire Immune system meaning next time you get the flu or Covid, it would be a worse.",
          "score": 80
        },
        {
          "text": "Just impose travel restrictions on infection hotspots, like the US",
          "score": 50
        },
        {
          "text": "Man I can't fucking believe measles is back all because of one man's desire to own the libs",
          "score": 49
        },
        {
          "text": "&gt; All 11 cases in January were not fully vaccinated, including three infants under 12 months old who were not yet eligible for the measles, mumps and rubella (MMR) vaccination. Seven cases had travelled overseas recently. \n\nso 8 were eligible for measles vaccine but not fully vaccinated. are they all immunocompromised? why weren’t they fully vaccinated? we don’t recognise religious reasons to not vaccinate no? or do we? \n\nwhat am i missing?\n\nis this because if rfk’s anti vax nonsense? measles is spreading in america. sorry brain real tired.",
          "score": 39
        },
        {
          "text": "Poly called and said I was in contact with someone who had measles during my visit 3 weeks ago. Told me to see monitor til 10 Feb and see doctor as soon as I feel any symptoms",
          "score": 37
        },
        {
          "text": "America weaponizing disease against the world.",
          "score": 29
        },
        {
          "text": "thanks america!",
          "score": 28
        },
        {
          "text": "Hope everyone’s vaccinated against measles, and if not they really should be",
          "score": 15
        }
      ]
    },
    {
      "id": "t3_1qxh1sg",
      "subreddit": "singapore",
      "title": "Another Singaporean added to US govt ‘worst of worst’ site for criminals",
      "url": "https://old.reddit.com/r/singapore/comments/1qxh1sg/another_singaporean_added_to_us_govt_worst_of/",
      "score": 251,
      "num_comments": 47,
      "created_at": "2026-02-06T21:03:42",
      "selftext": "",
      "comments": [
        {
          "text": "Ooof... to be on the same list as Amos Yee.",
          "score": 179
        },
        {
          "text": "If you're a small-time money launderer, you get on the list. If you're a big-time money launderer, you make a couple of \"donations\" and you get a pardon",
          "score": 116
        },
        {
          "text": "\"money laundering\"\n\nOk who is she next to\n\n\"Child predator\"\n\nOh.....",
          "score": 108
        },
        {
          "text": "Pretty sure the cartel can get to her more easily in the US than in Singapore lol",
          "score": 89
        },
        {
          "text": "Fear for your safety? So you'd rather stay in the US than SG? She is probably gonna do some serious time if she gets back here",
          "score": 52
        },
        {
          "text": "If there is one place on earth where you want to avoid being murdered by mexican cartel, it's singapore. 100% not the USA where even the president is at risk of being assassinated...",
          "score": 34
        },
        {
          "text": "Just find it funny its The Star MY that published this.",
          "score": 31
        },
        {
          "text": "Better Call Shao",
          "score": 18
        },
        {
          "text": "wah play until Sinaloa cartel. Sinkies really got talent ",
          "score": 9
        },
        {
          "text": "So will Trump send them \"back\" to China or Singapore?\n\nI bet that the Americans deport her to China (due to administrative error) instead of Singapore 🤣\n\nPlace your bets!",
          "score": 4
        }
      ]
    },
    {
      "id": "t3_1qy0xfe",
      "subreddit": "singapore",
      "title": "McDonald’s outlet at Tampines Mall to close in March after decades in operation",
      "url": "https://old.reddit.com/r/singapore/comments/1qy0xfe/mcdonalds_outlet_at_tampines_mall_to_close_in/",
      "score": 209,
      "num_comments": 86,
      "created_at": "2026-02-07T09:55:37",
      "selftext": "",
      "comments": [
        {
          "text": "Tampines Mall doesn’t feel right without this McDonalds lol",
          "score": 218
        },
        {
          "text": "If Mcdonalds dont even want to pay for the recontract says something about the rent increase.",
          "score": 193
        },
        {
          "text": "Don’t worry guys I’m sure the space will be filled up in no time and we can sample the delights of cuisine from a some province or other in China.",
          "score": 127
        },
        {
          "text": "The rental became extortion. ",
          "score": 73
        },
        {
          "text": "Damn, legit end of an era. 50c ice cream cone while waiting for your friends was convenient. \n\nGuess there is no more “Let’s meet at the Tampines Mall McD” cause we have to differentiate between 3 McDs there.",
          "score": 68
        },
        {
          "text": "Fastfood are usually less common in CBDs due to rents, it is crazy this has spread to even the heartlands.",
          "score": 36
        },
        {
          "text": "What whyyyyy?\n\nTampines Mall without Macdonalds is like Lawrence Wong without his guitar....it doesn't feel right.\n\nBut in all honesty, macdonalds closing at Tampines mall, city hall, etc shows that rental is really bad when these outlets have huge footfall",
          "score": 27
        },
        {
          "text": "Either Mac does not want to pay the rental, or there is a new plan",
          "score": 19
        },
        {
          "text": "I swear they gonna make that space into another generic China branded shop, like they JUST opened one god damn China gelato chain again near the entrance. The Decathalon shop is also apparently going to be gone. Fkin hell, everywhere also China chains and their shops.",
          "score": 18
        },
        {
          "text": "While I do share the same sentiment on china's F&amp;B businesses aggressive approach to enter the singapore market, but cmon guys this is Hanbaobao Pte Ltd we're talking about here. McDonalds never moved out due to costs of rent, it's usually a decision backed by urban planning and location outreach. ",
          "score": 15
        },
        {
          "text": "I'm guessing that there's too many outlets within walking distances from each other...  \n\n\nso  they are closing whichever outlet with the highest operating costs.",
          "score": 9
        },
        {
          "text": "Only the government landlord who owns Tampines Mall is jumping for joy to get in the next sucker",
          "score": 8
        },
        {
          "text": "I heard Tampines Mall will be having renovation. Wonder how true.",
          "score": 3
        },
        {
          "text": "Man, I remember going there to eat with my primary school friends after we watched Harry Potter and the Chamber of Secrets (yes, that's how long ago this was), and one of them taught me about the existence of curry sauce \n\n\nI've been eating every meal at McDonald's with curry sauce ever since",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1qxezux",
      "subreddit": "singapore",
      "title": "Former WP chairman calls for special conference to be held sooner, regardless of Pritam Singh disciplinary panel",
      "url": "https://old.reddit.com/r/singapore/comments/1qxezux/former_wp_chairman_calls_for_special_conference/",
      "score": 137,
      "num_comments": 105,
      "created_at": "2026-02-06T19:20:50",
      "selftext": "With friends like that who needs enemies.\n\nWhen contacted by CNA, Dr Tan said he wrote the personal letter “because I thought something must be done. I felt that the thing has stretched on for quite long already. It’s been one month plus already. Normally, when such a thing happens and cadres request any emergency meeting, it should be very fast,” he said.",
      "comments": [
        {
          "text": "So the Chinese gang versus the English gang now?",
          "score": 81
        },
        {
          "text": "I feel that he's a bit out of touch from the ground? \n\nDuring his time WP only had one MP in Parliament. They currently have 10 MPs and 2 NCMPs, and with Budget debates coming up, it seems reasonable that they will be stretched during this period, especially since two of the panellists are MPs.",
          "score": 49
        },
        {
          "text": "WP need to be careful that this does not degenerate into Electeds vs Non Electeds. Last time, a non Elected took over an opposition party, that party was destroyed and has never won another election.",
          "score": 39
        },
        {
          "text": "Yesterday when i read the news on the DP interviewing WP members i was joking with my friends, seems like the purpose is to purge those against PS. \n\nNow seeing this, maybe it is really a purge after all and this ex chairman is trying to stop that from happening by convening the special conference first. ",
          "score": 30
        },
        {
          "text": "And this is why he is former, same as GMS or James Gomez.",
          "score": 22
        },
        {
          "text": "Must support Pritam then can be considered as a friend of WP? Maybe he is putting the party above any individual?",
          "score": 22
        },
        {
          "text": "the appalling short-sightedness of these people, good lord. ",
          "score": 20
        },
        {
          "text": "All want power only in opposition politics as there is little money. Pritam is elected while this Tan isn’t in his life hence his faction behave like haters now. You should never ever try kick out your elected opposition MP from the party in sg politics, it will backfire. Remember Dr Chee’s days?",
          "score": 17
        },
        {
          "text": "https://www.sammyboy.com/threads/workers-party-tan-bin-seng-struck-off-medical-register.25849/",
          "score": 9
        },
        {
          "text": "Did the party with his Chairmanship, win any GRC from 1992 to 2003?",
          "score": 7
        },
        {
          "text": "this former chairman managed to get only one person from his party into parliament during his tenure. he's a good example of yaya papaya",
          "score": 5
        },
        {
          "text": "Imo, if they want to support PS, then just go the whole mile and not do any internal disciplinary proceeding. They don't owe the government an internal disciplinary proceeding, he paid the fine and lost is leader of opposition role, and all the WP MPs voted in PS's favor anyway. Its really weird now when people that have already voted to support PS parliament also in the disciplinary panel. It's pretty obvious the proceeding is for show so I doubt it will change anybody's opinion on PS.",
          "score": 4
        }
      ]
    },
    {
      "id": "t3_1qy4uxe",
      "subreddit": "singapore",
      "title": "Doctor made no attempt to fix surgical error which led to patient’s death: Coroner",
      "url": "https://old.reddit.com/r/singapore/comments/1qy4uxe/doctor_made_no_attempt_to_fix_surgical_error/",
      "score": 132,
      "num_comments": 30,
      "created_at": "2026-02-07T13:02:52",
      "selftext": "",
      "comments": [
        {
          "text": "\"Similarly, the Raffles Hospital second medical report at best skirted around the fact that the coeliac trunk and the superior mesenteric artery were transected due to an identification error on the part of Dr Fong,” said the State Coroner in ruling the death as caused by medical misadventure.\"\n\nDoctors and hospitals are always covering up for each other. Hard to really take them down coz they never admit mistakes",
          "score": 114
        },
        {
          "text": "So in summary the doctor's inactions caused the woman's death.\n\nIn true blue pitchfork wielding fashion: what potential repercussions will this doctor face?\n\nCan the family sue?",
          "score": 83
        },
        {
          "text": "I assume this was discovered because the family has the resources to engage legal and medical experts. \n\nI wonder how often does something like this actually happen? And what's the recourse for those who cannot afford experts to verify their suspicions?",
          "score": 36
        },
        {
          "text": "I don't understand why people still go for private doctors. Nowadays I find doctors from public hospitals to be more competent. ",
          "score": 29
        },
        {
          "text": "&gt; The state coroner said that there were three opportunities for Dr Fong to remedy his errors, but they were not addressed. He added that in his opinion, the patient’s death was avoidable.\n\nThis and if a doctor cannot admit &amp; quickly rectify his/her mistake, &amp; get a 2nd opinion to potentially save a life, this doctor can no longer be allowed to practice. And I wonder if there are regulations in place to protect patients from such “doctors”.",
          "score": 20
        },
        {
          "text": "How is this guy still a doctor?!",
          "score": 17
        },
        {
          "text": "Jail.",
          "score": 9
        },
        {
          "text": "How did the case make it to the courts? There are SOPs in place to detect such deaths or the family has to be smart enough to report?",
          "score": 2
        },
        {
          "text": "Reminds me of the book 'black box thinking' which highlights the malpractises of ppl in the medical industry.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qy1lw7",
      "subreddit": "singapore",
      "title": "Only 56% of Singapore workers are happy, despite 8 in 10 believing it is possible: Survey",
      "url": "https://old.reddit.com/r/singapore/comments/1qy1lw7/only_56_of_singapore_workers_are_happy_despite_8/",
      "score": 111,
      "num_comments": 34,
      "created_at": "2026-02-07T10:26:59",
      "selftext": "",
      "comments": [
        {
          "text": "To be clear, this is about happiness in the office rather than general happiness. \n\nAlso, sensing a bit of a pattern here.\n\n&gt;Indonesia tops the regional rankings, with 82% of workers reporting they are happy at work, followed by the Philippines at 77% and Malaysia at 70%. Australia stands at 57%, narrowly ahead of Singapore, while Hong Kong ranks last at 47%.",
          "score": 41
        },
        {
          "text": "Happy to be in the job or happy to have a job. Very different kind of happiness.",
          "score": 40
        },
        {
          "text": "Of course possible. Give high pay, no work except what you want to do and flexible timings. Sure happy.",
          "score": 39
        },
        {
          "text": "I mean we have shitty worker protections. Once you’re classified as a pmet you don’t even have limits on overtime. \n\nWe have no bargaining power, our default working hours and leave and other benefits have been unchanged for decades. There is no job protection. \n\nLoads of companies have been in hiring freezes for years now so everyone who can’t find new jobs is tanking more work than before. And they can load the extra work on you without extra pay. \n\nWith all that 56% is pretty good actually.",
          "score": 36
        },
        {
          "text": "Been working late recently. And ended sheer minutes near midnight on one of the nights, before reporting to work on time the next morning.\n\nOn TGIF yesterday, I put in 3 hours of OT.\n\nPlus my supervisor just told me that he needed something done over the weekend.\n\nNot trying to be a cynical puss here, but I find it really hard to consider myself happy lol.\n\nOr course, the door is always out there but the reality is that bills still gotta be paid.\n\nAnd I believe I'm not alone in this.\n\nAll the best, my fellow warriors!\n\nPS: That's not to say that being happy at work is an impossible feat. But I personally feel it doesn't simply occur to everyone and it takes the trifecta of time, place and people to align.",
          "score": 30
        },
        {
          "text": "We're only just behind Hong Kong at 47% at being the unhappiest country in the Asia-Pacific region. Come on people! We must be numbah one",
          "score": 29
        },
        {
          "text": "and only 35% will do anything about it!",
          "score": 11
        },
        {
          "text": "Who are really happy? From the top down “they fought” to the bottom jobless people also have to fight for a job. Sad. Get a job also have to fight internally with FT. Even sadder! So what can make 44% People happier?",
          "score": 6
        },
        {
          "text": "Being happy is possible?",
          "score": 4
        },
        {
          "text": "I don’t know man , I just want people to stop messaging me after work or on leave. I’m tired",
          "score": 4
        },
        {
          "text": "The beatings will continue until morale improves.",
          "score": 2
        },
        {
          "text": "The 8 still believe in tooth fairy and that bill gates is a good guy who wants to eradicate illnesses.",
          "score": 2
        },
        {
          "text": "As luck ng as YOU are happy or unhappy who cares how the nxt guy is feeling",
          "score": 2
        },
        {
          "text": "What I want from work:\n* Interesting work with an actual purpose\n* Minimal paperwork that could distract from my actual work\n* Competent and understanding bosses with aligned motives\n* Conducive working environment that is safe to speak up\n* Good enough income\n* Good working hours",
          "score": 1
        },
        {
          "text": "8 in 10 believe in striking toto one day",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qxgbvg",
      "subreddit": "singapore",
      "title": "Tackling excessive plastic bag use: No levy in the works",
      "url": "https://old.reddit.com/r/singapore/comments/1qxgbvg/tackling_excessive_plastic_bag_use_no_levy_in_the/",
      "score": 84,
      "num_comments": 46,
      "created_at": "2026-02-06T20:30:25",
      "selftext": "In 2018, Amy Khor says, \"Imposing a charge or ban on disposable plastic bags and substituting them with other types of disposable bags is unlikely to improve environmental outcomes\"\n\nIn 2023, government implemented the charge nationwide for large supermarkets (but of course every supermarket has been charging anyway, riding on the virtue signalling). \n\nRecently, SEC posted report raising questions on how supermarkets use the funds raised from these plastic charges. \n\nMore questions should be raised on:\n1. Whether these social donations and \"green\" upgrades are eligible for tax rebates or additional grants for these supermarkets? If yes, how much free money has these supermarkets gained? \n2. Why are supermarkets not prohibited from spending these on internal projects and initiatives? \n",
      "comments": [
        {
          "text": "Got strong mandate liao. Fk your questions. Move on",
          "score": 118
        },
        {
          "text": "The problem is now we have to buy plastic bags for the trash can \n\nTown council says the trash must be bagged before going down the chute",
          "score": 59
        },
        {
          "text": "So fucking stupid",
          "score": 52
        },
        {
          "text": "The government should have collected the surcharge themselves and invest it in green/waste reduction causes.\n\nWhat extra regulatory reporting burden would supermarkets incur, if they already have to do it under the scheme anyway?\n\nAsking supermarkets to self manage the funds just creates a conflict of interest. The best way to prevent misuse would be to not leave it to the hands of people who might misuse it in the first place!\n\nThe whole thing is a shit show many have seen coming. It is ridiculous to the point it sounds incompetent.\n\nIt is really ridiculous that NEA (or a responsible agency) chose not to collect the charges and manage it themselves, when it does not look that onerous. And a good use of the proceeds would actually look good on the government, no?\n\nThen, it is also really ridiculous that NEA (or a responsible agency) chose to leave it to the supermarkets and not mandate how the funds must be used.\n\nIf the reason why we are paying for plastic bags is because of the environmental impact, then why was it not mandated for the funds to be used only on green causes?\n\nAnd how ridiculous can NEA (or a responsible agency) be to not foresee the whole thing and require any spending of the funds collected to be used to create *additional* impact, and not just impact alone?\n\nOne ridiculous mistake, fine, maybe we can overlook it. But so many? Who are they kidding? The government want to shirk away from doing work, fine, but the minimum they could do is to plug some obvious loopholes, right?\n\nThey do not want to do work, do not want to close loopholes, then now it got exposed and harmed consumers’ faith and confidence in the scheme. With that bottle recycling charge thing coming up, this could not be worse.\n\nNow, people will start doubting that too (if they have not yet done so already).\n\nHeads should roll, but chances are, this will probably be dismissed as a “honest mistake”. One would hope the scholar in charge of this fiasco be punished, but no point holding our breath.",
          "score": 43
        },
        {
          "text": "In the near future supermarket would be charging $0.1 for every question asked since asking less questions will lead to lesser consumption of energy.",
          "score": 40
        },
        {
          "text": "seriously f her",
          "score": 29
        },
        {
          "text": "Naive Singaporeans really think our politician will debate this topic in parliament and question those businesses on the $ they collected? They rather stir opposition shit than to give a fuck about your $0.05, and why will they stir those businesses to give them problem when you, me and any stray dogs and cats also know that they’re pro business and only suck up to businesses.",
          "score": 28
        },
        {
          "text": "fuck you lah cheebye dog",
          "score": 10
        },
        {
          "text": "Most useless mp award😒",
          "score": 9
        },
        {
          "text": "\\[In 2018, Amy Khor says, \"Imposing a charge or ban on disposable plastic bags and substituting them with **other types of disposable bags** is unlikely to improve environmental outcomes\"\\]\n\n  \nI mean you quote it yourself. they won't charge on disposable plastic bags **and** substitute them with other types of disposable bags. They didn't say they won't charge on disposable plastic bags and ask you BYOB.",
          "score": 8
        },
        {
          "text": "Greenwasshing is a biz.",
          "score": 7
        },
        {
          "text": "no ntuc plastic bags how to throw garbage at home sia 😭",
          "score": 6
        },
        {
          "text": "The irony is that she was right, back then. But then the PAP went woke trying to capture the youth vote.",
          "score": 6
        },
        {
          "text": "Rwanda totally bans plastic bags and even imposes a fine at the airport for bringing them in.  This policy has resulted in it becoming the cleanest tidiest country in Africa. \n\nhttps://www.channelnewsasia.com/world/plastic-bag-ban-charge-waste-rwanda-2767096\n\n“KIGALI, Rwanda: The signs in airport arrival areas around the world commonly warn passengers against smuggling drugs, weapons or large amounts of currency.\n\nBut the white sign that confronted me as I cleared customs in Rwanda’s Kigali airport last month presented a rather unusual message: \"Use of non-biodegradable polythene bags is prohibited.\"",
          "score": 4
        },
        {
          "text": "By the way, NTUC foodcourt Kopitiam and Cantine also have “no straw” policy and use only plastic spoon for hot drinks.",
          "score": 3
        },
        {
          "text": "After reading the responses here, maybe the supermarket can give out free trash bags using the money collected instead",
          "score": 2
        },
        {
          "text": "I wander what’s the minister who drove the campaign to reduce “plastic bag” usage that harms Mother Earth, requiring shoppers to pay $$ for per usher. \n\nEveryone believed and bought into the campaign. But how could Thi campaign fail to save mother earth? \n\nWe no all have been fooled? Goodness! I can’t believe that’s true.",
          "score": 2
        },
        {
          "text": "U wanna change habits you have to start young. Educate your future leaders, those who are still in school.",
          "score": 1
        },
        {
          "text": "It starts with the boomers who go to the supermarkets, and start extracting as much of the roll of plastic bags as they can from the fruit section without someone telling them to stop \n\nThese people use up more plastic bags than anyone else 😆",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qxxajx",
      "subreddit": "singapore",
      "title": "Malaysia, Japan the most popular destinations for S’pore residents in cross-border card spending: Visa",
      "url": "https://old.reddit.com/r/singapore/comments/1qxxajx/malaysia_japan_the_most_popular_destinations_for/",
      "score": 78,
      "num_comments": 19,
      "created_at": "2026-02-07T07:18:40",
      "selftext": "",
      "comments": [
        {
          "text": "Lol i also can say.",
          "score": 42
        },
        {
          "text": "Thanks Captain Obvious",
          "score": 33
        },
        {
          "text": "too bad for Visa, my no-exchange fee card from Mari Bank is a Mastercard",
          "score": 21
        },
        {
          "text": "i can say this for free",
          "score": 14
        },
        {
          "text": "In other news, the sky is blue..",
          "score": 10
        },
        {
          "text": "Malaysia, Japan makes it sound like a province in Japan. ‘and’ exists but they cant be bothered to put it in the title lmao.",
          "score": 4
        },
        {
          "text": "Cheap option, atas option",
          "score": 2
        },
        {
          "text": "Surely this is just an ad for Visa.",
          "score": 1
        },
        {
          "text": "Damn, big if true.",
          "score": 1
        },
        {
          "text": "I wanna know what people are buying in Japan when (at least for snacks) most brands already distributed in Singapore .",
          "score": 1
        },
        {
          "text": "Malaysia checks out lol it’s literally right there.",
          "score": 1
        },
        {
          "text": "Coming from visa... China and places where credit cards are not widely accepted will be under reported.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qy550h",
      "subreddit": "singapore",
      "title": "S'pore man, 25, arrested for Pokémon trading card scams with losses over S$135,000",
      "url": "https://old.reddit.com/r/singapore/comments/1qy550h/spore_man_25_arrested_for_pokémon_trading_card/",
      "score": 73,
      "num_comments": 9,
      "created_at": "2026-02-07T13:17:23",
      "selftext": "",
      "comments": [
        {
          "text": "Good work by our police in nabbing these people. \n\nGOTTA CATCH'EM ALL!",
          "score": 22
        },
        {
          "text": "Spending huge amounts of money and getting scammed on a fking card has to be a next level joke",
          "score": 20
        },
        {
          "text": "Gotta scam them all?",
          "score": 2
        },
        {
          "text": "amazing so much money can be spent on a card😲",
          "score": 0
        },
        {
          "text": "&gt; Consumers were also encouraged to use payment methods with buyer protection, such as in-app options that release funds only after delivery, instead of making advance payments or direct transfers.\n\nMany people do this to bypass Carousell's platform fees. Want to use the platform but don't want to pay them lol.",
          "score": -5
        }
      ]
    },
    {
      "id": "t3_1qy53tm",
      "subreddit": "askSingapore",
      "title": "how to build great body while only eating at hawker?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qy53tm/how_to_build_great_body_while_only_eating_at/",
      "score": 55,
      "num_comments": 52,
      "created_at": "2026-02-07T13:15:34",
      "selftext": "I want to look good but due to personal circumstances I can only eat out or do minimum cooking like boil eggs or open canned food.\n\nI learned that aside from exercise, diet is important and I need to track the calories I need, and add on to that to make the excess become good weight.\n\n  \nSince I only eat out, my option for broke person like me is always hawker. While eating at cai png, the meat portion is always small, and if i get more meat its always adding up to price very quickly. the food are also quite oily / saucy. And importantly idk how to track how much calories / protein is in that meal.\n\nAnyone who is in similar situation as me and managed to pull off? Would love to know what kind of things you eat at hawker, how do you track the calories, etc. tyvm\n\n  \n",
      "comments": [
        {
          "text": "Buy a rotisserie chicken from cold storage, then order a drink and get a seat at the hawker center 😬",
          "score": 77
        },
        {
          "text": "I’m trying to eat protein and Mr bean’s hainan chicken porridge is 30g protein, the soy milk is 17g and the combo is 6.80$\n\nIf not full, maybe wack some old changkee fish balls but mind your sodium",
          "score": 32
        },
        {
          "text": "Chicken rice!!",
          "score": 17
        },
        {
          "text": "eat western chicken chop and change all fries into baked potatoes or salad. ",
          "score": 10
        },
        {
          "text": "Decathlon protein powder. When they are on sale you can buy a 900g pack for $24.90. That’s 30 servings of 21g of protein. Cost wise that’s even cheaper than frozen chicken breast which is usually $12.90 for 10 servings of 25g protein.",
          "score": 9
        },
        {
          "text": "Looking good invariably requires cutting weights, and that means a caloric deficit. Overall, nutrients are important but they don't necessarily help you look good. \n\n\nFor your case, I will cut out carbs. Go for stuff like cai png with less or no rice, fish soup without rice or noodles, yong tau foo soup etc. Just reduce the carbs will help you lose a lot of weight. \n\n\nFor proteins, I feel like if you don't cook yourself, then the best solution is eggs, like soft boiled eggs. Or just invest in a tub of protein powder which can last you quite long.\n\n\nFor looking good, important is to train muscles, but cardio will help burn calories too. If you have the time, always balanced both.\n\n\nBack to nutrients though, looking good is nice, but feel good is more important so hope you get some good nutrition along the way.",
          "score": 7
        },
        {
          "text": "Unsweetened soy milk is the simple hack for topping up protein, just buy from supermarkets.\n\nThen make sure that you don't overeat your calories from your meals, and you're done",
          "score": 6
        },
        {
          "text": "Chicken rice with white rice",
          "score": 3
        },
        {
          "text": "Chicken rice extra meat, ayam bakar, chicken chop with rice instead of fries. Chicken breast from 7/11 to fill up if still hungry.\n\nIf you want to cut eat less calories if you want to bulk eat more calories simple as that. Type calories calculator into google, type your stats, it will give you how much calories to maintain how much to cut/add daily. \n\nThen, you just type your meal into chatgpt ask how much calories is it. Use it to track. If over shot/under shot for first meal, other meals of the day do accordingly to hit whatever goal. \n\n‘Good weight’ or whatever is bullshit, literally just add or reduce calories that’s it. The only deceptive thing is just that nowadays with processed food, one bite of a mcdonalds’s burger might equal to half of an entire chicken rice meal, some things are unnaturally dense in ways that we cannot comprehend, so just simply track with ai whatever you eat. Good food, bad food, cut certain food group, eat the whole meal but cut just sauces and gravy, all of these are all debunked already. (in terms of good looking body at least) \n\nOnly thing is, if you are doing cutting, mcdonalds burger alone might equal your one meal’s calories but after a while you might feel like shit cause a lot of it cannot be absorbed well by the body, so that’s why eat the above foods at the top cause they give you your protein and carbs and have enough for the body to absorb. When cutting eat more natural than processed, not because there’s a physical difference (the body only knows calorie in calorie out) but because it’s gonna be tough mentally with not much usable calories. Soft drinks also same, add calories but does nothing for the body aside from immediate energy that’s probably gonna be wasted. \n\nAbout soft drinks, if you find you really need soft drinks to get through the day, ration it, like buy bottle or a can then sip it for taste every now and then, then put in the fridge. If you need caffeine just buy zero sugar ones, wonda zero max I find is very good (but I’d say just wean off of it if can, it’s a drug that works for the first time then gives less and less energy until you need it just to operate at baseline, so why). Aside from that reason don’t get soft drinks with artificial sweetener, it’s just a very large amount of acid and salt with no calories and will only make you more hungry and thirsty for no reason and make you eat more, worse than normal soft drinks which at least have some calories to counter the acid. \n\nAside from that unnatural aspect of foods and drinks I mentioned above, there are no bad foods.\n\nIf you are bulking for the first time, gym/bodyweight training/sports is as important as food, cause your body has no built muscle. If you are cutting, incline treadmill walk does wonders for reducing daily calories very efficiently.",
          "score": 2
        },
        {
          "text": "Chicken rice change rice to normal white rice",
          "score": 2
        },
        {
          "text": "Western grill chicken without the gravy and extra servings of coleslaw",
          "score": 1
        },
        {
          "text": "yong tau foo and fish soup. avoid caifan stalls because the oil in every dish is absolutely absurd. unfortunately the only way to be completely accurate with calorie and macro tracking is to make your own food. you can make rough estimates with hawker food, but you'll never be sure on the accuracy. your best bet is to choose whatever proteins are cooked with the least oil.",
          "score": 1
        },
        {
          "text": "Combine 7-11 chicken breast with the caifan? Or if you eat Yong tau Foo, can choose the tau Kwa? Tau Kwa is actl high in protein. You can also buy from supermarket also can just boil or fry. I think one block got 30g of protein.\n\nI think other people might supplement with protein powder also. \n\nI’m not in a similar situation but if the food is high cal and got no choice I think you can incorporate some form of moderate cardio daily to offset the additional calories abit.",
          "score": 1
        },
        {
          "text": "2 packet: Chicken rice. Breast meat. Less rice more chicken.",
          "score": 1
        },
        {
          "text": "Fish soup - no milk, half the amount of rice, add veg. My friend even boiled his own spinach or broccoli and bring it with him and put them into the soup.\n\nChicken rice - add breast meat, cut rice. Even better, ask them for plain rice mixed with chicken rice.\n\nCaipeng - go for the steamed stuff — egg, chicken, fish fillet. Again cut the rice. Fill up on veggie.",
          "score": 1
        },
        {
          "text": "Eat muscle salad",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qxg7r4",
      "subreddit": "askSingapore",
      "title": "How often do jaywalking fines happen in SG?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qxg7r4/how_often_do_jaywalking_fines_happen_in_sg/",
      "score": 51,
      "num_comments": 35,
      "created_at": "2026-02-06T20:25:05",
      "selftext": "Friend of mine stayed in TP with no cases. Moved to Pasir Ris a week ago and kena already. Dk is suay or what",
      "comments": [
        {
          "text": "Buy toto sir, incredibly lucky",
          "score": 123
        },
        {
          "text": "It's not jaywalking beyond 50m of a designated crossing. Seems that they gave up and even put legal designated \"jaywalking\" places, like a path leading to the road without stoplights.",
          "score": 76
        },
        {
          "text": "Your friend unlucky. I jaywalked in front of police car before also didn't get fined 😭 I completely forgot I wasn't supposed to jaywalk despite seeing the police car, but I guess jaywalking that road was too common so the police close eye lol",
          "score": 34
        },
        {
          "text": "Rare. But one of my colleague kenna before. Lol",
          "score": 21
        },
        {
          "text": "i saw someone got booked at city hall before",
          "score": 11
        },
        {
          "text": "Your friend damn suay",
          "score": 11
        },
        {
          "text": "Sibei suay. I think if you ask around, hardly people get fine for it and know people that got fined for it.",
          "score": 9
        },
        {
          "text": "15 years ago i witnessed a police officer camping behind the pillar at the junction 8 traffic light.\n\nIt was 6am and he booked a couple that beat a red man right before i was about to cross the road. Good thing the couple passed before me as i would have jaywalked as well.\n\nNot too sure if they still do it though",
          "score": 7
        },
        {
          "text": "I got fined at Pasir Ris too wtf",
          "score": 5
        },
        {
          "text": "Lol what the hell, I lived in Pasir Ris all my life, never Kena before, did not even know Jay walking was a chargeable offence. ",
          "score": 4
        },
        {
          "text": "20+ years of my life I've only knew one family member with a jaywalking fine",
          "score": 3
        },
        {
          "text": "There's fines for jaywalking? ",
          "score": 2
        },
        {
          "text": "[removed]",
          "score": 1
        },
        {
          "text": "While j walking today, just so happens a police car drove by and slightly slow down. I was like is this the day I get fined for jaywalk? \n\nBut luckily the car just drove by. Phew!",
          "score": 1
        },
        {
          "text": "How much is the fine?",
          "score": 1
        },
        {
          "text": "I kanna before 20 years ago. Was with my neighbour/bff on our way to school (NYP) and alighted at bus stop opposite MRT station. I wanted to use the overhead bridge, bff said no car and just asked me to jaywalk. Got stopped by regular police once crossed the road. First ever fine in my life.",
          "score": 1
        },
        {
          "text": "Saw people jaywalking at Republic Poly like 15 years ago as they were just waiting and people kept jaywalking. So many people got fined but saw a group running away as the officers apprached them. Officers were not fit to run after them.",
          "score": 1
        },
        {
          "text": "I jaywalk frequently, touch wood, never tio before.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qxs31u",
      "subreddit": "askSingapore",
      "title": "What is your favorite Singapore hawker food breakfast?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qxs31u/what_is_your_favorite_singapore_hawker_food/",
      "score": 48,
      "num_comments": 75,
      "created_at": "2026-02-07T03:56:49",
      "selftext": "Mine would be chai tau kueh.\n\nCan't wait for it in a few hours time! ",
      "comments": [
        {
          "text": "Black or white? I'm team black.",
          "score": 52
        },
        {
          "text": "I like my Kaya Toast Set, Kopi C siew dai!",
          "score": 31
        },
        {
          "text": "Lontong with sambal",
          "score": 23
        },
        {
          "text": "Bak chor mee",
          "score": 23
        },
        {
          "text": "Woke up hungry huh? \n\nMine is vegetarian Bee Hoon, the ones with sauce and green chilli. Reminds me of the times when my grandma was still around.",
          "score": 22
        },
        {
          "text": "Nasi Lemak!",
          "score": 15
        },
        {
          "text": "Because i'm hungry now, i'd say bee hoon!! Topped with Taiwan sausage, fresh cabbage, fish cake/fishball",
          "score": 15
        },
        {
          "text": "As a Brit who comes every year to Singapore, set 2 kopi C, Toast Box, is something I yearn for during the cold wet winter in England. See you in April",
          "score": 12
        },
        {
          "text": "my economic beehoon set 🤣😂",
          "score": 9
        },
        {
          "text": "Kaya toast set",
          "score": 8
        },
        {
          "text": "Chee kueh! \n\nWe would dabao the kuehs and chaipo separately and reheat in the steamer in the morning, very comforting.",
          "score": 8
        },
        {
          "text": "you tiao + kopi O",
          "score": 6
        },
        {
          "text": "Pork porridge with century egg and a regular egg mixed in!",
          "score": 6
        },
        {
          "text": "Roti prata",
          "score": 6
        },
        {
          "text": "Cai tow kuey",
          "score": 5
        },
        {
          "text": "Prawn noodles",
          "score": 5
        },
        {
          "text": "2 plaster prata with fish curry",
          "score": 4
        },
        {
          "text": "Economy bee Hoon shop but I usually take fried kway tiao. Add otah, egg, veg, chilli. This is my perfect Singaporean breakfast",
          "score": 4
        },
        {
          "text": "Mee rebus with THICC gravy and green chilies",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1qy32n3",
      "subreddit": "askSingapore",
      "title": "SG Blogshops — Which Brands Do Girls Really Buy From These Days?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qy32n3/sg_blogshops_which_brands_do_girls_really_buy/",
      "score": 49,
      "num_comments": 72,
      "created_at": "2026-02-07T11:35:14",
      "selftext": "Noticed that a lot of SG blogshops seem to be carrying very similar designs lately. Curious which ones girls actually still shop from, and why.",
      "comments": [
        {
          "text": "I need this thread!! I have been buying from Lovet (Great quality for most pieces except their linen), SSR for a while and outgrew them because of their very girly and feminine style.",
          "score": 54
        },
        {
          "text": "I mostly shop from Zara, mango, Uniqlo. No longer buy from blog shops due to their lousy return policy and only giving store credits.",
          "score": 40
        },
        {
          "text": "TIL there are still blogshops....",
          "score": 30
        },
        {
          "text": "I like to buy love bonito from carousell but man, are SG girls so skinny. They're always selling S but my fat ass wears M.",
          "score": 26
        },
        {
          "text": "Kindtokind- Like the material and choices. Different lengths and designs for various occasions. \n\nFairbelle for ethnic wear. The designs are pretty and affordable\n\nFirstStitch.co for their nice cuts and also their tailoring. \n\nAll these are under 50. I buy when on sale in bulk so I get free shipping and get discounts.",
          "score": 22
        },
        {
          "text": "For office wears I go to Love Bonito (find ones in Carousell first), otherwise I go to Indo local brands as it's hard for me to move on from them. Try to take a look at Shop at Velvet, [Drunk Dad](https://drunkdadinthelobby.com), [Toko Didiyo](https://tokodidiyo.id/collections/all) or others from[ HGL House](https://hglhouse.com) \\- they do ship internationally!",
          "score": 19
        },
        {
          "text": "current fave is a for arcade for pretty unique styles!! they usually sell items that are more bold/different which I really like.\n\ntinsel rack is great too for basics and its decent quality for it's price.\n\ni would avoid 6s***e though cause a lot of their items are dropshipped and can be found on taobao.",
          "score": 17
        },
        {
          "text": "I find that most of these shops are just importing and selling at a high markup. \n\nThe only one I really like is kind to kind (previously lilypirates). The owner goes on live and explains the designs in detail and you can see the fit on their models of different sizes and high resolution videos of the fabric as well. \n\nSo far, I’ve been very happy with the pieces I got from them. \n\nLB is absurdly priced now and their fabric always dunno why so thick and boxy. The rest of the shops feel and look like shein. \n\nSome taobao brands are quite good too. But hard to find good shops among all the bad ones.",
          "score": 8
        },
        {
          "text": "I like All Would Envy for their really cute and unique prints, plus their cuts tend to be pretty flattering (although tbh they've only for like 3 or 4 basic designs, just different prints only)",
          "score": 7
        },
        {
          "text": "TTR! Super cute quality clothes, feminine but also good basics. Usually buy them on shopee with the vouchers or on sale.\n\nMikayla's BARE series are quite good for basic stylish pieces too. But they always like to do PO and i don't really like the wait time \n\nAforarcade has some unique pieces which I like as well. The Style Soiree also has elegant and feminine pieces.\n\nAgree with the rest about 6style...quality is not the best so now i avoid buying.",
          "score": 7
        },
        {
          "text": "Not sure if it's a blogshop but I love Y21. Quality is noticeably better than Playdress and a few other blogshops I tried.",
          "score": 5
        },
        {
          "text": "I like Lovet, Modparade and fashmob for good quality pieces!",
          "score": 3
        },
        {
          "text": "I buy and I love the designs from Blairwears, Carrislabelle, The Style Soiree and Shop Sassy Dream. Highly recommend these brands! :)",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1qxo258",
      "subreddit": "askSingapore",
      "title": "Switch career engineering-&gt;pilot",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qxo258/switch_career_engineeringpilot/",
      "score": 23,
      "num_comments": 14,
      "created_at": "2026-02-07T01:31:40",
      "selftext": "Hi everyone, i just wanna ask how tough it is to get into the SIA trainee programme if I am a uni grad (just graduated) studying computer engineering. \n\nMy resume dont really have anything that screams I am passionate for flying or anyth similar in general. If anything it says more about how much I am into swe.\n\nI will appreciate it if anyone can tell me anything else that you may find to be useful for me.",
      "comments": [
        {
          "text": "Acceptance rate is less than 5%, there’s a tele group for people looking to get into SIA and scoot programs. Both are super competitive to get in and you’ll need to study and prep extensively for their interviews and etc.",
          "score": 23
        },
        {
          "text": "Please prepare beforehand on your knowledge of Aviation in general and also technical knowledge of Aircraft. You only have one or two rejections before you are blacklisted from applying again. Oh yeah and get ready to explain how passionate you are for flying",
          "score": 9
        },
        {
          "text": "So this SIA trainee programme is very selective and competitive because there’re many people vying for it.\n\nThere are 3 stages, the first stage is an interview with 3 SIA staff, one pilot, one HR, forgotten which department the last one was from. The pilot will be grilling you technical questions related to aviation, but this is adapted based on your background. \n\nNevertheless, even if you are from an unrelated course, be prepared to answer basic questions like the four forces acting on an aeroplane, and also how does a plane fly. \n\nThe second stage is more intense. More difficult technical questions. They will ask you much harder questions if your background is in aviation. There’s an FAA private pilot textbook that is free online, if you can memorise everything you should have no problems.\n\nThe third stage is tea session with current SIA pilots. I heard most people pass here, you have to be a real douchebag to fail at the last stage.\n\nI was from an unrelated course but did a PPL at Seletar Airport. So I could get past the first stage, but I got rejected at the second stage. You can google online for the question list that SIA will ask you.\n\nAlso just a weird tip. I realise most SIA pilots there have a hard on for Airbus. If they ask you which manufacturer you prefer, say Airbus first. And also be prepared for questions like what is the difference between Airbus and Boeing.\n\nIt doesn’t hurt to try but looking at your profile, you have a low chance ah ngl. You have to convince SIA to invest hundreds of thousands of dollars in you through this selection process. So if you really want this you need to start building your resume now. Save up some cash and get a PPL at least. You’ll know if flying is for you and also it’s better than nothing for your resume.\n\nIf you are rejected from everywhere else on Earth but still dead set on flying for a career. Look into Susi Air in Indonesia. Pay isn’t the best and you’ll start from bush flying instead of multi-crew, but you can work your way up.",
          "score": 1
        },
        {
          "text": "SIA Pilot here, quite easy just pass the interview and it's settled",
          "score": -5
        },
        {
          "text": "If you have to ask, you already know the answer",
          "score": -15
        },
        {
          "text": "super tough. You need good eyesight, tall and many years of training",
          "score": -18
        }
      ]
    },
    {
      "id": "t3_1qxgw9l",
      "subreddit": "askSingapore",
      "title": "Renting for the first time, is this scam",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qxgw9l/renting_for_the_first_time_is_this_scam/",
      "score": 22,
      "num_comments": 45,
      "created_at": "2026-02-06T20:57:08",
      "selftext": "how likely is the renting a scam if:\n\n1. i’ve viewed their house.\n2. they asked to pay a deposit to reserve the rental (through paynow)\n3. there’s no contract at all, landlord said usually there’s a contract for whole unit but none for a room rental\n\nis this normal with rental?\n\nThere’s no agent between us.",
      "comments": [
        {
          "text": "Not normal. There should be a contract",
          "score": 84
        },
        {
          "text": "Everything else looks okay. Except. Single room need contract. Even sharing a room need contract.",
          "score": 19
        },
        {
          "text": "NO! Don’t! There is supposed to be a contract even for room rental. \n\nI’ve been renting since 2017, first 2 rentals were rooms and then I rented whole apartments and have always had contracts for both",
          "score": 17
        },
        {
          "text": "2. is normal there are people say yes we will rent but after that just MIA because they got another best deal  \n3. not really otherwise u can ask them whether you can draft out the contract for them to sign and keep 1 copy for yourself another for them",
          "score": 7
        },
        {
          "text": "100% scam. No contract, no money. \n\nGive money on what basis? Booking also got contract hor. Anything involving money got contract regardless of amount or purpose. Ever seen $1 contracts? Nominal amount, still got contract.",
          "score": 7
        },
        {
          "text": "I dont think its the norm. Usually there’s contract whether you take unit or room. Deposit usually after signing contract.",
          "score": 3
        },
        {
          "text": "You need a contract. Ask for it. No contract don’t pay deposit",
          "score": 3
        },
        {
          "text": "No rental agreement is enforceable unless stamp duty is paid.",
          "score": 3
        },
        {
          "text": "That's how they cheat your money. Even if they get caught by police, and charged, you won't get your money back. (Witnessed firsthand, accompanied my friend to police station to lodge the case.)",
          "score": 2
        },
        {
          "text": "Not normal way too sus.\n\nFind another landlord.\n\nWithout a contract what is your recourse going to be if he decides to kick you out before your lease expires? Or if he decides to triple your rent? ",
          "score": 2
        },
        {
          "text": "There is a contract and they'll have to officially register you on the portal...",
          "score": 2
        },
        {
          "text": "There is always a contract. No contract means they are sus.",
          "score": 2
        },
        {
          "text": "You need a contract. If no agent, just download one from hdb website, customize it and then get it stamp duitied",
          "score": 2
        },
        {
          "text": "GET A CONTRACT. DON'T PAYNOW ANY MONEY WITHOUT IT.",
          "score": 2
        },
        {
          "text": "Without signing a tenancy agreement, don't pay a single cent. Get whatever agent your landlord is using to attest that agreement, so that it's approved by HDB or Condo mgt",
          "score": 2
        },
        {
          "text": "Scam",
          "score": 1
        },
        {
          "text": "Scam. \nRun",
          "score": 1
        },
        {
          "text": "Be skeptical, especially if found via fb marketplace.",
          "score": 1
        },
        {
          "text": "If you’re worried, how about an email? Contract &gt; Email &gt; WhatsApp",
          "score": 1
        },
        {
          "text": "Either they are cheating you, and/or they are cheating IRAS. \n\nSomeone here is definitely getting scammed. \n\nWhy not find one with an agent though? 99% of the time, agent commissions are paid by the landlord. \n\nHaving an agent on the hook for the legality of the case is the minimum for peace of mind.\n\nAlso, if you are a foreigner, without an agent/contract, you are boned if you need the address for your work permit. \n\nFor everyone, you are screwed because the landlord has the liberty to do whatever they want to you/your things and there is zero recourse without a contract.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qxhca6",
      "subreddit": "askSingapore",
      "title": "Does Singapore Pools take EZ-Link?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qxhca6/does_singapore_pools_take_ezlink/",
      "score": 14,
      "num_comments": 13,
      "created_at": "2026-02-06T21:16:23",
      "selftext": "Sorry if dumb qn. Never gambled before, but my sibling keeps asking for money for their ez-link, just wondering if I help them top up money directly to their ez-link card, they won't be able to use it for gambling? Dont want to be funding their gambling habit. Thanks",
      "comments": [
        {
          "text": "IIRC we used to buy Cigarettes and Liquor from 7-11 using Ez-Link card.\n\n18-year-old guy give IC (sometimes they don't even check), then use my friends Ez-Link card pay, his dad every month top up 100 to his Ez Link. Cashier didn't really care and system didn't block it. ",
          "score": 12
        },
        {
          "text": "I thought u can track ezlink card $ usage?",
          "score": 9
        },
        {
          "text": "Might be better to buy concession then it will be easier to stop reckless spending",
          "score": 5
        },
        {
          "text": "To my knowledge only nets. Google also say no.",
          "score": 2
        },
        {
          "text": "Asking for money on EZ-Link card sounds like a minor. Singapore Pools minimum age is 18, and they do check ID.",
          "score": 1
        },
        {
          "text": "They take CDC too haha",
          "score": 1
        },
        {
          "text": "Also, why do u pay their ezlink? Sounds like they need a side job.",
          "score": 1
        },
        {
          "text": "7-11 / Fairprice takes ezlink, so it could be for cigarettes/booze.\n\nSource: https://ezlink.simplygo.com.sg/card-charm/simplygo-ezlink/where-to-use/",
          "score": 1
        },
        {
          "text": "i dont think so, but ezlink can be used in mcd, bk, 711, cheers. most likely hes using it in one of these places to get food. if youre suspicious you can go to the machines at mrt stations and see where he spent the money and how much he spent",
          "score": 1
        },
        {
          "text": "Ezlink can be used to pay for food and other stuff too. You probably need to Google to get the full list.",
          "score": 1
        },
        {
          "text": "Eh why are your siblings asking money to top up ezlink from you lol\n\nAnyway there are so many ways to gamble I am pretty sure they can figure something out even if they cannot use ezlink for Singapore pools",
          "score": 0
        },
        {
          "text": "Yes they do",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qy5rep",
      "subreddit": "askSingapore",
      "title": "What are some small f&amp;b businesses to try?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qy5rep/what_are_some_small_fb_businesses_to_try/",
      "score": 12,
      "num_comments": 5,
      "created_at": "2026-02-07T13:49:53",
      "selftext": "I really want to support more small f&amp;b businesses because I’m getting a bit of chain-restaurant-fatigues. I am looking for locally-owned stores but as long as it’s a small business I’m down! It can be any cuisine, hawker or non-hawker, I just want to try sth where the people really put love into their food :)\n\nMy recommendation:\n\nChoc a Bloc for amazing chocolate cakes! ",
      "comments": [
        {
          "text": "butter and cream seems very nice\n\n(pretty sure they arent really small anymore but)",
          "score": 4
        },
        {
          "text": "Alex creation cafe in Bugis Cube #03-13 formerly he was a chef from a well known hotel. His Instagram name is alexcreationcafe",
          "score": 2
        },
        {
          "text": "Hecha at Everton Park! they are working really hard and receptive of opinions 🙏🏻",
          "score": 1
        },
        {
          "text": "Mad Roaster Coffee, Spicy Wife, Jack Marzoni's (closing tomorrow but coming back with a new concept), will add on when I recall more",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qxchoo",
      "subreddit": "askSingapore",
      "title": "Reasonably priced vets in west side SG?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qxchoo/reasonably_priced_vets_in_west_side_sg/",
      "score": 12,
      "num_comments": 12,
      "created_at": "2026-02-06T16:48:28",
      "selftext": "I have 2 cats, one of which has IBD and diabetes. He has been on long term steroids and insulin, and we regularly buy blood glucose strips for testing, needles for injection etc. His steroids used to be $76 for 80 tablets at another clinic, but today the vet charged us $120 for 60 tablets. That's more than 100% difference per tablet.\n\nJust wondering if anyone has reccommendation for good vets with reasonably priced medicine in west side Singapore? \n\nWe like our vet, and she gives good recommendations... but feel medicine costs are high",
      "comments": [
        {
          "text": "Doubt there's reasonably priced vet in whole of SG. 😾",
          "score": 10
        },
        {
          "text": "You can try to see if you can get it over the counter in JB, this is what I do to keep my cat's medications cost down as well. Just need to make sure it's the same dose that your cat needs.",
          "score": 5
        },
        {
          "text": "I find Gaia Vets charges to be reasonable.",
          "score": 1
        },
        {
          "text": "Joyous vet. Dr Grace is very good. I find the prices reasonable too.",
          "score": 1
        },
        {
          "text": "Do you have the name of the medication? Pet stuff sometimes can buy OTC.",
          "score": 1
        },
        {
          "text": "If the medication are also used for human, you can get them filled at some hospital pharmacies like KKH,  SGH and CGH. Just request for vet to provide presciption (usually there's a small charge) and call the pharmacies if they have stock. \n\nSeparately, note that small vet clinics may not have the bargaining power to reduce the cost for the meds. For my late girl, she was prescribed Sildenafil for pulmonary hypertension - Vet A charged $3.50 per pill, Vet B $2.50 and KKH $1.50 iirc many years back.\n\nTo add: the pharmacist at KKH said its not uncommon for them to fill in meds for diabetic pets.",
          "score": 1
        },
        {
          "text": "Recently I’ve been using an online vet dispensary called My Animal Dispensary. I find their prices to be slighter better for the prescription diets compared to my vet. Not very sure what your cat takes but you can check if they carry your meds. \n\nBut do keep in mind online stock is not immediate so there’s the hassle of dealing with delivery and some times being out of stock when you need it.",
          "score": 1
        },
        {
          "text": "What meds are these? If they are also used in humans, you can get a prescription from the vet clinic and collect the meds at NUH pharmacy (assuming cuz you mentioned west side). I used to get ursofalk for my dog from NUH as its less than $1 per pill but vet charges more than $3. Sometimes not clinic fault as the med suppliers will not extend the same prices to them, tender processes are also different.",
          "score": 1
        },
        {
          "text": "Prescription creams also can get from JB? The vet i goes to cost $55 or $60 just for consultation alone 🙁",
          "score": 0
        },
        {
          "text": "Ask for a prescription and get from a human pharmacy?",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qxyed1",
      "subreddit": "askSingapore",
      "title": "How easy is to go get to Pulau Ubin over CNY?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qxyed1/how_easy_is_to_go_get_to_pulau_ubin_over_cny/",
      "score": 9,
      "num_comments": 10,
      "created_at": "2026-02-07T08:04:38",
      "selftext": "It's too expensive and inconvenient to get anywhere outside Singapore so I thought I'd go to Pulau Ubin over CNY. I was just checking to see if there's any boats or cycle hire places that operate over then, or if everyone else has the same idea as me and so the island will be too crowded.",
      "comments": [
        {
          "text": "Alternatively you can take a ferry to Lazarus island from Sentosa cove. You can even walk to St John Island",
          "score": 4
        },
        {
          "text": "Not sure. If not enough ppl are boarding the ferry you might have to to pay the full amt of the ferry which is like $50 bucks",
          "score": 2
        },
        {
          "text": "To travel there or to spend there? Cuz Sentosa is pretty cheap tô travel over.\n\nBut spending there is another story.",
          "score": 0
        },
        {
          "text": "You can try Changi Point jetty. Not sure if the bike shops will be open on the island.",
          "score": 0
        },
        {
          "text": "probably no one is going. I would love to but visiting ",
          "score": 0
        },
        {
          "text": "Absolutely! 💯",
          "score": 0
        },
        {
          "text": "Batam seems cheap",
          "score": -2
        },
        {
          "text": "How is JB expensive or inconvenient?",
          "score": -13
        }
      ]
    },
    {
      "id": "t3_1qy4qxp",
      "subreddit": "SingaporeRaw",
      "title": "I see this my blood boil. Justice for the victims!",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qy4qxp/i_see_this_my_blood_boil_justice_for_the_victims/",
      "score": 288,
      "num_comments": 220,
      "created_at": "2026-02-07T12:57:26",
      "selftext": "",
      "comments": [
        {
          "text": "So the father cradling his dying child is being berated by the killer?",
          "score": 204
        },
        {
          "text": "No more cecas. Cecas go home",
          "score": 192
        },
        {
          "text": "https://preview.redd.it/g7cozh5xc0ig1.jpeg?width=1536&amp;format=pjpg&amp;auto=webp&amp;s=1de2fb4dc8dc971fd0367f5a9ca6e7f334ec577a",
          "score": 173
        },
        {
          "text": "Post taken from another group..\n\nI’m sharing what the witness wrote in Vietnam language 🥲\n\nThis morning, I walked to the market to buy coriander for selling bánh mì because I forgot to order it. While walking through the car park near the Chinese temple at Maxwell MRT, I witnessed a traffic accident at around 11:40 a.m. today. It was the first time in my life that I saw a traffic accident happen right in front of me.\n\nI was the first person walking behind the mother and her daughter. A woman was driving out from the car park. She did not look to the right for pedestrians; she only looked to the left when she turned right. The front wheel of her car ran over the little girl’s abdomen first, then over the mother’s leg. After that, the woman pressed the accelerator hard, and the rear wheel ran over the mother’s abdomen again.\n\nI don’t know why she accelerated so quickly when she just exited the car park. I guess they might be tourists. I can help as a witness and testify about this traffic accident.\n\nI clearly saw that when the front wheel ran over them, the driver should have felt that there was something under the wheel. However, she did not stop to get out of the car to check. Instead, she accelerated strongly and continued to drive forward, which caused the rear wheel to run over the mother’s abdomen again.\n\nI panicked at that moment and cannot remember clearly whether the rear wheel ran over the little girl again. I was in shock when the incident happened right in front of me.\n\nAt the time of the accident, the husband was not with them. Only the mother and daughter were there, and I was walking behind them. About two minutes later, the husband ran over and hugged the little girl.\n\nWhen the front wheel ran over the little girl, she was thrown and rolled about three times and ended up lying face down on the ground. Her mouth was in a pool of blood, next to her water bottle and her camera. The blood was flowing heavily from her mouth and spread thickly on the road.\n\nWhen the woman got out of the car and went to the back to check, she then realized that she had caused the accident. She raised her voice at the father while their daughter was injured and kept trying to explain that she was not at fault.",
          "score": 168
        },
        {
          "text": "It's a strange culture. The first reaction of a normal person is to feel horrified and rushed to help in anyway. But her first reaction is to blame the victims. \n\nReally can't understand this kind of behaviour.",
          "score": 122
        },
        {
          "text": "Fuck.... She'll most likely get 2 year jail, 1 year out already on good behaviour... Protected people, maybe half a year out already...",
          "score": 121
        },
        {
          "text": "What a tragic holiday which was meant to be a happy memory for the family, only to leave with the death of their beloved daughter. \n\nRIP to the young girl.",
          "score": 116
        },
        {
          "text": "Has she been arrested yet?",
          "score": 89
        },
        {
          "text": "wtf is wrong with the drivers here. Fucking entitled drivers, myself was in different scenarios of close calls and have to step back on pedestrian crossings bcoz of the drivers not slowing down :(\n\nI wasn’t in the scene, but read that she was blaming the victim and didn’t own up her mistake. Freaking asshole🤬🤬",
          "score": 78
        },
        {
          "text": "Ceca again.",
          "score": 74
        },
        {
          "text": "Yes! Jail the driver and make sure every foreigner who wants to drive in Singapore go take a driving course in Singapore. NO MORE CONVERSION!",
          "score": 43
        },
        {
          "text": "How can this woman be given a license to drive? She is a danger to all the road users. Hope she get 15 years of prison for causing death to a young girl  and the family sue her for millions . Make sure revoke her passports so she doesn't run back to her country plus her company need to sack her for the misery she caused to the family.. ",
          "score": 28
        },
        {
          "text": "https://preview.redd.it/ls6pbmoig0ig1.png?width=1152&amp;format=png&amp;auto=webp&amp;s=e784baeae01da31df62e4f1758c3981ed7cf51fa",
          "score": 24
        },
        {
          "text": "Down with cecas",
          "score": 19
        }
      ]
    },
    {
      "id": "t3_1qxy0uw",
      "subreddit": "SingaporeRaw",
      "title": "CECA woman causes accident while driving out at high speed &amp; pushes the blame",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qxy0uw/ceca_woman_causes_accident_while_driving_out_at/",
      "score": 175,
      "num_comments": 124,
      "created_at": "2026-02-07T07:48:45",
      "selftext": "The driver is absolutely disgusting! Instead of saying she is responsible, she blamed the pedestrians instead.\n\nhttps://www.facebook.com/groups/sgroadshallofshame/posts/3526630880817729/",
      "comments": [
        {
          "text": "They think whoever shout the loudest wins",
          "score": 114
        },
        {
          "text": "https://preview.redd.it/nf3nojghhzhg1.jpeg?width=720&amp;format=pjpg&amp;auto=webp&amp;s=2c4209b455a9586805d8ac76306f282f25cee00c\n\n🤬🤬🤬",
          "score": 80
        },
        {
          "text": "Girl, 6, dies after accident in Chinatown near Buddha Relic Temple\n\nhttps://www.straitstimes.com/singapore/girl-6-dies-after-accident-in-chinatown-near-buddha-relic-temple",
          "score": 60
        },
        {
          "text": "Fuck a 6yo girl died. Fucking ceca why do they keep coming over and causing trouble for us",
          "score": 60
        },
        {
          "text": "Someone even took a photo of the driver looking nonchalant…",
          "score": 40
        },
        {
          "text": "With a blame culture, India will struggle to become an advanced economy. Its people lack the ability to reflect on their actions, see and understand the consequences then self correct.",
          "score": 38
        },
        {
          "text": "its time she learn that its always drivers fault in Singapore",
          "score": 32
        },
        {
          "text": "https://preview.redd.it/dj81xouy80ig1.jpeg?width=1440&amp;format=pjpg&amp;auto=webp&amp;s=4a7706bc6f6e1d675904596ebd01cb7dc189f3aa\n\nIt's a new car less than 2 weeks old as well.",
          "score": 31
        },
        {
          "text": "https://preview.redd.it/jxyrxj7pczhg1.png?width=462&amp;format=png&amp;auto=webp&amp;s=6bcab5a03d8318bd80f45a23713c2629ef94f29e\n\n",
          "score": 29
        },
        {
          "text": "See this sad video you feel even more dulan at that dirty CECA https://www.facebook.com/100006265860610/videos/pcb.4233691340183020/905438615197807\n\nhttps://m.facebook.com/login/?next=https%3A%2F%2Fm.facebook.com%2Fstory.php%3Fstory_fbid%3Dpfbid04cxcCwqYDHaAfu3CecoSvhP3gqXTDsvUb2XN3c2Amr9k5Cyqq2eZaYsA99oPPdNhl%26id%3D100006265860610&amp;wtsid=rdr_0UPeWeoJsW4Ar4kxd&amp;refsrc=deprecated&amp;_rdr",
          "score": 23
        },
        {
          "text": "Guys, please help to spread the news on FB and social media to notify people that the driver is CECA. And show your friends and families the video and photos about how the CECA still can debate with victim’s dad about who is right or wrong in such situation.\n\nNeed to help the little girl (deceased) to get back the justice she deserves even though she has passed away. \n\nDon’t let that CECA woman get away just like that! That CECA woman needs to be jailed, deported, and barred from entering Singapore.",
          "score": 21
        }
      ]
    },
    {
      "id": "t3_1qxgodf",
      "subreddit": "SingaporeRaw",
      "title": "Traumatised by my first bridesmaid experience",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qxgodf/traumatised_by_my_first_bridesmaid_experience/",
      "score": 113,
      "num_comments": 64,
      "created_at": "2026-02-06T20:46:43",
      "selftext": "My JC classmate got married recently at a lavish island resort overseas. i was so hyped when she asked me to be her bridesmaid because it was my first time ever!! i really thought it was gonna be like those aesthetic vibes but it turned into a total nightmare.\n\nfirst thing that felt off was the bridesmaid dress she picked. It was super revealing. It was this champagne satin slip dress but the front was plunging like crazy and the back was completely bare all the way down to my tailbone. But the other girls were ok about it and kept saying omg you look so hot and your figure is 10/10  (thanks to my routine gym workout). But being conservative, I don’t want to wear it but still wore it because i didn't want to be the difficult friend and spoil the vibe. i was so naive to think people would just be respectful.\n\nThen the reception happened. The alcohol was flowing and some of groomsmen were getting super rowdy. Few of them were hovering around me the whole night making comments about my body. Then while we were walking to the afterparty, one of them came up behind me and straight up and groped lower half of my body.\n\ni was so shocked and felt so disgusted. So stupid to wear that dress. Now i’m back in sg and i’m in such a dilemma. i want to tell my friend but she’s literally on her honeymoon now looking so happy on ig. i don’t want to be the one to ruin her perfect wedding memory but i feel so sick inside knowing what her husband's best friend did to me.\n\n i know i should have stood my ground about the dress. Should i just suck it up and move on for the sake of the friendship?",
      "comments": [
        {
          "text": "avoid discussion of the dress but talk about the groping incident.\n\n  \nit is not the fault of the dress, it is the action of the guy.",
          "score": 450
        },
        {
          "text": "I’m sorry that this happened to you. Please don’t blame yourself for wearing that dress. The men SHOULD NOT touch you no matter what you wore.\n\nPlease consider making a police report or at least talk to someone you trust.\n\nTrust your gut instincts, if things don’t feel right, you are allowed to walk away. Walking away can mean walking back to your hotel room to stay safe, or distancing yourself from a friend who doesn’t care about your safety.\n\nIt’s the groomsmen ruined the wedding, not you.",
          "score": 105
        },
        {
          "text": "This is SA isn't it?\n\n\nMake a police report ",
          "score": 50
        },
        {
          "text": "Few days ago you mentioned this.\n\n\nHigh chance op is like to write such content\n\n\n\nhttps://www.reddit.com/r/SingaporeRaw/comments/1qup403/got_scolded_for_helping_an_uncle_while_in_my_gym/",
          "score": 44
        },
        {
          "text": "Even if you're naked, nobody should touch you.",
          "score": 38
        },
        {
          "text": "The argument that crimes or indecent behaviour is done against girls/women because of their choice of attire is so wrong",
          "score": 18
        },
        {
          "text": "This should be shared with the bride. A true friend would appreciate the honesty and not take this lightly.",
          "score": 12
        },
        {
          "text": "I think you should raise this up to her. It's not okay for you, or anyone, to get harassed and not have a good time. The wedding is supposed to be a sacred event where everyone enjoys their time and gives their wishes, this kind of thing is unacceptable. Honeymoon or not, if she's truly a friend she would understand your situation",
          "score": 7
        },
        {
          "text": "I have been to hundreds of weddings and its not what you wear and it should not ever be about that but what people behavior is and what is consensual or not.\n\nI have been groped straight between my legs from the front by the groomsman while wearing one the most boring outfit (as I was working) but spoke loudly and said what he did and if he did it again I am pressing charges. All his friends grabbed him and apologised saying he is drunk.\n\nBride and groom apologised after they heard.",
          "score": 7
        },
        {
          "text": "tell her but maybe in the future because like you said, she's on her honeymoon period. ",
          "score": 5
        },
        {
          "text": "Have you reported to the police on the groping incident?",
          "score": 5
        },
        {
          "text": "You should make a police report for sexual assault",
          "score": 4
        },
        {
          "text": "tell her now. the longer you wait the worst it gets.",
          "score": 3
        },
        {
          "text": "You should make a police report wtf",
          "score": 3
        },
        {
          "text": "Tell your friend the truth",
          "score": 3
        },
        {
          "text": "The groper is a creep. Report police or at least call him out.",
          "score": 3
        },
        {
          "text": "It’s entirely the groom fault. It’s SA. \nTalk to her. Report to police. \n\nNothing to do with dress.",
          "score": 3
        },
        {
          "text": "Please do not blame yourself about the dress. IANAL but I believe making comments about you and touching your bottom is outrage of modesty. I hope someone with the legal knowledge can advise you on your options. All the best.",
          "score": 2
        },
        {
          "text": "The dress has nothing to do with the sexual assault.\n\nYou should report the pervert who assaulted you.",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1qxfjzi",
      "subreddit": "SingaporeRaw",
      "title": "Stressful Family Situation",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qxfjzi/stressful_family_situation/",
      "score": 112,
      "num_comments": 41,
      "created_at": "2026-02-06T19:51:24",
      "selftext": "Stressful Family Situation\n\nDear all, I just want to rant.\n\nI have two younger brothers, K and X. \n\nK is 31 years old this year. When K finished JC and then NS, he aspired to be a doctor/dentist. K didn't manage to get a place in medicine/dentistry but he managed to get into SMU Law. K dropped out halfway through Year 1. I suspect it is because K is not the most eloquent person (all three of us have really bad social and communication skills) and it was difficult to survive in SMU. K then tried to become an entrepreneur and stays in his room all day, coming out for only food, water and toilet. It has been 9 years. People send their watches to our apartment and K repairs them. There are lots of rubbish (food wrappers, empty drink cans) in his room and my mother cleans the room for him every now and then. Every few years, we get a pink letter from a debt collector and I don't see as many deliveries of watches these days. We don't communicate but I don't think K's business is exactly working out.\n\nX is 29 years old. X graduated from uni during covid. X has not gotten a job since then and has been staying at home almost all the time. X spends all his time watching YouTube and mediacorp shows. X has been using Grabfood almost daily even though we live about 10 minutes from 3 coffeeshops. Recently, he has developed an extreme cleanliness streak. Twice a day, he spends 2 hour brushing and showering. He uses up an entire roll of toilet paper and a quarter of the shower gel bottle in the process. After that, he spends another 1 hour washing his hands, using about half a bottle of handwash. And another 1 hour applying copious amount of lotions to his face body and massages these parts (counting to around 100 for each body part). Our utilities bill is $600 per month for our family of five - no aircon. \n\nMy parents are in their 70s. My father is working as a petrol station attendant. They tried to talk sense into my two brothers for years but things have not improved. X has anger management issues and will raise his voice or says 'shhh' until my parents stop. My mother does all the housework. My two brothers don't help at all. I am a single male and working as a civil servant. I am extremely stressed about my family situation, especially the financial side of things.",
      "comments": [
        {
          "text": "Honestly sounds like some form of mental disorder for both of them. Ideally they should get help but hard to convince them if they’re not willing.",
          "score": 83
        },
        {
          "text": "X behaviour sounds like OCD (the mental health condition, being fussy is not OCD). If you wanna seek help, suggest to check out your neighbourhood Family Service Centre to discuss options with the social workers there:\n\nhttps://supportgowhere.life.gov.sg/services/SVC-FSCF/family-service-centre-fsc\n\nTake care",
          "score": 37
        },
        {
          "text": "OP I will be very upfront with you. \n\nHang in there until both your parents die , leave the house to your brothers and let them take care of themselves. \n\nYour debt is only to your parents. Whether your brothers live or die is their business. ",
          "score": 34
        },
        {
          "text": "Do you think either or both your brothers are on the spectrum (nerodivergent)? That would make them anti-social.",
          "score": 32
        },
        {
          "text": "How does X pay for all that?",
          "score": 15
        },
        {
          "text": "Is there any reason why they are not taking up other types of jobs? This is because I see these as side effects of not having any human interactions in daily lives. Regardless of the types of jobs (manual vs. office, well paid vs. non-well paid), most if not all would require some sort of human interaction, which will limit the degree of anti social behaviour. Besides that, taking up any kind of job will also create a sense of purpose and responsibility, which may break the loops. And sometimes tough love is required, I get that you and your parents have talked to them before, maybe more is needed to force them out of their daily routine.",
          "score": 15
        },
        {
          "text": "Whew it’s stuff like this that really make you think twice and appreciate how lucky one is",
          "score": 8
        },
        {
          "text": "Sorry for your situation. I'm also concerned that he watches mediacorp.",
          "score": 7
        },
        {
          "text": "All the best fellow bro. Saw that u were not asking for advice etc so all I will say is stay strong.",
          "score": 5
        },
        {
          "text": "It sounds like both your brothers have a mental disorder, namely K might be suffering from depression and X might have OCD.\n\nIt’s not something that you can talk someone out of.",
          "score": 5
        },
        {
          "text": "Respect to your parents for grinding it out for the three of you.",
          "score": 2
        },
        {
          "text": "Get your parents or you to stop funding their shitty lifestyle. Food delivery not cheap these days. Cut them off and tell them to get their asses off.",
          "score": 2
        },
        {
          "text": "U can’t help them tbh, just ignore and focus on urself, if u feel that u want to help ur parents just give allowance \n\nCrazy how some people live lives on hard mode I mean I unds as well",
          "score": 2
        },
        {
          "text": "Move out and rent a room to protect your peace then slowly accumulate CPF to buy a hdb.",
          "score": 2
        },
        {
          "text": "Can try family services centre. But even then, the social workers can only talk to them and encourage them, ultimately they still need to be the ones to actively do things and follow through on advice in order to improve their own lives. \n\n I think they need to realize that their actions are affecting others around them as well, and it's not a state that they can stay in forever. They're too comfortable now and have a shelter over their head so they don't feel a need to change. But what if one day your parents stop working and cannot support them anymore? They're on a sinking ship.",
          "score": 2
        },
        {
          "text": "Seems like both your younger siblings lack human interaction. One step at a time uh, I feel that however minimal, should force them to have some sort of human interaction before it gets even worse. Like getting them to tabao food etc. Slowly ease them back into society, but it’s not gonna be easy uh. Jiayou mans",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qxbxzl",
      "subreddit": "SingaporeRaw",
      "title": "Gunna be Grab VIP member alr",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qxbxzl/gunna_be_grab_vip_member_alr/",
      "score": 64,
      "num_comments": 20,
      "created_at": "2026-02-06T16:13:57",
      "selftext": "https://mothership.sg/2026/02/edmund-chen-appealing-jail-sentence-careless-driving/",
      "comments": [
        {
          "text": "Putting his experience of acting skills to good use. How fast he started crying",
          "score": 43
        },
        {
          "text": "Why he so scared go jail ? He so old liao no bro there will poke his karchng even if he keeps dropping soap lah.",
          "score": 25
        },
        {
          "text": "Just serve it and be done with it GDI",
          "score": 12
        },
        {
          "text": "Please, just admit your mistakes, serve the short 5 days of sentence and get it over and done with lah. Waste time and resources.",
          "score": 8
        },
        {
          "text": "Only 5 days should be fast",
          "score": 6
        },
        {
          "text": "![gif](giphy|4a1BYASufIy57JonDA)",
          "score": 6
        },
        {
          "text": "The way he portrayed himself, I almost fell for it that he was old and careless \n\nBut the truth is that he was inconsiderate and he was only thinking of his own convenience\n\nJust to save 10 or 15 minute detour, he almost killed someone and victim ended up with grievous injury.\n\nHe should be given a year in jail.",
          "score": 5
        },
        {
          "text": "Our driving laws are insanely lax. It's a bit shocking how soft on driving crimes that result in serious hurt are.\n\n&gt;The victim was sent to the hospital, where he underwent surgery and was found to have sustained multiple right-hand wrist fractures.\n\n&gt;He was given 99 days of hospitalisation leave but did not suffer any permanent disability.\n\nWhat is 5 days to him. He should be jailed at least equal to the injuries he caused 99 days perhaps?",
          "score": 4
        },
        {
          "text": "Maybe after this can make it big in taiwan or china. See Christopher lee go in come out become a star in taiwan. Maybe this is the secret that y Ian fang also go in. He is waiting to become a star when he go back china.\n\nWhy he so scare It is a hiddn secret future star in the making recepie that most star dont know",
          "score": 3
        },
        {
          "text": "![gif](giphy|FEYPi8pbJmPS87v910|downsized)",
          "score": 2
        },
        {
          "text": "Once an actor, always an actor",
          "score": 2
        },
        {
          "text": "5 days isn’t that bad. Just go in and relax. $15,000 is 😟",
          "score": 1
        },
        {
          "text": "I just want to know his skin care routine",
          "score": 1
        },
        {
          "text": "猫哭老鼠假慈悲\n\n呸！",
          "score": 1
        },
        {
          "text": "5 days only...the victim hospitalised and need live with the traumatic experience leh. Appeal somemore la later the judge tambah his sentence then he will think 5 days is very short.",
          "score": 1
        },
        {
          "text": "I think he paid for good lawyer package so inclusive if appeal, so just appeal lor. Idk why everyone work up over the appeal. He got charged as guilty what.",
          "score": -2
        }
      ]
    },
    {
      "id": "t3_1qy19ho",
      "subreddit": "SingaporeRaw",
      "title": "Singapore's R&amp;D Spending visualised",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qy19ho/singapores_rd_spending_visualised/",
      "score": 30,
      "num_comments": 8,
      "created_at": "2026-02-07T10:11:01",
      "selftext": "",
      "comments": [
        {
          "text": "Wish there's a statistics on the outputs, returns or effectiveness of R&amp;D spending. A high input i.e. resource expenditure and spending may not translate to a high output i.e. patents, publications, innovative products and services.",
          "score": 17
        },
        {
          "text": "RnD spending here feels more like a thinly veiled show to attract foreign investments. Money is often thrown into the latest buzz topic cuz there was a breakthrough elsewhere.. years ago biotech, nanotech, yesterday it probably was Fintech, agrotech and fake meats, today maybe AI and robotics, 3 -5 years later maybe after fdi targets are reached, we'd say bye bye to the capex and human resource that were developed, throwing them into the bin and then set up new ones from scratch.",
          "score": 16
        },
        {
          "text": "We should find out R&amp;D Spend as a percentage of GDP. That will be more interesting to see.",
          "score": 5
        },
        {
          "text": "India R&amp;D is like not existed, they all go our country to pick fruit indeed",
          "score": 4
        }
      ]
    },
    {
      "id": "t3_1qy6xk7",
      "subreddit": "SingaporeRaw",
      "title": "Thambi living and working in OZ yet want to defend CECA",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qy6xk7/thambi_living_and_working_in_oz_yet_want_to/",
      "score": 25,
      "num_comments": 13,
      "created_at": "2026-02-07T14:53:56",
      "selftext": "[https://sg.linkedin.com/in/praveenparam](https://sg.linkedin.com/in/praveenparam)\n\n[https://www.tiktok.com/@praveen.param/video/7602574695120063764](https://www.tiktok.com/@praveen.param/video/7602574695120063764)",
      "comments": [
        {
          "text": "He gives me the Raeesah Khan vibe.",
          "score": 18
        },
        {
          "text": "Reminds me of another one called sangeetha, kpkb sg but has been permanently residing in aussie land",
          "score": 16
        },
        {
          "text": "Professional victim. [**https://www.dailymail.co.uk/news/article-14770499/mcdonalds-melbourne.html**](https://www.dailymail.co.uk/news/article-14770499/mcdonalds-melbourne.html)\n\nRemove his SG citizenship",
          "score": 13
        },
        {
          "text": "He is ceca to the aussies as the cecas are to us. Probably the reason for the rant.",
          "score": 3
        },
        {
          "text": "Traitors have been always been around.\n\nEven our founding PM worked for invaders who killed and tortured his fellow men",
          "score": 1
        },
        {
          "text": "He is a local Singaporean.... you guys want to shoot CECA end up shooting our own kaki !!! some of this CECA hate comes back on our own local indians you know that right?",
          "score": -14
        }
      ]
    },
    {
      "id": "t3_1qy4w07",
      "subreddit": "SingaporeRaw",
      "title": "India driving test. JAIHO",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qy4w07/india_driving_test_jaiho/",
      "score": 24,
      "num_comments": 6,
      "created_at": "2026-02-07T13:04:21",
      "selftext": "[https://youtu.be/xGfLNqjh4j0?si=tg8vfHSLSqScHS0V](https://youtu.be/xGfLNqjh4j0?si=tg8vfHSLSqScHS0V)",
      "comments": [
        {
          "text": "https://preview.redd.it/e3l1417ye0ig1.jpeg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=7f7697af9affe03fe4b3322b7248811728532f02\n\nWhat the actual fuck",
          "score": 18
        },
        {
          "text": "https://www.theaustraliatoday.com.au/indian-origin-truck-drivers-caught-in-nz-licence-crackdown-after-false-or-altered-documents-uncovered/\n\nNZ recently revoked their licenses.\n\nThis news never gets reported here.",
          "score": 15
        },
        {
          "text": "![gif](giphy|UqKD7TU0igaUE)",
          "score": 7
        }
      ]
    },
    {
      "id": "t3_1qy690a",
      "subreddit": "SingaporeRaw",
      "title": "假人假意Ex-actor Edmund Chen’s jail sentence stayed pending appeal outcome, bail increased to $15k",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qy690a/假人假意exactor_edmund_chens_jail_sentence_stayed/",
      "score": 12,
      "num_comments": 11,
      "created_at": "2026-02-07T14:15:41",
      "selftext": "SINGAPORE – The courts have allowed former actor Edmund Chen’s five-day jail sentence over his role in a traffic accident to be stayed pending the outcome of his appeal.\n\nThe 64-year-old, identified in court records as Tan Kai Yuan, appeared at the State Courts on Feb 6, days after he [filed an appeal against the jail sentence on Feb 2](https://www.straitstimes.com/singapore/courts-crime/former-actor-edmund-chen-appealing-jail-term-over-aye-accident-which-injured-motorcyclist?ref=inline-article)\n\n.District Judge Shawn Ho, who had earlier imposed the sentence on Chen on Jan 29, granted his application to stay his sentence and increased his bail from $10,000 to $15,000.\n\nAccompanied by his new lawyers Kelvin Ong and Dickson Chew from Contigo Law, Chen appeared composed while entering the courts on Feb 6.\n\nDuring the court hearing, he discharged his previous lawyers, Mr Josephus Tan and Mr Cory Wong from Invictus Law.",
      "comments": [
        {
          "text": "the person who killed the 6 year old better get a heavier sentence than edmund",
          "score": 8
        },
        {
          "text": " he should think of being an inmate as method acting lol",
          "score": 4
        },
        {
          "text": "Wah he dismissed his previous lawyers some more. Really deadpan on not going to jail. \n\nHello unker, 5 days only lah, just go in squat as if it's an extended toilet squat pangsai haha. Oh well, precedence has it that many appeals ended up with jail sentences doubled even LOL. Coz it's utter waste of court's time and resources.",
          "score": 3
        },
        {
          "text": "Never know he is a shit 💩person until this incident. No wonder his children’s career are stagnant.",
          "score": 1
        },
        {
          "text": "[ Removed by Reddit ]",
          "score": 1
        },
        {
          "text": "Hopefully it gets extended .",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qy6uw1",
      "subreddit": "SingaporeRaw",
      "title": "coping after a break up",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qy6uw1/coping_after_a_break_up/",
      "score": 10,
      "num_comments": 15,
      "created_at": "2026-02-07T14:49:43",
      "selftext": "relationship with my partner of 2.5 years just came to an end, feeling like a wreck right now and crying non stop. can literally feel my heart hurting.. wanted to keep myself busy by exercising, going out or sleeping yet i really can’t bring myself to do anything at all. been on my bed for 2 days straight, haven’t told my family or friends about it too, just trying my best to act normal and happy.\n\nit really hurts like crazy as i’m sure we both still loves each other but also understand that this relationship is not going to work out anymore. (repeated quarrels over the same issue, different views on things etc)\n\nplease drop/share your tips on how to cope :(",
      "comments": [
        {
          "text": "focus on making money, your partner may leave you one day no matter how hard you try. But your bank balance won’t",
          "score": 26
        },
        {
          "text": "give your time to grief and accept your feelings. Believe that time will heal. I also suggest changing your routine and maybe travel it helps alot ",
          "score": 5
        },
        {
          "text": "Treat yourself to a nice spa and facial",
          "score": 3
        },
        {
          "text": "embrace your emotions - cry and let it all out.\n\nit will also be good to talk to someone - close friend, close family member. not so much to get advice, but to verbalise your thoughts. it will help you to think clearer.\n\nas suggested by others, keep yourself occupied with your favourite activities. you can also consider trying new activities. \n\nstay away from alcohol. personal experience - back then, i drank alot for about a month before coming to my senses. it definitely harm my body in some way. \nafter which i kept myself occupied with a short 4 months course and learning something new (went for boxing class)\n\ni wish you all the best",
          "score": 3
        },
        {
          "text": "Brutal",
          "score": 1
        },
        {
          "text": "time will help you yo heal. just gym everyday",
          "score": 1
        },
        {
          "text": "give urself time! cope healthily",
          "score": 1
        },
        {
          "text": "cry it out, and cry some more to let it all out. you have to let the emotions come out. the pain is there because it was real. but set yourself one task or a time limit each day or each morning, noon or night. if it's too difficult, it could be I'm going to get out of bed at this time, walk one round around the house get a cup of drink or some food. slowly expand that, if you don't feel like going to see pple, just go to a park and time yourself for half an hour walk and go back. \n\nthere's nothing i can say that'll make it better but as cliche as it has been said, give it time, if it doesn't get better give it some more time. if you ever have any negative thoughts or thoughts that will harm yourself, do get help, there are other love equalling the need for your attention, your love for yourself, your parents and friends love for you. \n\nget well soon.",
          "score": 1
        },
        {
          "text": "It will likely be difficult, but give yourself time and space. At the same time, you should accept reality. If you find yourself missing that person then maybe you should remind yourself why things did not work out in the first place... The earth will continue to spin and life goes on... all the best!",
          "score": 1
        },
        {
          "text": "Validate your feelings. Why need to act normal and happy? Seek therapy",
          "score": 1
        },
        {
          "text": "Engross yourself with work/studies/exercise.\n\nAvoid the places both of you frequent during dates. \n\nTime heal all wounds they say. The truth for some, the hurt lesser with time but that doesn't mean you don't miss or think about the other person despites the years.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qxcose",
      "subreddit": "singaporefi",
      "title": "US market volatility spreads, end of the easy money",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qxcose/us_market_volatility_spreads_end_of_the_easy_money/",
      "score": 76,
      "num_comments": 93,
      "created_at": "2026-02-06T17:00:48",
      "selftext": "So finally, the broken clock is right. \n\nWith the huge downswing that we have seen in US markets, let's pause, take a step back, and rewind how this sell-off unfolded. \n\nIt all started with the SAAS companies, a little over 2 weeks ago. We saw major names in the software sector getting hit with sharp corrections on fears that AI and Claude, specifically, could disrupt their subscription based business model. \n\nThen earlier this week, we saw reports of friction between OpenAI and Nvidia, sparking a correction for the semiconductor sector. This week, after major tech giants reported an unprecedented, hyper-aggressive rise in capex spending, the entire tech sector just sold down. \n\nValuations are the single most crucial thing in investinng. Buying a super high quality business at a gargantuan valuation makes it a bad decision automatically. And by now, I'm sure that everyone would be familiar with the fact that what goes up, must come down. \n\nTo address the common wisdom that it's impossible to time a crash, and hence continously buying into US tech despite skyhigh valuations is justified, let me pose a simple question to you. Are you sure that the risk to reward ratio is in your favour? How probable is it that when the market continues to go up and tanks eventually, it will still be higher than the current price that you are buying it? \n\nMe personally, seeing this volatility, well, I'll be lying if I said it didn't feel soooo good to prove the haters wrong. But am I going to liquidate my position in my dividend stocks in HK and go all in on us tech? No. I'm going to continue to remain rationale. Should the valuations of the companies continue to go down, I may even start a SMALL TINY position in solid, blue chip US tech companies. But as of right now, I'll still be patiently waiting on the sidelines. \n\nTo those that saw huge drawdowns in your portfolio this week, please take a moment to pen down your thoughts and emotions. It really helps to guard against FOMO and hype chasing, a few months later down the road. Valuable lessons can be learnt from this drawdown.\n\nTo end with a quote, \"The stock market functions as a mechanism that transfers wealth from the impatient to the patient\". ~ Warren Buffett. \n",
      "comments": [
        {
          "text": "\\*checks S&amp;P500 YTD, -0.88%\\*\n\nis the crash in the room with us tonight?",
          "score": 189
        },
        {
          "text": "finally bro is back from all the hard work at Temasek..\n\nLooking at the past 10mins of market movement, -0.19% to now +0.5% \n\nReally the OG",
          "score": 86
        },
        {
          "text": "Today we will have a green day, thanks ET",
          "score": 55
        },
        {
          "text": "YASSS! Our prayers have been answered!\n\nI thought the chief mod scared you off with a particular comment and you were never going to post on Fridays again. \n\nIn all honesty though, yesterday was probably an over-reaction and it was going to be a green night even without your grand appearance. I do expect a lot of \"unproductive\" volatility in the near term future though. Just swing here swing there. ",
          "score": 29
        },
        {
          "text": "ELECTRONIC TEAR POSTED we're saved everyone!!!!!",
          "score": 29
        },
        {
          "text": "ET!!!\n\n** Getting ready to move in big tonight .....",
          "score": 19
        },
        {
          "text": "My lord, since your disappearance many pretenders have tried to take your place in your stead. But I assure you that this subreddit r/singaporefi has not lost its faith in our one true god and your powers u/Electronic_Tear_3865",
          "score": 17
        },
        {
          "text": "Believe it or not, calls.",
          "score": 15
        },
        {
          "text": "What drawdown? I just checked VWRA and it's down 0.35% from 5 days ago. ",
          "score": 14
        },
        {
          "text": "Our Messiah returns! So many pretenders lately trying to usurp ET's throne but there is only one ET!",
          "score": 12
        },
        {
          "text": "Was honestly a lil worried but now that overlord ET has posted my fears are assuaged.",
          "score": 10
        },
        {
          "text": "S&amp;P500 is up 1.50% today.\n\nAll hail our lord and savior",
          "score": 5
        }
      ]
    },
    {
      "id": "t3_1qxcyvr",
      "subreddit": "singaporefi",
      "title": "Stocks with Bank after passed on",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qxcyvr/stocks_with_bank_after_passed_on/",
      "score": 31,
      "num_comments": 67,
      "created_at": "2026-02-06T17:18:47",
      "selftext": "Hello. Just checking if it’s true that if you passed on with stocks in US, you be taxed 40% of the total amount regardless of profile or losses? I tried googling but I get a lot of “may” tax.\n\nWondering if anyone have a more definitive answer. Also is it better to add next of kins in the account so it doesn’t get taxed?\n\nThank you for answering",
      "comments": [
        {
          "text": "Yes you will get taxed up to 40% of US estate tax for US assets &gt;60k usd.\n\nThat is actually a major risk factor most investors have to accept by investing in US stocks or US domiciled ETFs..",
          "score": 34
        },
        {
          "text": "If your loved ones have access like password and 2fa then it'll be 0 tax",
          "score": 7
        },
        {
          "text": "By right yes, by left unless they find out... (i.e. NOK need to show your death cert to ask for access etc)",
          "score": 6
        },
        {
          "text": "lol the amount of misinformation on this thread is amazing.\n\nYes, if you hold US situs assets (US domiciled ETFs) above USD 60k will be subject to US estate tax. This is the part that is written in the US tax code. \n\nNo, the IRS has never gone after a non-US person for this yet. So historically till now, the US tax authorities have not tried to tax a non-US citizen, living/working outside of the US for estate tax on stocks/ETFs. \n\n**tl;dr : got such rule but no enforcement yet.**\n\nSo you decide if you want to take this risk (of potential future enforcement by the US) or just utilize UCITS ETFs that are listed outside of the US, thus not subjected to this complication. ",
          "score": 5
        },
        {
          "text": "Your broker/bank/custodian (e.g. IBKR) will freeze all US-situs assets.  Your beneficiary has to file with IRS for clearance before they release.\n\nAdding NOK as joint account holder makes it worse.  Then the death of either will result in account being freeze.",
          "score": 3
        },
        {
          "text": "Put your acc id and password somewhere your NOK is likely find. Inform them you have a trading account. Liquidate everything.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qxzc5f",
      "subreddit": "singaporefi",
      "title": "With emergency funds already saved up(&gt;6mths), and getting bonus next month, what would you do with it?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qxzc5f/with_emergency_funds_already_saved_up6mths_and/",
      "score": 23,
      "num_comments": 44,
      "created_at": "2026-02-07T08:44:12",
      "selftext": "I am expecting to receive a low 5 digit bonus. What would you do with that bonus since it is not really a big amount.",
      "comments": [
        {
          "text": "Some people make early repayments to their mortgage. Others save it. Some put it in the stock market…\n  \nThe underlying theory is - what makes you sleep easier at night",
          "score": 46
        },
        {
          "text": "Invest it lump sum on a red day. ",
          "score": 36
        },
        {
          "text": "All in down payment for a new car",
          "score": 32
        },
        {
          "text": "If you (I use broad terms like \"ample\" and \"decent\" because the number is different for everyone): \n- Have ample emergency funds \n- Decent job security \n- Housing settled (Preferably fully paid/CPF covers entire or most of mortgage)\n- Decently invested \n- No other financial commitments \n\nTreat yourself to something good. The first bonus ($19.5k to be exact) I got, I gave my parents a red packet then treated myself to an amazing holiday. Business class tickets, high-end hotels, great restaurants. That was a few years ago and that trip is still one of my core life memories and the memories are worth a lot more than the $17k I spent. Would it be worth much more now if I put it all into VWRA? Sure it will, but I will never be in my early 20s again with a panoramic view of the Dolomites from my hotel room at FORESTIS.",
          "score": 26
        },
        {
          "text": "Rolex",
          "score": 10
        },
        {
          "text": "SRS if ur tax above 11% bracket. Then invest with ur SRS.",
          "score": 8
        },
        {
          "text": "First time having bonus?",
          "score": 7
        },
        {
          "text": "Put lump sum in investments",
          "score": 5
        },
        {
          "text": "Why would you treat it any differently from salary? That's mental accounting at work.",
          "score": 4
        },
        {
          "text": "Good time to dca and load up some msft and Amazon now.",
          "score": 4
        },
        {
          "text": "Milo can",
          "score": 2
        },
        {
          "text": "Treat yourself",
          "score": 2
        },
        {
          "text": "Get ready to jump into the market when the bank stocks are dropping.",
          "score": 2
        },
        {
          "text": "If its purely just bonus, i would set aside money for your indulgences and then the rest invested or kept away in HYSA.\n\nPercentage of both depends on how frugal/stingy you are with yourself.",
          "score": 1
        },
        {
          "text": "Geylang",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qy27vf",
      "subreddit": "singaporefi",
      "title": "Need advise, which bank in singapore has the most privacy",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qy27vf/need_advise_which_bank_in_singapore_has_the_most/",
      "score": 9,
      "num_comments": 85,
      "created_at": "2026-02-07T10:55:04",
      "selftext": "Anyone knows which bank in sg has the most privacy to store 7 figure balance? Specifically looking for bank accounts that have strong internal controls so random RM won’t go around sharing sensitive customer info with each other. Do not appreciate people calling just because we hit a certain tier and ask if we want to invest in their products. thanks",
      "comments": [
        {
          "text": "You have too much cash and they will definitely call. Put that cash to work and you will have too little money for them to bother with",
          "score": 81
        },
        {
          "text": "Unfortunately the big 3 \n\nWill most definitely have RM calling you up\nUnless you're into private banking like UBS",
          "score": 37
        },
        {
          "text": "Unless you are really rich, 7 figures cash is too much cash.\n\nPut them in different banks. No one entity should know your entire wealth.\n\nDon’t answer any calls with unknown numbers. What’s so difficult?",
          "score": 33
        },
        {
          "text": "I once quarreled with DBS about this. I even complained to the [Do Not Call (DNC) Registry](https://www.dnc.gov.sg/index.html). So they advised that all I needed to do is to write to the bank and tell them do not call me and they are legally obligated to stop calling me for whatever nonsense they want to sell to me.",
          "score": 28
        },
        {
          "text": "I think all banks will have a strong incentive to cross sell things to you once you have a large balance. Information shouldn't leave outside the bank of your choice, but within the bank they can review and may reach out to you. Your best bet is to review the docs that you sign and ensure you uncheck any boxes that allow the bank to freely share information internally and to contact you for marketing purposes.",
          "score": 19
        },
        {
          "text": "Just don't pick up from unknown numbers, or if you accidentally pick up, just say \"not interested, please flag internally to never call me again\"? \n\n7-figures is not that huge a number to local banks...they won't be calling you every other week to hound you if that's what you're worried about.",
          "score": 17
        },
        {
          "text": "not 100% sure, but definitely not UOB!",
          "score": 9
        },
        {
          "text": "I consolidate everything from UBS, CS into DBS after the GFC.  \nGFC scared me and you can see CS had another crisis in the recent years.\n\nSo have faith in DBS. If they toh, means Singapore toh!",
          "score": 7
        },
        {
          "text": "I keep 7 figures in my brokerage IBKR. It auto sweeps at 3%+, withdrawal takes a bit longer about 1-2 working days not including weekends. No RM call me and I put the cash to work selling far out of the money puts whilst unused cash earning sweep",
          "score": 6
        },
        {
          "text": "Advice, not advise",
          "score": 6
        },
        {
          "text": "Split into multiple banks. Or keep in ibkr. \n\nAlso note that if you want to take advantage of private banking / prestige banking then you can't complain if they call you. Banks consider giving special clients personal notification of all these special promos as a perk of that relationship.",
          "score": 5
        },
        {
          "text": "My bank, i promise i wont tell anyone else",
          "score": 5
        },
        {
          "text": "You can consider putting it in a corporate account instead. Of course that means you have to register a company, file your annual reports etc but I think you will have more privacy and less calls. 7 figure sum is big in retail banking but not in the corporate side so they will pay lesser attention to you. Also it comes with the understanding that corporate funds will have multiple stakeholders to answer to so there's no point in harassing a single decision maker.  ",
          "score": 3
        },
        {
          "text": "CPF \n\nSwiss",
          "score": 3
        },
        {
          "text": "Bank of Singapore, UBS",
          "score": 2
        },
        {
          "text": "Goldman sachs, jp Morgan, Morgan Stanley",
          "score": 2
        },
        {
          "text": "Can consider buy ssb",
          "score": 2
        },
        {
          "text": "Hint, which bank doesn’t measure ur social credit score?",
          "score": 2
        },
        {
          "text": "VP Bank",
          "score": 2
        },
        {
          "text": "Definitely not stanchart. I dont want to meet their RM, so now they block my W8 and force me to go to a branch only to wait over an hour for the RM when I am surrounded by other banking staff and no customer. To sign a form that could be done online by everywhere else.",
          "score": 2
        },
        {
          "text": "Split it up among the different banks. SDIC is only up to 100k (?) per account holder per bank anyway",
          "score": 2
        },
        {
          "text": "If it was me, I'd split the 7-figures across OCBC, SC and Investment tools (i.e. IBKR, Tiger)",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1qy4465",
      "subreddit": "singaporefi",
      "title": "Banks/platforms to use now",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qy4465/banksplatforms_to_use_now/",
      "score": 4,
      "num_comments": 5,
      "created_at": "2026-02-07T12:25:55",
      "selftext": "Hi!\n\nNow that MariBank/chocolate finance interest rates have dropped, what platforms can I use to park my savings in?\n\nI have about 25k in Mari, and 20k sgd in chocolate. 6k sgd in chocolate as well. No idea what to do with this now that the rates are constantly dropping. Where do I move my funds? \n\nS&amp;P 500? ",
      "comments": [
        {
          "text": "Very simple.  \n\nJust invest in the same funds as Chocolate and reap the full yield instead of donating to them.\n\nFunds that Chocolate used your money to invest in:\n\nhttps://www.poems.com.sg/fund-finder/fullerton-short-term-interest-rate-fd-c-543004/\nhttps://www.poems.com.sg/fund-finder/uob-united-sgd-fund-cl-a-acc-036313/\n\nThey are paying 4% to 4.5%.  Chocolate has been paying you 2% and keeping the rest for themselves.",
          "score": 16
        },
        {
          "text": "In the next 12 months? ES3.",
          "score": 2
        },
        {
          "text": "I bought D05 instead of putting my money in DBS, 4-5% dividends a year + capital growth",
          "score": 2
        },
        {
          "text": "You should not park your funds in the S&amp;P500. Its fundamentally different from whatever chocolate finance is giving.\n\nYou should instead be thinking about how to split your money, in terms of short term, medium term or long term.\n\nFor more information...\n\nhttps://www.reddit.com/r/singaporefi/s/Kb8NEI78oj",
          "score": 2
        },
        {
          "text": "CDA account",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qxdr3k",
      "subreddit": "singaporefi",
      "title": "Spending in Non-SGD: Maribank or Trustbank?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qxdr3k/spending_in_nonsgd_maribank_or_trustbank/",
      "score": 5,
      "num_comments": 20,
      "created_at": "2026-02-06T18:08:24",
      "selftext": "May I know how is everyone's experience with Trust bank &amp; Maribank's FX rates when spending overseas aka which is better?\n\nI used Maribank for an airbnb stay in 2024 and was shocked when I was charged an additional fx conversion fee, even though everything on the airbnb app is in SGD. Since then, I stopped using Maribank for overseas spending and using Trustbank instead, since Trust has better FX rates then. \n\nBut I read that Maribank's FX conversion fees are now taken away and there is an additional 1.5% cash back. I just logged into both TRUST bank &amp; Maribank apps and Trust Bank's FX rate seemed to lose out to Maribank's but it is using an average of last week while Maribank shows the current rate of the day, so its kinda hard to compare unless one spends 😅",
      "comments": [
        {
          "text": "If you're using it after march, maribank offer 1.5% cashback but trust only 0.5%.\n\n\nI doubt the exchange rate will differ by 1% so maribank should win out",
          "score": 9
        },
        {
          "text": "We do get this question once every week.",
          "score": 7
        },
        {
          "text": "If you want to compare the exchange rate, use these sites (set bank fee = 0%)\n\nMaribank (Mastercard): https://www.mastercard.com/global/en/personal/get-support/currency-exchange-rate-converter.html\n\nTrust (Visa): https://www.visa.com.sg/support/consumer/travel-support/exchange-rate-calculator.html",
          "score": 2
        },
        {
          "text": "That fee you got charged is likely a 1% DCC / cross-border fee which is levied on SGD transactions processed overseas.\n\nBasically the only credit cards in SG that don't charge DCC are Trust's cards.\n\nOtherwise I would say in my experience Mastercard on average has better FX but it's not a hands-down win.",
          "score": 2
        },
        {
          "text": "For the airbnb or Agoda type app, you must read very carefully to know if you are going to be charged in what currency. They may display the price in SGD but actually charge in a foreign currency.\n\nWith Agoda in particular, you WANT them to charge in a foreign currency and then you pay with Trust/Mari. They have this in the fine print\n\n&gt; Agoda will calculate the price for your booking using the Bloomberg Generic Composite Rate. However, after you select your Charge Currency, an additional amount up to 5% of the price (the “Additional Amount”) will be added when Charge Currency is different from Display Currency",
          "score": 1
        },
        {
          "text": "maribank - tried for transactions on same day, trust is sightly better but with the 1.5%, Mari wins. I THINK youtrip was very slightly better, but no rebate so don't bother.",
          "score": 1
        },
        {
          "text": "You are thinking very hard about a matter of a few dollars tops. Hope your hourly rate is worth it",
          "score": 1
        },
        {
          "text": "Trust Cashback is still better Maribank. If you blend the overall cashback for the preferred categories and non-preferred categories, you can easily get more than 1.5%.",
          "score": 1
        },
        {
          "text": "Mari &amp; YouTrip user here \n\nlast used both cards in Bat a few weeks ago. the Mari has no FX fee, just the local amount @ exchange rate and i get the S$ payable. No more the 1 liner about conversion fee and then another line as overseas spend rebate.\n\nYT was simple straight forward but i always worry about insufficient funds.\n\nSo, which is better?\n\nMari's exchange rate wins. By the few '00 Rp but shiok that 8 get better rates.\n\nMari has a hotline that will answer me (happened last year when i was in KL)..\n\nfor YT, have to send an email or something, then get a boiler plate reply that never answers your question directly. ask them somemore question to clarify and it will be 5 business day later to hear back, again not answering my question.\n\nlastly, Mari has 1.5% cashback on overseas spent. sure do, any side income is welcomed as helps my monthly bill payment 🥳",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qxm44m",
      "subreddit": "singaporefi",
      "title": "Surrendering ILP After Full Maturity",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qxm44m/surrendering_ilp_after_full_maturity/",
      "score": 3,
      "num_comments": 7,
      "created_at": "2026-02-07T00:21:56",
      "selftext": "Over a decade ago, I got the Investment Linked Policy (ILP) AIA Achiever Plus Accumulator. I see now that it has reached maturity and can be surrendered without any significant penalty.\n\n  \nHow do I go about doing so? I can see on aiaplus that there is no penalty for surrendering, yet there is no option to surrender the policy on the site. \n\n  \nAny advice is appreciated. I got this policy as a very young adult and did not really consider whether it would ultimately be lucrative. Thank you.",
      "comments": [
        {
          "text": "Err - go find the agent listed on the policy in myaia . Call him/her. Reddit is the worst place to ask for specific product terms.",
          "score": 7
        },
        {
          "text": "Your agent will try to \"upgrade\" you to a new ILP.\n\nJust cash out and walk away.",
          "score": 2
        },
        {
          "text": "if there is aia helpline you can also call them. they will find the agent responsible currently",
          "score": 1
        },
        {
          "text": "Check with AIA directly",
          "score": 1
        },
        {
          "text": "This isn’t something you can do through the app. Must go through agent, or if you lost contact, email/call AIA HQ.",
          "score": 1
        },
        {
          "text": "You will have to fill up a form to surrender it.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qy7fe5",
      "subreddit": "singaporefi",
      "title": "Anyone here holding an old endowment / life policy they’re thinking of giving up?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qy7fe5/anyone_here_holding_an_old_endowment_life_policy/",
      "score": 1,
      "num_comments": 1,
      "created_at": "2026-02-07T15:22:12",
      "selftext": "Hey all,\n\nI’m exploring the secondary market for endowment and whole life insurance policies, basically buying policies from people who no longer want to keep them, instead of them surrendering to the insurer for a lower value.\n\nI was just wondering if anyone\n\n\\-Has an old endowment or whole life policy they’re planning to surrender\n\n\\-Or has looked into selling one before and found the process confusing or opaque\n\nThe idea (in simple terms) is that sometimes a third party can pay more than the surrender value, take over the premiums, and hold the policy to maturity. Not always suitable, but can make sense in some cases.\n\nHappy to just chat, answer questions, or hear concerns. If you’d rather not share details publicly, feel free to PM me. And if this post isn’t appropriate here, mods feel free to remove.\n\nAppreciate any thoughts or experiences.",
      "comments": [
        {
          "text": "There are quite a few big resellers for resale endowments. If you want to buy, you can go google.",
          "score": 4
        }
      ]
    },
    {
      "id": "t3_1qy34hl",
      "subreddit": "singaporefi",
      "title": "GXS down?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qy34hl/gxs_down/",
      "score": 1,
      "num_comments": 6,
      "created_at": "2026-02-07T11:37:38",
      "selftext": "Is GXS down for anyone else?\n\nI’m getting constant error Something went wrong. Please try again later.\n\nEdit:\n\nError occurred even after using singpass, face recognition &amp; correct PIN.\n\nGot it to work after i reinstalled the app, reset my PIN and use the new PIN. No idea why…",
      "comments": [
        {
          "text": "My GXS account cannot login since 2 weeks ago",
          "score": 3
        },
        {
          "text": "Just tried - works for me though. Hope you get it resolved soon!",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qxg14s",
      "subreddit": "singaporefi",
      "title": "Should I switch from VXUS to EXUS.LN?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qxg14s/should_i_switch_from_vxus_to_exusln/",
      "score": 1,
      "num_comments": 2,
      "created_at": "2026-02-06T20:15:53",
      "selftext": "Im a sg pr and have invested 5k usd in VXUS. Should I switch from VXUS to EXUS.LN? Are there any better alternatives to VXUS that are UCITS? This is because I found out about the 40% US estate tax, and I want to avoid it as much as possible.",
      "comments": [
        {
          "text": "Yes swap to EXUS.L and EIMI.L to avoid estate tax.",
          "score": 3
        },
        {
          "text": "The 40% estate tax isn't your main concern right now, since 5K USD right now is still significantly under the 60K estate tax threshold. Your bigger concern should be the 30% dividend withholding tax that you are hit with for US-listed ETFs, even though all the dividends come from ex-US stocks. Switch to the UCITS ETF and your dividend withholding tax drops dramatically, especially since EXUS doesn't hold any US stocks and thus is unaffected by any US dividend withholding tax.",
          "score": 2
        }
      ]
    }
  ]
}