{
  "schema_version": "raw_scrape_v1",
  "report_id": "2026-01-28",
  "scraped_at": "2026-01-28T15:04:07.652007",
  "subreddits": [
    "singapore",
    "askSingapore",
    "SingaporeRaw",
    "singaporefi"
  ],
  "total_posts": 40,
  "total_comments": 803,
  "posts": [
    {
      "id": "t3_1qocjhh",
      "subreddit": "singapore",
      "title": "'I take full responsibility': Melvin Lim's name removed from PropertyLimBrothers' website amid alleged affair with colleague",
      "url": "https://old.reddit.com/r/singapore/comments/1qocjhh/i_take_full_responsibility_melvin_lims_name/",
      "score": 706,
      "num_comments": 237,
      "created_at": "2026-01-27T20:30:26",
      "selftext": "",
      "comments": [
        {
          "text": "She is ‘apparently’ an influencer and is married… As if the whole of Singapore don’t know everything about both of them by now",
          "score": 696
        },
        {
          "text": "Married since last sept... Pity the hubby...",
          "score": 338
        },
        {
          "text": "Well apparently the affair has been going on for 2 years already, many people suspect the husband already knows and allows it",
          "score": 276
        },
        {
          "text": "I also got tea, this isn't the first time she cheated on the same husband who was then a boyfriend.",
          "score": 244
        },
        {
          "text": "There was a reason she had a teaching scholarship at MOE but abruptly left. ;) is all I'm going to say. Hearsay ah not factual ~ she was already with her now husband at that time (if you see her fb she said she 'waited 7 years' to marry him lmao)",
          "score": 189
        },
        {
          "text": "From the intel who leopard crawled to collect info for Reddit and this intel definitely remembered to switch off the ringtone during mission.",
          "score": 144
        },
        {
          "text": "read from somewhere her salary is 230k .. so .... take that as you will ..",
          "score": 85
        },
        {
          "text": "Bro spill more",
          "score": 82
        },
        {
          "text": "I don’t think the husband allows it but probably suspected but had no evidence + holding on to the r/s",
          "score": 78
        },
        {
          "text": "People goes to BTO for money reasons, \"you go and fuck the guy and we split the salary\" isn't that far?",
          "score": 66
        },
        {
          "text": "This tea come from where.. the 2y one",
          "score": 63
        },
        {
          "text": "Maybe the husband also agree lei? Her pay jump by jumping on boss is a lot lei. Who can earn so much, so fast? The hubby maybe sian ah, now cannot let wife jumping jumping for higher pay liao",
          "score": 58
        },
        {
          "text": "Wah spill more",
          "score": 46
        },
        {
          "text": "Maybe it's the husband's kink 🤯",
          "score": 42
        },
        {
          "text": "Wa maybe hor! \"BB just tahan a few more years ok. After that we can be millionaires too!\"",
          "score": 36
        },
        {
          "text": "If this is true, bro is not beating cuck allegations no matter how bad ppl feel for him",
          "score": 35
        },
        {
          "text": "Something tells me he is aware of her shenanigans. Might even be complicit in that kind of lifestyle. I'm not one to judge though.",
          "score": 29
        },
        {
          "text": "Pass the cuck chair please",
          "score": 28
        },
        {
          "text": "Affair with a married teacher colleague :))) resulting in her sudden termination",
          "score": 18
        },
        {
          "text": "Perhaps the husband has a cuckhold fetish lol",
          "score": 15
        },
        {
          "text": "What a fucking wrecking ball",
          "score": 10
        },
        {
          "text": "but they bought a resale at Marine Parade lol",
          "score": 9
        }
      ]
    },
    {
      "id": "t3_1pezo88",
      "subreddit": "u_herodevs",
      "title": "Why did Angular go years without CVEs, then three in two weeks?",
      "url": "https://old.reddit.com/user/herodevs/comments/1pezo88/why_did_angular_go_years_without_cves_then_three/",
      "score": 34,
      "num_comments": 0,
      "created_at": "2025-12-06T00:33:45",
      "selftext": "",
      "comments": []
    },
    {
      "id": "t3_1qo76ka",
      "subreddit": "singapore",
      "title": "Interesting Google review left on PLB page just before the saga surfaced",
      "url": "https://old.reddit.com/r/singapore/comments/1qo76ka/interesting_google_review_left_on_plb_page_just/",
      "score": 650,
      "num_comments": 51,
      "created_at": "2026-01-27T15:25:13",
      "selftext": "",
      "comments": [
        {
          "text": "he was so pissed that he willed the entire saga into existence through sheer will",
          "score": 412
        },
        {
          "text": "I guess we gonna have another career coach or some business speaker very soon",
          "score": 339
        },
        {
          "text": "In the Light of this, definitely take this with a pinch of Salt.",
          "score": 330
        },
        {
          "text": "Dude thinks he can hold an entire industry hostage?",
          "score": 302
        },
        {
          "text": "I think we should all take this with a pinch of salt. I mean if you go to the Google Reviews of \"Babyhotpot\" now, you're gonna see some very interesting \"reviews\" that were left in the last 24hours. Edit: just to be clear, I meant take this google review with a pinch of salt, not the affair.",
          "score": 168
        },
        {
          "text": "Sprayed pheromones in the office Sent reservist videos to cameraman #2 to revise his leopard crawl",
          "score": 130
        },
        {
          "text": "Melvin and Marc have already been trying to spin themselves as biz experts, and selling courses.",
          "score": 110
        },
        {
          "text": "It has long been over saturated",
          "score": 80
        },
        {
          "text": "the office unit beside PLB also dealing with property leh since they discussing about land transformation at WDL as ML was locking his unit.",
          "score": 63
        },
        {
          "text": "Embarrassing at this point. Does PLB have any legal grounds on the leaker?",
          "score": 60
        },
        {
          "text": "Is this a sign that the property industry is oversaturated?",
          "score": 53
        },
        {
          "text": "Ba dum tsh. I see what you did there.",
          "score": 32
        },
        {
          "text": "He forgot to send reminder to mute the phone tho",
          "score": 29
        },
        {
          "text": "Main character energy ahh 😂",
          "score": 28
        },
        {
          "text": "Yeah it's a building where many real estate companies have their offices at. Propnex was adjacent to PLB",
          "score": 27
        },
        {
          "text": "nah he'd win",
          "score": 18
        },
        {
          "text": "Singapore has a green lantern ah siao liao siao liao",
          "score": 15
        },
        {
          "text": "I once remembered that he decimated three property companies....with a google review....with a fking....review",
          "score": 14
        },
        {
          "text": "ahhaha touche!",
          "score": 10
        },
        {
          "text": "MANIFEST!",
          "score": 8
        },
        {
          "text": "This video was already circulating for a couple of days, maybe like Thursday it got viral among other agents, only hit the public space on Sunday night",
          "score": 4
        },
        {
          "text": "mute the phone then cannot hear the screamssssss?",
          "score": 3
        },
        {
          "text": "Hotpot with a pinch of salt is very tasty",
          "score": 2
        },
        {
          "text": "Just 10% of the industry",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qozqs8",
      "subreddit": "singapore",
      "title": "Woman charged with spitting water while on a train, remanded at IMH",
      "url": "https://old.reddit.com/r/singapore/comments/1qozqs8/woman_charged_with_spitting_water_while_on_a/",
      "score": 330,
      "num_comments": 133,
      "created_at": "2026-01-28T11:13:00",
      "selftext": "",
      "comments": [
        {
          "text": "She’s fucking 37????!!!!",
          "score": 344
        },
        {
          "text": "Wild Wild Wet resurgence",
          "score": 161
        },
        {
          "text": "Life have not been kind to her lol",
          "score": 112
        },
        {
          "text": "Good grief. If I looked like that at 37 I too would be mad!",
          "score": 85
        },
        {
          "text": "I’m 40, and I thought she’s my mother generation",
          "score": 77
        },
        {
          "text": "1937…",
          "score": 34
        },
        {
          "text": "Looks like 59.",
          "score": 23
        },
        {
          "text": "Hate ages people up badly. Also meth...",
          "score": 19
        },
        {
          "text": "Expedite her admission to IMH for treatment for her mental condition, might be blessing in disguise.",
          "score": 12
        },
        {
          "text": "She’s 37?!",
          "score": 11
        },
        {
          "text": "broooooooooooooooooooooooo she looks 50",
          "score": 11
        },
        {
          "text": "I am 37.. and she looks like she can be my mother. WHAT??!!! ",
          "score": 11
        },
        {
          "text": "Mental stress can do that to you.",
          "score": 10
        },
        {
          "text": "Im in my 40s and if I have to greet her, I will call her auntie assuming she is my senior....",
          "score": 7
        },
        {
          "text": "The only reason I went to read the article was cause of the age... Like, I'm 44 and she looks waaaaaay older than me.",
          "score": 5
        },
        {
          "text": "obviously people who have mental issues, and I mean real mental issues normally looks a bit different.",
          "score": 3
        },
        {
          "text": "Looks like 73 lol",
          "score": 2
        },
        {
          "text": "Omg I thought she is 60s",
          "score": 2
        },
        {
          "text": "Some people's children.",
          "score": 2
        },
        {
          "text": "Apparently. Looked 60 to me.",
          "score": 0
        },
        {
          "text": "Meth wont end up so round. \nSo just pure hate.",
          "score": 0
        },
        {
          "text": "Who are the unlucky 37 people???? Must they be tested for any viruses???!",
          "score": 0
        },
        {
          "text": "Is that a typo?If it said 73, it'd be plausible.",
          "score": 0
        },
        {
          "text": "What happens when you let yourself go.",
          "score": 0
        },
        {
          "text": "No cooking equipment or energy to cook meal in kitchen, cooked food are expensive outside now, eat tibits from value shops for 3 meals everyday.",
          "score": -2
        }
      ]
    },
    {
      "id": "t3_1qofw4w",
      "subreddit": "singapore",
      "title": "Family of late S’pore primary school teacher of 50 years hope ex-students can attend wake (Yang Zheng Primary School and Greenridge Primary School)",
      "url": "https://old.reddit.com/r/singapore/comments/1qofw4w/family_of_late_spore_primary_school_teacher_of_50/",
      "score": 190,
      "num_comments": 16,
      "created_at": "2026-01-27T22:50:20",
      "selftext": "",
      "comments": [
        {
          "text": "“Up until her retirement in 2021, she had never taken a single day of leave or medical leave” 🤯",
          "score": 78
        },
        {
          "text": "This grand-niece Yin needs to stop with the glorification of stoicism and the never taking sick or annual leave drivel. For example, complaining, particularly about enduring illness and treatments would have in no way detracted from her contributions to the schools she taught in and her students!",
          "score": 71
        },
        {
          "text": "Was a Yang Zheng alumni, attended primary school there in the 90s. Didn't know of a Ms Peh, but I recall a Annie Chan who was also quite well liked by students. But there were also teachers that the world would do better without. A certain Molly Chan comes to mind.",
          "score": 42
        },
        {
          "text": "RIP",
          "score": 31
        },
        {
          "text": "Teachers still sometimes have to work during the school holidays",
          "score": 15
        },
        {
          "text": "Graduated in 2020. Annie Chan was my Green Club TIC and my P3 and 4 science teacher. She was indeed a wonderful teacher",
          "score": 11
        },
        {
          "text": "For every teacher that is revered, there are several more that should not be teaching.",
          "score": 7
        },
        {
          "text": "RIP",
          "score": 6
        },
        {
          "text": "Let's not make 'Not taking Leave or MC' a good thing now. If my memory serves me, a bunch of preschool staff were roasted in this forum because they didn't take mc during the beginning of the Covid period.",
          "score": 5
        },
        {
          "text": "I presume she just got her days off during school holidays?",
          "score": 3
        },
        {
          "text": "\"Once a Scout, Always a Scout\" Rest in Peace fellow Scout",
          "score": 2
        },
        {
          "text": "Sometimes?",
          "score": 1
        },
        {
          "text": "Ya lah but it’s sensible to assume she also took some days off",
          "score": 1
        },
        {
          "text": "I remember Annie Chan, graduated in 2014.",
          "score": 1
        },
        {
          "text": "Mrs chan my goat, she wrote me a letter when I graduated. It was really sweet of her",
          "score": 1
        },
        {
          "text": "Another teacher that everyone hates (at least in my class), we address her as mrs E (dk the exact spelling but we pronounced it as the letter 'e')",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qobwi7",
      "subreddit": "singapore",
      "title": "Restoration of bus arrival timing system delayed to 'early next week' after another 1,000 buses found with issues",
      "url": "https://old.reddit.com/r/singapore/comments/1qobwi7/restoration_of_bus_arrival_timing_system_delayed/",
      "score": 160,
      "num_comments": 55,
      "created_at": "2026-01-27T19:59:38",
      "selftext": "",
      "comments": [
        {
          "text": "Let'a launch another investigation into Pritam. That'll solve it.",
          "score": 229
        },
        {
          "text": "Lol no wonder timing say 20 mins end up I turn behind bus come liao. Been a while since I did a shuttle run start.",
          "score": 133
        },
        {
          "text": "What the hell. Just watch and see how many other issues will surface as time passes, due to upkeep lapses. I’m also noticing that without the bus arrival timings, the actual bus arrival intervals are quite off as well. Or is it just me?",
          "score": 75
        },
        {
          "text": "LTA will blame vendor for missing their SLA Standard play card",
          "score": 51
        },
        {
          "text": "I think have to do with some drivers not respecting the schedule and just going as quickly as they can. Plus LTA not prioritizing public transport on the roads, making traffic more efficient for car owners but less predictable for buses",
          "score": 47
        },
        {
          "text": "this happened to me too. ive grown to not chk the arrival times anymore and jus trust my gut feeling",
          "score": 26
        },
        {
          "text": "The vendor also knows that willingness to take blame is essential for getting contract.",
          "score": 24
        },
        {
          "text": "It could be just you. Their scheduling uses a different system (Trapeze CFMS) as compared to the NextBus arrival system (should be part of this thing called the NOBE). But then traffic nowadays is quite bad too, and the non discretionary turns, in my opinion, makes bus scheduling worse because of increased variance (buses wait longer for a green light, and that X the number of traffic lights encountered during the route makes the variance quite significant)",
          "score": 16
        },
        {
          "text": "atp ban cars for useless rich people 😒",
          "score": 11
        },
        {
          "text": "Pritam must have lied about the buses being on time too.",
          "score": 10
        },
        {
          "text": "Singapore is learning from Trump. Majority is asking for Epstein list to be released in US. But Trump is winning on Venezuela and Israel. Now nobody is talking about Epstein.",
          "score": 9
        },
        {
          "text": "Surely if we spend more time talking about LOTO in Parliament with the NMPs the bus timing issue will go away on its own",
          "score": 8
        },
        {
          "text": "No accountability mah",
          "score": 7
        },
        {
          "text": "I have already listed \"chasing for the bus\" as my official hobby. Another week, I think this hobby can be as trendy as pickleball.",
          "score": 3
        },
        {
          "text": "close down open new one. Pro biz Singapore will sarpork",
          "score": 3
        },
        {
          "text": "The info is still correct. Technically speaking, while NOBE provides info to ETA, ETA is a separate system that is not part of NOBE.",
          "score": 2
        },
        {
          "text": "I do not think so, since the bus schedule/frequency is controlled by the Fleet Management System (FMS) and their Operations Control Center (OCC).",
          "score": 2
        },
        {
          "text": "Bunch of Phoenix in the worst sense of the word - burn it down by bad decisions while extracting max cash, born again to repeat.",
          "score": 2
        },
        {
          "text": "NextBus arrival system is not part of NOBE. NOBE handles fare collection.",
          "score": 1
        },
        {
          "text": "Hmm I got the info from here, maybe LTG is outdated then: “Apart from managing fare collection through cash or contactless cards, NOBE data is used to provide bus arrival times and approximate passenger loading onboard each bus. This information is accessible to the public through various applications, such as MyTransport.SG mobile app, and also made available to third-party applications via LTA Datamall.” https://landtransportguru.net/new-onboard-bus-equipment/",
          "score": 1
        },
        {
          "text": "So in conclusion do you think that the current system issue is affecting the actual bus schedule/frequency?",
          "score": 1
        },
        {
          "text": "How off are the arrival intervals? Like instead of every 10 min, it becomes 14min, 12min etc?",
          "score": 1
        },
        {
          "text": "Not sure, my feeder bus timings are way off from before, usually my buses (for about 2 years) are not very full but a few days recently it has been filled to the brim sometimes. I suspect it is because the frequency has been thrown off.",
          "score": 1
        },
        {
          "text": "Were buses running this late before pritam covered for raesah? It’s clearly his misdeeds that triggered the butterfly effect 😢",
          "score": 1
        },
        {
          "text": "Jeffrey gonna get a pay rise soon. You think he care?",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qp3f02",
      "subreddit": "singapore",
      "title": "Singaporean boy who recreated ISIS attacks, executions in Roblox and Gorebox gets restriction order",
      "url": "https://old.reddit.com/r/singapore/comments/1qp3f02/singaporean_boy_who_recreated_isis_attacks/",
      "score": 139,
      "num_comments": 35,
      "created_at": "2026-01-28T14:11:15",
      "selftext": "",
      "comments": [
        {
          "text": "While his family members and friends were aware of his extremist views and support for ISIS, none of them reported him to authorities, said ISD.",
          "score": 0
        },
        {
          "text": "His whole family are on our watch",
          "score": 0
        },
        {
          "text": "Put all his frends and family on watch now.\nThose that knew but did nothing.",
          "score": 0
        },
        {
          "text": "Put the entire fucking family on watch also",
          "score": 0
        },
        {
          "text": "If he had played Counter-Strike instead, would the situation be different?",
          "score": 0
        },
        {
          "text": "\"Bro why you keep choosing terrorist?\"",
          "score": 0
        },
        {
          "text": "\"Bro pass me the bomb, i'll plant.\"",
          "score": 0
        },
        {
          "text": "\"Bro why you keep friendly fire me? We are counter-terrorist\"",
          "score": 0
        },
        {
          "text": "If counter strike was about shooting unarmed civilians execution-style, then no. But this is obviously not a competitive shooter with a terrorism theme. There’s nothing wrong with war/conflict games themselves, it’s the intent. Nobody is going to care if you blow up 100 aliens on a hypothetical future mars colony as doomguy. But it’s completely different if you change the narrative to a current conflict and shoot people representative of current victims.",
          "score": 0
        },
        {
          "text": "I sees what you did there.",
          "score": 0
        },
        {
          "text": "Will he serve National Service under the Restriction Order? If not GGWP",
          "score": 0
        },
        {
          "text": "He will, but prolly limited to desk jobs in low key unit with minimal security clearance.",
          "score": 0
        },
        {
          "text": "SCDF enters the chat",
          "score": 0
        },
        {
          "text": "Social media for kids a fking mistake...algos just out there trying to maximise your screen time on the platform...omg we are so fking screwed",
          "score": 0
        },
        {
          "text": "To prepare, he practised close-quarter battle simulations at home for up to two hours daily with a toy AK-47 rifle, role-playing as an ISIS fighter attacking the United States Army or Israel Defense Forces, whom he considered enemies of the group. The parents should be getting restriction orders instead.",
          "score": 0
        },
        {
          "text": "Parents never step in to restrict access to Roblox or even limit social media usage? Sad to see someone getting exposed to stuff when he was 12",
          "score": 0
        },
        {
          "text": "What happens if a Singaporean really travels overseas and joins isis? Do we revoke their citizenship?",
          "score": 0
        },
        {
          "text": "They should...why would we want these jokers back even if they survive",
          "score": 0
        },
        {
          "text": "There were already some that tried. Iirc they were jailed by ISA.",
          "score": 0
        },
        {
          "text": "Investigate his entire family too, they’re complicit in this",
          "score": 0
        },
        {
          "text": "These are the real and serious problems that demand the government and entire nation's attention, not a property agent fucking his lover.",
          "score": 0
        },
        {
          "text": "What am i supposed to do if i keep thinking about the guy outside the room lying down in prone position trying to film those 2 having sex",
          "score": 0
        },
        {
          "text": "Join Propnex and you can sit in their office whole day long lol",
          "score": 0
        },
        {
          "text": "dont think real estate is my calling",
          "score": 0
        },
        {
          "text": "These aren’t mutually exclusive",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qow6kd",
      "subreddit": "singapore",
      "title": "Forum: Traffic marshals adding to congestion caused by Circle Line upgrading",
      "url": "https://old.reddit.com/r/singapore/comments/1qow6kd/forum_traffic_marshals_adding_to_congestion/",
      "score": 123,
      "num_comments": 57,
      "created_at": "2026-01-28T08:40:40",
      "selftext": "",
      "comments": [
        {
          "text": "LOL can imagine those lao uncle auntie marshals, end up just stand there din dei",
          "score": 114
        },
        {
          "text": "Whats more annoying to me is the additional walking to access the mrt platform at serangoon and bishan via the longer way through a narrow stretch",
          "score": 60
        },
        {
          "text": "They have to cover all the bases, pun not intended. If anything happened without marshals there, then their ass becomes roasted. It's like fire extinguishers. Most of the time they are there as decoration and nobody uses them. Until you suddenly need them, then if you don't have them, the government cooks your ass nicely. Just think of those very free marshals as \"fire extinguishers\". They are there to make sure that 1- if anything happens, there is at least minimum control and 2- to insure that their bosses asses remain nicely uncooked.",
          "score": 46
        },
        {
          "text": "Not really, I take the Mountbatten CCL train which is the smack dab in the middle of the restructuring The uncles and aunties are the ones doing the crowd management, shouting which directions to go/how to change for the next train The younger ones usually stand around, but they assist where they can ofc generally, the aunties/uncles make small talk and try to help the younger staff also, which i find the dynamics q cute tbh",
          "score": 41
        },
        {
          "text": "The people who comment like this about not needing marshal at less crowded MRT stations probably have never had to handle any kind of service disruption or plan for something similar in their life",
          "score": 38
        },
        {
          "text": "Shoutout to the marshal at Botanics though, love his live commentary.",
          "score": 36
        },
        {
          "text": "It's to slow down the crowd so that they don't all end up in the same area at the same time",
          "score": 36
        },
        {
          "text": "Damned right. Don't deploy marshals, kenna complain why never do enough to guide confused commuters. Deploy marshals, oso kenna complain, do too much, confuse commuters. Truly, we are complain kings. Can't win no matter what we do.",
          "score": 34
        },
        {
          "text": "And I don't understand why they would deploy marshals at non crowded stations such as Bartley or Lorong Chuan. Those marshals deployed there basically just keep walking back and forth on the train platform for the entire shift",
          "score": 30
        },
        {
          "text": "The people who planned all this don’t even ride the MRT.",
          "score": 26
        },
        {
          "text": "The letter writer observed it is the younger marshals who tend to represent a greater waste of space.",
          "score": 23
        },
        {
          "text": "i stay at bartley- tbf the marshals are needed to guide commuters to the shuttle bus services running to and along the affected circle line stations as well",
          "score": 16
        },
        {
          "text": "slow down the crowd so that they don't all end up in the same area at the same time proceeds to force people into a narrow stretch so they end up in the same area at the same time. even if crowd control is needed in this way, it's annoying that the barriers are there even during non-peak periods instead of only during peak periods. forces people to walk a longer distance even when it's unnecessary.",
          "score": 15
        },
        {
          "text": "Don't deploy KBKP say never think about users",
          "score": 13
        },
        {
          "text": "Hahaha i was at botanic 1 day and he said smth along the lines of \"guys if you want to board the train please head to the front and back doors because we can only fit 3 people in the middle so its quite pathetic\" Lmao-ed when i heard that, added more fun to the peak commute",
          "score": 11
        },
        {
          "text": "Yeah its definitely something that should be adjustable. I believe most of us when we walk the crowded stretch above the platform only to look down on trains that are not as packed because fewer people can get on the platform at the same time. The solution therefore is the marshalls there should and have been crowd control to allow normal access and adjust to the current set up when there's a surge.",
          "score": 7
        },
        {
          "text": "It acts as a floor area extension to the platform area. I think it’s really effective, crowding at the platform is far less than when a train breakdown occurs.",
          "score": 5
        },
        {
          "text": "I was at Bishan early this morning. Some of the marshals just standing down there & using their phones. Easy life. Don’t need to say anything, all done by recorder",
          "score": 5
        },
        {
          "text": "Oh what kind of live commentary does he do?",
          "score": 3
        },
        {
          "text": "I don’t know about being there throughout the day, it’s gone during evening peak hours even on the first day.",
          "score": 3
        },
        {
          "text": "when I was at one of these stations in the early morning (non-peak, before 7am) a few days ago, I had to take a long walk around and deal with an oppressive number of barricades, since they had made it such that only one set of escalators took passengers off the platform (instead of both sets which is the usual practice). my comment was based on that experience, though I could be wrong.",
          "score": 3
        },
        {
          "text": "I suspect they set it up as soon as the station opens and then take them down once the morning rush hour ends.",
          "score": 1
        },
        {
          "text": "Crowd control and walking a few more metres is better than a potential stampede. I assure you if a stampede were to happen in Singapore it will first happen at Serangoon mrt.",
          "score": 1
        },
        {
          "text": "Damn annoying ",
          "score": 1
        },
        {
          "text": "Well they could deploy those marshals at stations which have higher usage, Bartley and Lorong Chuan don't need those marshals",
          "score": -9
        }
      ]
    },
    {
      "id": "t3_1qodgky",
      "subreddit": "singapore",
      "title": "Court rejects appeal by man who refused to accept divorce, noting 'perfectly timed' heart problems",
      "url": "https://old.reddit.com/r/singapore/comments/1qodgky/court_rejects_appeal_by_man_who_refused_to_accept/",
      "score": 102,
      "num_comments": 22,
      "created_at": "2026-01-27T21:12:20",
      "selftext": "",
      "comments": [
        {
          "text": "\"The appellant may have a weak heart, but it stoutly persisted in perfectly timed failures - nine times - either on the eve of court proceedings or on the day of the proceedings itself; and even once in the midst of a hearing when it appeared that the proceedings were not going his way,\" said Justice Choo. What an eloquent way of calling out bullshit lol",
          "score": 129
        },
        {
          "text": "Imagine if you are married for only 4 months and your wife is cheating on you Oddly specific",
          "score": 78
        },
        {
          "text": "SG’s marriage laws are just wtffffff? Imagine if you are married for only 4 months and your wife is cheating on you. Want annul, also not allowed. Want divorce, have to wait 3 years.",
          "score": 54
        },
        {
          "text": "Man, that was a seriously infuriating read",
          "score": 48
        },
        {
          "text": "That woman should have been granted an immediate divorce - anything else is a failure of Singapore's divorce laws.",
          "score": 39
        },
        {
          "text": "Abit bizzare (to me) that u can be married for 10 years no big issues then all of a sudden u start whacking your spouse, doing crazy things, claiming infidelity and going wayyyy above and beyond (I mean who would logically think that having 10 'heart failures' is the best way) to impede the divorce / make life difficult for someone. Dude needs to get his head check fr.",
          "score": 32
        },
        {
          "text": "Justice Choo has a way with words. If you enjoyed that, can search up more of his judgments lol",
          "score": 30
        },
        {
          "text": "100%. It is ridiculous than well into the 21st century people is not allowed to divorce without any reason at any time. Singapore lawmakers seems to have gone back to 1950s as inspiration...",
          "score": 18
        },
        {
          "text": "That was hilarious. Lol.",
          "score": 16
        },
        {
          "text": "Woah man…. U are right",
          "score": 9
        },
        {
          "text": "The man's doctor whenever he saw him: \"Ah, shit, here we go again...\"",
          "score": 8
        },
        {
          "text": "A very wise judge",
          "score": 6
        },
        {
          "text": "Possibly micro stroke and personality changss",
          "score": 5
        },
        {
          "text": "Divorce is the antithesis to the government's plan to raise the TFR mah, they would rather have people stick to failing marriages and hope that they keep on having fix-it babies 🤷🏻‍♂️ True story: when my mother caught my father cheating, they went for marriage counselling at a government/government-adjacent counselling centre, and the counsellor told my mother to suck it up, forgive and forget, she shouldn't \"obsess\" over the cheating LMAO",
          "score": 5
        },
        {
          "text": "I feel like when there’s at least one party that’s clearly full of shit, it really sets Justice Choo’s pen on fire lmao. There’re some judgments that he clearly had a lot of fun writing. (I’m not complaining, they make for entertaining reads and he gets his point across very succinctly. The artistic flair doesn’t compromise the quality of the work product.)",
          "score": 4
        },
        {
          "text": "Ask the counselor for the contact of the spouse. Hire a sex worker to do it in front of him or her. See how quick they are to forgive and tell them to suck it up if they can't.",
          "score": 3
        },
        {
          "text": "You can be fired without reason. You cannot divorce without reason. Solution? Don't get Married, hire a wife.",
          "score": 1
        },
        {
          "text": "SG has already legalised divorce by mutual agreement in 2024 and that is the most progressive it can be any easier divorce, would actually be regressive for most of history, making divorce harder is actuallyprogressive, it makes it harder for the stronger party in the relationship to abandon the weaker party they dont make it easy for some rich dude to sukasuka divorce their spouse the moment they got sick",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qoudwf",
      "subreddit": "singapore",
      "title": "The Asian Civilisations Museum will soon have a tea-themed exhibition and Chagee pop-up store with exclusive merch",
      "url": "https://old.reddit.com/r/singapore/comments/1qoudwf/the_asian_civilisations_museum_will_soon_have_a/",
      "score": 80,
      "num_comments": 54,
      "created_at": "2026-01-28T07:27:32",
      "selftext": "",
      "comments": [
        {
          "text": "Civilisation is now capitalism, how apt.",
          "score": 87
        },
        {
          "text": "Oh you mean the Asian Capitalism Museum then?",
          "score": 83
        },
        {
          "text": "And this happened without a single-person raising the issue of how tone-deaf it is. I mean Chagee is from China, which has a rich history of tea production, but this is like having a Delifrance pop-up at an exhibition about Jeanne d'Arc.",
          "score": 75
        },
        {
          "text": "Singapore not beating the allegations that our only history is capitalism.",
          "score": 52
        },
        {
          "text": "I'm willing to bet Chagee offered a very very lucrative sponsorship  deal on this one.",
          "score": 50
        },
        {
          "text": "I mean without capitalism, Singapore wouldn’t exist. We were founded as a trading port.",
          "score": 39
        },
        {
          "text": "Are you really this upset about commercial collab for museum or is this just “ah thiong bad”",
          "score": 22
        },
        {
          "text": "In the end this collaboration will bring -people that otherwise might never attended such events -expertise and material from China to have a better exhibition -probably some money Literally everything a museum might want. I known there are those who snob changee for some reason but from the practical point of view no one really can complain about this.",
          "score": 22
        },
        {
          "text": "100% agree. Trade is what we are known for. But this is some bonus stage of capitalism when the official singapore tourism board has approved this showcase at the Asian Civilisations Museum. If it was just the history of tea then sure. But this is THE Museum exploring the history & cultures of Asia & their shaping of contemporary Singapore bending over for a PRC pop up selling merch and toys.",
          "score": 18
        },
        {
          "text": "Too many \"it's just business\" rationalizations being used in all facets of life.",
          "score": 13
        },
        {
          "text": "Lets double it. ASIAN CAPITALISM MUSEUM you say?",
          "score": 12
        },
        {
          "text": "For sure, exhibition space isn't cheap and this one runs for months.",
          "score": 12
        },
        {
          "text": "fully agreed, if it brings more ppl to ACM then so be it i wonder how many ppl complaining about this here have been to acm or even any museum in sg",
          "score": 12
        },
        {
          "text": "They did have an Impressionism exhibition with a Pierre Herme pop up…",
          "score": 11
        },
        {
          "text": "It's a joint collab, with their name and logo on the banner. Listed as organisers. It's written in the article and on the official site. https://www.nhb.gov.sg/acm/whats-on/exhibitions/garden-of-senses",
          "score": 9
        },
        {
          "text": "When was it not besides a very ambitious period in like the early to mid 1900s",
          "score": 8
        },
        {
          "text": "Is it though? Tea production is nowhere as “serious” as Jeanne d’Arc is it? More like Delifrance pop-up at and exhibition about croissant croissant",
          "score": 8
        },
        {
          "text": "Chagee actually sell tea though",
          "score": 5
        },
        {
          "text": "hardly a new or uncommon practice in the industry even the Louvre collabed with uniqlo",
          "score": 4
        },
        {
          "text": "But this is THE Museum exploring the history & cultures of Asia & their shaping of contemporary Singapore bending over for a PRC pop up selling merch and toys. Huh wow I didn't know china is not part of asia, milk tea is not known to comtemporary singapore and chagee doesn't sell tea lol Seriously though considering the current popularity of chagee, STB found the right sponsor for this. ACM is already a musem with one of the least footfall due to its niche focus and this event will help to draw attention to it. Otherwise when was the last time you thought about ACM?",
          "score": 4
        },
        {
          "text": "Always has been",
          "score": 2
        },
        {
          "text": "Yes. That is Singapore’s history.",
          "score": 2
        },
        {
          "text": "I don't think this has to be approved by STB. Just a dumb NHB decision.",
          "score": 1
        },
        {
          "text": "Hey this is just the most recent wave of Chinese goods coming to Singapore... Along the lines of a long history of Chinese companies setting up shop here.",
          "score": 1
        },
        {
          "text": "Man. So dumb.",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qomh8z",
      "subreddit": "askSingapore",
      "title": "Parents threaten to disown me if I solo travel.",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qomh8z/parents_threaten_to_disown_me_if_i_solo_travel/",
      "score": 167,
      "num_comments": 144,
      "created_at": "2026-01-28T02:41:12",
      "selftext": "I’m turning 19M this year and I brought up the fact that I want to solo travel to Japan for 10 days. They were displeased with the fact that I want to go alone. They say that they are unable to protect me if I’m overseas and only allow me to go after 21. They even threatened to disown me if I did. I was obviously devastated because my father has always encouraged me to take up my own responsibilities and go out into the world to learn for myself. But this event had made me lose respect for my father. What should I do?",
      "comments": [
        {
          "text": "Not a parent but just a advise from someone much older. It’s just care and concern and they might have phrased it wrongly to you. Asian parents suck at that. If I’m in ur shoes I would feel controlled and it’ll suck. But on the bright side he did give u an age which is 21, and honestly it’s not that bad. Like what others have suggested, maybe start by gaining their trust and building confidence? Group travels, solo travel in shorter capacities before a 10-day japan solo trip. Yes Japan it’s safe but it’s a 6h+/- flight from Singapore and if anything happen you won’t be easily reached. Hope you can put urself in their shoes even if their words are on the harsher side. Just my 2 cents",
          "score": 341
        },
        {
          "text": "Maybe slowly show your independence instead of taking big jumps. Staycay in sg with a friend? Keep them up to date of your whereabouts etc, but also be clear that you can't update ALL the time.",
          "score": 229
        },
        {
          "text": "I cant believe im agreeing with this.. especially since my father is similarly incredibly strict and toxic (using disowning as threat lol). Op, i understand how you feel completely. But it's really them just trying to protect and show their concern (albeit toxic) in their own way. While i dont agree and wont validate the way your dad handled it, i guess at the end of the day no parent wants to bury their child before they go. I, too, agree that waiting till 21 is really not that bad. i might argue it might actually be a better age to solo travel. Maybe we'll only understand this when we are parents ourselves but i guess as much as it's difficult to look past the toxicity, try to understand it from the pov of their concern for u. Trust",
          "score": 114
        },
        {
          "text": "At 19, you should be learning how to have these conversations. Your choices aren't just \"suck it up\" and \"rebel and run away from home\". It sounds like their toxicity isn't typical of them, considering your dad encourages you to be more independent. But, that also means that your idea of taking a solo trip is quite a leap from your usual activities as well. Actions speak louder than words. Are you someone who could handle it? Have you done your research on solo trips/Japan, or did you just decide that it would be a fun thing to do? Why aren't they already convinced of your capabilities, and what could you do to change that? You can't just ask for stuff and expect things to be approved automatically. That being said, I completely disagree with their response. I don't buy the bullshit that \"Asians show their love this way\". So yeah, fight back if you want, but make sure you actually have a case to do so.",
          "score": 49
        },
        {
          "text": "19 is not legal age in Japan , just saying , better to go at 21",
          "score": 40
        },
        {
          "text": "I think parents need reassurance too. If you do go to overseas, make sure to keep parents updated - just so they know you are safe & doing ok. If you're going to be uncontactable for an hour or more, inform them in adv so that they dont panic. Share some pics with them (not constantly but pace it). Earn the trust by building the trust.",
          "score": 39
        },
        {
          "text": "Yea I agree with this too. I did my first solo trip at 23. But that’s after having went Only after doing all of this was when they were accepting of me doing my first 18D solo trip to Japan, including solo hiking (day hikes only) across several small local mountains. Granted it’s quite abit to accept 18D as your first solo trip, but convincing them that I could get around in Mumbai at night after classes ended safely was what made it happen. After all, it’s Mumbai, Japan is a piece of cake relative to the chaos.",
          "score": 23
        },
        {
          "text": "You live in their house and unfortunately, you gotta suck it up with their rules. Just wait a couple of years then go. It’s really not that big a deal.",
          "score": 21
        },
        {
          "text": "yeah wait till you’re 21. also travel with your own money, not theirs. then they can’t say anything about it. good time to find a part time job to save money too.",
          "score": 18
        },
        {
          "text": "Yeah this too, op at least 20, you can't even enter bars at 19",
          "score": 15
        },
        {
          "text": "And then can try a night in JB next",
          "score": 13
        },
        {
          "text": "Agree. You'll understand when you are older. Your parents meant well.  :)",
          "score": 13
        },
        {
          "text": "Came here to say exactly this. 2 years is nothing. Yes, threatening to disown you is completely bonkers, but if waiting for just a couple of years makes that big of a difference I'd just hold back. Could you consider going somewhere else with friends for this year? Say KL or Bali with a few buddies? I'd talk with your parents about how you can build independence. Tell them that you want to learn to be your own man, and show them that you're reasonable.",
          "score": 12
        },
        {
          "text": "After seeing everyone’s advice, I will wait till 21 and I’ve been working since 15 so most of my expenses is paid by myself and I could def fund my own travel thus I felt disappointed when they think I wasn’t ready to travel solo.",
          "score": 12
        },
        {
          "text": "Yeah, the crux of the problem here is that Singaporean parents generally tend to worry more. It's common for most young adults here to live with their parents, so by extension, it is harder for parents to imagine their kids by themselves in an unsupervised environment. It's also harder for them to accept this if their children happen to be not really reliable. If you are the sort of person who constantly forgets things and can't seem to take care of yourself normally, your parents likely won't trust you to solo travel. Not saying OP is this person, but it's a common sentiment for parents. My parents were mostly fine with me solo traveling (barring the usual fearmongering), but not for my sibling because he is extremely forgetful.",
          "score": 10
        },
        {
          "text": "Don't just wait though. Do some short trip travels around ASEAN to gain some trust so that they will be more confident in you knowing that you know how to stay safe on your own",
          "score": 10
        },
        {
          "text": "Just to clarify for those who chance upon this post: Japan's legal age of adulthood has been lowered to 18 (from 20) since 2022. However, the legal age for vices such as smoking, drinking, and gambling remains at 20yo.",
          "score": 9
        },
        {
          "text": "My usual activities aren’t quite different as I could stay out till 3 am and they wouldn’t care. I also work till 1am some days too while being in poly. I could def handle myself as I went on an immersion trip in poly and after school activities, I was the one who led my team to travel around Shanghai. So that’s why I was disappointed that they didn’t trust me enough. Thanks for ur opinion tho 🙏",
          "score": 8
        },
        {
          "text": "My usual activities aren’t quite different as I could stay out till 3 am and they wouldn’t care. I also work till 1am some days too while being in poly. I could def handle myself as I went on an immersion trip in poly and after school activities, I was the one who led my team to travel around Shanghai. Look... \"staying out till late\" and \"going on a solo trip\",are not the same thing. They are definitely \"quite different\". That said, I think your other trips are much more relevant, so focus on those. Consider the differences in those experiences:\n1. Length - were the other trips also of similar length? Every extra day is extra planning to be done.\n2. Destination - are those countries particularly safer? Or, nearer/easier to get to? What are the people typically like? \n3. Activities - did the trips revolve around city areas, or was there often terrain / environmental danger involved? \n4. Emergency plan - in the event of emergency, what's the plan? Who can you call, and who can your parents call? If there's a good difference in any of these questions, then that's probably what they're focused on. Otherwise, if your previous trips are very similar, you can try to drill down on what exactly is it that gives them so much pause. So that’s why I was disappointed that they didn’t trust me enough. It's often not you. As any driver will tell you, the biggest hazard on the road is \"other drivers\". The best driver in the world can still get into an accident as long as there's one other reckless person. They may not doubt your skill and independence, but rather the things/people that you are exposing yourself to. But again, although I think that it's bullshit to make such a big threat out of \"love\", the fact is that people won't always say what they mean, and strangers will be even worse to tourists.",
          "score": 6
        },
        {
          "text": "nah bro, you’re definitely ready. just respect your parents wishes until you are ready to leave their house.",
          "score": 6
        },
        {
          "text": "Just here to say, chaotic as Mumbai is, it’s probably the safest city in India still. People do still genuinely look out for you.",
          "score": 5
        },
        {
          "text": "Yea agreed, it’s relatively safe, and the highest risk is getting hit by traffic over anything else or getting chased by beggars. Relative to Japan though, if one can get by in Mumbai, Japan is definitely a non issue. Different story if you’re comparing it to Egypt or Spain which are more chaotic than Mumbai.",
          "score": 5
        },
        {
          "text": "Yeah the parents worries are not unfounded and unrealistic. Any parent would worry about their kid going out into the world for the first time. They are just very poor and communicating this to the kid.",
          "score": 5
        },
        {
          "text": "Yea that’s the case for me as well as my younger brother is extremely forgetful but I can handle myself just fine. I don’t rely on them too much tho.",
          "score": 1
        },
        {
          "text": "you are still a kid. accept itif you aren't, you would be able to live on your own by now",
          "score": -8
        }
      ]
    },
    {
      "id": "t3_1lfr4ja",
      "subreddit": "u_alejandromnunez",
      "title": "I am building a massive real time strategy game. Would you play something like this?",
      "url": "https://old.reddit.com/user/alejandromnunez/comments/1lfr4ja/i_am_building_a_massive_real_time_strategy_game/",
      "score": 1217,
      "num_comments": 547,
      "created_at": "2025-06-20T08:58:52",
      "selftext": "",
      "comments": [
        {
          "text": "I miss the golden era of RTS and RTT games so much. Command and Conquer,Commandos,Company of Heroes,World in Conflict- wish we made more of them, and incrementally innovated in the genre.",
          "score": 3
        },
        {
          "text": "I really like some of the features in Total Annihilation, where you could program routes / waypoints and actions for units, such as \"Patrol\" etc. Very useful also for support-units, and it was as easy as chosing and action and holding down shift, and then click the route / area you wanted....",
          "score": 3
        },
        {
          "text": "Maybe TLG will revive part of that sentiment, I am an old school RTS fan and that's one of the reasons I am building TLG as a more complete RTS like the old ones (with construction, economy, resources, etc), but using all the newer technologies available now to make it massive. Remember to wishlist it onsteamand join the discord to be in the early tests this year!https://discord.gg/thelastgeneral",
          "score": 2
        },
        {
          "text": "Does steam have a reminder for games basically u get a notification if a game is released? Cuz im gonna be waiting for this",
          "score": 2
        },
        {
          "text": "will it be ready by this Christmas?",
          "score": 2
        },
        {
          "text": "I am aiming to release early access at the end of this year, but I am not sure yet if I will make it in time. It depends on how the initial alpha playtest and the demo go. Remember to wishlist it onsteamand join the discord to be in the alpha play tests in a couple months!https://discord.gg/thelastgeneral",
          "score": 2
        },
        {
          "text": "if include space stuff yes",
          "score": 2
        },
        {
          "text": "I mean it looks cool but it looks more like a Battlefield game than a strategy game. I don't get it - for an RTS you never have time to zoom in on the characters and see what they are doing so it makes no sense to do that in the promo video. I am a a bit confused if I control the squads or a single soldier at times.",
          "score": 2
        },
        {
          "text": "RTS games are something that for me have either been like baby's first RTS or You are the General you are not going to win if you havent watched like 5 hours of tutorials. I havent played this game, but this, this seems like something that anyone could get into. The highlighting feature seems very fun to use and building being more interactive than clicking on a button and waiting 5 minutes. I have somethings that dont seem to fit in for me, I am not saying they are bad I think they are cool, but as I said dont fit in, the sending troops to enter buildings is cool and being able to control them seems underlooked in other games.",
          "score": 2
        },
        {
          "text": "People do play games like this... Looks like every Eugen System game (Warno, Steel Division). Not sure how the highlighting of the ground works, but maybe that's novel, and if it works by making less micromanagement on top of a game similar to Warno then that'd be interesting for sure.",
          "score": 2
        },
        {
          "text": "Hi, long time fan of RTS here. I think it fits the bill. I played a ton of RTS since early C&C and Warcraft days. I played large scale rts from Total War series to Wargame. For me the thing that draws me in to modern military RTS is the explosions lol. Just building an army of hotwitzer and sending rain of fire is satisfying to watch. This is what I love about games like for example World In Conflict. Can't wait to try your demo.",
          "score": 2
        },
        {
          "text": "I’m not sure if the time for RTS games has already passed. Nowadays, fast-paced gameplay or games that don’t require quick results seem to be more popular. Still, I’d love to play some Close Combat in this kind of view ;)",
          "score": 2
        },
        {
          "text": "Would love to see bodies and destroyed vehicles just being there and not despawning. Might be huge hit for performance if done wrong but i believe.",
          "score": 2
        },
        {
          "text": "This is a weird one - but I will if you can't zoom out too much. I don't want 'Labels saying those 4 pixels MILES BELOW are a T-27 vs labels saying those 4 pixels are a helicopter'. !",
          "score": 2
        },
        {
          "text": "Looks like WIC. I have checked out Warno but its too hardcore for me. Where would you say this sits?",
          "score": 2
        },
        {
          "text": "I'm designing a real-time monitor and action UI/UX system for battlefield management (UX/UI independent portfolio case) for use in the real world, and I can't help but think I would make a game out of it.. I wanted to ask you OP what was your motivation to make this game? Bring back RTS or any other reason? Just curious. Added to wishlist btw! Good luck!",
          "score": 2
        },
        {
          "text": "this reminds me of Hearts of Iron IV but if it wasn't the world map",
          "score": 2
        },
        {
          "text": "I already joined the Discord server. This is right up my alley. I am a big Wargame: Red Dragon and World in Conflict fan. With a bit of polishing, this could be great. Like the units that just \"pop up\" or \"disappear\" when they enter a building. Like a small \"entry animation\" where the soldiers provide cover to each other and then open the door/go in.",
          "score": 2
        },
        {
          "text": "Dude this is the exact type of game I'm interested in!! A big map conquer and strategy build game that also let you go in in 1st person? Imagine if it is online with many players how that's gonna be! Looking forward to it's release!",
          "score": 2
        },
        {
          "text": "looks insane! what is it built with and how much experience did you bring to be able to now build this yourself?",
          "score": 2
        },
        {
          "text": "This looks sick! is it going to be 1v1 or will it have like 1 General that orders attacks and big lobbies with people choosing like im an inf or chopper pilot",
          "score": 2
        },
        {
          "text": "I would love to, however, I need to know what are the recommended typical specs in order to run your astonishing game.  Does the game compatible with RTX 40 series?",
          "score": 2
        },
        {
          "text": "Since 2000 I envisioned an rts game like C&C but with the ability to change to FPS and command a single unit real time . (also modes where you split players into teams one is the strategist the other the logistics and the third the field guy) . But I am too lazy and never learned to code.",
          "score": 2
        },
        {
          "text": "I would love to play this! I recently picked up playing Combat Mission Battle for Normandy again. And sometimes I wish I could just switch to FPS on units to do things myself.",
          "score": 2
        },
        {
          "text": "You can wishlist it on Steam:https://store.steampowered.com/app/2566700/The_Last_General?utm_source=reddit_ads Join the Discord to be an early tester:https://discord.gg/thelastgeneralOr join the subreddit if you don't have discord:r/TheLastGeneral",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qon1n7",
      "subreddit": "askSingapore",
      "title": "Are you truly happy with what you are today?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qon1n7/are_you_truly_happy_with_what_you_are_today/",
      "score": 71,
      "num_comments": 66,
      "created_at": "2026-01-28T03:00:37",
      "selftext": "As someone who completed my education, joined the workforce for a few years, married my partner of few years and eventually gotten our BTO. I understand that this may be the conventional route for many and I’m not complaining about it. I’m just feeling mundane and probably tired of this cycle and wonder is this what we were made for?\n\nBack when I was in my first job and I was one of the youngest in my company, less the interns. I vividly recalled about ex colleagues who were in their 30s and 40s, they seemed to be happy but not exactly. Most have house loans to pay and they just want a normal and peaceful life. There were a few who opened up to me and said that they’re happy as long as the job is stable and they are able to pay off the monthly house loan. Back then I didn’t understand it as I felt that if they were unhappy they could look for a new job, which was what I did by job hopping to different companies over this few years. However now that I look back, it’s like a mirror reflection and I got to admit I’m growing old and am seeing myself like those ex colleagues.\n\nSo are you guys truly happy in this rat race or you’re just happy because you are able to pay off your loans, able to eat and drink what you want, or perhaps able to excel in your career?",
      "comments": [
        {
          "text": "I swing between two extremes. There are times I am happy that I have a job, money coming in, being able to pay the bills, put food on the table and roof over my head. Especially when I compare myself with the those with less or those with employment troubles. However, there are times when I struggle - almost claustrophobically - with the realisation that the clock is running out on this one life I had and I am stuck doing something just to survive instead of living and experiencing. There is this urge to throw it all take risks, reinvent and see what happens. And then I have to pay my bills. And I swing back to the other extreme.",
          "score": 154
        },
        {
          "text": "You can’t really win the race, it’s like infinite levels. At some point I decided that I’m happy with what I have  and just wanted status quo. I guess I’m part of that 30-40s colleagues you saw. I met this friend from game and learnt much from him, he works as a technician and has a very positive, laid back attitude to life. Makes do with what he has and looks genuinely contented. At this age, I can feel my knees creaking and have no desire to buy cars, move house or super big ticket items. Just go downstairs exercise and save to bring family to holidays, the rest go to savings/investments happy already.",
          "score": 58
        },
        {
          "text": "I can't say I'm in the rat race. By other people's standards, my income is low considering my age. I am single and have no kids. So I still stay with my parents. But there was a point in my life where I wondered what is it all for? To just burn out trying my best to earn so I can have that \"easy life\" later? But how can I guarantee my health? I was one of those that burned out working in a large company. I realised having money is useless if I'm depressed and anxious and stressed. It was a scary time. I couldn't stomach a fast paced high earning job. I lost a lot of drive. I struggled through unemployment trying to find a soft place to land. But I found a good-enough place in a small company. I'm not successful by other's standards, but I enjoy my work (sufficient challenge and reward) and my colleagues are kind. I have a lot of freedom to call my own hours and decline work if I have no available time. I have enough money to pay for training to advance my skills, and some hobbies that I enjoy. I help out with the household bills. Yeah it's a quieter life. I don't drink or party. I don't own a car. Travelling, unless my parents sponsor a family trip, I can afford once a year. But I'm not worked to the bone any more. I'm not jaded about my job and I feel I am being useful to others and being paid fairly. But the major difference is my salary. I can't afford to move out and I do wish I had that and could own my own home. Maybe one day I will get married and then with dual income we can do it. Other than that, it's a content life for me.",
          "score": 30
        },
        {
          "text": "I have a decent life but I always wanted to achieve much more than I did. I’ve struggled with it for a while but I am at peace with it now. I am focusing on hobbies and family instead. Currently I just hope that I can maintain the current professional level until it’s time for retirement and watch my kids grow up healthy and happily.",
          "score": 16
        },
        {
          "text": "R u me?",
          "score": 15
        },
        {
          "text": "Yup I am happy. I didn't join the rat race. I live my life at my own pace.",
          "score": 12
        },
        {
          "text": "No he’s me. Stop trying to steal me. I’m unique.",
          "score": 9
        },
        {
          "text": "Trying to stay happy, but one day I will be truly happy. I would like to exit the race one day, if possible. Currently saving up what I can and investing the savings. My weekdays is just repeating this whole cycle of sleep > eat > work > eat > sleep, and lately it doesn’t seem to have any meaning. But I keep on fighting, telling myself one day I will break out of this corporate bad cycle.",
          "score": 9
        },
        {
          "text": "With fair reason and being grateful, I would say yes. I have never put myself in the rat race, I used to work in MNC for almost two decades, as the years passed and feel increasingly jaded and resentful to biased treatment. I like my job, or I used to love it but hate the absolute unprofessionalism and toxic culture there. Bootlickers with no substance and blatant plagrism by management irks me to no end.\nNever been happier after I tendered resignation, to the surprise of many, especially since I am the sole breadwinner of my family with kid. And no, I did not have any job lined up, some ex colleague commented \"wah, so good you found another job, really envy you blar blar blar\" these are the whiners who have  always been complaining the job sucks and saying their life miserable for a FEW YEARS and yet they are still there, SMH. I just decided to venture and do something that I have wanted to do for sometime. Sure, having a job to cover the finances  is good but I wouldn't be sure that I would not go berserk and do regrettable actions some day at the workplace if I remain there. I am definitely not stress-free since income is varied but I do not regret my decision at all, for context, my house is fully paid. I am in a healthier emotional state and slowly recovering from the resentment and negative feelings. At least, I can smile now on occasions, slow down my pace to look and appreciate  the flowers and greenery Singapore has to offer. No, I don't envy anybody, to me, it serves no purpose and is a waste of time.",
          "score": 8
        },
        {
          "text": "But there was a point in my life where I wondered what is it all for? To just burn out trying my best to earn so I can have that \"easy life\" later? But how can I guarantee my health? I was one of those that burned out working in a large company. I realised having money is useless if I'm depressed and anxious and stressed. It was a scary time. Went from 4.1>4.4>5k. The 5k job (it was more the people, not the work itself) gave me PTSD and I spent the pay raise on therapy and counselling because I was slowly creeping towards passive suicidal ideation. Now I'm paid 4.1 at a much chiller role in a different company. I'm still a bit worried for my future and finances. I'm making it work somehow, still can save and invest, just at a slower rate (which is what I'm worried about) but I'm definitely not suicidal in this new role and I (mostly) have time for myself outside working hours. Yes, even though this role has alt Sat half day shift. I'm fortunate (or unfortunate?) that I'm still single so this new salary is enough for my needs and wants (need to manage expectations) and I should be able to afford my own 2 room BTO soon. Is it weird that I'd rather have this type of new job etc and be actually able to earn more in the long run because I'm not constantly looking at the door to resign vs I get paid more on paper but only last for 3 months to a year?",
          "score": 7
        },
        {
          "text": "Give up one thing or another if you want to really live life.  You cant have it all.",
          "score": 6
        },
        {
          "text": "Definitely not happy in a rat race, but what can we do for some of us? Despite that how hard we have tried. Sometimes we just have to bite the bullet to move on, but with damages in our well-being.😑",
          "score": 6
        },
        {
          "text": "I was in the rat race but I wasn’t happy. Left and I’m happier now though life isn’t perfect. Sometimes I look at my peers and envy them for making a few k every month, can afford BTO while I’m earning minimum wage. But I remember that I have more freedom and time than them and the negative feelings disappear. One thing about happiness is that it’s really a choice. The grass is always greener on the other side so we have to make a conscious choice to be happy.",
          "score": 6
        },
        {
          "text": "Working as IT Executive in healthcare sector. I own a flat, fully paid off the loan (last year). Not married. No car. Enough to get by, with my simple life.",
          "score": 5
        },
        {
          "text": "90%+ of the population are like you, but 100% of them all think they are not, that’s the gist of it, not that it’s anything bad though, that’s just the way it is, it takes more effort to break the mould.",
          "score": 5
        },
        {
          "text": "I told my psychologist that I am not happy and I don’t know why. But it doesn’t mean I am sad. It is the constant “then what” that is getting to me. Get a stable job then what? Buy a house then what?",
          "score": 5
        },
        {
          "text": "it is a rat race when you believe that it is. I feel like people coin this term because they are not happy. Life is what it is, and all our lives are happening in different ways. The struggle I feel is always in how we find meaning. For some, it can be doing Hyrox and challenging themselves. For some, it can be job stability and caring for their family. For some, it can be travelling the world and seeing new things. For me, I am happy enough when I can have my favourite Bak Chor Mee in the evening. My opinion is that in the end, you are the one who puts meaning in your life. For the rich, maybe having a 3 star michelin meal still cannot make them happy. So if you dont define that meaning yourself, you will feel mundane and in a loop. And honestly, even when you do derive meaning, the feeling of being in a loop wont magically disappear, but it will just feel a little easier. Happiness in itself is not a forever feeling. Our emotions flunctuates, and I think learning to regulate our emotions ,plus reflection and having the feeling of gratitude in our lives, will make things just a little easier. You are fortunate enough to be married to your partner, to own a house with her, to live life with her. There will be more struggles and challenges to come, but everything will happen for a reason, sometimes not to what we like, but it will happen regardless. Hope you can figure things out OP.",
          "score": 5
        },
        {
          "text": "We are all in the same boat. Thankful that the boat is still robust and not leaking water. Hopefully that it never leaks until all the loans are paid off. The sooner the better.",
          "score": 4
        },
        {
          "text": "I'm okay. I do get moments of happiness though, alongside moments of stress. I have kinda accepted that the rat race is going to be part of life so I'm running it on my own terms. As long as I am good at what I want to do and doing what I want to do, that's a good start. Then from there, I'm going to have the most fun I can earning my living. I think that's what makes me happy with that one aspect of life.",
          "score": 4
        },
        {
          "text": "yep single and debt free, low stress job with decent pay and high savings. life is great",
          "score": 4
        },
        {
          "text": "The Singapore dream is to be shackled with golden chains to our house/car/children that we constantly need more and more to pay off.",
          "score": 3
        },
        {
          "text": "if you didn't join the rat race, what are you working as? do you own a house? and is it enough to get by, having kids?",
          "score": 3
        },
        {
          "text": "I think I am quite lucky.  We married young, BTO when its cheap, paid of my home loan already but I have 2 kids in Pri school.  While my work life is ok, now my stress are all directed to my kids studies. I am unable to teach them certain subjects like Maths, have to outsouce which tution is getting more n more ex.  One hand MOE say shouldn't focus on academic that much, the other hand, the exam papers doesn't seem to be any easier. MOE say don't need tution, school is enough, but without tution, my kids can't even pass. Even you want to get into the school support program, there is a waitlist as your kids are not the worst performing.",
          "score": 3
        },
        {
          "text": "Well said! As the saying goes - \"happiness is a journey, not a destination.\"",
          "score": 2
        },
        {
          "text": "I so agree. this makes me so mad at the current government when whatever they says just is so disconnected from the ground.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qo7cf9",
      "subreddit": "askSingapore",
      "title": "What are your views on physical discipline (eg. slapping, spanking, caning) of children?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qo7cf9/what_are_your_views_on_physical_discipline_eg/",
      "score": 69,
      "num_comments": 107,
      "created_at": "2026-01-27T15:34:57",
      "selftext": "Majority of my generation was raised with physical punishment and if we go one generation up, probably every child was raised with some form of physical punishment. As a counsellor working with other adults my age, sometimes we have to talk about whether their parents' behaviour was appropriate or abusive.\n\nWhat is your take on physical punishment as discipline? Would/do you ever spank your children? Any exceptions?",
      "comments": [
        {
          "text": "I was caned regularly for medium things (not doing homework, playing Xbox too long etc) now I'm deathly afraid of bending rules and overstepping. and always second guess my decisions because if they're wrong, I feel impending sense of doom. got good got bad I suppose, but I wish I was more loved when I was a kid.",
          "score": 81
        },
        {
          "text": "the irony is that everyone is against physical punishment until they meets some kid inconveniencing them in the malls.",
          "score": 81
        },
        {
          "text": "With the disclaimer that I have no children (and probably won't for a long ass time), I feel that physical discipline should only be done as an absolute last resort measure. That was how my family handled it when I was growing up in the 2000s, if we were caned or spanked, honestly we deserved it. My more \"liberal\" friends really disagree with this take and feel that no parent should ever lay a hand on their child that way, even if they \"deserve it\".",
          "score": 71
        },
        {
          "text": "Based on long term studies: The Adverse Childhood Experiences (ACE) Study00017-8/pdf) - Adults with higher occurrence of physical punishments during childhood were significantly less likely to be \"successful\" in terms of health. They had drastically higher rates of heart disease, cancer, and liver disease. It also found a strong correlation between childhood abuse and adult unemployment and \"lost productivity.\" The \"Cycle of Violence\" Study- Abused children were 28% more likely to be arrested as adults and significantly more likely to commit violent crimes. It also noted lower educational attainment and higher rates of housing instability compared to the non-abused group. Long-Term Consequences of Child Abuse and Neglect on Adult Economic Well-Being- By age 41, individuals who were abused as children had lower levels of education, lower employment rates, and fewer assets (like owning a home) than their non-abused peers. There was a notable \"earnings gap,\" with survivors earning significantly less on average over their lifetimes. Chicago Longitudinal Study- This study found that children with a history of maltreatment fared significantly worse in early adulthood across almost every indicator: they were less likely to complete high school, more likely to be receiving government assistance, and more likely to have mental health hospitalizations compared to non-abused children from the same economic background. The Gershoff and Grogan-Kaylor Meta-Analysis-  No evidence is found that physical punishment improves child’s behaviour. Instead, it was significantly linked to 13 detrimental outcomes, including increased aggression, antisocial behavior, mental health problems, and diminished cognitive ability. Longitudinal Study on Aggression- Children who were spanked more frequently at age 3 were more likely to be aggressive at age 5, and those spanked at age 5 were more likely to show aggressive behavior and lower vocabulary scores at age 9. The evidence is clear that “cycle of violence\" will persist where the child learns that physical force is a valid way to resolve conflict. The Durrant and Ensom Analysis- Physical punishment was consistently linked to a higher risk of \"internalizing\" problems (depression, anxiety, withdrawal) and \"externalizing\" problems (delinquency, substance abuse).",
          "score": 59
        },
        {
          "text": "I think at the very least, if physical punishment is used it should not be excessive, not excessively used, and the child should know and understand why the punishment is being administered. (In addition to your point of it being the last resort so to say) Having said that, there are many ways to raise a child and physical punishment is not the only punishment.",
          "score": 37
        },
        {
          "text": "Physically punish the parents for not properly keeping their kid in tow lah. The kid is still too stupid to know better, the parents of said kids? They should know better.",
          "score": 23
        },
        {
          "text": "Similar view, from a different angle. I train dogs, and yes I know it's not the same as children, but there are parallels and I'm pretty sure this one is true. If you have to resort to physical discipline, you've already lost. The best training / rearing is done without physical discipline, and I can look back at raising my border collie (seriously they're so intelligent that it's like halfway to having a human child) and the times I resorted to anything physical was pretty much always I had screwed up and I regretted it. If I can teach my dog to have manners physical intimidation as a last resort, pretty sure you can raise a child without it.",
          "score": 20
        },
        {
          "text": "Agreed! I also think there is a fine line between physical punishment used to discipline, and repeated excessive physical punishment as a form of venting anger and taking it out on the kid. In the latter, I would consider it abuse and unfortunately many parents use this excuse under the guise of \"discipline\".",
          "score": 18
        },
        {
          "text": "Whenever ppl raise their hand in front of me I instinctively flinch.",
          "score": 16
        },
        {
          "text": "Physical punishment is but one of the many tools available. Just use it wisely and only as required. Even Singapore government used caning as a punishment for adults.",
          "score": 12
        },
        {
          "text": "I read through all the comments, replaced the word kid with dog/puppy, and you realise how fucked up it all seems.",
          "score": 11
        },
        {
          "text": "Awww giving you a virtual hugs💚",
          "score": 6
        },
        {
          "text": "Yeah agreed",
          "score": 6
        },
        {
          "text": "Even more fucked up when people see the word \"kid\" and think it's reasonable, but replace it with \"dog\" and they're like wtf animal abuse!",
          "score": 4
        },
        {
          "text": "Though children don’t seem to fit martingale collars very well",
          "score": 3
        },
        {
          "text": "if it can be administered in a non-emotional way, with boundaries set out before hand on what kind of behaviour is crossing the line, and the child is aware of the consequences when they do so, then i'd argue that its somewhat acceptable however most parents are not capable of handling it non-emotionally and often end up venting their frustrations on their kids, so honestly its probably better to just not lay hands on them at all",
          "score": 2
        },
        {
          "text": "The issue is who makes the decision on who and when they \"deserve it\"? That's the slippery slope that you may get right sometimes and wrong most of the time once you resort to beating your kids. My parents have never laid a hand on me and I intend to continue the tradition.",
          "score": 2
        },
        {
          "text": "same lol even when ppl break glass on the floor, I instinctively flinch cause I know my dad gonna come out and smack me for breaking glass",
          "score": 1
        },
        {
          "text": "Eh actually I feel the same way but i was caned only once.",
          "score": 1
        },
        {
          "text": "[ Removed by Reddit ]",
          "score": 1
        },
        {
          "text": "I trained on a flat collar and people were shocked that my dog was better behaved than theirs when they had used martingales and other instruments. My point is that just as the original comment above said, these are tools of last resort and if you have to use them you've already failed.",
          "score": 1
        },
        {
          "text": "But they do use physical intimidation like choke collars on dogs 🙁",
          "score": 1
        },
        {
          "text": "Sadly, some people still do. My experience, andbacked by science, is that this is a mistake and produces much worse outcomes.",
          "score": 1
        },
        {
          "text": "Why didn't you do your homework or not play the Xbox for too long?",
          "score": 0
        },
        {
          "text": "Do you feel that way when you jay walk?",
          "score": -7
        }
      ]
    },
    {
      "id": "t3_1qocd5m",
      "subreddit": "askSingapore",
      "title": "Biggest company angbao ever received?🧧",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qocd5m/biggest_company_angbao_ever_received/",
      "score": 45,
      "num_comments": 75,
      "created_at": "2026-01-27T20:22:03",
      "selftext": "With CNY just around the corner, do you remember the biggest angbao you ever received from your company?",
      "comments": [
        {
          "text": "I know Grayce got $230K+",
          "score": 280
        },
        {
          "text": "I received an email for CNY angbao supposedly sent from HR Clicking on the link meant you failed the phishing test, and it tells you to be suspicious of things that sound too good to be true Indeed",
          "score": 164
        },
        {
          "text": "Some of my ex-colleagues getting big one this year. 1 month pay for every year of service?",
          "score": 73
        },
        {
          "text": "Came loaded.",
          "score": 72
        },
        {
          "text": "You guys are getting angbaos?",
          "score": 34
        },
        {
          "text": "Cum loaded you mean",
          "score": 26
        },
        {
          "text": "Based on performance hor!",
          "score": 23
        },
        {
          "text": "$10",
          "score": 20
        },
        {
          "text": "Got a sausage roll from polar.",
          "score": 16
        },
        {
          "text": "Noun or verb? \nThat’s a sticky one. We need to bounce back and forth to finish this off.",
          "score": 15
        },
        {
          "text": "How loud the moan is",
          "score": 13
        },
        {
          "text": "Ah how nice of you to Grayce us with your wit.",
          "score": 12
        },
        {
          "text": "Closed door performance 🤣",
          "score": 10
        },
        {
          "text": "Got $88 from my angmoh boss, was nice cos it was personal money not from the company.",
          "score": 9
        },
        {
          "text": "Must be a fellow HCW. Think it was 2-3 years ago? Haha received that phishing email too",
          "score": 8
        },
        {
          "text": "What performance?",
          "score": 8
        },
        {
          "text": "Chocolate coin ccb",
          "score": 7
        },
        {
          "text": "88 dollars. I've been to quite a few companies. Singaporean, govt, foreign etc and honestly most don't give. Best I got is 88 which is pretty good imo.",
          "score": 6
        },
        {
          "text": "Chocolate coins for me, lol.",
          "score": 5
        },
        {
          "text": "Walao, I get 2 weeks only",
          "score": 5
        },
        {
          "text": "The one on the knees",
          "score": 4
        },
        {
          "text": "$600 when working at shengsiong after O level",
          "score": 4
        },
        {
          "text": "10 and two oranges",
          "score": 3
        },
        {
          "text": "We heard it from them. Im not taking any credit for this widespread. Somebody else took full responsibility.",
          "score": 2
        },
        {
          "text": ". . . that's pure evil",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qp1dg4",
      "subreddit": "askSingapore",
      "title": "What happens when a foreigner dies in SG?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qp1dg4/what_happens_when_a_foreigner_dies_in_sg/",
      "score": 39,
      "num_comments": 28,
      "created_at": "2026-01-28T12:27:53",
      "selftext": "Hello! Im currently single and working in SG under E pass. And Im just wondering, what if sth happens to me, where all my assets and savings will go? My family of course doesnt know what banks I use in SG. So when a foreigner dies in SG, what steps would his/her family need to take to inherit those? For context, I dont own a house or car here. Just my checking account for my salary and IBKR for my investments.\n\nAnd btw everything’s fine for me right now, its just a thought you know LOL",
      "comments": [
        {
          "text": "Do a will under singapore law to prevent things from getting messy for your love ones and let them know of its existence?",
          "score": 41
        },
        {
          "text": "I think there would be a death reported with ICA and the cancellation of the pass would be triggered.. the embassy of the foreigner will be informed if there is no next of kin here.. I guess the embassy would then do what they need to do to get the information to the kin and all that",
          "score": 28
        },
        {
          "text": "When a foreigner dies, Govt agencies will informed the country's embassy. The Embassy will then forward the information to the revenant agencies in their country and will inform the next of kin of the Deceased.",
          "score": 22
        },
        {
          "text": "Your assets would be frozen until someone applies for a letter of administration. But if no one does........ you know...",
          "score": 19
        },
        {
          "text": "It's a bunch of work for the executor/administrator (e.g. one of your parents or siblings) to do all the paperwork to claim your assets and savings. First they will apply for a grant of probate or letter of administration (depending on whether your wrote a will) that gives them the legal authority to \"settle your affairs\". Then they might do some detective work. Look at the cards in your wallet, your letters and emails, to figure out which banks to contact. They submit the legal document and they will have access to your account. Or they might end up writing to every bank and insurance company to find out if you had dealings with them. Or, you can just give these details to your family members to make it easier for them in case anything happens? Whether you're a foreigner or not doesn't make that much difference. Just more of a hassle if your family member needs to fly over here to collect your belongings and settle papers, in addition to the first task of deciding what to do with your remains.",
          "score": 13
        },
        {
          "text": "Legally it goes to whoever you will it to, or else your next of kin (children / spouse). If your will is legally recognized back home then our government will probably follow its instructions. If you have no will, and no next of kin, then it’s going to be very difficult to figure out who has the rights to your assets. I assume they will leave it frozen until someone claims it, and after some time if nobody shows up then it gets added to the state coffers.",
          "score": 8
        },
        {
          "text": "Trick is when you have no loved ones. Was discussing this recently. I have no kids, no parents, no siblings, not close with immediate family. Suggestion I got was to designate somebody as next of kin in your home country and make sure they understand what will be entailed if something happens to you. That or some combination of choosing a charity, but still need somebody to execute the will.",
          "score": 6
        },
        {
          "text": "I had a friend, 63 years old pass away last year. His GF contacted me and while the police was aware of his death, the Turkish embassy started the process to repatriate his body back to Turkiye. In the meantime, as it was a weekend, getting clearance to contact his family officially was harder from the embassy side and therefore I assisted in finding family members through his social media. We managed to get a few people in contact and his nephew came down to settle the case. For the house tenancy agreement, cause of death was part of the agreement so half of the deposit was forfeited and half was refunded by his landlord. Salary: Was paid till the day he passed away with a small bonus. Deposited to his bank account. Bank account: Had more than 5 figures inside and hence a lawyer was needed due to the banks Terms and Conditions. It took around 8 months and around 9k SGD of lawyer fees to get the amount transferred to my friends siblings accounts. Singapore based online investments: Only after the phone was unlocked, they found a few hundred thousand $ worth of investments. After using Turkish lawyers to talk to the companies, funds were transferred to his Singapore bank account which was bounced back, and then with another court order it was transferred to Turkiye with high costs due to the official process. Body transfer to Turkiye from Singapore had cost around 9k SGD including post mortem and Singapore Muslim Casket assistance. Most of the basic stuff took 3 days to complete but the most difficult ones were the bank and investment payouts. My friend didnt have a will, didnt have any marriages or kids. Therefore it was harder to get his work done. But may he rest in peace and know that it has all been settled.",
          "score": 5
        },
        {
          "text": "You can add a “trusted contact” on IBKR.",
          "score": 3
        },
        {
          "text": "Write a will and make sure it, as well as a copy of essential information, is with your loved ones.",
          "score": 3
        },
        {
          "text": "Your company HR will liaise with your next-of-kin.",
          "score": 3
        },
        {
          "text": "I believe can get a professional executor? The issue is just to avoid the trouble of having to go through an even longer process if one dies interstate.",
          "score": 2
        },
        {
          "text": "But thats only for employment related issues, final pay, staff insurance payouts etc.\nThe company isn't going to help deal with anything once those payments have hit the bank account, or help with any other personal assets/liabilities.",
          "score": 2
        },
        {
          "text": "always update your Embassy on your latest Particulars , ie, place of work, contact, housing..",
          "score": 2
        },
        {
          "text": "The relevant governments and embassies will take care of informing your next of kin. If you end up getting a PR and a CPF account, then your CPF will be withdrawn and given to whoever your next of kin is based on your nomination or inheritance laws of there is no nomination. But all the individual things like assets and investments will be up to them to sort out. Which is why it's so important to have a will or at the very list a set of instructions for your next your kin to make it easier for them. Otherwise their only option would be to call up every bank and investment broker in Singapore to ask if you have an account with them. And before you say \"I'm too young to make a will\". You're never too young to make one. Like you said, anything can happen at anytime. And last thing you want is for your family to have to play detective to hunt down your assets when they're busy mourning you. And a will doesn't have to be complicated. You can simply say you want everything split equally between family and call it a day.",
          "score": 2
        },
        {
          "text": "Nope, no lawyer needed. It's as simple as going online and downloading a free template and filling up the relevant information. You would need to nominate an executor who will carry out your wishes and at least 2 witness present when you sign off on the will. Note that the witnesses cannot be a beneficiary of the will. So if you intend for your parents to be beneficiaries, they can't be witnesses. You can ask friends, coworkers or non-beneficiary family members. You can create a template here:https://www.lawdepot.com/sg/estate/last-will-and-testament/?webuser_data_id=210310776 And you can upload it here. It's optional but makes it easier for your family to track your will down if they need to:https://wills.sal.sg/ Additional info:https://mylegacy.life.gov.sg/end-of-life-planning/write-a-will/ Of course if you really want everything to be ironclad, like if you have troublesome relatives who will try and contest, or you have some very specific instructions on how you want your assets distrubuted, then getting a lawyer is the safest bet. A lawyer can also be the executor of your will if you don't have anyone in your family you trust to do so or you don't want to put the burden on them. To add: You can also contact your bank and ask about their estate planning services. And IBKR has inheritance services where you can nominate your next of kin to take over your account assets.",
          "score": 2
        },
        {
          "text": "Do you know whats the process for a foreigner to create a will in SG? Do we have to engage a lawyer?",
          "score": 1
        },
        {
          "text": "You don’t actually need a lawyer to create a will BUT if you think your beneficiaries might potentially contest the will then I suggest that you contact one. It’s not that expensive if your assets are straightforward you can always ask for a quote before committing to hiring one",
          "score": 1
        },
        {
          "text": "is it even different between foreigner and citizen/pr with the exception of cpf and hdb? like do banks and other financial institutions treat these two groups differently, eg directing reaching out to NOK for citizen to inform them about obscure bank accounts belonging to the deceased",
          "score": 1
        },
        {
          "text": "The next of kin will need to handle, when I had a friend on EP die.  His family had to come, finalize everything and repatriate the body. You better be sure you document somewhere “just in case” all the banks insurance etc that you are using",
          "score": 1
        },
        {
          "text": "Free money for the government",
          "score": 1
        },
        {
          "text": "I would like a portion too;)\nMaybe the limps as the meat is less tough as compared to the trunk",
          "score": 1
        },
        {
          "text": "Transfer all assets to moi and I will handle everything Swee Swee for you inclusive of nice glamorous coffin to your choice and selection.",
          "score": 1
        },
        {
          "text": "If it's a mnc, they will go beyond. Even crowdfund for the family. My company did it for a few of my corlicks who passed away.",
          "score": 0
        },
        {
          "text": "we eat the body",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qog60c",
      "subreddit": "askSingapore",
      "title": "is this even legal? mailboxes have been broken into and the latches broke",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qog60c/is_this_even_legal_mailboxes_have_been_broken/",
      "score": 22,
      "num_comments": 5,
      "created_at": "2026-01-27T23:00:26",
      "selftext": "i got home from poly after an interview and was at the void deck with my mom, and when she mentioned the mailboxes being broken into (the locks to actually open the mailbox itself were intact, it was the tiny flap where you could slide papers through) i quickly walked to go check. what i saw was the latch mechanism holding the lock got pushed down and the door was free to be opened.\n\ni found that a (possible?) fix for this was finding something small enough to act as a shim preventing the flap lock from going back down\n\ni then checked the other mailboxes, and to my surprise all of them also had this issue. some of them also had locksmith phone numbers on stickers hidden beneath where the tiny flap would be\n\nconsidering that there isnt a lot of wiggle room for a tool to reach the lock itself and just break it by pushing it down, i presume that whoever did this had forcefully broke the flap in, causing the lock to be forced downwards. obviously terrible since your mailbox will be crammed with flyers, and your mailbox is now a locksmith billboard",
      "comments": [
        {
          "text": "Lodge a complaint using OneService or LifeSG app",
          "score": 31
        },
        {
          "text": "File a online police report and cc your MP or town council for follow up. Unacceptable business practices.",
          "score": 25
        },
        {
          "text": "i thought mailboxes itself isnt personal private property?something like the elevators, staircase and corridors. they are leased together with your apartment.only the lock to open the mailboxes  is personal. so if people are penalized for damaging these areas, people who damages mailboxes should be penalized.",
          "score": 7
        },
        {
          "text": "Which area was this? I noticed the mailboxes in my area at Sengkang also had the same issue. Some bugger forced the flaps.",
          "score": 3
        }
      ]
    },
    {
      "id": "t3_1qo70fz",
      "subreddit": "askSingapore",
      "title": "Home cooks and rice lovers, what's your go‑to rice brand?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qo70fz/home_cooks_and_rice_lovers_whats_your_goto_rice/",
      "score": 22,
      "num_comments": 45,
      "created_at": "2026-01-27T15:15:22",
      "selftext": "I just moved out recently and started buying my own groceries. My family has always used “Jin Fei Ren” rice, but now I’m looking to explore other brands, any type is fine (brown, Japanese, jasmine, etc.). What do you recommend?\n\nEdit: Thanks everybody for your comment and suggestions!",
      "comments": [
        {
          "text": "Song He all the way",
          "score": 22
        },
        {
          "text": "Koshikari rice in a made in Japan Zojirushi IH rice cooker. My kids have been absolutely polishing off their bowls. I'm okay with splurging on rice (and noodles / pasta), since it's not prohibitively expensive and it elevates our meals a lot! The rice cooker was a big splurge but I do think it's worth it for perfect rice each time. Also very idiot-proof.",
          "score": 20
        },
        {
          "text": "A Zojirushi is always a good investment",
          "score": 9
        },
        {
          "text": "Fairprice brand ponni rice is good. Ponni rice is very different from Asian fragrant rice",
          "score": 8
        },
        {
          "text": "Royal Umbrella",
          "score": 8
        },
        {
          "text": "Song He new crop for my family",
          "score": 6
        },
        {
          "text": "Double FP Thai Hom Mali. The blue one.",
          "score": 6
        },
        {
          "text": "I love buying premium rice because most of the time I eat out at coffee shops and food courts due to work. On the rare day that I can cook rice for myself, I use my Zojirushi rice cooker which cooks really yummy rice. I like to buy the “No Wash” type of rice from Donki or online retailers. Usually they write something like 無洗米 which means that you don’t have to wash it. Just pour into rice cooker and add water. You don’t have to wash it because they have already washed the rice during the farming process. It’s more expensive but I just treat it like a hobby, since I seldom cook. Only when I’m ill, or once a month when I have some time.",
          "score": 5
        },
        {
          "text": "Basmati takes away focus from main dish. Ponni knows its place.",
          "score": 4
        },
        {
          "text": "Song he is like minimum standard anything worse dont waste your money",
          "score": 4
        },
        {
          "text": "The one with the kangaroo. We get the calrose variety and works well for kimbap making since they’re quite sticky",
          "score": 4
        },
        {
          "text": "Royal umbrella is good. I'm using basmati rice (no specific brand) now because it's lower GI.",
          "score": 4
        },
        {
          "text": "Ponni parboiled rice - love it. Especially with Indian food. Do not like the basmati that much as it doesnt go well with indian veg curries or even fish curry from bengal or andar pradesh.",
          "score": 3
        },
        {
          "text": "You can’t use basmati rice for sambar or rasam. Only ponni goes with it. Basmati rice is used more for biriyani and pilaf",
          "score": 3
        },
        {
          "text": "golden peony rice Japanese rice is very nice.",
          "score": 3
        },
        {
          "text": "golden eagle new crop",
          "score": 3
        },
        {
          "text": "My parents swear by Golden Phoenix Thai jasmine from a certain source, which is not always available. They bought Golden Phoenix with the same packaging from ntuc before but it tastes different according to them. Apparently many guests have commented on the fragrance of the rice when they visit my parents place. I personally can't tell the difference. Since I prefer to douse my rice in gravy, I just buy the fair price brand Thai Hom Mali, which is cheaper.",
          "score": 3
        },
        {
          "text": "The one by JA Rice with the red packaging is decent and accessible! Can be found in NTUC also.",
          "score": 2
        },
        {
          "text": "It’s less fragrant and more sticky as compared to basmati rice. But it’s a lot less sticky than like… jasmine rice. There is actually no fragrance to ponni rice. It is extremely plain and that’s why it’s used in South Indian cuisine",
          "score": 2
        },
        {
          "text": "Me too. Otherwise Royal Umbrella new crop",
          "score": 2
        },
        {
          "text": "Go Jb buy Rambutan brand",
          "score": 2
        },
        {
          "text": "I first tried Song He when Shell had that 5kg for $1 + Shell Points promo or something like that.  I was so surprised at how much better it is compared to all the other rice I've cooked.  Swapped over since.  Never looked back.",
          "score": 1
        },
        {
          "text": "I glanced thru Redmart and see many varieties of Koshihikari rice. Which do you recommend for a first timer?",
          "score": 1
        },
        {
          "text": "Any difference in taste as compared to basmati? I know they look different",
          "score": 1
        },
        {
          "text": "Same here.\nBeen eating Royal Umbrella rice for the longest time.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qoylxb",
      "subreddit": "askSingapore",
      "title": "How do you choose your insurance agent? They keep leaving the company",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qoylxb/how_do_you_choose_your_insurance_agent_they_keep/",
      "score": 20,
      "num_comments": 28,
      "created_at": "2026-01-28T10:24:20",
      "selftext": "How do you choose your insurance agent? I thought I did a good job as this agent does not sell me what I do not need or want, and is not pushy, and offers to share and educate me in certain terms that I don't understand. But shockingly he just left the company after a few years, without even informing me. The new agent took over and whatsapped me about this. Not the first time my insurance agent had left the company or industry. Some were friends, some where known through word of mouth.\n\nIs choosing an agent as important as choosing the plan itself? Any tips for my future purchases? Not sure if I still want to buy from the new agent, although I'm considering some plans from them. Perhaps this is a non-issue as long as my plan is still valid regardless of who my agent is?",
      "comments": [
        {
          "text": "Your agents keep leaving cuz you are choosing those who are not pushy. This means they don't earn much money so they will quit after finding out this job isn't for them.",
          "score": 48
        },
        {
          "text": "I don’t even envision myself staying in one company for my whole life, much less anyone else. I expect my FA to leave at one point also, hopefully either to a higher calling in the same industry or switch to different industry. If move to different broker firm, i expect him to at least let me know, which he did 3 years ago. So far my experience of 7 years with him, all’s okay.",
          "score": 9
        },
        {
          "text": "ah yes terrible times. i changed a couple agents for multiple reasons. but my current one is just from the great eastern site - just picked a friendly face, talked to one and felt shes right. so far so good! i feel choosing an agent is impt esp if you cant be bothered to read every word on the  lengthy contract. so you rly need a helpful and smart guy to tell you things based on his knowledge and experience. tips for future purchases - meet up with a couple of agents! maybe 2, 3. whichever makes you feel at ease. you can cross check things this way too. i do know some people who are just very good at insurance things (but hes not an agent), they can just buy the products themselves; their agent is just to add on with their 'onsite knowledge' (?) :) ps: for a particular other company, all their agents ive met were bad. so i just call in to their service center when i need something!",
          "score": 5
        },
        {
          "text": "Facts haha. The most recent one said he's been in the industry for 20 over years so I trusted that he'd stay, and well, at least give a courtesy goodbye if he is leaving, but no he just poof. I only got wind when the new agent came onboard today.",
          "score": 4
        },
        {
          "text": "i will source from online insurers like fwd, budget, Direct Asia that has an attentive hotline to call and speak to someone easily without being hardsell anything",
          "score": 3
        },
        {
          "text": "Choose a agent that work for more than 7 years. I have realized friends that have joined insurance but cannot make it usually quit within 1-3 years. On rare cases 4-5 years.",
          "score": 3
        },
        {
          "text": "Get an independent agent that is not part of any company. They will be able to freely advise any policy from any insurance company.",
          "score": 3
        },
        {
          "text": "do you mind sharing which is the particular other company?",
          "score": 2
        },
        {
          "text": "I chose the sgt that treated me well during my NSF days.",
          "score": 2
        },
        {
          "text": "lol i chose a friend who lasted a solid 4 years without targeting his friends then 1 year after buying he kenna kicked out T_T",
          "score": 2
        },
        {
          "text": "Agents are just a sales force for insurance company. Comings and goings does not affect your existing plans. To be honest, your previous agent might be a bit too soft to last long in the industry, where a bit of sales pressure is needed. I was an agent before, so I don't really need one to bring me through financial planning. But for most people, gaining some rough knowledge from one is certainly a good idea. One of my current agents is my uni mate who has been in the industry for ages. Another one is my secondary school mate who joined a few years back only. I go to them when I feel like I need to top up some protection. I'm not really concerned about them leaving the industry. They will probably inform me anyway, more as a friend than as a client. Lol.",
          "score": 2
        },
        {
          "text": "You need to know that your previous agent is a good agent, bad salesman. And these type wont last long in the industry. Sad truth",
          "score": 2
        },
        {
          "text": "Choose those older ones instead of those pretty xiao mei meis?",
          "score": 2
        },
        {
          "text": "Is a common question lei, the good ones will have a template answer prepared from long ago",
          "score": 2
        },
        {
          "text": "No one is going to give you any guarantee on this buddy.",
          "score": 2
        },
        {
          "text": "Perhaps this is a non-issue as long as my plan is still valid regardless of who my agent is? Yes, claims can file online or via phone, bypass the agent totally after signing the plan. Just ask those people who bought their insurance at banks, they never see any agent at all only the bank staff.",
          "score": 1
        },
        {
          "text": "My primary agent still with the first company. I just got lucky. Don't think you can game this",
          "score": 1
        },
        {
          "text": "If turnover high and service is inconsistent and constantly disappointing and not meeting your needs, shouldnt that be a sign not to continue with this insurance company?",
          "score": 1
        },
        {
          "text": "I consider myself lucky have insurance agent since young till now",
          "score": 1
        },
        {
          "text": "I got mine thru a FA and not from a specific insurance company. So it's easier to buy policy from various insurance companies all handled by one person. When he left his company to join another one and as expected all my policies got reassigned to a new guy. But my fa asked if I wanted to stick with him. which I did. Known the guy for 18 years and not pushy so I agreed the transfer and it was seamless.",
          "score": 1
        },
        {
          "text": "common but easily forgotten with conversation",
          "score": 1
        },
        {
          "text": "My agent is a 40 year old uncle lol. The new one taking over is a XMM which I don't think I'll buy from her.",
          "score": 0
        },
        {
          "text": "I have two family friends who are aunties who are insurance agent. One is with AIA and the other prudential. AIA aunty is not pushy at all. You ask her things she will tell you pros and cons and you can decide yourself. She will follow up but just to ask my decision. if I decline she says it’s ok and leaves me alone. Both of them have good attitude but I’m closer to AIA aunty.",
          "score": 0
        },
        {
          "text": "Met my agent more than 20 years ago. I was just out of uni, started working, shit pay. Walked from Tampines Mall to Century Square, this lady approached me. She is chio, so I entertained her, ended up purchased my 1st insurance from her.  She stopped and transferred me to her husband for a few years after her children were born. Then took back my account under her when she came back to work full time. She has been very responsible, never pushy, and always consider based on our situation. After communicating with her, my wife like her and has since consolidated all insurances under her. Both my children’s insurance are from her as well.",
          "score": 0
        },
        {
          "text": "Normally I will give them a 灵魂拷问 qn, be it cold agent or friend turned agent How long do you think you will be around for this insurance line ? Then watch their reactions and that will tell if the agent is going to be able to service me for the long haul.",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qp0mwh",
      "subreddit": "askSingapore",
      "title": "Those in university right now, how's your dating life ?",
      "url": "https://old.reddit.com/r/askSingapore/comments/1qp0mwh/those_in_university_right_now_hows_your_dating/",
      "score": 19,
      "num_comments": 27,
      "created_at": "2026-01-28T11:53:44",
      "selftext": "i.e. are you serious already, or still dating around ? Do you think you've already found \"the one\" ? And do you plan to get married shortly after graduation ? Any plans for your future family yet, in general ?",
      "comments": [
        {
          "text": "I don't necessarily believe in the \"one\". I advocate for the \"two\". One I met in uni to marry and buy a house with, and another from work to be my sugar daddy.",
          "score": 41
        },
        {
          "text": "Nil",
          "score": 38
        },
        {
          "text": "As a 30 year old single older sister, let me tell you that the best time to find your partner is during uni. Try hard! I wish I dated more intentionally when I was younger",
          "score": 38
        },
        {
          "text": "Thats cute.. Wait till you start your working life..",
          "score": 32
        },
        {
          "text": "Grayce and Melvin approve this message",
          "score": 23
        },
        {
          "text": "Actually where got time? Got assignments; project; lectures and tutorial. But the time your rush all these stuffs - you should be quite exhausted.",
          "score": 16
        },
        {
          "text": "Can confirm it is worse during working life, enjoy Uni while you can.",
          "score": 8
        },
        {
          "text": "too busy with hobbies /internship/ module load and current friends\nlazy to play guessing games and don't want to put myself out there and be vulnerable and also deal with other people's emotional baggage, judging others and being judged by them and their friends. never dated before but dating can be draining from what I see",
          "score": 7
        },
        {
          "text": "i was also single at 30 and dated in uni, so i think i can see both POVs. it's a lot easier to meet people when you're younger/in uni and guys especially don't have baggage related to their exes yet, but the biggest issue is that usually people (both parties) don't know what they want. i knew since i started dating at 19 that i was dating intentionally aka every bf of mine i could have married - i was that serious. the guys i dated from uni age till mid 20s did not have marriage as a concrete goal in mind, and it ended being a waste of time for me.",
          "score": 6
        },
        {
          "text": "Serious but cannot find anything serious gg",
          "score": 6
        },
        {
          "text": "long term rls! cmg up to 2 years in march hehe",
          "score": 5
        },
        {
          "text": "“There is no other One, for I am the One for myself as the wholesome One. Be One with Zen at peace.”",
          "score": 3
        },
        {
          "text": "Dating with apps. Not people. There's a difference.",
          "score": 3
        },
        {
          "text": "Most people just take it easy until they want to BTO Source:https://www.reddit.com/r/askSingapore/comments/1qng1xk/if_bto_wasnt_tied_to_marriage_would_half_of_sg/",
          "score": 3
        },
        {
          "text": "NA",
          "score": 3
        },
        {
          "text": "Non existent, id probably stay single for life as i need lots of alone time, and treasure the freedom to do whatever i want and dont want children.",
          "score": 3
        },
        {
          "text": "As someone who recently graduated, I thought it's more appropriate to only start dating once secured a FT job if the ultimate goal is marriage then maybe family",
          "score": 3
        },
        {
          "text": "As an advice, it's either you take the risk or don't. Else you'll end up with a useless partner for life like the recent news of the husband having his heart failures timed so appropriately. It's nothing new that some husbands are useless and leeched on their partner. With current society now, women shouldn't have to deal with this since they can be in the workforce to support themselves.",
          "score": 3
        },
        {
          "text": "Men, don’t fret, you don’t have a biological clock, keep relationships casual and stabilise your career first. Even in your 30s you can date a 24 or older. Don’t go for younger because you never know if they are really decided on what they want until they go to work at least the first year or two. Women, see which man is good, the one that comes out of army and doesn’t chase pussy the first thing out the ORD-gate is a man with the necessary self-discipline to make a relationship work. You find one, a good one, hang on to him.",
          "score": 3
        },
        {
          "text": "just graduated, in a rs coming on 3 years (met on hinge lol). it’s been rough tho recently. theres not really a rush for me to get married; though i know it’s what i want one day",
          "score": 2
        },
        {
          "text": "uni is def the best time esp y1 or 2",
          "score": 2
        },
        {
          "text": "Yesterday I muttered 'excuse me' while passing by a girl, it's almost like we're married.",
          "score": 2
        },
        {
          "text": "Too soon haha",
          "score": 0
        },
        {
          "text": "Lmao. Sweet naive summer child.",
          "score": 0
        },
        {
          "text": "Working life more chill than uni life, unless u are the kind not studying",
          "score": -3
        }
      ]
    },
    {
      "id": "t3_1qo9olr",
      "subreddit": "SingaporeRaw",
      "title": "Even MORE PLB Tea!",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qo9olr/even_more_plb_tea/",
      "score": 706,
      "num_comments": 193,
      "created_at": "2026-01-27T17:56:22",
      "selftext": "AMA was conducted on another sub-reddit. I consolidated the replies so it is easier to read. Original poster claims to be a former PLB staff.",
      "comments": [
        {
          "text": "Probably just me, but when a person asked for an open relationship, it usually mean that he or she is already doing with someone behind your back or at least has someone in mind for that.",
          "score": 213
        },
        {
          "text": "Grayce used to be a MOE teacher btw. We need her colleagues to tell us the juicy gossip. She had an affair with a married teacher in the school too",
          "score": 125
        },
        {
          "text": "Yes. Or they think they can do better than you, but wanna keep you in case they don’t find someone",
          "score": 63
        },
        {
          "text": "Didn’t know about the teacher affair. Only know that she broke her MOE bond to join PLB and had to pay 6 digits for breaking bond",
          "score": 55
        },
        {
          "text": "sooooo fucking pretentious. Bitch just broke the bond because she wanted to be rich. that is all there is to it. These fucking influencers just got to make it like it's an emotional drama. pathetic",
          "score": 48
        },
        {
          "text": "Ya bro it’s like those who preach cheat feeling not ok but cheat with body ok… Maybe the hubs got some cuck fetish also but who knows. My gut feel is that this Melvin will get away like Jack Neo. In the other leak about his comms to the company seems to suggest that he settle his fam already. We should cheer the wife on to seek for divorce, women charter will wackgaogao get half his net worth plus heavy alimony for live",
          "score": 23
        },
        {
          "text": "<image> I can’t find the post where she mentioned the amount anymore (think it was on her tiktok), but in this post she alludes to having quarter million debt from breaking scholarship bond",
          "score": 19
        },
        {
          "text": "Melvin paid for the bond",
          "score": 17
        },
        {
          "text": "Depends on when the request was made. If it was made early in the relationship and the other partner consents to it, then it is alright. Some marriages are open because both partners are gay/lesbian but they need to maintain optics, or both want to win the BTO lottery and perhaps split the earnings after MOP. But if it was made way deep in the relationship, it is obvious that the person who asked for it is already cheating and just finding a way to feel better about himself or herself.",
          "score": 12
        },
        {
          "text": "You guys are shafted like mad xia. MOE bond during my time 30k nia. Even accounting for inflation 100k is mad for the value they give you. But even then urs is still not 100k, plus once u start work the bond value drops so honestly im not convinced it’s 6 digit to break bond.",
          "score": 10
        },
        {
          "text": "you want fixxxxxxx heerrrrrrr or nott?",
          "score": 9
        },
        {
          "text": "Mine was? In fact almost every one who entered for the bond was almost 100k if not more.",
          "score": 8
        },
        {
          "text": "Depends on if you took the full \"4 year Local Uni + NIE\" scholarship package or just the \"1 year PGDE\" deal.",
          "score": 6
        },
        {
          "text": "Yes, I don’t think polyamory is bad. But within context, it’s an excuse to cheat amongst partners with no ethics and proper communication. Polyamory requires a level of maturity and objective-thinking most standard-issue Singaporeans aren’t capable of",
          "score": 4
        },
        {
          "text": "Yes it’s a red flag and indirectly telling u she/he is cheating. I have a female friend who had an open rs and things didn’t turn out well 🤣",
          "score": 3
        },
        {
          "text": "do you recall the date it was on her tiktok? <image>",
          "score": 3
        },
        {
          "text": "Was this before or after they hooked up?",
          "score": 1
        },
        {
          "text": "Not surprising anymore. Eeeeeeks",
          "score": 1
        },
        {
          "text": "The day before I got saw a comment in other thread said she was a babysitter or what and having affair , maybe is this one .",
          "score": 1
        },
        {
          "text": "Which would you recommend? Pondering on whether I shld be a Chinese teacher.",
          "score": 1
        },
        {
          "text": "MOE bond where got 6 digits one?",
          "score": 0
        },
        {
          "text": "Learn too much from the Smith family 😂",
          "score": -1
        },
        {
          "text": "He can't this guy is my friend. He is gay bro, he is referring to Melvin as \"she\"",
          "score": -1
        },
        {
          "text": "noting to fixxxxxxxxxxxxxxxx shes perfect",
          "score": -16
        },
        {
          "text": "nothing wrong wit open relationshipssssssssssssssssssss",
          "score": -33
        }
      ]
    },
    {
      "id": "t3_1qoiktr",
      "subreddit": "SingaporeRaw",
      "title": "some archived photos",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qoiktr/some_archived_photos/",
      "score": 516,
      "num_comments": 180,
      "created_at": "2026-01-28T00:27:28",
      "selftext": "",
      "comments": [
        {
          "text": "She constantly humble brags about being such a successful serial entrepreneur, and gives out life advice like she’s some enlightened being on a higher plane of existence. But her whole schtick this whole time was her tits. That’s the whole secret sauce. Nothing more than flashing tits on socials, and moaning with the boss. It is an absolute joy to watch self-righteous, holier-than-thou pretentious leeches get torn to shreds by their own stupidity.",
          "score": 511
        },
        {
          "text": "The husband's glow up though. He looks so different with long vs short hair.",
          "score": 250
        },
        {
          "text": "He’s another level of handsome.. can pull off all kinds of hairstyles. But money more important than hair so oh well",
          "score": 162
        },
        {
          "text": "You’re assuming people like her have shame.",
          "score": 112
        },
        {
          "text": "to be fair, more than half of the influencers in this country are about face or body you talk as if there's more to offer",
          "score": 81
        },
        {
          "text": "<image>",
          "score": 51
        },
        {
          "text": "That’s all insta influencers globally . Not a sg specific thing.",
          "score": 46
        },
        {
          "text": "Says a lot about the audience doesn’t it?",
          "score": 42
        },
        {
          "text": "At this rate she should just delete her social media and forget about her influencer career or whatever that’s left of it.",
          "score": 31
        },
        {
          "text": "She is still accepting follows on her IG. I just followed her and she accepted. Also her followers count grew by +1k. Think she is also milking the saga for her comeback next time",
          "score": 28
        },
        {
          "text": "He can pull off the pretty boy look so well sia",
          "score": 24
        },
        {
          "text": "She basically started believing her own bullshit lol.",
          "score": 24
        },
        {
          "text": "<image>",
          "score": 24
        },
        {
          "text": "tits...mouth...pussy... maybe even ass? if not how to hook Melvin Lim so deep",
          "score": 23
        },
        {
          "text": "Long and short is next level ?",
          "score": 18
        },
        {
          "text": "HAHHAHAHAHA RIGHT",
          "score": 15
        },
        {
          "text": "Like not very nice of op to keep posting the husband pics leh.. but I must say the husband very handsome with both long or short hair..",
          "score": 14
        },
        {
          "text": "She’s extremely shameless but that’s also how she got to where she is so 🤷🏻‍♀️ I also feel sad for her parents to have their daughter turning out like that.",
          "score": 10
        },
        {
          "text": "Only comeback for her future is cum on her back lmao",
          "score": 7
        },
        {
          "text": "they get more famous , more gooners subscribing monetize more",
          "score": 6
        },
        {
          "text": "don't knock it.. OF can make millions",
          "score": 5
        },
        {
          "text": "Let's not put him in the spotlight, he deserves some privacy.",
          "score": 4
        },
        {
          "text": "Don't understand it, porn already free online but got siao lang paying for it.",
          "score": 3
        },
        {
          "text": "where is his green hat",
          "score": -8
        }
      ]
    },
    {
      "id": "t3_1pjsnbs",
      "subreddit": "u_SecurityBridge",
      "title": "SAP might be patient, but attackers aren’t.",
      "url": "https://old.reddit.com/user/SecurityBridge/comments/1pjsnbs/sap_might_be_patient_but_attackers_arent/",
      "score": 0,
      "num_comments": 0,
      "created_at": "2025-12-11T16:40:03",
      "selftext": "",
      "comments": []
    },
    {
      "id": "t3_1qoesay",
      "subreddit": "SingaporeRaw",
      "title": "Grayce Tan R066196F has transacted 1 hdb rental and 4 condo units in the last 33 months according to CEA filing",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qoesay/grayce_tan_r066196f_has_transacted_1_hdb_rental/",
      "score": 409,
      "num_comments": 107,
      "created_at": "2026-01-27T22:07:01",
      "selftext": "What are your thoughts?",
      "comments": [
        {
          "text": "What I learnt from all my previous and current jobs is that it doesn't matter how hard you work. If your boss like you, means they like you. If they don't like you, means they don't like you, simple as that.",
          "score": 310
        },
        {
          "text": "She don't need to work hard when she just there work him hard and money",
          "score": 233
        },
        {
          "text": "Lol people actually pay for this shit <image>",
          "score": 161
        },
        {
          "text": "that is very true, having a good manager can 1.5-2x your career progression",
          "score": 82
        },
        {
          "text": "Lol <image>",
          "score": 64
        },
        {
          "text": "To fund their overseas trip",
          "score": 48
        },
        {
          "text": "It’s crazy even straits times has caught on. The reacts don’t disappoint. <image>",
          "score": 44
        },
        {
          "text": "Pay to daydream results Self masturbate to the thought of it Just to fund their overseas trip and legitimacy Fools",
          "score": 43
        },
        {
          "text": "Boycott",
          "score": 35
        },
        {
          "text": "It's alarming that newer & newer generations are getting more enslaved except the lucky few (nepo ofc). More resources are getting allocated to the top.",
          "score": 34
        },
        {
          "text": "Can get gracey after this course?",
          "score": 22
        },
        {
          "text": "You’re lucky your manager is from the same village as you, ceca.",
          "score": 20
        },
        {
          "text": "Give me money I also don’t want",
          "score": 14
        },
        {
          "text": "Google reviews for “baby hot pot” are gold",
          "score": 14
        },
        {
          "text": "Moaning class maybe more will sign up haha",
          "score": 14
        },
        {
          "text": "dei punde tiam la",
          "score": 12
        },
        {
          "text": "Bull shitty classes by greedy and stupid real estate agents.",
          "score": 11
        },
        {
          "text": "Bui bui?",
          "score": 8
        },
        {
          "text": "That’s the real truth.",
          "score": 3
        },
        {
          "text": "Will they update the curriculum: “The exact monkey Melvin fucked to destroy PLB”",
          "score": 3
        },
        {
          "text": "For her it’ll be 20x",
          "score": 2
        },
        {
          "text": "very true\nworking world is always about having good connections, social and networking skills that is why i tend to see those who are extroverted with great social skills tend to soar high into their careers if you see those high earning job roles they tend to be catered to extroverted and outspoken people such as FAs, Real Estate, front office in banking, selling Cars,\nthe jobs that prioritise speech skills tend to net you the highest gain",
          "score": 1
        },
        {
          "text": "They are selling to their own agents. That is the point. Captive audience. Members get a discount.",
          "score": 1
        },
        {
          "text": "Tbf, they’re not the real estate agency selling such “masterclass”",
          "score": 1
        },
        {
          "text": "You just noticed? Good for you buddy. 😂😂",
          "score": -30
        }
      ]
    },
    {
      "id": "t3_1qo7sxh",
      "subreddit": "SingaporeRaw",
      "title": "Sgag you don't cb",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qo7sxh/sgag_you_dont_cb/",
      "score": 386,
      "num_comments": 41,
      "created_at": "2026-01-27T16:02:48",
      "selftext": "",
      "comments": [
        {
          "text": "Why is sinkie mainstream humor so fucking terrible. Here's why: 😂😂",
          "score": 111
        },
        {
          "text": "<image>",
          "score": 96
        },
        {
          "text": "Sgag really be cooking and pulling down PLB + Melvin + Grayce’s reputation gao gao 😭😭😭 On a sidenote really feels bad for their partners….especially so close to CNY period, cannot avoid becoming the hottest topic to gossip amongst their relatives etc.",
          "score": 77
        },
        {
          "text": "Somehow SPF & SCDF is better at doing this and it’s not even their job lol",
          "score": 41
        },
        {
          "text": "Their moan make until almost the same as the actual video sia 🤣",
          "score": 28
        },
        {
          "text": "Can still take airplane and go overseas le",
          "score": 22
        },
        {
          "text": "I will avoid CNY if I were them. Just go Thailand or jb hide",
          "score": 18
        },
        {
          "text": "SGAG, brightman video leak parody when?",
          "score": 18
        },
        {
          "text": "Trying too hard sia...",
          "score": 14
        },
        {
          "text": "Feels like primary school kind of joke",
          "score": 14
        },
        {
          "text": "Because SGAG didn't grow out of their primary school life stage.",
          "score": 12
        },
        {
          "text": "SPF and SCDF are likely managed by SGAG themselves sooo",
          "score": 10
        },
        {
          "text": "I might find this funny if i’m a 13 year old",
          "score": 10
        },
        {
          "text": "tot he leak his ex nudes?",
          "score": 7
        },
        {
          "text": "Later they kena also lol",
          "score": 7
        },
        {
          "text": "He got leaked videos lo. Solo on camera.",
          "score": 6
        },
        {
          "text": "Support neither of the parties. Not surprised with this xiao Ming level of humour.",
          "score": 6
        },
        {
          "text": "All in the bandwagon!!!!",
          "score": 5
        },
        {
          "text": "There is an AMA that points to the cuck knowing about Grayce cheating behaviour. Wife and kids I feel bad for.",
          "score": 4
        },
        {
          "text": "No haha actually managed by their own personnel in that station. Scdf main managed by HQ. Some of the regulars were from media before joining.",
          "score": 4
        },
        {
          "text": "Which ex? I only see the videos of him play his stick on cam. tattoo all show de.",
          "score": 3
        },
        {
          "text": "SPF and SCDF got their own regulars making memes on the side, not even kidding",
          "score": 2
        },
        {
          "text": "clairejia23 on tiktok. the one always crying on posts one",
          "score": 2
        },
        {
          "text": "I need the tea! What did I miss?",
          "score": 2
        },
        {
          "text": "Pretty sure he's been out of the company for like half a decade alr",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qovi4o",
      "subreddit": "SingaporeRaw",
      "title": "Such an inspirational promise!",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qovi4o/such_an_inspirational_promise/",
      "score": 296,
      "num_comments": 120,
      "created_at": "2026-01-28T08:12:41",
      "selftext": "“To O, I promise to be your snack feeder, story teller, dream chaser and world builder”.\n\nI wonder how that turned out.",
      "comments": [
        {
          "text": "This a tale of two pretentious idiots who think they know better than everyone else because they made more money than the average person. G- Humble brag about her struggles and her entrepreneurial endeavors, nothing wrong btw, in fact, it might have been inspirational, if it was real. But when the truth comes out, it is just really her tits and serving as her boss' cum bucket that got her where she is and it isn't the advice she so enthusiastically preaches about. M- all that talk about being a righteous christian, god being the boss, family orientated and he basically shits over that image and bankrolls his intern's career because she gave him the sloppy toppy multiple times. Weak af move from the leader of the company.",
          "score": 185
        },
        {
          "text": "Saw on sammyboy forum.. Someone posted that grayce used to be listed as a local freelancer.. Don't know zhun anot..",
          "score": 154
        },
        {
          "text": "property / insurance agents calling themselves entrepreneurs is the biggest joke. they are really just a SALES PERSON",
          "score": 72
        },
        {
          "text": "Interesting. The mindset of being an FL is totally different. Plenty of girls who will sleep around with good-looking guys or wealthy guys who aren’t ugly. But FL means anyone who pays that amount, can up. Then again, there’s also at least another 2-3 with a sizeable following who worked as an FL in the past.",
          "score": 59
        },
        {
          "text": "Freelance prostitute?",
          "score": 28
        },
        {
          "text": "Not surprised at all. Given the free passes Singaporean women get in Singapore, whores are rewarded.",
          "score": 21
        },
        {
          "text": "So funny now watching her wisdom video, fucking pretentious",
          "score": 20
        },
        {
          "text": "How much? 1000/1/1?",
          "score": 15
        },
        {
          "text": "Lol ofc, that’s all sammyboy talks about",
          "score": 15
        },
        {
          "text": "Not to be misogynistic, but if they're not trying to break glass ceiling in career, and content to be taitai or have a career with upper middle class income or just sit around do nothing, they really do benefit more than men.",
          "score": 15
        },
        {
          "text": "I hope she’s aware that her compensation (allegedly at $230k) is fluke. Even in the highest earning industries, while possible, is an anomaly rather than norm. Certainly not a small RE agent company doing something as utterly useless as ‘strategy’. And her self righteous ‘inspirational’ videos about entrepreneurship is a slap in the face in the true entrepreneurs who have to boot strap their way. This is what irks me the most is this.",
          "score": 13
        },
        {
          "text": "Lowest grade sale person",
          "score": 6
        },
        {
          "text": "Now I’m curious who are the 2-3 influencers with a sizeable following who worked as an FL in the past",
          "score": 5
        },
        {
          "text": "Post link leh",
          "score": 5
        },
        {
          "text": "your account is already verified as tagged in your flair because you have completed a captcha to prove that you are not a spam bot. if you are trying to access NSFW content like you wanna watch porn on reddit then yea reddit will prompt you to key in your age",
          "score": 4
        },
        {
          "text": "Seems that many influenzers enjoy showing how wise they are",
          "score": 4
        },
        {
          "text": "Sammyboy has 2 different forums. The Sex forum and 'Courtyard Cafe'. Courtyard cafe is just like sgraw and edmw where you can talk about anything under the sun but without censorship.",
          "score": 3
        },
        {
          "text": "i think in here we post screenshots etc without fear? or need verify age too?",
          "score": 3
        },
        {
          "text": "Maybe freelance during LDR?\nThat’s either always-horny or too much into money sia",
          "score": 3
        },
        {
          "text": "Freelance dog walker ?",
          "score": 3
        },
        {
          "text": "Wait...freelancer for piap piap? OMG just when i thought the tea was done, we get more and more haha.",
          "score": 3
        },
        {
          "text": "Means got fr for grayce?",
          "score": 1
        },
        {
          "text": "Don’t know. Just clarifying what “freelance” means since you asked.",
          "score": 1
        },
        {
          "text": "Oh ok. Means I must go bus forum to check. 🤔",
          "score": 1
        },
        {
          "text": "Honestly nothing wrong if one is upfront and open about such things to someone you promise your entire life to and that he’s ok with it. Not sure for this case if the husband even knows until the recent leaks.",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qozanw",
      "subreddit": "SingaporeRaw",
      "title": "PropertyLimBrothers as an ex intern",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qozanw/propertylimbrothers_as_an_ex_intern/",
      "score": 290,
      "num_comments": 133,
      "created_at": "2026-01-28T10:53:30",
      "selftext": "(rant) I used to intern in the company for a while when our school assigned us. Their work culture was like a “family” as they call it, with christian quotes written on some boards. Didnt enjoy it as an introvert due to the environment which prioritised socialising>work quality, but that’s just me. We had to attend weekly meetings, which was often hosted by Melvin Lim, and got paid $800 per month as mentioned by the redditor who disclosed everyone’s salaries. Late fee of $10 applicable to interns as well if late for meetings even 5 mins, money requested by events team which goes to pantry supplies. The best thing from this scandal is Marc filling in as Interim CEO. He was a genuinely nice person who gave good feedback and listened to our presentations since our mentor would be sick/apply for leave on our presentation days. Can’t say the same for anyone else there though. Could tell that Carrie the HR person didn’t like interacting with interns as well\n\n(edit: adding on that every week required by mentor to interview 2 agents on their closed cases which was ridiculously hard since theyre too busy to show up/will ghost u online, have to text like 30 of them for example at once to get 2 to reply to u within that wee…waste of time since all information is already recorded previously)",
      "comments": [
        {
          "text": "The HR person is a joke la. Just go on linkedin, lots of title inflation and no credible experiences in the company. Red flag.",
          "score": 179
        },
        {
          "text": "Her LinkedIn is very unremarkable. 1 year at Forest City, then from Manager to a $150K Vice President. A bit slower trajectory than Grayce, but I won’t be surprised if there was hanky panky there too.",
          "score": 107
        },
        {
          "text": "Ex-staff here. Carrie is a hardworking Malaysian with nothing much going for looks. She is fiercely loyal to Melvin out of the fact that SGD is bigger than Ringgit and not only does she not question her master, she also helps him “bury the bodies”, and act as the Gestapo to spy and rat on people.",
          "score": 98
        },
        {
          "text": "Potential hot take: many HR personnel used to be secondary school mean girls who thrive on toxicity.",
          "score": 82
        },
        {
          "text": "she wasnt helpful at all.. when talking to her she seems impatient and she would relay her message to mentor instead of replying to me when i was in office which was weird as hell, shows a lot abt character if u act like youre above us",
          "score": 80
        },
        {
          "text": "That is so malaysian. How did someone able to pivot into sg so easily",
          "score": 46
        },
        {
          "text": "She's too old. Bloody jhk",
          "score": 40
        },
        {
          "text": "https://www.propertylimbrothers.com/teams/carrie-teoh/ Carrie is the “mother” of PropertyLimBrothers. Simply put, she plans, directs, and coordinate the administrative and financial functions of PropertyLimBrothers. Additionaly, she oversees the recruiting, interviewing, and hiring of new team members. Despite her heavy workload, she finds time to attend the daily BFT, because health is priority! As our “mother”, you can also find Carrie cooking some healthy and delicious meals in our office kitchen that’s named after her.",
          "score": 30
        },
        {
          "text": "because 65% approved. I didnt. Did you?",
          "score": 30
        },
        {
          "text": "A person's real character is presented when dealing with someone that has nothing to offer in return.",
          "score": 29
        },
        {
          "text": "Also a bit surprise how with her background she went from HR to HR+ Finance. It’s common for finance people to undertake HR (comparatively a more administrative and generalist function), but not the other way round.",
          "score": 17
        },
        {
          "text": "Typical mudlander",
          "score": 17
        },
        {
          "text": "Sounds like Ghislaine Maxwell wor",
          "score": 15
        },
        {
          "text": "after PLB can go work for ICE in the US",
          "score": 15
        },
        {
          "text": "Raking in 500K MYR a year…",
          "score": 13
        },
        {
          "text": "ure not her level. Royalty doesn't talk to peasants, you know.",
          "score": 12
        },
        {
          "text": "Carrie is a hardworking Malaysian with nothing much going for looks. She is fiercely loyal to Melvin out of the fact that SGD is bigger than Ringgit and not only does she not question her master, she also helps him “bury the bodies”, and act as the Gestapo to spy and rat on people. Typcial toxic Malaysians who are working in Singapore for a good retirement back in Malaysia",
          "score": 10
        },
        {
          "text": "I am from the deep red state.",
          "score": 7
        },
        {
          "text": "This was precisely the sort of profile I thought she is when I compare her pay cheque to her official title (that generally doesn’t pay that scale in a company of their size)",
          "score": 7
        },
        {
          "text": "Can’t agree more. Which intelligent, well-adjusted person wants to manage employee performance as their dream job?",
          "score": 3
        },
        {
          "text": "There are imposters among the 65%.",
          "score": 3
        },
        {
          "text": "And earn 12.5k per month with that kinda degree and 8 years of experience. The premium paid could be for the character. However, there is an oversupply of her countrymen with similar character in Big 4 audit and after seeing her pay they must have been questioning their career paths.",
          "score": 3
        },
        {
          "text": "really meh? she sounded really helpful when i had problems within the company leh, even guided me through every obstacle i was facing last time",
          "score": 1
        },
        {
          "text": "Colbie not bad leh if got ig can pm thx!",
          "score": 1
        },
        {
          "text": "you have any examples of what she did?",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qol5mz",
      "subreddit": "SingaporeRaw",
      "title": "Lol did Grayce Tan got locked out of her Facebook or something. Why is her wedding post still publicly available?",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qol5mz/lol_did_grayce_tan_got_locked_out_of_her_facebook/",
      "score": 248,
      "num_comments": 74,
      "created_at": "2026-01-28T01:56:05",
      "selftext": "",
      "comments": [
        {
          "text": "Really pity the husband.",
          "score": 158
        },
        {
          "text": "Maybe she is posting it publicly to try to save her own marriage? Maybe the husband totally ignored her and she posting to show that she still want him? Such things we dont know one but most people reaction when facing cheating is either very angry and sad or fall into extremely cold. Is either you show your emotional or surpress everything inside",
          "score": 130
        },
        {
          "text": "That's what Melvin did.",
          "score": 115
        },
        {
          "text": "Fuck her He is good looking, faithful and capable Sure can find another more loyal one and better one. She on the other hand, can live her life being known as the woman who cheated for money.",
          "score": 105
        },
        {
          "text": "Homeschooled?? Oh they are THAT kind of Christian meh",
          "score": 89
        },
        {
          "text": "<image>",
          "score": 86
        },
        {
          "text": "Luckily the kids are home schooled, if not they wouldn’t be able to face their classmates.",
          "score": 82
        },
        {
          "text": "Yea. I think he works in Razer (toxic company) and is a head of some department. And has very strong analytics and maybe coding skills also. Is a very capable man, I briefly saw his experience somewhere. Not only that, got one video posted of him adjusting their Christmas decorations, fit zai. Someone like that deserves better honestly.",
          "score": 38
        },
        {
          "text": "Wedding wear green helmet. Now also wear green helmet.",
          "score": 33
        },
        {
          "text": "<image>",
          "score": 30
        },
        {
          "text": "overshare lo. When its good, its great but when its bad, its 💩",
          "score": 28
        },
        {
          "text": "Wife busy homeschooling kids and taking care home, whilst husband office-schooling his mistress, irony.",
          "score": 20
        },
        {
          "text": "NS probably also",
          "score": 13
        },
        {
          "text": "Can’t be la, all post are dated way before their affair found out and they wouldn’t privatized all their ig also if so.",
          "score": 11
        },
        {
          "text": "How is razer toxic? Just curious",
          "score": 8
        },
        {
          "text": "Boss aka the CEO is pretty toxic and egoistic. Thinks himself of being the sg Steve Jobs in tech when his biz didn’t even cut it in sg back then unlike SWH lol. You can google even he himself admits it in interviews",
          "score": 7
        },
        {
          "text": "thats crazyyy so he was actually serious bout what he said in Salt & Light but had some secret desires",
          "score": 7
        },
        {
          "text": "With RGB lighting",
          "score": 6
        },
        {
          "text": "Can enlarge the mistress? She looks like a small kid in the family protrait",
          "score": 4
        },
        {
          "text": "at least earlier uncover better than later la, rather than next time got kids then find out 🤭",
          "score": 3
        },
        {
          "text": "Have a relative in the firm ( not sure if there anymore ). It is a “hire-fire” culture where there is close to zero job stability. A few departments are run dictator-style where if the boss is in a horrible mood can end your employment the first chance he/she gets without due justification (No pip just fire or make it toxic till you leave). Shouting, screaming and more or less all round SME environment. Not the first I’ve heard of the company. Also had peers and the description of the company is… not ideal.",
          "score": 2
        },
        {
          "text": "Luckily mine was black.",
          "score": 2
        },
        {
          "text": "He thinks he is Elon Musk.",
          "score": 1
        },
        {
          "text": "sorry for asking..what actually green helmet mean",
          "score": 1
        },
        {
          "text": "Getting cucked by your spouse",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qok7g9",
      "subreddit": "SingaporeRaw",
      "title": "Comments didn’t disappoint 🤣",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qok7g9/comments_didnt_disappoint/",
      "score": 219,
      "num_comments": 38,
      "created_at": "2026-01-28T01:23:18",
      "selftext": "Restaurant is owned by M and G",
      "comments": [
        {
          "text": "<image> Lore is impeccable.",
          "score": 144
        },
        {
          "text": "Changed name to Yu Dong Lai hotpot <image>",
          "score": 66
        },
        {
          "text": "Do people realise that all these 1 star reviews will be removed by Google very quickly as examples of review bombing?",
          "score": 48
        },
        {
          "text": "lol not fast enough tho damage control needs to be more proactive lei...we are more than 48 hours in",
          "score": 36
        },
        {
          "text": "flame them all you want but can you guys not post pictures of their families? not just his kids but those in her family too. the doxxing is too much",
          "score": 33
        },
        {
          "text": "You can’t remove centuries of cultural excitement in 抓奸 (catching any form of cheating). It’s cross cultural. Modern laws made a lot of things illegal but the excitement to gossip, punish them will always be there. A lot of people use them as a chance to reiterate subtly to their partners on the topic of fidelity. They try to understand why it happened and how they can prevent it happening to themselves. This contributes to the heat. Their family is collateral damage it’s true. But the real perpetrators are really not those online gossipers or coffee shop sharing. It’s the one who do the actual deed. They get no justice and that’s true too. This is not part of modern law. Spousal fidelity and duty. Less than a century ago the families will still have been implicated and shamed given their public image. At least there will have been some form of justice with the pig cage (I’m not supporting that, it’s barbaric and unfair but I’m making a point about family damage being inevitable). These are 2 pretty public people who willing put their life’s on display, so i am guessing on technical terms those information are already public and not disclosed against their will.",
          "score": 33
        },
        {
          "text": "People have no comprehension of limits online behind anonymity. I just hope they never have the day when they themselves are the subject of online gossip and ridicule like what they are dishing out to others now no matter rightly deserved or otherwise.",
          "score": 20
        },
        {
          "text": "They did the obvious like insta but some stuff can’t tbh like here- that said most of these will be removed \nOdd that no one reviewed the company though, just this restaurant",
          "score": 19
        },
        {
          "text": "Singaporeans love to kick a person while they are down Singaporeans love to kick a \"goody\" influencer while they were caught in a supposedly immoral behaviour. Changed your sentence for you. And why are you even sticking around in these posts? Aren't you had enough of Grayce Tan? Or trying to be a white knight?",
          "score": 16
        },
        {
          "text": "The one with the Spider-Man pic is too fkiny funny 😂😂😂",
          "score": 15
        },
        {
          "text": "Your comment made me laugh omg-",
          "score": 10
        },
        {
          "text": "Thanks. I am having too much fun on this saga",
          "score": 8
        },
        {
          "text": "They deleted all the 1 star reviews",
          "score": 7
        },
        {
          "text": "Singaporeans love to kick a person while they are down",
          "score": 7
        },
        {
          "text": "You think by saying this you gonna change anything? 😂😂 pathetic.",
          "score": 6
        },
        {
          "text": "Changed name to Yu Dong Lai hotpot Fish Hole Come hotpot?",
          "score": 5
        },
        {
          "text": "Users of edmw came here, multiple posts the past few days. Matched election hype",
          "score": 3
        },
        {
          "text": "Melvin is not a good name for a gang member!",
          "score": 3
        },
        {
          "text": "Because this restaurant was opened by two of them. Melvin Lim and Grayce",
          "score": 2
        },
        {
          "text": "They should give 5 stars with that comment. Will it be removed?",
          "score": 2
        },
        {
          "text": "Lai liao, lai liao, self righteous internet hero lai liao",
          "score": 2
        },
        {
          "text": "Come Inside the Fishy Hole",
          "score": 1
        },
        {
          "text": "Yes it has been removed",
          "score": 1
        },
        {
          "text": "Users of edmw came here, multiple posts the past few days. Matched election hype",
          "score": 0
        },
        {
          "text": "Not defending her. But how people are taking the opportunity to jump on the hype train to be malicious is disgusting.",
          "score": -15
        }
      ]
    },
    {
      "id": "t3_1qobxj2",
      "subreddit": "SingaporeRaw",
      "title": "PLB founder when your wife/gf joins the company",
      "url": "https://old.reddit.com/r/SingaporeRaw/comments/1qobxj2/plb_founder_when_your_wifegf_joins_the_company/",
      "score": 200,
      "num_comments": 72,
      "created_at": "2026-01-27T20:00:53",
      "selftext": "Melvin laughing at you all pathetic wage cucks.",
      "comments": [
        {
          "text": "She posted this last year on her FB, like literally creating her own memes lmao. <image>",
          "score": 84
        },
        {
          "text": "Sax too good, didn’t even realise the succubus was destroying his company and his family",
          "score": 78
        },
        {
          "text": "Waiting for cuck to release statement and say he support her and forgive her.",
          "score": 61
        },
        {
          "text": "Is really, if you fkin ugly but got money women still will bang u. Lol",
          "score": 60
        },
        {
          "text": "Melvin hear already grow even harrdr le",
          "score": 36
        },
        {
          "text": "I bet that’s the face he made when he saw her mangoes",
          "score": 27
        },
        {
          "text": "even in such a picture.. also need to squeeze her boobs out for all to see",
          "score": 20
        },
        {
          "text": "Most women are whores for money and status. Some are more upfront, others are more subtle. Basically, most women are gold diggers, while some are just better at hiding the shovel.",
          "score": 18
        },
        {
          "text": "<image>",
          "score": 16
        },
        {
          "text": "<image>",
          "score": 16
        },
        {
          "text": "I can make that face too if I saw her mangoes",
          "score": 14
        },
        {
          "text": "Yesh. 6 pax is no use against 6 zeros. \nAlso for female, big win already. Sure got people wanna eat as long as you open shop.",
          "score": 12
        },
        {
          "text": "Netorare is if the cuck don’t like it. Netorase is if the cuck likes it. Netori is if you are the man who cucked the cuck.",
          "score": 11
        },
        {
          "text": "I would have, too. Lmao.",
          "score": 10
        },
        {
          "text": "Irl netorare",
          "score": 9
        },
        {
          "text": "Literally every casual photo I see of her got give half ball Sia Slug jiushi slug",
          "score": 8
        },
        {
          "text": "Hopefully this Thurs night I can make that face.",
          "score": 8
        },
        {
          "text": "Eh don’t judge hor. At least she stick to her New Year’s resolution.",
          "score": 7
        },
        {
          "text": "Eh. I got see this machine at the gym before.",
          "score": 5
        },
        {
          "text": "Or her beef curtains",
          "score": 3
        },
        {
          "text": "Lucky you",
          "score": 2
        },
        {
          "text": "Monkey 🐵",
          "score": 2
        },
        {
          "text": "It’s 10mil on thurs night bruh",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qojzpb",
      "subreddit": "singaporefi",
      "title": "Advice to your younger self (20s, 30s)",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qojzpb/advice_to_your_younger_self_20s_30s/",
      "score": 53,
      "num_comments": 38,
      "created_at": "2026-01-28T01:16:04",
      "selftext": "Hi hi, I’m a 28yo earning 6K / mth after cpf as a software developer. Lowkey proud to hit 200K in savings and investmenrs excluding CPF. But I also have a lot of money anxiety and feel broke despite being financially better off than my parents at my age.\n\nI want to wait to buy my own place instead of renting, but even a flat for one (ie not getting married yet) is like 700K-1M based off 99.co listings.\n\nAm I being too ambitious and idealistic? Should I be expecting to rent for the rest of my life? How do I hit 1M assets in my life?\n\nHave you felt this way when you were younger? What would you tell yourself now?",
      "comments": [
        {
          "text": "on the flip side, i'm a millionaire in my late 30s, and i achieved that by being prudent with my spending and investing consistently. but my regret is not spending a bit of that money more when i was younger. travel a bit more. date around a bit more. enjoy life a little bit more. i realised money itself doesn't buy happiness. but it's a tool that can help you achieve happiness. you must be willing to use that tool (within limits, of course) though.",
          "score": 94
        },
        {
          "text": "What you’re describing is more common than people admit.\nHitting 200k and still feeling broke usually isn’t a money problem. It’s a reference frame problem.\nIn your 20s, progress is mostly invisible. Your numbers move, but your life doesn’t feel dramatically different yet. So the brain fills the gap with anxiety.\nOne thing I wish I understood earlier: milestones like “1M” or “own place” aren’t destinations. They’re just coordinates along a much longer path.\nAt 28, the most valuable asset you’re building isn’t the 200k. It’s the fact that you’re already on a stable, compounding trajectory.\nThe danger isn’t renting or buying late. It’s letting future goals make the present feel like failure.\nIf I could tell my younger self one thing, it’d be this:\ndon’t judge your life using endgame metrics while you’re still in the accumulation phase.\nYou’re not behind. You’re early",
          "score": 54
        },
        {
          "text": "It really depends on your long term goals. 200k at your age is a good achievement. How do you plan to compound going forward? Through stock investments, or through your lived-in property? Some people aim to climb the wealth ladder using stock investments, some people consider their home their investment and aim to flip every few years. If you buy a place of your own now, a large portion of your salary will go to your mortgage loans, and you lock yourself out of the option to BTO in the future. It will also eat up a significant portion of your existing cash, leaving you with less to invest in stocks. Your goal will be to eventually sell off your property for profit in the future. Alternatively, if you rent, you could potentially have a roof over your head at a cheaper cost and you'll be able to invest in stocks with the rest of your savings. But your rent payments won't benefit the appreciation of your home, only benefits your landlord.",
          "score": 32
        },
        {
          "text": "This is true. Money is a tool and these days if anything can be solved with money I don't overly take any issues too seriously. If something Eg a service can can be used to make my life easier, I stop being stingy with myself on that.\nIts a tool not something you accumulate and never use and never bring it with you",
          "score": 11
        },
        {
          "text": "If you continue your trajectory in terms of income, and optimise your savings by continuously DCA and staying invested, you will hit a million before 40 yo. Maybe even 2-3 millions (depending on your income growth). No problem with not owning your own property/ home, especially if there is a chance for you end up owning a lousy property, which is worse than renting. When counting your networth, you should include all CPF and assets, minus liabilities. Be at peace, smell the roses, and enjoy the sunshine, is my advice.",
          "score": 11
        },
        {
          "text": "No choice lei, singles are heavily penalised for being single. All I can say is continue working and investing. With a job, the mortgage will be manageable. It's just the initial downpayment for most people.",
          "score": 7
        },
        {
          "text": "Wise words. I’m not OP but I’ve gained some insight from reading your reply.",
          "score": 6
        },
        {
          "text": "Let people calculate their network how they wish. Some like me like to calculate liquid networth, as I’m not near retirement age. Also people don’t think about CPF when calculating their FI number",
          "score": 5
        },
        {
          "text": "Not stopping you. But liquid networth, is liquid networth. Total networth is total networth. I have multiple metrics (e.g., networth related) to measure for investment, asset allocation, retirement planning etc. As long as you know it yourself. Yes, I recognise that liquid networth is useful when you are trying to determine whether you have enough for daily necessities before getting your CPF (if you plan to retire early) etc. But liquid networth underestimates his/her networth. Not everyone buy the same types or size of houses, have CPF or no CPF etc., have the same loan size. Thus the right way to compare across all timeline, and determining “true” networth, is total assets minus total liabilities (total networth).",
          "score": 5
        },
        {
          "text": "Indeed. I tried using the technically \"right\" way of calculating networth but tbh it isnt practical in any sense of the word. Alot of times, especially for Singaporeans, incorporating CPF/asset value of primary resident gives the false impression that they are arriving to their FI number when in fact they are nowhere near FI.",
          "score": 5
        },
        {
          "text": "2-3rm for single still maybe viable. Any bigger and it'll be very costly to tank alone. Renting is good. Can move where ever you like. Work overseas, come back get big bump in pay.",
          "score": 5
        },
        {
          "text": "It's nice to have your own place, but buying a 1M place means you are tied to your job and mortgage. You could always sell it, but you may not be able to sell it at the right price. So it's a choice between freedom and a place of your own.",
          "score": 4
        },
        {
          "text": "Hmm DCA your savings into VOO or VRWA. This will get you to 1m a lot faster!",
          "score": 4
        },
        {
          "text": "Thanks so much for this. I'm not HENRY (early 30s, annual is just over 100k) and I always feel like I'm behind my peers as many of my friends are in civil service which I associate with good annual packages. Recently I looked at all my cash and investments and realised I'm doing much better than I thought. But still I can't shake off the feeling of being behind others.",
          "score": 3
        },
        {
          "text": "All of CPF? Or just OA for example?",
          "score": 3
        },
        {
          "text": "Die with zero.",
          "score": 2
        },
        {
          "text": "Hard disagree, I have been working overseas for the past 3 years and now that I’m coming back, plenty of roles are looking for international exposure.",
          "score": 2
        },
        {
          "text": "Yeah, this is much more apparent for singles since we are effectively locked out of the market for HDB flats till 35 (especially if you have peers moving to the next phase in their life). I have been working for 5 years but I don’t feel that it is very different from university days (except less freedom haha) - doing assignments/projects etc.",
          "score": 1
        },
        {
          "text": "Is 34 turning 35 considered late thirties to really take it slower",
          "score": 1
        },
        {
          "text": "I would agree. But also, I by far, would rather be in your position than someone in financial hardship. Life is a lot of give and take unfortunately but financial issues are one of the hardest holes to climb out of. It's hard to just get more income.",
          "score": 1
        },
        {
          "text": "That's really not a problem at all, renting gives you the freedom to up and go if you don't enjoy the place. There's also alot of expenses as a home owner.",
          "score": 1
        },
        {
          "text": "Overseas experience is overrated now and not easy find job elsewhere as foreigner. World’s not the same bro.",
          "score": 1
        },
        {
          "text": "im sure",
          "score": 1
        },
        {
          "text": "OK THANKS CHATGPT",
          "score": 0
        },
        {
          "text": "All CPF, to determine the correct total networth.",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1lfr4ja",
      "subreddit": "u_alejandromnunez",
      "title": "I am building a massive real time strategy game. Would you play something like this?",
      "url": "https://old.reddit.com/user/alejandromnunez/comments/1lfr4ja/i_am_building_a_massive_real_time_strategy_game/",
      "score": 1218,
      "num_comments": 547,
      "created_at": "2025-06-20T08:58:52",
      "selftext": "",
      "comments": [
        {
          "text": "I miss the golden era of RTS and RTT games so much. Command and Conquer,Commandos,Company of Heroes,World in Conflict- wish we made more of them, and incrementally innovated in the genre.",
          "score": 3
        },
        {
          "text": "I really like some of the features in Total Annihilation, where you could program routes / waypoints and actions for units, such as \"Patrol\" etc. Very useful also for support-units, and it was as easy as chosing and action and holding down shift, and then click the route / area you wanted....",
          "score": 3
        },
        {
          "text": "Maybe TLG will revive part of that sentiment, I am an old school RTS fan and that's one of the reasons I am building TLG as a more complete RTS like the old ones (with construction, economy, resources, etc), but using all the newer technologies available now to make it massive. Remember to wishlist it onsteamand join the discord to be in the early tests this year!https://discord.gg/thelastgeneral",
          "score": 2
        },
        {
          "text": "Does steam have a reminder for games basically u get a notification if a game is released? Cuz im gonna be waiting for this",
          "score": 2
        },
        {
          "text": "will it be ready by this Christmas?",
          "score": 2
        },
        {
          "text": "I am aiming to release early access at the end of this year, but I am not sure yet if I will make it in time. It depends on how the initial alpha playtest and the demo go. Remember to wishlist it onsteamand join the discord to be in the alpha play tests in a couple months!https://discord.gg/thelastgeneral",
          "score": 2
        },
        {
          "text": "if include space stuff yes",
          "score": 2
        },
        {
          "text": "I mean it looks cool but it looks more like a Battlefield game than a strategy game. I don't get it - for an RTS you never have time to zoom in on the characters and see what they are doing so it makes no sense to do that in the promo video. I am a a bit confused if I control the squads or a single soldier at times.",
          "score": 2
        },
        {
          "text": "RTS games are something that for me have either been like baby's first RTS or You are the General you are not going to win if you havent watched like 5 hours of tutorials. I havent played this game, but this, this seems like something that anyone could get into. The highlighting feature seems very fun to use and building being more interactive than clicking on a button and waiting 5 minutes. I have somethings that dont seem to fit in for me, I am not saying they are bad I think they are cool, but as I said dont fit in, the sending troops to enter buildings is cool and being able to control them seems underlooked in other games.",
          "score": 2
        },
        {
          "text": "People do play games like this... Looks like every Eugen System game (Warno, Steel Division). Not sure how the highlighting of the ground works, but maybe that's novel, and if it works by making less micromanagement on top of a game similar to Warno then that'd be interesting for sure.",
          "score": 2
        },
        {
          "text": "Hi, long time fan of RTS here. I think it fits the bill. I played a ton of RTS since early C&C and Warcraft days. I played large scale rts from Total War series to Wargame. For me the thing that draws me in to modern military RTS is the explosions lol. Just building an army of hotwitzer and sending rain of fire is satisfying to watch. This is what I love about games like for example World In Conflict. Can't wait to try your demo.",
          "score": 2
        },
        {
          "text": "I’m not sure if the time for RTS games has already passed. Nowadays, fast-paced gameplay or games that don’t require quick results seem to be more popular. Still, I’d love to play some Close Combat in this kind of view ;)",
          "score": 2
        },
        {
          "text": "Would love to see bodies and destroyed vehicles just being there and not despawning. Might be huge hit for performance if done wrong but i believe.",
          "score": 2
        },
        {
          "text": "This is a weird one - but I will if you can't zoom out too much. I don't want 'Labels saying those 4 pixels MILES BELOW are a T-27 vs labels saying those 4 pixels are a helicopter'. !",
          "score": 2
        },
        {
          "text": "Looks like WIC. I have checked out Warno but its too hardcore for me. Where would you say this sits?",
          "score": 2
        },
        {
          "text": "I'm designing a real-time monitor and action UI/UX system for battlefield management (UX/UI independent portfolio case) for use in the real world, and I can't help but think I would make a game out of it.. I wanted to ask you OP what was your motivation to make this game? Bring back RTS or any other reason? Just curious. Added to wishlist btw! Good luck!",
          "score": 2
        },
        {
          "text": "this reminds me of Hearts of Iron IV but if it wasn't the world map",
          "score": 2
        },
        {
          "text": "I already joined the Discord server. This is right up my alley. I am a big Wargame: Red Dragon and World in Conflict fan. With a bit of polishing, this could be great. Like the units that just \"pop up\" or \"disappear\" when they enter a building. Like a small \"entry animation\" where the soldiers provide cover to each other and then open the door/go in.",
          "score": 2
        },
        {
          "text": "Dude this is the exact type of game I'm interested in!! A big map conquer and strategy build game that also let you go in in 1st person? Imagine if it is online with many players how that's gonna be! Looking forward to it's release!",
          "score": 2
        },
        {
          "text": "looks insane! what is it built with and how much experience did you bring to be able to now build this yourself?",
          "score": 2
        },
        {
          "text": "This looks sick! is it going to be 1v1 or will it have like 1 General that orders attacks and big lobbies with people choosing like im an inf or chopper pilot",
          "score": 2
        },
        {
          "text": "I would love to, however, I need to know what are the recommended typical specs in order to run your astonishing game.  Does the game compatible with RTX 40 series?",
          "score": 2
        },
        {
          "text": "Since 2000 I envisioned an rts game like C&C but with the ability to change to FPS and command a single unit real time . (also modes where you split players into teams one is the strategist the other the logistics and the third the field guy) . But I am too lazy and never learned to code.",
          "score": 2
        },
        {
          "text": "I would love to play this! I recently picked up playing Combat Mission Battle for Normandy again. And sometimes I wish I could just switch to FPS on units to do things myself.",
          "score": 2
        },
        {
          "text": "You can wishlist it on Steam:https://store.steampowered.com/app/2566700/The_Last_General?utm_source=reddit_ads Join the Discord to be an early tester:https://discord.gg/thelastgeneralOr join the subreddit if you don't have discord:r/TheLastGeneral",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qonhsu",
      "subreddit": "singaporefi",
      "title": "U.S. dollar devaluation and inflation will underscore 2026",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qonhsu/us_dollar_devaluation_and_inflation_will/",
      "score": 28,
      "num_comments": 68,
      "created_at": "2026-01-28T03:15:41",
      "selftext": "Get ready",
      "comments": [
        {
          "text": "97 to 96 is less than 1%. As long as SPY gains more than that we're still making profits holding it.",
          "score": 30
        },
        {
          "text": "Agree. So many noobs here. Devaluation is a non-issue so long companies still continues having massive profit. What’s 5-10% difference in FX when total gains is 100++% - this is the true number for my decade long DCA index as part of my folio.",
          "score": 23
        },
        {
          "text": "Devaluation even contributes to higher gains in USD. The big companies all do international business. You just need to consider both gains and FX together, or if you are using an SGD-denominated product like Amundi Prime USA, you can just turn your brain off also as it will reflect the \"true gain\" for us.",
          "score": 10
        },
        {
          "text": "Yes, theoretically true but reality is far more complex.  The closer reality is weaker USD is resulting in higher producer prices and killing corporate profits. The only reason why we do not see this yet is the inflated stock prices in the AI trade.  Once that flattens, you will see the real picture.",
          "score": 7
        },
        {
          "text": "YTD. We are at 28 Jan today, not 28 Dec.",
          "score": 5
        },
        {
          "text": "Most companies give 10-15% discount for ESPP so it should offset currency losses.  You might want to check your company's discount.",
          "score": 3
        },
        {
          "text": "That's the real issue isn't it? We have two compounding problems - a cyclical stock market that should return to mean and a non-cyclical devaluation of USD due to policies.",
          "score": 2
        },
        {
          "text": "You loh, and not only that you are also blind af. I already say my vested horizon is already 13+ years liao of constant DCA. you go pluck a number from YTD for S&P. For benefit of doubt, my etf is VWRD. Have not count in any individual overseas/local stocks.",
          "score": 2
        },
        {
          "text": "Granted past results doesn’t mean future performance but you use YTD to predict next decades? Ok.",
          "score": 2
        },
        {
          "text": "Why you look at one month only?",
          "score": 2
        },
        {
          "text": "Two separate issues. We have seen unprecedented gains in the past few years. We should fully expect this not to be sustainable. There will definitely be \"flattening\", but whether it's decreased gains or reds, it's hard to say.",
          "score": 1
        },
        {
          "text": "Actually, I'm in a less complicated position because I have like less than 1/25 of my port exposed as rest are hedged. Look, all I'm saying is USD depreciation is a real problem if you are in accumulation mode.  If you are in VWRA, the problem is somewhat alleviated by currency appreciation of the 40% non-US stocks.  But if you are 100% US (CSPX), then be careful.",
          "score": 1
        },
        {
          "text": "Does this mean it’s pretty bad now for employees to participate in USD ESPP? Swapping SGD salary for USD company shares",
          "score": 1
        },
        {
          "text": "Then I challenge you to look 10 years horizon for both USD/SGD and S&P or world ETF index for that matters.",
          "score": 1
        },
        {
          "text": "Please at least try harder leh. Vwrd only starts in 2012 which I vested in largely. VWRA like only 2019? What 30 years cock you talking. No one knows is precisely why I invested in world ETF (VWRD) I mentioned for past 13 years. That along with some PM, BTC, local dividends and real estate.",
          "score": 1
        },
        {
          "text": "I’m not using history to predict the future in a mechanical way. I’m using the S&P 500’s track record to see whether FX has ever really mattered for long-term equity returns. That history already includes multiple currency cycles due to policy shifts etc and it consistently shows that FX moves affect short-term returns but don’t drive long-term market outcomes. Calling historical data “irrelevant” doesn’t strengthen your argument. it just signals that you don’t have a better one.",
          "score": 1
        },
        {
          "text": "Fine.  Past one year: S&P +14.06%, USD depreciation -6.57%.  Net 8.64%, 46% destruction of value.",
          "score": 1
        },
        {
          "text": "No? Keep calm and DCA applies to almost everybody. Maybe you are in a more complicated position because you already retired.",
          "score": 0
        },
        {
          "text": "Fine.  Past one year: S&P +14.06%, USD depreciation -6.57%.  Net 8.64%, 46% destruction of value.",
          "score": 0
        },
        {
          "text": "Don't you think it's interesting that I'm talking about regime change over the past year due to US policies while you are trying to anchor numbers based on a history that is irrelevant?",
          "score": 0
        },
        {
          "text": "Keep calm and DCA and number go up. The problem is that as numbers go up the value of each u it buys less real world physical things. Paper and digits can be conjured up at will. But the earth is finite. You can’t print energy and material. That’s the problem with using a currency that constantly changing to measure real wealth. It distorts the value of things. The Turkish stock market was one of the best performing stock markets in terms of % gain. But when the depreciation of the lira is factored in wealth was not made or preserved. Same things happened in Venezuela. Currency can fall and the stock market increases to compensate. In an evironment like this you have several horses you can choose. I’ll choose the fastest horse not the horse that can run.",
          "score": -1
        },
        {
          "text": "You don’t know the times you’re living in. DCA into VWRA worked well in the last 30 years. But the regime is changing. A capital rotation event is happening but most people here are still asleep. People look at the price of gold and silver and ask why. No one truly understands what’s happening or cares to understand what’s really happening. How you invest in the next 20 years will be different from how your senior have did in the past. You will lose purchasing power over time because the SGD cannot be allowed to strengthen against the USD. Your gains in value will be negated by the loss in purchasing power over time.",
          "score": -1
        },
        {
          "text": "Correction - You are using decades of accumulation to arrive at 100%++ to make a point.  I was merely using YTD to illustrate that USD devaluation has an impact and can't be ignored. If YTD is what you are objecting to, we can always use last year's data as that's when US policies start to have an impact on USD deterioration.",
          "score": -2
        },
        {
          "text": "Most people here don't care about your accumulation. They care about their next decades of accumulation.",
          "score": -3
        },
        {
          "text": "S&P 500 YTD is +1.71% while USD loss is -1.63%.  That's 95% destruction of value, leaving you a +0.08% YTD return. If this continues and USD does not taper, you are looking at less than 1% return per annum.  Less off SG 2% inflation and you are net negative in real terms. So who's the noob?",
          "score": -6
        }
      ]
    },
    {
      "id": "t3_1qodzvh",
      "subreddit": "singaporefi",
      "title": "ETFs to consider (via IBKR)",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qodzvh/etfs_to_consider_via_ibkr/",
      "score": 25,
      "num_comments": 21,
      "created_at": "2026-01-27T21:35:06",
      "selftext": "Hi All, just to kindly seek some opinions if don't mind.I currently already invested 150k + in VWRA (via IBKR Platform) thus far.\n\nMy strategy is just to hold it over a long time horizon e.g 15 years or more, if possible.I don't really monitor prices to see when is a good time to sell, like how some aggressive traders does with volatile shares, etc.\n\nJust realised that there are other ETFs have an even lower expense ratio than VWRA (0.12% vs 0.19 TER).\n\nExpense Ratio Comparison (Annual)\n\n\\Note: Invesco also launchedFWRA(Invesco FTSE All-World UCITS ETF) which has a lower expense ratio of 0.15%, competing directly with VWRA.*\n\nAm thinking of keeping my VWRA investments (Rather than withdrawing).But few months later, once have accumulated more savings then might consider invest in other ETFs (in addition to VWRA).\n\nJust curious, on everyone's thoughts on ACWD/CSPX/WEBN/FWRA being a better potential ETF to invest in as compared to VWRA due to them having a lower expense ratio?",
      "comments": [
        {
          "text": "Oh oh, I know this one. First, you should just kick cspx out the window. Thats a US only fund as compared to the \"world\" funds of the rest. Here are my thoughts, your conclusion you draw yourself :) Webn: (idk where you saw 0.15% ter, I got 0.07% ter) Pros: lowest TER. Tracks solactive index, 99% correlation with MSCI ACWI. Cons: not exactly tracking the \"main brand\" indices so future performance may vary. Just launched (2024), low volume and shorter track record. Note: EUR, not in USD according to what I found. So idk how it might work with IBKR, I assume no change but im not 100% sure. fwra: Pros: VWRA but cheaper + instead of Vanguard, its invesco. Cons: low volume, relatively new as well. vwra: Pros: high liquidity, broader than ACWD in terms of \"coverage\", vanguard is a giant and staple company for investments. Cons: higher TER, no exposure to small caps. acwd Pros: lower cost than VWRA and still covers decent coverage. Cons: not as much coverage as VWRA. lower volume. imid Pros: has large; medium; and small caps. Similar TER than the rest given the \"coverage\" in markets. Cons: low volume, sampling risk (they dont buy ALL the stocks but a sample instead), and exposure to small caps means higher volatility. IMID might be worth to look to get \"everything\" but if you want cost efficiency for similar coverage to vwra, ACWD / WEBN might be good. If you want definitely more \"safe\" because of the holding company, you cant go wrong with vanguard.",
          "score": 24
        },
        {
          "text": "I am personally doing a mix of SWRD(89%)+ EIMI(11%), total TER (0.126%) in the percentages that represent the MSCI ACWI global. Small caps from EIMI over time should add exposure and better fund performance in the long run, which should outperform ACWD's TER of 0.12% But its really marginal. If you want more small cap exposure there's some offerings by DFA(Dimensional Fund Advisors), but you really should understand that its an actively managed ETF that's not just market cap weighted ETF. Therefore the TER for DFA is higher. DFA to me is super interesting, but you have to know they haven't beat the market in the last few years because the large cap US stocks have performed so well in the last few cycles. By the way that they do their fund, it will increase the exposure to small cap stocks, value stocks. They also recently launched Irish docimiled ETFs. They actively use finance research, and their funds are designed to beat the market, which prior to the tech rally, they do beat vanguard's funds and sometimes do beat the market. I am not paid in anyway by those funds or youtube videos, just like you are curious what others think. I'm personally leaning to SWRD+EIMI just for the time being as DFA irish funds are super new aka low liquidity. https://www.youtube.com/watch?v=JfknibBat2A https://www.dimensional.com/us-en/etfs",
          "score": 5
        },
        {
          "text": "First; DBSvickers charge higher comms than IBKR. It looks like a minimum of $27 per trade. IBKR, if buying ireland domiciled ETFs, the minimum comms is around 2 USD per trade. Next, CSPX > VOO is because CSPX is ireland domiciled. This is good for us because both of these track S&P500. The companies in S&P500 have dividends. However, due to how taxes work, buying VOO will cause you to have 30% tax on dividends whereas for CSPX, theres only 15% tax. People have done the calculations where a 50% tax reduction on dividends is worth the higher expense ratio. Also, CSPX is accumulating, so dividends are reinvested into the fund (after the 15% tax). So less hassle there also.",
          "score": 5
        },
        {
          "text": "Been buying IWDA every month since I started working in 2017. Pick one of the many globally diversified ETFs and you can't really go too far wrong.",
          "score": 3
        },
        {
          "text": "I switched from accumulating VWRA to ACWD since it has the lowest TER for now. Don't sell your existing holdings just to switch, because the commission isn't really worth it. Just start buying the new ETF.",
          "score": 3
        },
        {
          "text": "How would you compare WEBN and ACWD against VWRA, in terms of higher potential returns (after factoring in the lower TER aspect) ? I don't care. Just look at TER. Don't need to think so much.",
          "score": 3
        },
        {
          "text": "Keep it simple. Any of then will do. Have to consider fund size and liquidity too",
          "score": 2
        },
        {
          "text": "Depends on whether you want simplicity of just buying single ETF. As for TER, some of the ETF will revise from time to time so do not ever sell everything and switch over. Otherwise you maybe find selling and buying eating up your money. Especially nowadays you see more and more ETF coming up every few years. You can follow what some others suggest by buying another ETF like AWCD and keep VWRA. Take note they do track different index. Everyone of them should do fine as world ETF except CSPX is S&P500 which is not world ETF.",
          "score": 2
        },
        {
          "text": "Hi All, really thanks alot for the inputs. Am trying to see which one is more worthwhile over the long-term (10 years or more) to hold to maximise long-term earnings. My main point is always to achieve a high returns, and higher TER means that over the long term they will earn into my earnings. Heard that ACWD is the closest to VWRA amongst the others, as they track close to 3000 entities whilst VWRA is around 4000+. Taking into account that ACWD already tracks so many entities, thus the fact that they are only 0.12 in TER compared to VWRA probably means over the long-term they should have a higher returns of achieving better returns? Just curious, if you guys have any ETFs to recommend other than VWRA where I feel that the 0.19 TER will eat into my profits over the long run. Thus in addition to VWRA, I am contemplating between CSPX/IMID/WEBN/ACWD/SWRD. But not exacty sure which 1 of the above is better than VWRA to hold over 10 years or more. I am only sticking to VWRA, due to popular recommendation since last time but right now am considering the other options now, since they are lower TER.",
          "score": 2
        },
        {
          "text": "TERs change, you know? Don’t go and project out 30 years and say that the TER makes how many thousands of dollars difference (but the total is millions so whatever). ACWD was 0.40% in early 2024 then dunno how they can slash to 0.12%. Is it sustainable? No idea. Then there are other factors like tracking error and whether lower volume lower liquidity affects the price you execute at. So overall, don’t go crazy over-analyzing this. It’s not going to move the needle. There are better things to worry about in your life. ETA: The above refers to choosing similar funds based on TER. Obviously choosing CSPX vs world index will make a difference. With or without emerging markets will make a difference.",
          "score": 2
        },
        {
          "text": "Thanks a lot for the insight, perhaps will look into it during the weekends. Right now, I only have $150k+ in VWRA via my IBKR Account. Thus contemplating alternative ETFs too and there are other ETFs with TER lower than 0.19. How would you compare WEBN and ACWD against VWRA, in terms of higher potential returns (after factoring in the lower TER aspect) ?",
          "score": 1
        },
        {
          "text": "Really appreciate a lot for the insight. Currently am looking into it, ACWD is most likely the ETF which I will buy in. Few months time after a few months worth of salary crediting in. Am aware that they track lesser entities than VWRA, but considering they are already tracking close to 3000 entities I presume that it should be enough. Looking at purely now (as TER will rise/fall in coming years), would you say that ACWD with a TER of 0.12 (lower than VWRA) will bring higher potential returns in the long-run (e.g 10 years time or more) ?",
          "score": 1
        },
        {
          "text": "If your investment is really huge, you will see the difference. Depends on how much you contribute in 10 years. Difference of .0x% is just a few dollars every 10k",
          "score": 1
        },
        {
          "text": "The bigger question is, if you already have $150k (i.e. likely not a fresh grad or other newbie), why are you saving up for a few months salary before investing? Instead of DCA every month like all the advice tells you to?",
          "score": 1
        },
        {
          "text": "May I know why you chose to use IBKR instead of a platform like DBSVickers? Also, why CSPX instead of VOO that has an even lower expense ratio (0.03%)?",
          "score": 1
        },
        {
          "text": "The big one is US estate taxes on VOO.",
          "score": 1
        },
        {
          "text": "Look above.",
          "score": 1
        },
        {
          "text": "Maybe long-term passive DCA investment in a broad-base worldwide index ETF is an OK way to preserve purchasing power and maybe make some money while having enough portfolio diversity to avoid huge drawdowns. Maybe a lot of people think so and that's why small TER differences is a big deal to them. I don't worry too much about TER, but more about the actual content of the ETF, e.g. whether it is actually diverse, and whether the particular ETF is a good fit for my thesis. I have a feeling that the majority consensus here is that anything other than just picking up to 3 broad-based ETFs is being too smart, citing efficient market hypothesis and whatnot. If you have no bandwidth to study macro developments and individual stocks, it's probably better to keep it simple like this, but I think this way you can only keep up with the money printing, not beat it. If you have the bandwidth, picking a small number of roughly the right stocks and ETFs to hold for a few weeks or months makes a bigger difference than picking ETFs with lower fees, and I'm not even talking about day-trading.",
          "score": 1
        },
        {
          "text": "Horizon long enough to just take the lowest fee etf  fwra. Like others mentioned about money printer and etc or mixing etfs you end up with alot of US exposure cause of mag7. Since you are trying to avoid overlap with your current holdings One way is just make fwra/vwra like the core part (50-80%) of your deployable capital then divest into SGX or individual stock picks with the rest. If you alr plan to forgo CSPX pure US Snp500 index. Depending on what you think bout currency risk,nth wrong with some small sgd portion or topup cpf as bond component sua, before reinvestinf the remainder on what you think are good deals. Tough to decide now when every thing is ATH every other week",
          "score": 1
        },
        {
          "text": "You can do much more than that, e.g. mix and match, with minimal overlap if you want, e.g.: Regions & categories: CSUS, IEMA, EXUS, IVLU Countries: IRSA, IPOL, GRE1, EWC, EWZ, EWY, EWW. There is no overlap between different countries. Hitting ATH is the general nature of assets, just like the nominal amount of money in the world. Valuations (e.g. FCF or P/E ratio) for long-term and narratives for short-term. If you look more closely, there are still things that are not at ATH in nominal terms and especially in real terms.",
          "score": 1
        },
        {
          "text": "Considering the chaos originating from the US since the start of 2025 and how many national equity markets like Mexico, Brazil & Korea handily beat the S&P500 in 2025, and how USD has been devaluing, what about the IEMA & EXUS ETFs without any broad-based collection of US stocks until macro things quieten down a bit? CSPX/SPY also has a rather high P/E ratio of 31 at the moment partly due to the forward-looking AI theme compared to many other countries. A VWRA-like ETF might seem like diversifying over the world but just 10 big tech companies like the Mag7 ones and TSMC cover 24% of VWRA, and many of them are closely linked to the AI theme that depends much on future earnings for their high multiples. VWRA is also actually US-heavy. Don't be fooled by the \"all-world\" designation. So much for diversity. Of course if you have no time or knowledge to keep up with macro developments, a VWRA-like ETF can be a good choice for a long-term position that you won't touch for at least 3 years.",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qo9vdr",
      "subreddit": "singaporefi",
      "title": "Currency conversion on ikbr",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qo9vdr/currency_conversion_on_ikbr/",
      "score": 10,
      "num_comments": 5,
      "created_at": "2026-01-27T18:06:49",
      "selftext": "Hi I am looking to buy VWRA on ikbr.\n\nI have been reading the other posts and what I understand is that with cash account, I should not convert to usd manually and just let ikbr auto-convert for me to minimise the fees.\n\nBut with sgd being the highest it has been against usd, i was having second thoughts about converting all my cash im putting into ikbr (10k) now, instead of letting it auto-convert in the future.\n\nDo I have the right idea? Would appreciate any help, thanks!",
      "comments": [
        {
          "text": "If you're bullish on VMRA or whatever you want to buy, a little loss on conversion isn't going hurt. Just do it. You're wasting time worrying about 0.01% when these assets move in +-4% a day.",
          "score": 14
        },
        {
          "text": "i would not be too vexed over convert lump sum 10K USD or auto convert over a few months in the future, Like a fellow commentor input, u can convert full 10k to USD now if you are not intending to use the full sum for anything in near future. and secondly if u have full 10K u want to convert now, why not do lump sum 10K investment into VWRA now via auto conversion? unless u r reading the market, thinking VWRA will go lower in the future, and lastly, USD to SGD  conversion rate is around 1.27 currently.  if it drop further to 1.25 nest month after u converted, would u have regretted yr decision? In summary, in grand scheme of things over a longer time horizon, such foreign exchanges calculations might not matter too much.",
          "score": 4
        },
        {
          "text": "What is high can go higher. If you want to gamble a little that the rate will reverse, then go ahead. But it’s as good as picking red or black to me. There’s no “regression to the mean” or in the long run it should go up”. And I don’t think you are some geopolitics or monetary policy expert to have an informed opinion.",
          "score": 3
        },
        {
          "text": "Personally I would convert the full 10k to USD if you are not intending to use the full sum for now",
          "score": 3
        },
        {
          "text": "Right i think since im planning to dca anyway, i will just leave it to auto-convert. Thanks for the help everyone",
          "score": 2
        }
      ]
    },
    {
      "id": "t3_1qovisx",
      "subreddit": "singaporefi",
      "title": "Am I keeping too much as emergency funds in my 30s with no kids just mortgage to pay? I have just over 50k sitting in a few accounts giving better interest than bank rates. Any suggestion?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qovisx/am_i_keeping_too_much_as_emergency_funds_in_my/",
      "score": 9,
      "num_comments": 21,
      "created_at": "2026-01-28T08:13:26",
      "selftext": "Monthly mortgage split with wife is 600~ investment portfolio around 260k. Is 50k rainy funds too much if so how much should i reduce it to and put the remaining into investment?",
      "comments": [
        {
          "text": "Raw dollar saved is not a good gauge. What is your monthly expenses/commitments? What is your monthly income? What are your financial concerns? What do you mean by emergency funds?",
          "score": 15
        },
        {
          "text": "Yes. Emergency fund should be 3-6 months of expenses. Assuming no extenuating circumstances like strong sense of imminent layoffs, baby on the way etc.",
          "score": 11
        },
        {
          "text": "50k is not much honestly. It is quite the right amount assuming your monthly expenses is around 5-8k,",
          "score": 8
        },
        {
          "text": "Also, given current climate, 18 months expenses (including mortgage) is something to consider. Have heard of many unable to secure jobs for over a year and you don't want to be stressed about affording the roof over your head/having enough to eat while also trying to find a job.",
          "score": 4
        },
        {
          "text": "When it's a dual-income family, especially DINK, I feel that 18 months expenses are not needed. Often if one person loses their job, the other one can still cover expenses, just that maybe nobody can save/invest during this challenging time. It's one of the major perks of marriage!",
          "score": 3
        },
        {
          "text": "I think 2 to 3pax 1 pax expense 5k 1 month abit printing money alr",
          "score": 3
        },
        {
          "text": "Should peg the 50k to your 6 months expense instead of looking at absolute figure. Also, you can consider SSB or something with slightly higher yield to hold part of the emergency expense instead of all lying somewhere in different bank accounts. Consolidate if no need for so many bank accounts.",
          "score": 3
        },
        {
          "text": "So complicated bro. Just lump it together under emergency fund, or else change your DCA amount that month to accommodate extra spending.",
          "score": 2
        },
        {
          "text": "In today climate, the possibility of both losing jobs are high.",
          "score": 1
        },
        {
          "text": "Monthly expense of 5-8k/pax?",
          "score": 1
        },
        {
          "text": "Fr those living on 5-8k/mth individually living in a diff world lol, not even relatable to the avg sinkie",
          "score": 1
        },
        {
          "text": "If you only have mortgage to pay and dont need to pay for food, clothing, transport, utilities then 50k is more than enough.",
          "score": 1
        },
        {
          "text": "personally i feel that 50k is not alot.. its a good 'warchest' to go shopping with when you find something worth to buy.. jus relax and leave it ..",
          "score": 1
        },
        {
          "text": "I think the $50k funds is a good call, keep it intact If can, round it up to $100k and apply for Trust+ card, take the perks",
          "score": 1
        },
        {
          "text": "As long as you can earn interest on that 50k more than what the mortgage charges you, you are fine",
          "score": 1
        },
        {
          "text": "I would learn how to write a less painfully formatted post before anything else.",
          "score": 1
        },
        {
          "text": "50k is nothing much if you lose your job or medical emergency.",
          "score": 1
        },
        {
          "text": "Go Pattaya bro Spent it like no tomorrow.",
          "score": 1
        },
        {
          "text": "How much Raining Day funds should a person keep handy for those emergency appliance replacement or plumber visits?  Do you all think $5,000 is enough? What I mean by Raining Day funds - I go tonight and discover my microwave is not working and to make it worse the TV won't turn on, rather than repairing it, I will go out and purchase new microwave and TV. I know its likely not to happen at the same time!",
          "score": 1
        },
        {
          "text": "got wife la besides if want to spend like no tomorrow, Saigon or Macau are much better",
          "score": 0
        },
        {
          "text": "True. \nOnce u bring the wife anywhere,  u won’t get to spend like no tomorrow. Because all might be spent today. /s",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qoiwd8",
      "subreddit": "singaporefi",
      "title": "Do Adjoined Flat worth more per sqf?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qoiwd8/do_adjoined_flat_worth_more_per_sqf/",
      "score": 4,
      "num_comments": 7,
      "created_at": "2026-01-28T00:38:43",
      "selftext": "Hi, I am thinking about older 3rm flats that are adjoined (5rm) with decaying lease. Are they supposed to carry a premium per sqf compared to same block same level units? When i said older, I mean lease with <50years but in areas like Bukit Merah etc.",
      "comments": [
        {
          "text": "Why would it? Rarity value? On the other hand, larger condo units tend to go for lower psf than smaller units. So maybe what is obvious to you is not so obvious to others?",
          "score": 3
        },
        {
          "text": "You can stay in one side, rent out the other. Hdb rental is higher yield compared to most other housing investments. If you do the math, the rental can pay off your flat (both sides) in maybe 20 years with slight top up from you. You basically stay for free. Rarity is also a factor but then you'd just go for an EA or EM. Those are also at a premium on psf basis.",
          "score": 1
        },
        {
          "text": "Ah, so it's like dual-key condo having a premium in psf.",
          "score": 1
        },
        {
          "text": "Yes, dual key or space for in law and couple, separate with privacy but stays next door in second door inside the unit itself.",
          "score": 1
        },
        {
          "text": "Hi, rarity yes. I looked at one of the blocks, 3rm pricing in May 2024 with 65sqm was $370K. Mar 2024 a jumbo or rather adjoined flat 153sqm was $940K. Both units are on the same floor range (10-12 floor). Per sqm basis, one was $5.69K per sqm, the other $6.14K per sqm. Granted there might be other factors like reno etc.",
          "score": 1
        },
        {
          "text": "Yes of course. Why wouldn't it",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qo78x8",
      "subreddit": "singaporefi",
      "title": "I need opinions / suggestion",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qo78x8/i_need_opinions_suggestion/",
      "score": 3,
      "num_comments": 5,
      "created_at": "2026-01-27T15:29:09",
      "selftext": "Hi guys,\n\nI have wrote in the sub before asking about having monthly dividends for my 70k. I listened to the suggestions and i agree that 70k is a small sum, it's better to focus on capital growth.\n\nSo i decided to open up an IBKR account and DCA into VWRA for now (I'm not sure if its a good move to additionally invest in individual stocks due to the 30% withholding tax)\n\nI keep a \"1 year\" worth of emergency money (it's just 40k, but i reckon that will float my ship for abit in an event i lose my job) on DBS multiplier with 1.8% + i did a RSP (regular savings plan) recently to qualify for one of the categories (investment) to bring me up to 2.1%. $100 monthly\n\nWhat do you think of my setup?\n\nI don't think i can even think of retirement at an early age unless i decide to do a rent-out-your-unit-stay-at-cheaper-countries like Malaysia lifestyle or significantly increase my income flow.\n\nMy payment is not fixed due to 6 months / 12 months bonus. But let's just assume i get 3k monthly after cpf.\n\nCPF OA is being eaten up to pay for bank mortage loan, i believe you need 20k minimal to invest CPF. so that is out of the question for me.",
      "comments": [
        {
          "text": "So basically one year of emergency savings in bank and the rest DCA VWRA IBKR? Pretty much following standard advice here, except that maybe based on personal comfort most people are fine with 3-6 months spending as emergency fund. Not sure that the RSP in DBS is really worth it, but not a big deal. Lots of people can't retire early. That's not a big deal. Just keep stacking and you'll probably be in good shape at 65 and maybe able to retire at 55 or 60, like slightly early but nothing to boast about. Financial independence is a great goal without early retirement.",
          "score": 4
        },
        {
          "text": "Yeah actually i feel like reducing it (my emergency savings) and dump it to VWRA. I'm DCA-ing right now because of TACO. I have no idea what Orange man will do that may potentially tank the market. But with the bad job market right now i just keep 1 year.",
          "score": 1
        },
        {
          "text": "1 year is fine if you wanna be cautious. But like due said, its a very standard set up. All the best.",
          "score": 1
        },
        {
          "text": "How much for emergency funds actually also depends how much dependents you have. So if nobody is depending on you and you feel you can work any random jobs if laid off, you can consider reducing to 6 months.",
          "score": 1
        },
        {
          "text": "The most difficult step is the 1st 1 mil. Once you hit that. You can really see your money multiply. Hang in there",
          "score": 1
        }
      ]
    },
    {
      "id": "t3_1qp2dq9",
      "subreddit": "singaporefi",
      "title": "Insurance Planning",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qp2dq9/insurance_planning/",
      "score": 1,
      "num_comments": 4,
      "created_at": "2026-01-28T13:17:19",
      "selftext": "M31 this year. Annual is about 60k per year before bonus and CPF deductions. 80k per year after bonus.\n\nWill be selecting my BTO flat this year with my partner. BTO price can be assumed to be around 600k. Will be taking a 25 years HDB loan.\n\nMy current insurance plan is as follow:\n\nSinglife Termlife 300k, TPD 200k, and Advanced CI 200k. Premium is about 630 annually.\n\nSinglife MINDEF Group Insurance, 200k Term, 200k Accident, Group Living Care 200k, and Group Living Care Plus 150k, Premium is about 20+ monthly.\n\nCareshield Life Plus with 2 ADLs Payout, 5k monthly payout. Premium is about 1.8k cash annually.\n\nPlans\n\nSinglife MINDEF Group Insurance, 500k Term, 500k Accident, Group Living Care 500k, and Group Living Care Plus 350k, Premium will be 60+ per month.\n\nI am upgrading my coverage mainly due to future commitments like mortgage, and I'm afraid of contracting CI (which is my biggest fear tbh).\n\nMy agent is the one who recommended me to upgrade my MINDEF Group Insurance to get a higher CI coverage, and then a single payout CI plan to mitigate cost. However, as I'm still abit paranoid, I'm not sure if I should get the multi pay plan instead.\n\nDoes my insurance plan seems good?",
      "comments": [
        {
          "text": "Oh my bad. Yup. I have an ISP. Forgotten about it.",
          "score": 1
        },
        {
          "text": "If you wanna get singlife mutlipay CI, assuming till age 75. It should be a little over 2.6k. PA., if it helps you with planning your finances.",
          "score": 1
        },
        {
          "text": "Hello Op, agent here. For singlife group term living care plus rider only covers 10 eci conditions, living care & living care plus rider premiums will increase in your 40s. I also buy singlife group term, max life insurance and upgrade the ci and eci rider. The conditions to claim CI is harder and recovery from a CI claim is longer if you are lucky. For example, Eci definition for liver is liver surgery while CI is end stage liver failure. What CI are you concerned about? Cancer? Stroke? Heart attack? Getting a 200k eci multipay rider would be quite pricy compared to a single claim eci plan. But whichever help you sleep better at night. Do compare other companies before committing to a long term contract.",
          "score": 1
        },
        {
          "text": "Hello FA and Trader here [33m] Okay, let me summarize a little for both from my understanding Death: 300k+200k to 300k+500k TPD: 200k Stays the same CI: 200k+200k to 200k+500k ECI: 150k to 350k PA: 200k to 500k Careshield done ISP? Overall looks good to me! I personally do think that the additional CI 200k plan (totalling of 550k if you do upgrade your mindef group one too!) should make it more than adequate, because usually people will use the lumpsum as an income replacement for the next few years. Multipay only pay multiple times if you sway sway kena different ECI/CI. So ultimately, it still comes down to you on how you feel about it, how much do you think is needed etc and at most FAs are there to advice and sell you the plans.",
          "score": 0
        }
      ]
    },
    {
      "id": "t3_1qoyalk",
      "subreddit": "singaporefi",
      "title": "Should I pay off all my debts in one shot?",
      "url": "https://old.reddit.com/r/singaporefi/comments/1qoyalk/should_i_pay_off_all_my_debts_in_one_shot/",
      "score": 2,
      "num_comments": 10,
      "created_at": "2026-01-28T10:10:50",
      "selftext": "i was doing some financial audit for myself and i realised that my savings now are more than the amount of debts i owe especially for student loans,, should i pay it off one shot? or continue to pay off monthly for the liquidity?\n\nany thoughts would be appreciated!",
      "comments": [
        {
          "text": "List out the interest rate of each loans. Pay off the highest interest rate one.If after paying off all your debts, how much savings will you have left. Keep savings at least 3 months emergency use or $10k whichever is lower. The rest allocate for debts repayment and investment.",
          "score": 13
        },
        {
          "text": "General strategy is your investment interest versus your debt interest. If greater don't pay off. If lesser pay off or invest better.",
          "score": 5
        },
        {
          "text": "Do check your contracts carefully for any early pre-payment penalty. Then likeu/BelovedInvestorsaid, pay off the highest interest ones first.",
          "score": 3
        },
        {
          "text": "Way to little info. - would you have enough liquidity for emergencies (this can be quite little if living with parents and a huge sum if you have your own place and kids) - what is the interest rate on the debt Generally, I would ensure I have enough liquid cash to cover six month of my expenses, and then make the decision as if I were putting the money into a fixed deposit with interest rates commensurate to your loan",
          "score": 2
        },
        {
          "text": "Aren't student loans 4-5% EIR? That's kind of high and quite different from mortgage EIR of 1-2%.",
          "score": 2
        },
        {
          "text": "I did that.",
          "score": 1
        },
        {
          "text": "Student loans interest so low, pay off for what. Invest",
          "score": 1
        },
        {
          "text": "New loans are 3M SORA +1.5%. Cheaper than margin.",
          "score": 1
        },
        {
          "text": "List down the loans and the amount, pay off those smaller amounts first For bigger amounts, pay X amount first then re-plan with a clearer picture of your monthly cashflow",
          "score": 1
        },
        {
          "text": "The shortest answer is if your returns on cash are higher or lower to borrow that money and pay interest to service. If cheaper to borrow, don't redeem.",
          "score": 0
        }
      ]
    }
  ]
}